{"id": "S000368701500054X", "article": "MAIN-TITLE Efficacy of a rubber outsole with a hybrid surface pattern for preventing slips on icy surfaces   HIGHLIGHTS          Hybrid rubber outsole was designed to provide high slip resistance without use of protruding studs or asperities.      Slip resistance of hybrid rubber sole was examined on dry and wet icy surfaces.      Drag tests and gait trials were performed on dry and wet icy surfaces.      Hybrid rubber sole exhibited high SCOF and DCOF values on both icy surfaces.      Hybrid rubber sole showed comparable slip resistance to anti-slip winter footwear devices.          KEYPHRASES   Hybrid rubber sole  Slip and fall  Ice   Slip-and-fall accidents are a major concern because of the severity and costs associated with the injuries incurred. Human factors such as gait biomechanics and extrinsic factors such as footwear influence the occurrence of slips and falls (Gao and Abeysekera, 2004). A large number of slip-and-fall accidents are experienced during the winter on icy or snow-covered surfaces (Gao et al., 2008; Grönqvist and Hirvonen, 1995). Poor grip or low friction between footwear and the underfoot surface on ice and snow is a primary risk factor; hence, winter footwear design is recognized as a key factor that requires more attention (Bentley and Haslam, 1998).  The coefficient of friction (COF) between footwear and the underfoot surface is widely used as a measure of slip resistance; however, the choice of either static COF (SCOF) or dynamic COF (DCOF) as a critical frictional parameter for preventing slip-related falls is controversial (Ekkubus and Killey, 1973; Tisserand, 1985; Pilla, 2003; Yamaguchi and Hokkirigawa, 2008). One could argue that both parameters are important, with high SCOF helping to prevent slip initiation and high DCOF helping to stop the slip; therefore, both SCOF and DCOF values should be evaluated (Yamaguchi et al., 2012a). Generally, previous studies have found that DCOF values in the range of 0.2–0.4 are required to arrest slips during level walking (Grönqvist et al., 1989, 2003; Redfern and Bidanda, 1994; Strandberg, 1983). As for the safe limit of the SCOF, Nagata et al. (2009) indicated that SCOF values around 0.4 are required to prevent slips.  Friction force is expressed as the sum of an adhesive term and a deformation term (Bowden and Tabor, 1950). Adhesive friction results from contact and subsequent shearing of the contact interface, whereas deformation friction occurs when hard protrusions on the bottom of the footwear (e.g. studs or asperities) “plough” through a softer support surface (e.g. ice). The frictional characteristics of icy surfaces are influenced by temperature, and melting (warm) icy surfaces are extremely slippery compared with dry (cold) icy surfaces due to the formation of a water layer (surface melt water due to localized frictional heat, rises in air temperature, etc.) which reduces adhesion friction between the footwear outsole and the icy surface (Oksanen, 1983).  Many winter footwear designs and winter anti-slip devices are available and are becoming more popular. Most anti-slip devices, such as crampons (Bruce et al., 1986), are meant to work on icy surfaces under wide temperature conditions by using hard studs or steel coils that penetrate the icy surface, resulting in increased friction due to ploughing of the studs or steel coils through the ice surface. However, these types of anti-slip devices may fail to prevent slips on surfaces that are too hard to allow penetration, or may cause trips to occur when walking on uneven surfaces, e.g. due to “snagging” of the crampons on surface irregularities (Bruce et al., 1986; March and Birkett, 1997). In contrast with the anti-slip devices that rely on ploughing friction, tread rubber footwear can help to prevent slips via increases in contact area, which can increase adhesion friction when the icy surface is dry. However, if the icy surface is wet, tread rubber footwear will produce low adhesion friction if the tread pattern cannot disperse the water film from the interface between the footwear and the ice. In this situation, the frictional force is small and caused mainly by viscous shear in the water layer (Chang et al., 2001).   Yamaguchi et al. (2012a) found that a rubber block with a smooth surface had low SCOF (<0.2) and high DCOF (>1.0) values on a smooth stainless-steel surface covered with a very slippery glycerol water solution, whereas a rubber block with a rough surface had high SCOF (>0.8) and low DCOF (<0.2) values on the same surface. On the basis of these findings, they developed a hybrid (rough and smooth) rubber surface. The hybrid pattern provided SCOF and DCOF values of ∼0.5 on a glycerol-lubricated surface.  Subsequently, Yamaguchi et al. (2014) developed footwear with an outsole that incorporated the hybrid rubber surface pattern, as shown in Fig. 1(a). In this outsole, slip resistance was further enhanced by designing the surface pattern to increase adhesion friction by dispersing the liquid film from the contact interface, as detailed in Fig. 1(b). Gait trials on a stainless steel floor covered with a glycerol solution demonstrated that this footwear sole has superior slip resistance at both slip initiation and during sliding, and significantly decreases the risk of falling compared with conventional commercial rubber footwear used in food factories and restaurant kitchens (Yamaguchi et al., 2014).  The purpose of the present study was to determine whether the hybrid rubber surface pattern sole, which relies on adhesion friction, is effective in preventing slips on dry and wet icy surfaces. Footwear incorporating the hybrid rubber sole was compared to conventional anti-slip devices, which rely on ploughing friction, by means of drag tests and gait trials. We hypothesized that the hybrid rubber sole would provide high (>0.3) static (SCOF) and dynamic (DCOF) coefficient of friction on both dry (−10 °C) and wet (0 °C) ice due to increased adhesion friction, as measured in the drag tests. We further hypothesized that the frequency and severity of slipping during the gait trials when using the hybrid rubber sole would be equivalent to, or less than, that occurring when using the conventional anti-slip devices, on both dry (−10 °C) and wet (0 °C) ice.   METHODS   A strap-on version of the new hybrid rubber sole was prepared for the purposes of this study, using natural rubber (Shore A-scale hardness of 40 at room temperature and 41 at −10 °C). This footwear was compared to three conventional winter strap-on anti-slip devices: 1) metal coils (YAKTRAX Walker Traction Cleats for Snow and Ice, Interex Industries, Vancouver, BC), 2) gritted (sandpaper-like) straps (GLIPS-LITE Rough Grips, Winter Walking, Horsham, PA), and 3) crampons (ALTRAGRIPS-LITE, Winter Walking, Horsham, PA) (Fig. 2 ). Each type of footwear was available in four sizes (S, M, L, and XL). As detailed in the sections that follow, drag tests (King et al., 2013) were performed to measure the relative slipperiness of the hybrid rubber outsole and the conventional anti-slip devices with respect to wet and dry ice surfaces, and a repeated-measures gait protocol was conducted with participants walking on wet and dry ice, on either a level plane or a slope, to characterize the frequency and severity of slips that occurred while wearing each of the four types of footwear. A single sample of each product (size M) was used in the drag tests; four samples of each product were used in the gait trials (size-matched to each subject's footwear).  Studies took place in a custom-built environmental chamber (ClimateLab, Toronto Rehabilitation Institute-UHN, Toronto, Canada). The climate-control system includes a refrigeration coil and associated condensing unit, electric heaters, a humidifier, a dehumidifier and a fresh air system. A proportional-integral-derivative feedback controller is used to regulate the environment temperature (measured with a temperature sensor) to within ±0.5 °C. For this study, the temperature was maintained at either 0 °C or −10 °C to create wet or dry ice surfaces, respectively. Relative humidity was 62.1 ± 14.8% at 0 °C and 67.5  ± 8.7% at −10 °C.  The interior dimensions of the chamber (4.2 m long, 3.7 m wide and 2.1 m high) allowed for two straight walkways measuring 3.64 m in length and 0.73 m in width. As shown in Fig. 3 , each walkway comprised three ice panels, plus a concrete panel at each end, with two of the three ice panels mounted over force plates (BP400600HF, AMTI, Watertown, MA). There was a 1.0-cm gap between panels such that the activation of any one force plate did not affect the others. For one walkway, the middle ice panel was mounted at a 1:10 rise-to-run slope (5.7°). [A slope between 1:10 and 1:12 is allowed by the standards for Americans with Disabilities (American Department of Justice, 2010).] The thickness of the ice panels was 5 cm. Each ice panel was created by freezing water in a plastic-lined wooden box at −10 °C in the chamber. The −10 °C trials were performed at least 1 h after freezing was complete. For the 0 °C trials, the chamber was warmed up to 0 °C and maintained at this temperature for 1 h before starting the trials.  The drag tests were conducted on the second ice panel of the level walkway at either 0 °C or −10 °C. A 6-kg weight was inserted into the shoe. A single type of shoe, with a length of 26 cm (US size 8), was used for all tests. Each of the four anti-slip devices was attached to the shoe, which was then dragged by hand at a particular velocity over the surfaces of interest to measure the slip resistance of the footwear–surface interface, as shown in Fig. 4 . The shoe was dragged 0.48 m in 3 s at an approximately constant speed, so that the average sliding velocity (except for the acceleration and deceleration periods) was approximately 0.2 m/s. This procedure was repeated five times for each combination of footwear and surface condition, in random order. During each test, light-emitting-diode markers were attached on the toe and heel of the footwear, and the three-dimensional motion of the markers was tracked with a motion capture system (Phoenix Technologies Inc., Vancouver, British Columbia, Canada). The drag-test motion-capture and force-plate data were sampled at 100 Hz and low-pass filtered digitally at 50 Hz. These data were then used to determine the SCOF (peak pull force required to initiate sliding divided by normal force) and the DCOF (average pull force when dragged at a constant speed divided by normal force).  The horizontal speed of the midpoint of the toe marker and heel marker was calculated and used as sliding velocity. The resulting horizontal (F x, F y) and vertical (F z) ground reaction forces during dragging were recorded to calculate COF according to the following formula:  (1)   COF =    F h     F z          (2)    F h  =    F x 2  +  F y 2          A representative time variation of COF and sliding velocity is shown in Fig. 5 . SCOF was determined as the first peak of COF just before sliding initiation. The mean COF value when the sliding velocity was >0.1 m/s was used as the DCOF, to eliminate data during the acceleration and deceleration periods.  Statistical analysis was performed using SPSS ver. 19.0 (SPSS, Inc., Chicago, IL, USA). Two-way analysis of variance (ANOVA) was used to test if the SCOF and DCOF values were affected by the type of footwear or temperature. Post-hoc paired t-testing with a Bonferroni correction was used to determine specific significant differences between footwear conditions. The significance level was set at p = 0.05.  Sixteen healthy adults (eight men, eight women; age 27.1 ± 6.3 years, range 20–43; height 1.69 ± 0.095 m, range 1.51–1.83; mass 63.9 ± 10.7 kg, range 45–80) with no neuromusculoskeletal disorders participated in this experiment. Each participant provided written informed consent to comply with ethics approval granted by the institutional review board.  Each study participant was tested with each of the four abovementioned types of footwear, which was fit over the participants' own footwear (participants were instructed to bring the shoes or boots that they normally wore in winter weather). For safety, participants were harnessed into a free-standing overhead track at all times while traversing the walkway. The fixed height of the harness was adjusted not to interfere with walking and to suit each participant to prevent injuries to the knees, hip, or head. Participants were asked to wear their own winter coats over clothing that they would normally wear in winter when the outdoor temperature was approximately −10 °C.  The total number of gait trials was 1152 (16 × 4 × 3 × 2 × 3 = 1152), with 16 participants using each of the four types of footwear on each of the three ramp angles (0°, 5.7° ascent, 5.7° descent) and each of the two temperature conditions (0 and −10 °C), with three repetitions for each test condition (total of 72 trials per subject). The trials at 0 °C or −10 °C were conducted on different days. The order of footwear type to be tested and the sequence of trials were counterbalanced across participants.  Participants were signaled to begin traversing the walkway at a natural pace, with one step on each panel, and to stop at the opposite end. They then turned around and waited for another signal before walking back to the starting point with one step on each panel. After completing three runs on the level walkway and three back-and-forth runs on the sloped walkway (ascent in one direction and descent in the other), participants were asked to step off the walkway, change footwear, and wait outside the chamber until the next condition was set.  The frequency of slips and falls was determined using the spatial coordinates of markers attached to the footwear at the heel (at a 2-cm height from the bottom of the shoe) and at the toe. The analyses focused on the second step (middle panel), on both the level and sloped surfaces. The motion-capture and force-plate data from these gait trials were sampled at 100 Hz and then low-pass filtered digitally at 10 Hz.  A forward slip during the braking phase was considered to have occurred if the heel horizontal (forward) velocity failed to reach 0 m/s (±20 mm/s) within a 3.0-cm displacement after the foot strike (Maynard, 2002; Fong et al., 2009). The foot strike was determined to have occurred when the vertical ground reaction force exceeded 5% of the body weight of the participant (Fong et al., 2009). A backward slip during the propulsive phase [the period after the braking phase in which the antero-posterior ground reaction force is negative and acts to propel the body forward] was defined to have occurred when the backward traveling distance of the toe marker during the propulsion period exceeded 3.0 cm (Maynard, 2002; Fong et al., 2009). Slip velocity and slip distance were also measured, as indicators of slip severity (Brady et al., 2000; Cham and Redfern, 2002a). A fall was defined as a foot slip that did not come to a stop (Cham and Redfern, 2002a).  Temporal–spatial gait variables were also measured to identify the effect of the footwear on gait while walking on icy surfaces. Stride time and stride length were determined as the duration and distance between two successive heel-strikes of the same foot on the first and third ice panels. Walking velocity was defined as the stride length divided by stride time.  The traction coefficient was calculated for both the braking and propulsion phases, by dividing shear force (horizontal force: F h) by vertical force (F z). Two approaches were used to avoid spuriously high RCOF values that can occur when F z is small: 1) excluding the first 5% of the stance phase (Blanchette et al., 2011) and 2) excluding F z values less than 50 N (Burnfield and Powers, 2007). Both approaches yielded identical results. The maximum peak values of the traction coefficient defined the required coefficient of friction (RCOF) during the weight acceptance (RCOFh) and toe-off (RCOFt) phases. For each trial, a single step on the middle panel was analyzed. Fig. 6 shows representative time changes in traction coefficient for walking on the level walkway.  Cochran's Q test was used to test if the frequency of slips and falls was affected by the type of footwear, for each temperature and surface condition. Two-way repeated-measures ANOVA was used to test if the gait variables and RCOFs were affected by the footwear and temperature conditions. One-way ANOVA was conducted to analyze the difference in slip velocity and slip distance for trials which were identified as slip trials (including forward and backward slips). Post-hoc paired t-testing with a Bonferroni correction was used to determine specific significant differences between footwear conditions. The significance level was set at p = 0.05.   RESULTS    Table 1 shows the means and standard deviations of the SCOF and DCOF values measured during the drag tests. Fig. 7 shows the relationship between the SCOF and DCOF values. Two-way ANOVA indicated that the mean SCOF and DCOF values were affected significantly by footwear type (p < 0.001), temperature condition (p < 0.001), and footwear–temperature interaction (p < 0.001). Post hoc analysis revealed that SCOF values for all types of footwear at 0 °C (wet ice) were lower than those at −10 °C (dry ice) (p's < 0.01). The same was true for the DCOF values (p's < 0.001), except that the hybrid rubber sole showed a slightly higher DCOF at 0 °C in comparison to −10 °C (0.34 vs 0.31; p = 0.006).  When the temperature was 0 °C (wet ice), the hybrid rubber sole showed a SCOF value equivalent to that of the gritted sole and crampons (p > 0.05), and higher than that of the metal coils (0.37 vs 0.10; p < 0.001). The hybrid rubber sole also exhibited the highest mean DCOF across all footwear types (0.34 vs 0.06–0.20; p < 0.001) at this temperature, and was the only type of footwear to show both SCOF and DCOF values greater than 0.3.  When the temperature was −10 °C (dry ice), all of the footwear types demonstrated relatively high frictional coefficients (mean SCOF and DCOF values >0.3). Nonetheless, there were some differences. The hybrid rubber sole was still superior to the metal coils, in terms of higher SCOF values (0.45 vs 0.39; p < 0.05); however, the gritted sole showed higher SCOF values than the hybrid rubber sole (0.67 vs 0.45; p < 0.001) and the gritted sole and crampons showed higher DCOF values than the hybrid rubber sole (0.37 and 0.38 vs 0.31; p < 0.01).  No falls were detected during the gait trials on the level walkway or slope at 0 °C or −10 °C. Slips occurred in 34 of the 1152 trials (3.0% of trials), and all but one subject had one or more slip trials (average number of slip trials per subject = 2.1, range 0–6). Table 2 shows the means and standard deviations (across subjects) of the frequency of slip trials for each footwear type, under each test condition. Across the test conditions, the mean frequency of slip trials ranged from 0.0% to 6.25%. A Cochran's Q test revealed that the frequency of forward slip for the metal coils was significantly higher than for the other footwear types when descending the slope at −10 °C (6.25% vs 0.0%; p < 0.05). There was, however, no significant difference in slip frequency among footwear types when descending the slope at 0 °C, or when walking on the level surface or ascending the slope at either temperature (p > 0.05).   Table 3 presents the number of slip trials and the means and standard deviations of the slip distance and maximum slip velocity. One-way ANOVA indicated that there was no significant difference in slip distance or slip velocity among footwear types, at either temperature.   Table 4 shows the means and standard deviations of the peak RCOF values for each footwear type. Two-way repeated measures ANOVA indicated that RCOFh and RCOFt values when walking on the level surface were not affected by temperature condition (p's > 0.05), but were significantly affected by footwear type (p < 0.05) and temperature-footwear interaction (p < 0.01). Post-hoc analysis demonstrated that significant differences between footwear during level walking occurred only at −10 °C. At this temperature, the hybrid rubber sole provided higher mean RCOFh values in comparison to the gritted sole (0.14 vs 0.12; p < 0.001) and crampons (0.14 vs 0.11; p < 0.001), and also provided higher RCOFt values in comparison to the gritted sole (0.22 vs 0.20; p < 0.01) and crampons (0.22 vs 0.19; p < 0.05).  For the ascending slope, two-way repeated measures ANOVA indicated that the RCOFt value was affected by temperature-footwear interaction (p < 0.05). Post-hoc analysis revealed that the RCOFt value for the hybrid rubber sole was higher than for the gritted sole at −10 °C (0.29 vs 0.26; p < 0.05).  For the descending slope, two-way repeated measures ANOVA indicated that the RCOFt value was significantly affected by footwear type (p < 0.05) and temperature-footwear interaction (p < 0.05). Post-hoc analysis indicated that RCOFt value for the hybrid rubber sole was higher than for the metal coils at −10 °C (0.17 vs 0.14; p < 0.001).   Table 5 shows the means and standard deviations of the gait variables for each footwear type. Two-way repeated-measures ANOVA indicated footwear type did not significantly affect stride time, stride length, or walking velocity (p > 0.05).   DISCUSSION   The results of this study support our hypotheses that the adhesion friction of the hybrid rubber sole would afford slip protection comparable to, or better than, that provided by commonly-used strap-on winter anti-slip devices which rely on ploughing friction. Although some of these devices yielded somewhat higher coefficients of friction in certain drag-test conditions, the hybrid rubber sole was unique in providing high static (SCOF ≧ 0.37) and dynamic (DCOF ≧ 0.31) coefficients of friction across all test conditions, and was the only footwear type to provide a substantial dynamic coefficient of friction (0.34) on the wet icy surface (0 °C). These results compare favorably with respect to the literature which suggests that COF values in the range of 0.2–0.4 are required to prevent or arrest slips during level walking (Grönqvist et al., 1989, 2003; Nagata et al., 2009; Redfern and Bidanda, 1994; Strandberg, 1983). In terms of preventing slips during our gait tests, the hybrid rubber soles were found to be just as effective as the crampons and gritted soles, and were actually more effective than the metal coils.  As hypothesized, the hybrid rubber sole exhibited high SCOF and DCOF values at both temperatures. Presumably, under dry-ice conditions (−10 °C), good adhesion was attained because the low hardness of the hybrid rubber sole at low temperature (shore A scale hardness of 41 at −10 °C) contributed to maintaining contact area with the ice surface. The hybrid rubber sole was apparently also able to achieve good adhesion under wet-ice conditions (0 °C) by dispersing the water film from the shoe–ice surface interface (during static friction tests) or by limiting infiltration of water (during dynamic friction tests); see Fig. 1(b). This mechanism shown in Fig. 1(b) would be the same as observed in drag tests on a glycerol-lubricated surface (Yamaguchi et al., 2012a). Somewhat surprisingly, the DCOF was actually higher in the 0 °C wet-ice condition (0.34) in comparison to −10 °C (0.31). One possible explanation is that the water on the wet icy surface formed bridges (meniscus) at the edge of the smooth part of the hybrid rubber block (Lee et al., 2012).  The other three footwear types were designed to create ploughing friction via penetration of studs, grit (aluminum oxide) particles or steel coils into the ice surface. Such penetration would be most likely to occur when the ice is soft (0 °C). Accordingly, the studs and gritted soles did provide high SCOF (≧0.32) at 0 °C; however, the low SCOF value (0.10) for the metal coils at 0 °C suggests that the coils failed to achieve adequate penetration of the ice. Moreover, the low DCOF values (0.06–0.2) obtained for the studs, grit and coils at 0 °C suggest that the ploughing resistance provided by the soft ice during dragging was insufficient to overcome hydroplaning effects due to the water layer.  In the gait tests, the hybrid rubber outsoles, studs and gritted soles all tended to show equally low frequency of slipping, and the only statistically significant difference was an elevated frequency of forward slips when using the metal coils to descend the sloped walkway at −10 °C. Although the temporal and spatial gait parameters that were analyzed (stride time, length and velocity) were not significantly affected by footwear type, the analyses of the required coefficients of friction (RCOF) suggest that some subtle gait alterations were utilized to reduce risk of slipping. In particular, the RCOF values during weight acceptance (RCOFh) and push-off (RCOFt) at −10 °C tended to be lower when wearing the crampons, gritted soles or metal coils, in comparison to the hybrid rubber soles, suggesting an adaptation to increase the safety margin between the required and available friction when wearing the ploughing devices on a hard-ice surface.  A potential limitation of the present study pertains to the loading that was used during the drag tests. Although the 6-kg load is comparable to loads used in some other studies of footwear coefficients of friction (King et al., 2013; Fong et al., 2005), it has been suggested that such loads may not provide a good simulation of the conditions that lead to slips in daily life (Chang et al., 2001). In particular, it is possible that higher loading would have led to greater penetration of the ice and hence increased coefficients of friction in the devices that rely on ploughing friction. In addition, variation in the speed of drag (due to the fact that the drag was controlled manually) could have possibly had an influence (Chang et al., 2001), although the differences in drag speed were relatively small. An ad hoc comparison (p < 0.05) revealed that the mean drag speed was ∼10% faster at 0 °C in comparison to −10 °C, and about 20% faster when testing the gritted sole in comparison to the crampons. It should also be noted that the drag tests fail to emulate dynamic “squeeze-film effects” that can occur on wet surfaces during the landing phase of gait, but it is not clear to what extent this may have affected the findings. The simple drag-test methodology has been used in previous wet-surface footwear studies (Fong et al., 2005, 2009; Nagata et al., 2009; King et al., 2013) and hence may provide a useful basis for comparison; however, further work is needed to determine how well these test results actually predict the ability to avoid slips during gait.  A limitation of the gait trials was that the step/stride length was regulated by the floor panel configuration. The average stride length while walking at a natural pace for an adult male is 1.51 m (Winter, 1999), whereas the average stride length of male participants in this study was 1.26 m. Because of the shorter stride length, the walking velocity was also slower than that of the natural gait of young adults. Slip potential, i.e., RCOF, is influenced by step length and walking velocity (Perkins, 1978; Grönqvist et al., 1989; Yamaguchi et al., 2008); therefore, it will be necessary to investigate the risk of slipping and falling when walking on ice with a longer stride and faster velocity. Another limitation pertains to the possibility of anticipation and adaptation effects. The participants knew prior to the trial that they had to land on the icy surface, and this may have led to a change in their gait to decrease slip potential, as reported by Cham and Redfern (2002b). Further investigations under more unpredictable conditions and during other walking conditions (such as turning, gait initiation and gait termination) should increase slip potential (Yamaguchi et al., 2013) and help to verify that the hybrid rubber sole can be utilized as an effective anti-slip device during winter. Asking subjects to perform a distracting cognitive task during the gait trials may also help to reduce adaptation and increase slipping (Woollacott and Shumway-Cook, 2002). In the present study, slips occurred in only 3% of gait trials. Although these data were sufficient to identify some footwear-related differences, the use of test conditions that increase slip frequency would help to increase the statistical power to detect footwear-related differences.  In future work, it would be beneficial to expand the testing to include a wider range of both footwear and anti-slip devices. Although the specific deformation-friction devices that were tested in this initial study were intended to represent the most commonly-used approaches (studs/crampons, metal coils and gritted surfaces), further work will be needed to determine whether similar devices from other manufacturers perform more effectively and to ensure that the specific samples that are tested are representative of the product. In addition, it will be important to determine the extent to which the performance is dependent on the type of shoe or boot that is worn in conjunction with the anti-slip device, since footwear features (e.g. outer sole stiffness) could well influence the pattern of contact between the anti-slip device and the icy surface. In the present study, the drag tests used only a single type of shoe, and the gait protocol was restricted to the winter shoes or boots that the subjects normally wear (seven participants wore various models of athletic shoes and nine participants wore various models of winter boots). Finally, there is a need to consider practical issues such as durability and wear resistance, which may have an important influence on cost. In particular, the hybrid rubber sole is very soft (40 Shore A hardness) compared with common footwear (>50); hence, further work is needed to evaluate its wear resistance.   CONCLUSIONS   Our drag-test and gait-trial results obtained on wet and dry icy surfaces indicated that the hybrid rubber sole showed a slip resistance that was comparable to that of conventional winter anti-slip devices. The hybrid rubber sole exhibited relatively high SCOF (≧0.37) and DCOF (≧0.31) values on the drag test, and no significant differences in the SCOF and DCOF values were observed when the environmental temperature changed. The other three footwear devices had substantially lower DCOF values (0.06–0.20) at 0 °C compared with the hybrid rubber sole. Analysis of the frequency of slipping while walking on level and sloped icy surfaces provided no evidence that the hybrid rubber sole was any less effective than the other footwear devices in preventing slips, and in fact showed significantly fewer slips than the metal-coil device. These results suggest that the hybrid rubber sole may be a viable approach to decreasing slip-and-fall accidents on icy surfaces. In addition to providing good slip resistance on icy surfaces, the hybrid rubber outsole may have a number of advantages over anti-slip devices that rely on ploughing friction, including reduced susceptibility to tripping (Bruce et al., 1986), better slip resistance on non-icy surfaces (Yamaguchi et al., 2014), and more comfortable walking on non-slippery surfaces. On the other hand, the low-hardness rubber used in the hybrid insole may be more susceptible to wear when walking on concrete pavement or other non-slippery surfaces (Gore and Gates, 1997). Further studies are needed to confirm the effectiveness and wear resistance of the hybrid rubber sole under a wider range of test conditions.  None of the authors has any conflict of interest, including specific financial interests, relationships, and/or affiliations relevant to the participant matter or materials included in this manuscript.   ACKNOWLEDGMENTS   This study was partially supported by the Excellent Young Researchers Overseas Visit Program from the Japan Society for the Promotion of Science (JSPS). This study was also supported, in part, by the Canadian Institutes of Health Research (grant #MAT-91865). Infrastructure support was provided by the Toronto Rehabilitation Institute (with grants from the Canadian Foundation for Innovation, the Ontario Innovation Trust and the Ministry of Research and Innovation) and by the Sunnybrook Research Institute.   REFERENCES", "highlights": "Conventional winter-safety footwear devices, such as crampons, can be effective in preventing slips on icy surfaces but the protruding studs can lead to other problems such as trips. A new hybrid (rough and smooth) rubber outsole was designed to provide high slip resistance without use of protruding studs or asperities. In the present study, we examined the slip resistance of the hybrid rubber outsole on both dry (−10 °C) and wet (0 °C) icy surfaces, in comparison to three conventional strap-on winter anti-slip devices: 1) metal coils (“Yaktrax Walker”), 2) gritted (sandpaper-like) straps (“Rough Grip”), and 3) crampons (“Altagrips-Lite”). Drag tests were performed to measure static (SCOF) and dynamic (DCOF) coefficients of friction, and gait trials were conducted on both level and sloped ice surfaces (16 participants). The drag-test results showed relatively high SCOF (≧0.37) and DCOF (≧0.31) values for the hybrid rubber sole, at both temperatures. The other three footwear types exhibited lower DCOF values (0.06–0.20) when compared with the hybrid rubber sole at 0 °C (p < 0.01). Slips were more frequent when wearing the metal coils, in comparison to the other footwear types, when descending a slope at −10 °C (6% of trials vs 0%; p < 0.05). There were no other significant footwear-related differences in slip frequency, distance or velocity. These results indicate that the slip-resistance of the hybrid rubber sole on icy surfaces was comparable to conventional anti-slip footwear devices. Given the likely advantages of the hybrid rubber sole (less susceptibility to tripping, better slip resistance on non-icy surfaces), this type of sole should contribute to a decrease in fall accidents; however, further research is needed to confirm its effectiveness under a wider range of test conditions."}