{"id": "S000368701300183X", "article": "MAIN-TITLE Towards a comprehensive Functional Capacity Evaluation for hand function   HIGHLIGHTS          This study validates a short protocol for Hand Function testing.      Hand capacity can be measured more efficiently compared to existing protocols.      Testing work capacity benefits from shorter protocol, because of lower costs.          KEYPHRASES   Hand function  Hand strength  Functional Capacity Evaluation   The evaluation of hand function is of importance in the assessment of upper limb impairments such as complaints of arm, neck and shoulder (CANS), chronic musculoskeletal pain or disabilities as the result of rheumatoid arthritis, chronic fatigue syndrome, developmental disabilities, muscular dystrophy, chronic pain or stroke (Blair et al., 1987; Mitsionis et al., 2009). Due to the importance of hand force in relation to work-related musculoskeletal disorders, evaluation of hand function and work ability has been a research issue among ergonomics researcher (Bao and Silverstein, 2005).  Upper extremity work capacity testing can be a part of Functional Capacity Evaluations (FCEs). FCEs are standardized batteries of tests which all together form an evaluation of the functional capacity of work-related activities (Soer et al., 2008). FCEs can be job specific (Innes, 1999) or pathology specific (Reneman et al., 2005; Gross et al., 2006; Gouttebarge et al., 2010) and they can be used to determine hand function (Reneman et al., 2005; Soer et al., 2006). A pathology specific FCE protocol for patients with work related upper limb disorders, consists of tests which determine Hand Grip strength, finger strength and upper limb dexterity (Soer et al., 2006). Usually these tests consist of multiple repeated trials, but there is discussion about the efficiency and validity (Watanabe et al., 2005), because repeated trials are time consuming, expensive and results may be affected by (muscle) fatigue (Watanabe et al., 2005, Reddon et al., 1985) and/or learning (Watanabe et al., 2005). Reliable and validated FCE protocols that consist of fewer or single trials to assess hand function have not been described. Some authors argue that a more efficient protocol can be developed since protocols that consists of less trials do not seem to affect the validity and reliability of the protocol (Soer et al., 2006; Coldham et al., 2006; Roberts et al., 2011).  Hand and finger grip strength testing is used to quantify physical exposures of work activities to guide prevention efforts in the management of work-related musculoskeletal disorders. Many exposures are difficult to collect in the work environment; therefore grip strength testing in combination with methods such as “force matching” is used by ergonomist in the field. (Bao and Silverstein, 2005; Dale et al., 2011; Wiktorin et al., 1996). It is also being argued that a measure of grip strength is not a true measure of grip strength alone because of the influence of pain and therefore a shorter protocol could lead to a more true measure of Hand Grip strength (Coldham et al., 2006). A less time consuming and demanding protocol could lead to reliable outcomes but that are less physical demanding, for workers with and without history of upper limb pathology (Coldham et al., 2006; Roberts et al., 2011). Therefore, a more efficient FCE protocol which consists of fewer trials may also lead to a more valid and reliable evaluation of hand function. Shorter protocols are more beneficial for ergonomists and occupational health specialists who determine hand function for work ability assessments, because it leads to a less time intensive and more cost efficient procedure (Dale et al., 2011). The aim of this study was to develop a more effective, lean and valid protocol to assess hand function. It was hypothesized that a shorter protocol does not affect the validity of hand function capacity testing.   METHODS   643 Healthy working subjects, 402 men and 241 women, between 20 and 61 years of age and working in more than 180 different occupations participated in this study. Inclusion criteria were meeting the criteria of the Physical Activity Readiness Questionnaire (Shephard, 1988; Thomas et al., 1992), a resting systolic and diastolic blood pressure of less than 159 mmHg and 100 mmHg (Matheson et al., 1995) and working at least 20 h a week with no absenteeism from work because of musculoskeletal complaints for more than 2 weeks during one year prior to the FCE. All patients signed informed consent.  Prior to the FCE, participants filled out a set of questionnaires concerning general demographics, self-reported health, and self-reported habitual physical activity. General demographics included sex, age, weight, height, education level, and work status. Self reported health was assessed by means of the RAND-36 Health Survey, a generic health measuring scale covering 9 domains of functioning and well-being (Hays et al., 1993). These domains were vitality, mental health, social functioning, general health perception, pain, role limitations (emotional problem), role limitations (physical problem), physical functioning and health change (Hays et al., 1993). On completion of the FCE, subjects received their personal results, a coupon of €15 and travel expenses. The study was approved by the Medical Ethical Committee of the University Medical Center Groningen.  The existing protocol consisted of six tests which measured elements of hand function. These tests were derived from the WorkWell FCE (WorkWell Systems, 2006). These tests were the Handgrip strength test, Tip Pinch Strength, Palmar Pinch Strength, Key Pinch Strength, Purdue Pegboard Test and the Complete Minnesota Dexterity Test. All tests were conducted for the right and the left hand. The shortened protocols were not tested separately, but were derived from the data of the criterion protocol. The one trial protocol is based on the first trial of the criterion protocol, whereas the two trial protocol is based on the results of the first two trials as performed in the criterion protocol. Subjects were individually evaluated by 1 of 15 physical therapy students who had completed a 2-day FCE training by a licensed WorkWell trainer specifically for this purpose. Inter-rater reliability of the tests of the WorkWell FCE were excellent with ICCs of 0.95–0.98 (Gross and Battié, 2002). The data of the tests were derived from subjects who performed a larger FCE protocol which is described in the study by Soer et al. (2009).  Several proposed shortened protocols were studied by testing the agreement between both protocols. The shortened protocols were compared to an existing original protocol which was considered to be the criterion protocol with good psychometric properties (Innes and Straker, 1999). The original tests from the WorkWell FCE determine hand function by the means of six valid and reliable tests (Laffayette Instruments, 1999; Soer et al., 2006; Mathiowetz et al., 1984; Mathiowetz, 2002; Desrosiers et al., 1997). The shortened protocols for the Hand Grip strength, finger strength tests and dexterity tests consisted of either one or two trial(s). The numbers of trials of the proposed protocols are described in Table 1 .  Isometric grip strength was determined by the use of a hand dynamometer (Jamar PC 5030). The Jamar dynamometer gives the most accurate and acceptable measures of hand strength (Mathiowetz et al., 1984; Mathiowetz, 2002). The subjects performed the protocol in a seated position, the subjects held their shoulder adducted and neutrally rotated, elbow flexed at approximately 90°, and the forearm and wrist in neutral position (Innes, 1999, Mathiowetz et al., 1985a, 1985b). Grip strength of the right and left hand was measured in a 3-trial procedure as recommended by the American Society of Hand Therapists (ASHT) (Garner, 1992). The average amount of kilogram-force was scored. Test-retest reliability in healthy subjects is high by the use of this protocol and materials (ICC = 0.93) (Innes and Straker, 1999).  The finger strength was measured with Isometric Tip, Key, and Palmar Pinch Strength. A Pinch-Grip dynamometer (Preston Pinch Gauge) was used to determine finger strength. The subjects performed the protocol in a seated position, the subjects held their shoulder adducted and neutrally rotated, elbow flexed at approximately 90°, the forearm and wrist in neutral position (Innes, 1999; Mathiowetz et al., 1985a). For the tip pinch, subjects pinched for 3 s with index finger above thumb. Facilitation of middle finger was not permitted. Palmar strength was measured with both index and middle finger on top and thumb below the dynamometer. Key strength was measured using pinch strength of thumb on top. Strength of the right and left fingers were measured in a 3-trial procedure. Average kilogram-force was scored. Test-retest reliability in healthy subjects is high (ICC = 0.76) (Soer et al., 2006).  Fingertip dexterity was determined by the use of the Purdue Pegboard (model no. 32020) protocol. The subjects performed the protocol in a seating position in front of the pegboard, placing pins with left and right hand as fast as possible in a 30-s trial. Average number of pins placed in 30 s over 3 trials in both hands was scored. Test-retest reliability of the 3-trial score in healthy subjects is moderate to high (ICC = 0.73–0.91) (Soer et al., 2006; Laffayette Instruments, 1999; Buddenberg and Davis, 2000).  Hand and forearm dexterity tests consist of gross movement coordination tasks of fingers, hands, and arms which was assessed by the use of a Complete Minnesota Dexterity Test. Subjects performed the procedure in a seating position where 59 blocks were displaced in a predetermined way as fast as possible. Total displacing time needed to perform 4 trials with both hands was scored. Test-retest reliability of the 4-trial score protocol in healthy subjects is high to excellent. (ICC = 0.77–0.98) (Soer et al., 2006; Desrosiers et al., 1997; Laffayette Instruments, 1969).  All tests were scored on an interval level. There were no ceiling or bottom effects possible. Normality of all tests were assumed based on analyzes of the QQ-plot and Skewness and Kurtosis data (Wilk and Gnanadesikan, 1968). The mean and standard deviations (sd) were calculated for all tests. Independent t-tests were performed to determine if there were significant differences between the mean scores for males and females in all tests. A distinction between males and females was made when a significant difference between genders was observed. To determine if there are differences in mean outcome between the consecutive trials of the criterion protocol, a repeated measures ANOVA was performed for all tests. A Greenhouse-Geisser correction took place in case of violation of the sphericity. P-Values <0.05 were considered significant. Data was analyzed with SPSS-18 for Windows.  Agreement between the shortened and original protocol was determined with Intraclass Correlation Coefficients (ICC), model (1,1) and Limits of Agreement (LoA) (Bland and Altman, 1986; Bland and Altman, 1986; Mokkink et al., 2012). ICCs are interpreted as follows: an ICC higher than 0.50 is assumed to have a moderate agreement and an ICC higher than 0.75 is assumed to have a high agreement (Innes and Straker, 1999). ICC results ranging from 0.75 to 0.90 indicate high agreement and ICCs between 0.91 and 1.0 indicate excellent agreement for clinical measures (Portney and Watkins, 1993). One way random Intraclass Correlation Coefficients (ICC 1,1) were conducted which determine absolute agreement between protocols by the means of within subject variances (McGraw and Wong, 1996). To explore the differences between the test results for within subjects between the criterion protocol and the proposed shortened protocols, limits of agreement (LoA) were calculated (Bland and Altman, 1986). The LoA were calculated as follows: mean difference ±1.96 × standard deviation of mean difference (Bland and Altman, 1986). The mean differences and their standard deviations were used to determine the LoA and therefore the LoA were for clinical interpretation. When the LoA was less than 16% deviated from the mean score of the criterion values, the LoA were assumed to be acceptable for clinical interpretation and therefore it is assumed that the highest variability could have no considerable influence on decision making. The variability of 16% is determined by analysis of the study of Schreuders et al. (2003) (Schreuders et al., 2003), who found that the smallest detectable differences (SDD) were due to a real change and not by measurement error, when the scores were more than 22% deviated for Hand Grip Strength testing, 16% deviated for Tip Pinch Strength testing and 23% deviated for Key Pinch Strength testing when compared to the mean of the measurement (Schreuders et al., 2003). These percentages were extracted from the study of Schreuders et al. (2003) by comparing the deviation between the SDD and the mean values of the tests. No SDD data of hand dexterity testing are described. The use of SDDs can assist to determine whether a change was real or due to a measurement error (Schreuders et al., 2003) and therefore could affect interpretation and decision making of the professional. The lowest variability of 16% is chosen for all tests. Thus, the hypothesis for good agreement was not rejected when the ICCs were higher than or equal to 0.91 and when the LoA was less than 16% deviated from the mean of the criterion values.   RESULTS   643 participants completed all hand function tests. Personal characteristics are presented in Table 2 . Gender had a significant effect in all tests (p < 0.001) and therefore results are presented for males and females separately.  Mean and SDs of the criterion protocol, ICCs and LoA's are presented in Table 3 (for males) and Table 4 (for females). In all positions of the Hand Grip Strength testing and in all dexterity tests, significant differences were observed by the means of the paired sample t-test, except for the two trial left handed protocol of the second position for Hand Grip Strength for males and females. The ICCs were excellent (ICC > 0.91) in all proposed protocols except for the one trial Purdue Pegboard test with ICCs of 0.80–00.82. In all tests, the ICCs were higher for the two trial protocol than for the one trial protocol. For all tests, the LoA's were about twice as large for the one trial protocol compared to the two trial protocol. All two trial protocols had a variability of the LoA of lower than 16% when compared to the criterion values.  There were significant differences on outcome between the positions of the hand grip in the Hand Grip strength test (F(1, 642) = 7592.89, p < 0.000). For all positions of the Hand Grip strength tests, significant effects between trials were observed (p < 0.01). In all positions, except for position 1, a decline of strength within the consecutive trials was observed. In position one, an increase of grip strength is observed in both hands between the consecutive trials. Significant different scores between the consecutive trials were found in the left handed Tip Pinch strength test (F(1.9, 1237) = 3.4, p = 0.03) and the right handed Palmar Pinch strength test (F(1.9, 1205) = 5.2, p = 0.01). The mean scores between the consecutive trials did not differ for the right handed Tip Pinch strength test (F(1.9, 1227) = 0.27, p = 0.75), the left handed Palmar Pinch Strength test (F(2.0, 1227) = 1.9, p = 0.16), the right handed Key Pinch strength test (F(1.9, 1204) = 0.02, p = 0.98) and the left handed Key Pinch strength test (F(1.9, 1203) = 0.14, p = 0.86). Significant differences in mean scores between the consecutive trials were observed for all dexterity tests (p < 0.001) after a Greenhouse–Geisser correction. The number of pins of the Purdue Pegboard Test increased in the consecutive trials. Consecutively, the mean duration between the trials of the Complete Minnesota Dexterity Test decreased indicating a learning effect in both dexterity tests.   DISCUSSION    RESULTS   For all test, a shortened protocol does not influence the agreement. The agreement analyses showed excellent correlation coefficients (ICC ≥ 0.91) for all proposed protocols, except for the one-trial Purdue Pegboard test. Significant differences between the trials within the subjects were observed in most of the tests, indicating that fatigue and/or learning affected the scoring of the tests, but in most instances these differences were small and the LoA showed that they did not influence the validity. Although agreement according to the ICC was good, no absolute agreement between the protocols can be determined by an ICC (Bland and Altman, 1986). Therefore all proposed protocols were analyzed with the LoAs. The LoA were considered to be acceptable when they could not affect possible interpretability of the data. LoAs with a variability of 16% or higher when compared with the references values could affect decision making (Schreuders et al., 2003). In all tests, a significant effect of gender was observed. Gender is an important determinant of hand function (Soer et al., 2006; Mathiowetz et al., 1985a; Puh, 2010; Hamilton et al., 1994; Peolsson et al., 2001; Chandrasekaran et al., 2010) and therefore the tests were independently presented. For the Hand Grip tests, in all five positions except the first position, a significant decline was observed over the consecutive trials, indicating that an effect of fatigue was present which was according to previous studies (Watanabe et al., 2005; Reddon et al., 1985). Agreement analyses showed that when Hand Grip Strength testing consist of two trials, the strength of the relationship is excellent for all positions (ICC > 0.93). For males, the LoAs of a two-trial protocol show that in most positions, the LoA were between −3 and 3 kg and that the mean differences in most positions were lower than 0.6 kg. For women, the LoAs were between −2 and 2 kg. Such LoAs do not influence the interpretability of the data because the differences are not detectable on the dial of an analogue Jamar dynamometer, which displays 2 kg increments. The difference between the range of the LoAs between a protocol consisting of two trials in comparison with a one-trial protocol is more than twice as large for all positions, indicating that when a protocol of one trial is performed, a higher variability is present. For position one, the LoA could reach up to a variability of 20% when compared to the mean score of the criterion values of the criterion protocol. However, the second and the third position of the Jamar Dynamometer are most often used in practice because hand size could have an effect on Hand Grip testing (Roberts et al., 2011; Peolsson et al., 2001; Desrosiers et al., 1995). A measurement of the second position of the Jamar dynamometer is advised by the American Society of Hand Therapists (ASHT) and therefore is the most used position (Reddon et al., 1985; Garner, 1992). For work ability assessment, however, use of other positions may be required. Therefore, data for all 5 hand grip positions are presented. Assessors may choose grip positions based on the purpose of the test. If a maximal performance for handgrip strength is required, than it can be advised to let participants self select the handle position for the highest grip force (Boadella et al., 2005). At the second position, the highest Hand Grip Strength for both genders was observed. With high ICCs, acceptable variability of the LoA (<16%) and small differences between the proposed protocols and the criterion protocol it is concluded that shorter protocols had no effect on clinical decision-making. The variability according to the LoA is smaller for the second hand grip position and the highest strength is also registered at the second handle grip position, therefore the use of the second handle grip is advised. Also the LoA of the one-trial protocol is less than 16% and therefore it is assumed that a one-trial protocol has no influence on the decision making of the clinician. Therefore a one-trial protocol in the second handle grip position is advised. For finger pinch strength, the only significant differences were found in the two-trial Tip Pinch strength left and the one-trial Tip Pinch strength left for females and for the one-trial right handed Palmar Pinch Strength test for males. The LoAs of a one-trial Tip Pinch strength test and a one-trial Palmar Pinch Strength test deviated more than 16% from the criterion values. Therefore a two-trial protocol is advised for the Tip Pinch Strength and Palmar Pinch Strength test. A one-trial protocol for the Key Pinch Strength is advised.  Effects of learning were present for both dexterity tests, which is in line with other studies (Soer et al., 2006; Haward and Griffin, 2002). Such learning effects could lead to a lower reliability coefficient (Soer et al., 2006). The mean differences between a one-trial protocol and criterion protocol were smaller than 5% and therefore do not influence interpretation of the data. For the two-trial protocol the LoA were up to a maximum of one pin. In contrast, when a one-trial protocol was performed, this was up to 2.7 pins which is a variability of 17% and the ICC of a one-trial protocol is much lower (0.80) compared with the two trial protocol with an excellent ICC of 0.95. In the literature there appears no consensus about the test-retest reliability of a one-trial protocol of the Purdue Pegboard Test. The test-retest reliability of a one-trial protocol ranged from ICCs of 0.37 to >0.70 (Wilk and Gnanadesikan, 1968). In contrast, the test-retest reliability of a three-trial protocol is reported to be higher with ICCs from 0.81 to 0.89 (Wilk and Gnanadesikan, 1968). Because the variability of the LoA was higher than 16%, an ICC of <0.91 and because of low test-retest coefficients, a two trial Purdue Pegboard Test protocol is advised. The LoA of a one-trial protocol in the Complete Minnesota Dexterity Test showed a variability of 15% for females and 17% for males. Because the difference between males and females is only 2%, because of good ICC's, and because we used the most strict arbitrary line (Schreuders et al., 2003), which was based on fingertip strength, we recommend a one trial Complete Minnesota Dexterity Test for both genders.  In daily practice, total time reduction for the shorter protocols will vary depending on which tests an assessor will include in the tests he/she wants to administer. Net time reduction for handgrip and finger strength was determined by eliminating the duration of the recovery break times (30 s) and the actual 5 s pinching procedure when conducting lesser trials. For the Complete Minnesota Dexterity Test the net time was determined by the use of statistical elimination of trials and deleting the extra trial time duration of the criterion protocol. For the Purdue Pegboard test, net time was determined by the use of the standard procedure where one trial takes 30 s. Time to reset or rebuild the assessment, conversation between the assessor and participant and other time variables were not determined. The net time benefit when using the proposed protocol could lead to 93% for Hand Grip strength testing and to 74% for dexterity testing when using the Complete Minnesota Dexterity test. Net time reduction per test is presented in Table 5 .  Concurrent validity analysis is a component of criterion-related validity, which examines the correlation between two or more measures given to the same subjects at approximately the same time (Innes and Straker, 1999). This approach is useful when the proposed protocols are new or untested and is being proposed as an alternative assessment to the criterion protocol because of ease or efficiency, practicality and/or safety (Innes and Straker, 1999). However, concurrent validity analyses depend on the validity of a “gold standard”. In the current study, there appeared no gold standard and in literature, there is no gold standard for the measurement of hand function therefore, the authors choose to use term agreement. The LoA were for clinical interpretation (Bland and Altman, 1986), but there are no exact data available which percentage of variability in LoA lead to differences in interpretability of the data. The use of Smallest Detectable Differences (SDD) is a way to determine whether a change could be due to a measurement error or due to a real change, but it does not determine when it influences decision making. Also subjects knew that 3 trials were required, this might have led to different test behavior compared to a one trial requirement. For age and anthropometric traits such as height and weight there was no correction, while this could affect Hand Grip strength testing (Chandrasekaran et al., 2010; Soer et al., 2012), however, there is no known data that such anthropometric traits could affect inter personal agreement. Another limitation of this study is that these tests were only tested on agreement on healthy subjects. Patients with hand disability may have different test behavior which may lead to higher variances between trials. Therefore it is recommended to repeat this study with patients with hand disabilities.  It can be concluded that FCE tests for hand function can be shortened with good agreement. For Hand Grip tests, a protocol consisting of one-trial in the second handle position is reliable. For finger strength testing, a two-trial protocol is advised except for the Key Pinch strength test, whereas a one-trial protocol is advised. For dexterity testing, a two-trial protocol is advised for the purdue pegboard test and a one trial protocol is advised for the Complete Minnesota Dexterity Test. In FCE testing it appears that shorter protocols which consists of less tests (Gross and Battié, 2007; Branton et al., 2010) and less trials will not affect recovery outcomes when they are compared to the standard validated FCE protocols. This shortened advised protocol gives ergonomics and occupational health care specialists the possibility to use a more time efficient and cost effective protocol for assessing hand function in a valid manner. Also these data possibly indicate that other protocols for functional capacity testing could still be reliable when shortened in their number of trials. A commonly used method by ergonomists known as ‘force matching’, which can also be used in push, pull and lifting task (Wiktorin et al., 1996), can therefore be conducted in an efficient way. Force matching is done by asking a worker, who performs tasks requiring grip efforts, to replicate the force with a similar type of grip on a dynamometer based on his estimation (Bao and Silverstein, 2005). Before concluding that shortened protocols are still a reliable way to determine hand function, further testing of the short form hand FCE protocols should be completed using patients with disabling conditions prior to widespread use of these protocols.   CONCLUSION   It was concluded that for healthy subjects, a shorter FCE protocol is a reliable measure. Further testing of the short form hand FCE protocols should be completed on patients with disabling conditions prior to widespread use of these protocols among clinical samples.  Abbreviations: HGS, Hand Grip Strength in Kg; PPS, Palmar Pinch Strength in Kg; ITPS, Tip Pinch Strength in Kg; PPT, Purdue Pegboard Test in number of pins placed; KPS, Key Pinch Strength in Kg; CMDT, Complete Minnesota Dexterity Test in seconds; LoA, Limits of agreement.   REFERENCES", "highlights": "The aim of this study was to develop a more efficient (i.e. shortened) protocol for hand function capacity evaluation and to test the agreement of the protocol compared to the original protocol. 643 Healthy subjects performed tests for hand function. Agreement between two shortened protocols was compared with an existing protocol. The original protocol was performed once and the proposed shortened protocol differed in the number of trials which were reduced by statistical elimination. Agreement was determined with Intraclass Correlation Coefficients (ICC) and Limits of Agreement (LoA). Excellent ICCs (≥0.91) were observed in all proposed protocols except for the one trial purdue pegboard test protocol. For all tests of hand function, shorter protocols are valid to determine hand function. For Tip Pinch Strength testing, Palmar Pinch Strength testing and the Purdue Pegboard test, a two-trial protocol is recommended, because the LoA were considerable, which could affect decision-making with regards to hand capacity. For the Hand Grip strength test, the Key Pinch Strength test and the Complete Minnesota Dexterity Test, a one-trial protocol is recommended, because the LoA were acceptable. It was concluded that for healthy subjects, this shorter protocol is a reliable measure. Further testing of the short form hand FCE protocols should be completed on patients with disabling conditions prior to widespread use of these protocols among clinical samples."}