{"id": "S000368701400026X", "article": "MAIN-TITLE Supervisory-level interruption recovery in time-critical control tasks   HIGHLIGHTS          We examined an interruption recovery tool to assist supervisors in C2 settings.      The tool is an interactive timeline of historical events with discrete replay.      Decisions were faster and more accurate with the interactive event timeline tool.      The tool was particularly effective when participants faced complex decisions.          KEYPHRASES   Interruption  Supervisory control  Unmanned vehicles   Interruptions, a common occurrence in modern workplaces, have been shown to have a wide variety of negative consequences (e.g., Jett and George, 2003). They can result in slower task completion time, increased error rates and additional job stress (e.g., Bailey and Konstan, 2006; Cellier and Eyrolle, 1992; Czerwinski et al., 2000; Van Bergen, 1968). Disruption of work in team-based activities can also lead to coordination problems, including increased time pressure and team member workload (Jett and George, 2003; Reder and Schwab, 1990). Interruptions can have particularly negative effects on personnel working in time-critical environments, such as command and control (C2) settings, as an interruption occurring in these high-risk, information-rich settings may cause personnel to miss critical information directly related to the decision-at-hand. Supervisors in modern work environments are particularly prone to interruptions in the form of “unexpected meetings and conversations” (Jett and George, 2003, p. 494) that interfere with their ongoing tasks (e.g., Mintzberg, 1990). In particular, supervisors in time-critical environments may be impacted by interruptions, especially given the highly collaborative and multitasking nature of these environments (Cooke et al., 2007; Cooke and Gorman, 2006). For example in C2 settings, supervisors not only monitor the mission and make decisions that involve tactical assessment, but are also in charge of monitoring the performance of other personnel. Detecting changes and maintaining situation awareness (SA) of an ongoing mission after an interruption in such complex monitoring tasks often imposes a high working memory load and requires mental calculation (Trafton et al., 2003). To date, however, little research has focused on interruption recovery support for supervisors in C2 settings. Providing such support may help supervisors more effectively resume their previous tasks, which often involves understanding the team's “mission picture” (or “big picture”), which may consequently benefit overall team functioning.  Previous research has investigated operator-level interruption recovery in C2 settings (e.g., Scott et al., 2006; St. John et al., 2005), with a particular focus in assisting operators to “catch up” on changes that occurred in their dynamic task environment while they were attending to an interruption. This research builds on this approach by adapting operator-level interruption recovery methods to account for the informational needs of team supervisors in C2 environments. In particular, this research builds on Scott et al.’s (2006) use of interactive event timelines coupled with discrete event replay to enable unmanned aerial vehicle (UAV) operators to regain SA after interruptions. In that research, selecting an iconic event bookmark from an interactive event timeline caused the historical state of the tactical map to be displayed at the time of the event in a separate replay window. This paper extends that previous research by providing an interactive event timeline that highlights team-related events and activities to improve supervisor decision accuracy and timeliness after an interruption.  To further set the context for this work, the paper overviews previous research in the area of time-critical interruption recovery. Next, a representative mission task scenario and experimental platform developed to evaluate the supervisory-level interactive event timeline design concept are introduced, along with the interruption recovery assistance (IRA) tool that reified the interactive event timeline interruption recovery method. A laboratory-based user study is then described that aimed to evaluate the effectiveness of this interruption recovery method on mitigating supervisory-level interruption recovery. Finally, the results of the experiment are detailed and discussed.   BACKGROUND   Over the past decade, there has been a growing interest in understanding the perceptual and cognitive processes involved in regaining the SA after an interruption in dynamic monitoring tasks. In this section, the work of Trafton et al. (2003) to anatomize the interruption process is first discussed. Next, a framework relevant to interruption recovery called Memory for Goal (MFG) model and two interruption recovery techniques, namely the use of external cues and event review, are reviewed.  Based on a task analysis of different interruption scenarios, Trafton et al. (2003) developed a model to describe the interruption and resumption process. Their model focuses on the temporal process of someone performing a “primary task”, becoming aware of an interruption (i.e., the interruption alert), beginning the “secondary task” (i.e., the interruption task), ending the secondary task, and finally, resuming the primary task. The model defines the period of time between the interruption alert and beginning the secondary task as “interruption lag.” The period of time between ending the secondary task and resuming the primary task is defined as the “resumption lag” (also referred to as reorientation time (Gillie and Broadbent, 1989) or interruption recovery time (Scott et al., 2006)). Trafton et al.’s research showed that when given an opportunity, people tend to use the interruption lag (e.g., of 8 s in their study), to mentally prepare for the interruption, which in turn, helps to reduce their resumption lag compared to when no interruption lag is provided. Other researchers explain this phenomenon as creating a prospective memory (PM) task in which the interruptee encodes an adequate intention to resume the primary task before orienting to the interruption task (Dodhia and Dismukes, 2009). This model was later expanded by Boehm-Davis and Remington (2009) who further divided the resumption lag into the time to disengage from the interruption task, the time to re-orient to the primary task, and the time to resume the primary task. Re-orienting to the primary task may be problematic since it involves not only a visual re-acquisition, but also memory for important state information (Boehm-Davis and Remington, 2009).   Altmann and Trafton (2002, 2004) proposed a cognitive process model of task resumption in which memory elements of the suspended goals are activated. According to this model, activation of memory elements is subject to decay over time. Therefore, old goals need to undergo a priming process using associative links between the goal and internal (e.g., steps in a procedural task) or external (e.g., environmental) retrieval cues. In subsequent work, Altmann and Trafton (2004) explained how mental preparation, especially via the use of mental or environmental cues during the interruption lag can help an interruptee resume a primary task as predicted by goal-activation theory. In several experiments (Altmann and Trafton, 2004; Trafton et al., 2005), they demonstrated how this theory can predict why providing explicit environmental cues, such as eye-ball icons or very salient arrows that mark the place of someone's recent actions, in a computer interface helps to reduce people's resumption lag following an interruption.  An important assumption that underlies this “preparatory” mitigation technique is that the primary task environment (e.g., computer interface) has not changed while the interruptee is performing the interruption task. However, in many complex task environments, such as command and control, task environments tend to be more dynamic where important situational changes occur in the primary task environment when someone is attending to an interruption. St. John and Smallman (2008) used the MFG model to develop an integrated framework to describe the post-interruption SA recovery in dynamic tasks. According to this framework, during recovery one needs to re-orient to the primary task in order to detect changes in the environment. This additional re-orientation stage (i.e., inferring the situational changes) is cognitively taxing since the interruption degrades the memory of the situation before interruption.  An important cognitive phenomenon that must be considered when investigating interruption recovery in such environments is change blindness. This phenomenon refers to the fact that people often fail to detect changes within a visual scene, especially when returning to the scene. Supervisory-level command and control tasks are complex monitoring tasks and hence are especially prone to change blindness since detecting mission changes is essential for gaining situation awareness. Previous research shows that interruptions, even for a short time (e.g., screen flickers), may cause the observer to fail to detect substantial changes in the scene or display (e.g., DiVita et al., 2004; Rensink, 2002; Simons and Ambinder, 2005). Simply looking away from a computer screen can also lead to change blindness (e.g., Durlach, 2004; Rensink et al., 1997). In time-critical command and control, many interruptions require a supervisor's visual attention, which in turn can lead to change blindness phenomenon.  One approach to mitigating interruptions in a dynamic task environment prone to change blindness is to use contextual cues to help someone regain their previous context and learn what information they have missed during an interruption. Daniels et al. (2002) implemented an interruption recovery tool using a spoken dialogue interface to mitigate the negative effects of interrupting a military operator while they were performing two monitoring tasks, tracking military logistics requests from deployed ground troops and monitoring their ship's system status. Using verbal queries, operators could ask simple questions regarding the interrupted task such as their status before the interruption (e.g., “where was I?”, “what was I last working on?” (Daniels et al., 2002, p. 16)), or request more complex information, such as an audio summary of the task progress since the beginning of the interruption.  The majority of the interruption recovery research in dynamic environments has focused on similar “event review” concepts. St. John et al. (2005) investigated a textual event history log called CHEX (Change History Explicit) that provided situation awareness of the important mission changes using a table of event bookmarks. When comparing the CHEX approach with video replay of historical mission events during a military airspace-monitoring task, they found that interruption recovery using the CHEX textual event history log was more effective and faster than video replay. While their video replay condition, which provided straight-forward “re-wind” and “replay” functionality akin to “instant replay” during a sports game, did not prove to be valuable, Scott et al. (2006) have argued that replay supplemented by event highlighting might be more effective.  To investigate this hypothesis, Scott et al. (2006) investigated alternative event replay designs to assist interruption recovery during a task involving a single operator monitoring a multiple unmanned aerial vehicle (UAV) mission. Their study compared a no assistance condition against discrete and continuous forms of event replay (available on a peripheral monitor). In the discrete replay condition, selecting an iconic event bookmark from an interactive event timeline located on the replay screen caused the replay window to display the state of the tactical map when the event occurred. In the continuous replay condition, an accelerated (∼10× real-time speed) historical view of all changes to the tactical map within a selected timeframe was displayed. In both replay conditions, event highlighting on an interactive event timeline located below the replay window was provided. Results from this study showed that the discrete event replay helped to reduce interruption recovery time, but only after complex mission changes. This warrants further investigation of tools to mitigate the disadvantages of interruptions when only simple system changes have occurred. In addition, the study results might indicate that task scenarios were overly simplistic and the interruptions likely too short to produce significant differences in interruption recovery or overall task performance. This paper investigates the effects of an improved highlighting tool to help supervisors of multiple UAV operators during a more dynamic, and more challenging command and control task, and a more realistic simulation environment.  To facilitate laboratory-based testing of interruption recovery interface concepts, a representative task scenario was first developed to provide a foundation for emulating a dynamic command and control team task. The task scenario is based on a UAV ground force protection mission, where a UAV operations team is tasked with ensuring the safe passage of an important political convoy through a hostile region. The team consists of three operators controlling multiple semi-autonomous UAVs and a mission commander. Each operator in the UAV operations team is responsible for discovering potential threats to the convoy in their assigned area of interest (AOI) by monitoring the surveillance progress of three UAVs.  The mission commander (i.e., the supervisor) is responsible for the safe passage of the convoy by overseeing the operators' progress and resolving issues related to underperformance of UAVs or operators by commanding time-critical decisions such as holding/releasing the convoy at its current position, reassigning UAVs between operators, and requesting assistance from external intelligence sources. Finally, the mission commander can reroute the convoy along an alternative path if the main path becomes too dangerous.  To emulate the above task scenario in a laboratory setting, a representative command and control room was created (Fig. 1 ), along with a software platform for simulating mission events and displaying mission data. For the experiment, the UAVs and UAV operators were simulated. The physical environment provided three 42-inch (1024 × 768 pixels), wall-mounted Smartboard interactive plasma displays to act as primary mission displays and to provide a variety of mission-related information to the mission commander. The environment also provided a mobile 12.1-inch Wacom Cintiq tablet display that enabled the mission commander to input command decisions into the system. A Dell Optiplex GX500 server computer, located just outside the experimental room, was used to drive the simulated task environment. The software platform provided three command-level interfaces for the large screen displays: a Map Display (MD), a Mission Status Display (MSD), and a Remote Assistance Display (RAD) (Figs. 2–3  ).  The Map Display contains the geospatial map of the mission's area of interests (AOI) as well as a threat summary and strike schedule timeline that reveals important information about the known and potential threats to the safety of the convoy (Fig. 2 (left)). The Mission Status Display (MSD) provides an overview of the current and expected operators' performance as well as several other mission status updates (Fig. 2 (right)). The MSD contains four main components: operator performance diagrams, tasking information for each operator, communication link status diagram, and a timestamp history log of important system events. The Remote Assistance Display (RAD) allows the mission commander to request status updates from the operators and to help them identify targets (Fig. 3 (left), for a complete description of the platform and task see Sasangohar (2009)).  The software platform also provided a tablet display interface: the Mission Commander Interface (MCI) (Fig. 3 (right)), which enabled the mission commander to implement command decision within the simulation environment, and into which features of the developed interruption recovery tool were integrated, as described below.  To derive information and functional requirements aimed at supporting interruption recovery in the UAV team supervision environment, along with more general requirements for supporting the mission commander in the UAV team task scenario, a hybrid cognitive task analysis (hCTA) (Nehme et al., 2006) was conducted. Several important requirements emerged from this analysis related to supporting interruption recovery, mainly, providing visual information on how close the convoy is to a threat, displaying when and where a UAV was destroyed, highlighting an operator's performance if it is deteriorating, and highlighting any recent changes in communication status (for full details of the analysis, see Wan et al. (2007)).  As discussed previously, one technique to display past events is to use an animated replay feature (St. John et al., 2005). However, such sequential replay of events may increase resumption lag since time may be wasted watching irrelevant events. Instead, Scott et al. (2006) used discrete event replay driven by an interactive event timeline that provided a visual summary of past critical events. Their research showed that although this approach can positively affect decision-making and interruption recovery in UAV operations, including redundant and irrelevant visual information in the visual summary shown on the event timeline can negatively affect performance. They also found that locating the event replay tool on a peripheral display can hinder the ability to properly relate past events with the current system state, and hence recommended that the event history be integrated with the current system state.  Based on the requirements generated in H-CTA and the above-mentioned design recommendations an interruption recovery assistance (IRA) tool was developed that contains two main components, 1) an interactive event timeline, and 2) discrete event highlighting capabilities. The interactive event timeline was incorporated into the MCI (Fig. 3), while the event highlighting occurred on the MD (Fig. 2), atop the situation map. The IRA timeline (Fig. 4 (top)), contained four event rows, each displaying interactive event “bookmarks” for different types of critical mission events: convoy attacks, UAVs destroyed, late strikes (i.e., threats that are scheduled to get destroyed after the convoy enters their weapon range), and communication link status changes. Except for communication link status, selecting a bookmark on the IRA timeline prompted event-related information to be shown on the MD situation map. For example, if a “convoy attack” bookmark is selected, the location of the attack would be highlighted with a red “X” on the Map Display for 5 s, and then fades away (Fig. 4 (bottom)).  The timeline provided a dynamically updated view of the events that occurred within the last 10 min (or will occur in the next 5 min, in the case of late strike notifications). This time scale was chosen to suit the experimental sessions, which lasted about 20–25 min. In practice, a different time scale would likely be needed for the actual task operations, depending on the operation tempo and complexity.  A preliminary study of the IRA tool showed minimal usage of the tool and increased recovery time after simple changes had occurred, but also showed a positive trend for decision accuracy effects (Scott et al., 2008). Participant interviews and general observations suggested that these results were, at least in part, due to the task and experimental design. In particular, overly simplistic task scenarios did not create a realistic and sufficiently challenging time-critical decision-making environment. Moreover, the experimental interruptions may have been too short and overly simplistic, and thus, not sufficiently distracting to require assistance to regain situation awareness once participants returned to the primary task. These findings motivated us to refine the experimental design (described in the following section) and task scenarios (described previously) to provide a more realistic environment for testing the utility of discrete highlighting and the associated interactive event timeline in the IRA tool.   METHOD   The study focused on determining the IRA tool's effect on recovery time and decision accuracy of participants who played the role of team supervisor in the experimental task environment described above.  Twenty-four computer-literate participants (18 male, 6 female), ranging from 18 to 58 years old, were recruited from the local university community. Twelve participants were students with previous military training who were either enrolled in Reserve Officers' Training Corps (ROTC) program or graduated from military academies. Of the twelve remaining participants, nine were either undergraduate or graduate students. Participants received $30 remuneration and the best performer received $100. The convoy's health score and mission completion time was used to assess performance.  The main part of the experiment was conducted in the experimental platform previously described. The secondary (interruption) task was performed on a computer located in an adjacent room.  Participants assumed the role of the team's mission commander in the UAV ground force protection mission scenario previously described. Participants had to be vigilant of changes in the scenario, assist the simulated remote operators using the RAD display, and to command decisions to mitigate situations in which operators were underperforming or other mission goals were not on track.  At two predetermined times during the study (Table 1 ), the experimenter would interrupt the participants and ask them to leave the room to perform the secondary task. The exact timing of the interruptions was determined by the location of convoy and the timing of pre-planned events. Scenarios were designed in such a manner that immediately before the interruptions ended, several pre-planned events occurred (e.g., convoy was attacked, convoy was about to enter an unsurveilled area, UAVs destroyed, etc.). These events required a participant's immediate attention upon their return to the primary task. The goal of the secondary task was to find a series of locations on a digital world map using provided hints. The Place Spotting application 1   1  http://www.placespotting.com. was used, which is an open-source online application based on Google Maps platform. Each interruption took 2 min, deliberately longer than the 1-min interruption task used in the preliminary study to minimize opportunities for participants to rely on memory during the recovery period. This reliance on memory was reported as a main interruption recovery strategy in the preliminary study.  A further step was taken to distract participants: the experimenter also asked several questions during the secondary task. For example, the participants were asked: “Did you find the hint?” or “How many tasks did you complete successfully?” Additional, to further motivate participant engagement in the task, they were told that performance in the secondary task would count toward their performance calculation to win the prize for best performance.  A 2 (assistance type) × 2 (decision difficulty) repeated measures experimental design was used. The two assistance types were assistance and no assistance. In the assistance condition, participants were provided with the IRA tool. In the no assistance condition, participants performed the experimental task without the IRA tool (using an alternate version of the MCI that did not include the interactive timeline).  Decision difficulty conditions were simple and complex. In the simple condition, there was only one possible decision that could address the situation facing the mission commander following an interruption. For example, the convoy is approaching a target that will not be destroyed in time, so the only correct decision is to hold the convoy until the strike team clears the target. In the complex condition, several decisions could be made to address the situation; however, only one decision properly fulfilled all mission objectives.  An example of a complex decision is that while the mission commander was gone, one of the UAVs was destroyed and the convoy is approaching the weapons range of an unsurveilled area, putting it in a potential threat situation. Also, during the interruption, the JSTARS communication link was disconnected (and thus additional surveillance information is unavailable). Therefore, when the mission commander returns from the interruption, they must observe that (a) the convoy is approaching a potential threat region and (b) they cannot use JSTARS to obtain surveillance information about the unsurveilled area. Although the mission commander could chose to wait until the JSTARS communication link comes back online, the optimal decision would be to quickly reassign another UAV to the area, and to hold the convoy until the potential threat region is surveilled. In general, a complex decision requires the mission commander to choose an optimal strategy from a few that are acceptable.  The two main dependent variables were interruption recovery time and decision accuracy. Interruption recovery time refers to the time between a participant returning to the primary task after the interruption and he or she making the first decision (correct or incorrect) to address the post-interruption situation (described by Trafton et al. (2005) as resumption lag). Decision accuracy refers to the correctness of a decision made following an interruption. The following nominal score was assigned to the action taken after each interruption: 0 = No action taken 2   2 While in practice, no action taken may represent a “correct” decision following an interruption, in the study, an action was always required to address an emerging situation following all of the experimental interruptions. or incorrect decision; 1 = Correct decision.   PROCEDURE   Participants were first welcomed and asked to complete an informed consent form and a demographics questionnaire. Next, they completed a computer-based PowerPoint® tutorial that outlined the experimental tasks and explained the software interfaces. The participants then completed two practice sessions in the experimental task environment. In the first practice session, participants were asked to observe changes of a partial scenario. Important functionalities of the interfaces were explained and the participants were asked questions to check their comprehension. This session took approximately 15 min. The second practice session was a complete task scenario in which the participant had to perform the task without the experimenter's aid. In this session, the participant was interrupted once in order to complete the secondary task. The training module was customized (i.e., either included IRA or not) based on the condition assigned to the participant. A benchmark test was used to ensure a sufficient level of task competency had been reached, which included the number of targets found or the number of operator status updates requested. Total training took approximately 60 min.  The two test scenarios were counterbalanced and assigned randomly to participants. These scenarios included two interruptions each after which participants had to make either a simple (after the first interruption) or a complex (after the second interruption) decision. The test scenarios took 20–25 min each to complete with a 5-min break after the first trial. Another set of training (15 min) was provided between the two trials to prepare the participant for the changes in the experimental condition (assistance vs. no assistance). After the experiment, participants took part in a retrospective post-experiment interview to gather feedback about the interfaces and the task scenario. This involved the experimenter walking them through their post-interruption decisions while watching corresponding video replay of the experimental interfaces (interface capture was performed using Camtasia® real-time screen capture software during the study sessions). The study trials and interviews were videotaped for further analysis. The entire experiment lasted approximately 150 min per participant.   RESULTS AND DISCUSSION   To test the effect of the IRA tool on interruption recovery time, a 2 × 2 repeated measures analysis of variance (ANOVA) comparing assistance type and decision difficulty, blocking for military experience was conducted. The ANOVA results showed that participants were significantly faster in their interruption recovery when provided assistance (M = 9.77 s, SD = 4.65 s) than when no assistance was provided (M = 28.04 s, SD = 16.51 s), (F(1,22) = 64.43, p < 0.001). However, recovery times were not significantly different after simple (M = 10.17 s, SD = 4.49 s) or complex (M = 9.38 s, SD = 4.86 s) decisions (F(1,22) = 1.50, p = 0.234). No interaction effects were found (F(1,22) = 0.14, p = 0.709). On average, recovery times for non-military participants and military participants were comparable (non-military: M = 19.06 s, SD = 12.00 s; military: M = 18.75 s, SD = 15.62 s, Fig. 5 ).  With respect to decision accuracy, the effect of the IRA tool on simple and complex decisions was tested separately. McNemar's test with the continuity correction showed a significant difference between decision accuracy for simple decisions across assistance types (Chi squared = 4.167, p = 0.04) (Table 2 ). The same test also showed a significant difference between complex decisions accuracy across assistance types (Chi squared = 5.786, p = 0.016) (Table 3 ). The results show that the interruption recovery tool led to significantly improved decision accuracy for both decision types but was more effective for complex decisions.  A video analysis was performed on the post-experimental interviews and the observation notes were reviewed for important events. These analyses revealed further information about the utility of the interruption recovery tool and of participants' usage behavior. The analyses revealed that all 24 participants took advantage of the interruption recovery assistance when provided and that the majority of participants (19 of 24) used the highlighting feature. In general, after an interruption happened, participants faced a challenging situation (e.g., convoy under attack or about to enter an unsurveilled region) and, thus, participants had to make a quick decision to mitigate the risk to the convoy.  The interview analysis revealed that participants realized that the time it took to navigate the main displays for information might have dire consequences to the convoy's health and hence gathered temporal information from the IRA tool (e.g., to identify the location of destroyed UAVs or the history of convoy attacks, their duration and location). In addition, 12 participants reported using the IRA tool throughout the session, not just after the interruptions. Thus, the IRA tool appeared to also provide more general situation awareness support during normal mission operations.  Out of the four interactive event bookmarks, “convoy attacked” was used the most after the interruption to determine the attack locations on the situation map. The post-experimental interview revealed that the majority of participants found the convoy health information most valuable after the interruptions and hence other IRA features were given lower priority. This result suggests that perhaps mission-critical information (e.g., convoy attacked) should be made more salient than other types of situation awareness information. In addition, although a time-stamped history log of all the major events was included on the Mission Status Display, this feature was rarely used.  Unlike in the preliminary study (Scott et al., 2008), most participants in this study (19 of 24) found the interruption task sufficiently distracting. This may be due to several factors, including the fact that most participants found the interruption task stimulating and distracting from the main task; most participants (22 of 24) successfully completed all the assigned secondary tasks. Also, the interruption task was related to the primary task and represented a realistic task, since a mission commander in command and control may be expected to perform frequent map search activities. Finally, participants were told that their performance would be considered in their overall performance rating, which encouraged them to focus on the interruption task and stopped them from thinking about possible post-interruption situations in the primary task.  Participants in the preliminary study reported their reliance on memory of the situation before the interruption occurred as their main interruption recovery strategy. Increasing the length of interruptions from 1 min to 2 min appeared to help prevent participants from memorizing the situation. In practice, interruptions may be long and humans are susceptible to memory loss over time.  The IRA tool provides interactive event bookmarks of important events that allow them to assess the situation as quickly as possible and to make an informed decision after an interruption. Scenarios were designed so that when participants returned to the primary task after an interruption, they faced a challenging situation in which several important changes had occurred. Arguably, the task of locating and encoding the changes and assessing the situation (also known as SA re-acquisition (Gartenberg et al., 2011)) is cognitively taxing. IRA's simplified presentation of events placed a smaller premium on maintaining complex representations in working memory and acted as a contextual cue that facilitated memory retrieval and SA recovery. In addition, the iconic representation of events simplified the encoding of perceptual information (Kieras and Meyer, 1997), and therefore reduced the re-orientation time. Also, in line with the Guided Search Model (Wolfe, 1994), the interactive feature of IRA allowed the participants to minimize the visual search time by directing the participant attention to the events with the highest priority. Overall, the results of this study showed that providing concise visual summary of past events improves supervisory-level performance especially when making complex decisions under time pressure. Participants utilized this visual summary because it enabled them to quickly review the current mission status by narrowing the information options, which was critical under time pressure.   CONCLUSION   A user study was conducted to assess the effectiveness of interruption recovery assistance in mitigating the negative effects of interruptions for team supervisors in a dynamic, time-critical task environment. The study involved the evaluation of an interruption recovery assistance tool that provided an interactive event timeline that enabled discrete event highlighting directly on the main task displays. The study showed that this tool enabled team supervisors to better assess the situation, and to make timely and accurate decisions after an interruption. More specifically, the results showed significant decreases in interruption recovery times when mission commanders of a UAV team task were provided with the interruption recovery assistance tool. Although it was discussed that the simplified representation of important events facilitated the quick encoding of perceptual information and minimized the visual search, further investigation of different features of the IRA in isolation may shed more light on the value of the tool. The study also showed significant increases in the mission commander's decision accuracy for both simple and complex decisions when provided this recovery assistance.  This study is the third study examining the utility of this type of interruption recovery tool – providing an interactive event timeline and discrete event replay (Scott et al., 2006, 2008). A comparison across the three studies suggests that this type of interruption recovery assistance reduces recovery times more consistently when operators or supervisors are faced with complex decisions after an interruption rather than simple decisions. One possible reason for the limited effect recovery time in the simple decision case is that people may not feel as rushed or pressured to make a decision after an interruption because the decision is relatively straightforward. As a result, they possibly spend more time gathering all the information they could from the interface and act on their decision at the last minute.  Furthermore, results from this and the previous studies suggest that the placement of the interactive event timeline could be further integrated into the primary task displays. In this experiment, the interactive event timeline was located on the tablet display, which was on a different visual plane than the main task displays and, thus, may not be ideal. Participants had to look back and forth between the different displays in order to use the interruption recovery assistance. This takes time to visually orient to the new view and, as participants in Scott et al.'s (2008) study reported, was distracting and annoying. Using alternative designs that integrate the interruption recovery tool directly into the main task display, for instance into the Map Display used in this study, may address this issue and warrants further investigation.  Finally, determining how to track such historical event information from actual sensor data warrants further investigation. For example, ensuring that events such as target destruction and attacks on convoys are registered on such a decision support display and displayed in real-time may currently be beyond today's technology. However, event-logging tools such as the Tactical Ground Reporting System (Talbot, 2008) are currently deployed, and research is underway to turn them into real-time information dissemination tools.   ACKNOWLEDGMENTS   This work was funded in part by Boeing Corporation, Natural Science and Engineering Research Council (NSERC), and Ontario Graduate Scholarship (OGS).   REFERENCES", "highlights": "This paper investigates the effectiveness of providing interruption recovery assistance in the form of an interactive visual timeline of historical events on a peripheral display in support of team supervision in time-critical settings. As interruptions can have detrimental effects on task performance, particularly in time-critical work environments, there is growing interest in the design of tools to assist people in resuming their pre-interruption activity. A user study was conducted to evaluate the use of an interactive event timeline that provides assistance to human supervisors in time-critical settings. The study was conducted in an experimental platform that emulated a team of operators and a mission commander performing a time-critical unmanned aerial vehicle (UAV) mission. The study results showed that providing interruption assistance enabled people to recover from interruptions faster and more accurately. These results have implications for interface design that could be adopted in similar time-critical environments such as air-traffic control, process control, and first responders."}