{"id": "S000368701630059X", "article": "MAIN-TITLE Standing on a declining surface reduces transient prolonged standing induced low back pain development   HIGHLIGHTS          Assessed alternative standing posture to alleviate prolonged standing low back pain.      Participants stood on a declining surface and level ground for 75 min.      Pain reports of those with low back pain on level ground decreased 58% on decline.      Greater hip flexion, trunk center of gravity translated posteriorly on decline surface.      Declining surface could help stabilize pelvis, alter the lower lumbar arc, prevent pain.          KEYPHRASES   Occupational standing  Standing aid  Static  Lumbar spine  Posture  Movement   The increased use of sit-stand and standing workstations has produced products that help people tolerate longer bouts of standing to prevent potential lower limb and back pain commonly associated with standing (Waters and Dick, 2015). There is a large potential market audience for these devices, as greater than 40% of people who have never reported a low back injury report while standing (Gallagher et al., 2014; Marshall et al., 2011; Nelson-Wong and Callaghan, 2010c). The Canadian Center for Health and Occupational Safety (2008), the Occupational Safety and Health Association (2012), and the National Institute of Occupational Safety and Health (Cohen et al., 1997) all recommend some sort of standing aid, such as a platform to elevate ones foot or anti-fatigue matting, when prolonged or static standing is an occupational risk factor. Despite these recommendations it is unknown how, why, or if these aids are successful at reducing low back pain (LBP). A working hypothesis is that when a device alters lower limb position it also alters pelvis and lumbar spine posture. A relevant example of this from sitting – decreasing the trunk to thigh angle causes the pelvis to rotate posteriorly and the lumbar spine to flatten (Keegan, 1953). While more subtle, the same mechanism is also found when changing lower limb position while standing (Dolan et al., 1988). Studying the influence of standing aids on prolonged standing induced LBP provides insight into (1) the characteristics of successful interventions and (2) the fundamental difference between prolonged standing low back pain developers (PDs) and non-pain developers (non-PDs). Thus, the purpose of this study was to assess the acute and prolonged kinematic differences between PDs and non-PDs when utilizing an intervention shown to be successful at reducing LBP during standing – a sloped standing surface.  A sloped surface allows for workers to vary their posture by either placing their ankles in dorsi- or plantar flexion (Fig. 1 ). When using this aid during a 2-h occupational standing simulation, self-reports of LBP intensity were 59.4% less in those previously categorized as PDs when standing on level ground and the scores were similar to the non-PDs (Nelson-Wong and Callaghan, 2010b). The success of this aid was linked back to the kinematic changes induced by plantar and dorsiflexion of the ankles. Standing on a decline resulted in greater trunk flexion with respect to the vertical, posterior rotation of the pelvis (Nelson-Wong and Callaghan, 2010b), and flattening of the lumbar spine (Gallagher et al., 2013). Standing on an incline surface resulted in the opposite changes, with greater trunk extension with respect to the vertical, anterior rotation of the pelvis (Nelson-Wong and Callaghan, 2010b), and greater lumbar lordosis angle (Gallagher et al., 2013) compared to level ground standing.  A limitation to the study by Nelson-Wong and Callaghan (2010b) was that participants could move freely between standing on the decline and incline. Participants spent 72% of their time standing on the decline, meaning that most of the time was spent with a less lumbar lordosis compared to level ground standing. The ability to cycle between the two postures makes it difficult to parse out the influence of standing in a modified posture and the influence of the surface on lumbar spine posture induced by moving between decline and incline have on reducing LBP while standing. Gallagher et al. (2013) only looked at the postures during incline and decline standing, but did not assess pain development. Determining whether posture and/or movement are important factors for reducing LBP will help to further design aids and also point to a potential fundamental difference between how PDs and non-PDs stand.  The purpose of this study was to evaluate the effectiveness of standing with the ankles continuously in plantar-flexion (referred to as standing on a decline or sloped surface) on the development of prolonged standing-induced LBP, as well as kinematics and movement variables. We hypothesized that the decreased lumbar lordosis angle induced by standing on a decline would help reduce or prevent LBP as compared to level ground. Secondly, we hypothesized that standing on a decline would induce postural changes of the hip angle, thigh-to-trunk angle, and location of the trunk center of gravity with respect to the ankle location. Lastly, we hypothesized that lumbar spine movement patterns would differ between the two groups. To evaluate these hypotheses, we used self-reports of LBP and a motion capture system to compare pain development and kinematics between standing on level ground and a sloped surface over a 75 min occupational simulation.   METHODS   Seventeen participants (nine male, eight female) aged 18–35 were recruited to participate in this study (Table 1 ). Participants could not have had any previous lifetime history of LBP that required medical intervention or time off work longer than three days, previous lumbar or hip surgery, employment in a job requiring prolonged static standing during the past 12 months, and the inability to stand for at least two hours. The University of Waterloo Research Ethics Committee approved this study and all participants provided written informed consent prior to starting the study.  An Optotrak Certus motion capture system (NDI Inc., Waterloo, ON, sampling at 32 Hz for the duration of the 75 min occupational simulations) was used to track movement of the infrared markers during data collection (Fig. 2 ). Three rigid bodies were used to track movement of the spine – one at T9 (thoracic spine), L1/L2 (upper lumbar spine), and the sacrum. Movement of the feet and thighs were also tracked bilaterally with rigid bodies. Anatomical landmarks were captured while the participant stood in a neutral posture and a digitizing probe with a rigid body containing four markers and a known location of a point at the end of the probe was placed on the anatomical landmark of interest. The location of the tip was captured in the global system and transformed into the rigid body used for tracking the corresponding segment.  A 100 mm visual analogue scale was presented on a touch screen tablet (iPad 2, Apple Inc., Cupertino, CA) to assess LBP development. A horizontal line was anchored at the left with “No Pain” and the right with “Worst Pain Imaginable” and participants moved an indicator on a sliding scale to mark their CURRENT level of pain. This has been previously used to identify PDs during prolonged standing (Gallagher et al., 2014; Marshall et al., 2011; Nelson-Wong and Callaghan, 2010c). Participants provided scores for their low back and bilateral gluteal and lower limbs regions. Participants filled out visual analogue scales when they entered the lab, immediately after instrumentation was complete, and during the standing protocol every 7.5 min.  Two standing conditions were tested in this study – level ground and sloped. During level ground standing, participants stood as they normally would on a flat surface. For the sloped surface, participants stood on a declining 16-degree angled wooden slope covered with a high friction surface. This sloped angle has been used in previous work (Gallagher et al., 2013; Nelson-Wong and Callaghan, 2010b); however, the one used in this study did not curve off to the side, eliminating mild foot supination that was allowed in the two previous studies. For both conditions participants were told to: “Stand as you normally would if you were required to work at a computer workstation. You can lift up each foot, change your foot position, and shift your weight back and forth. The two things you cannot do are support your body weight on the table and cross your feet”. If the participant supported their body weight on the table or crossed their feet, the experimenter prompted them to return to their standard position.  Participants worked at a computer performing a standardized typing task. The custom computer program had a window with a paragraph of text that the participant duplicated by typing it into a second window below the source document. The table and monitor heights were separately adjusted for both standing conditions. Participants stood in front of a table adjusted to 5–6 cm below their wrist when their elbows were placed at 90°, which is the position recommended for light work (Kroemer and Grandjean, 1997). The distance of the table from the participant was initially set up to be a fist width away from their trunk at the level of their abdomen. This allowed for control of the initial standing location with respect to the table between the two testing days.  Participants came into the lab on two occasions separated by at least 48 h. The order that the participants experienced the conditions was randomized. Half the participants performed the level ground standing condition on Day 1, while the other half performed the sloped standing condition first. Participants filled out a baseline visual analogue scale score after completing informed consent and proceeded through the instrumentation process. A five second trial with the participant standing in anatomical position was recorded to characterize the motion capture set up, followed by a maximum active lumbar spine extension trial used as a reference joint angle. For the maximum extension trial, the participant was told to keep their knees locked and bend backwards about their lumbar spine without shifting their hips forward.  On the day that the participant stood on the sloped surface, two 60 s foot constrained standing trials were taken before starting the prolonged standing trial – one on level ground and one on the sloped surface. These standing trials assisted with comparing the acute postural changes between level ground and sloped standing. Stance width was standardized for these two standing conditions to control for foot position by creating an outline of a square box using masking tape with dimensions equal to the participant's foot length. The participant assumed a comfortable foot position within the box with the lateral border of the small toe positioned at the side of the box (Carpenter et al., 2001) and was told to, “Stand as still as possible with your arms by your side and weight evenly distributed between your feet” (Zok et al., 2008).  Once the pre-trials were taken, participants entered the 75 min prolonged unconstrained standing trial. They took a visual analogue scale score at the start of the trial and then every 7.5 min.  Visual analogue scales were reported for each participant at thirteen time points – one immediately when they entered the lab, one before entering the prolonged standing task, and 11 (one every 7.5 min) during the standing protocol. To assess the relative increase in visual analogue scale score attributed to the prolonged standing task, visual analogue scale scores upon entering the lab were subtracted from all visual analogue scale scores that followed. As a result, all participants began with an initial score of 0 mm.  Participants were categorized as PDs based on their low back visual analogue scale scores reported during the level ground standing condition. As done previously in studies on prolonged standing a threshold of 10 mm with respect to baseline was used to categorize participants as PDs (Gallagher et al., 2014; Marshall et al., 2011; Nelson-Wong and Callaghan, 2010c). Hagg et al. (2003) found that when using a visual analogue scale to track worsening of LBP, the clinical important difference for patients to feel their LBP symptoms worsening was 8 mm. As a result, 10 mm is a conservative threshold to use for categorizing participants as PDs or non-PDs.  Marker locations (Fig. 2) were imported into Visual3D (Version 4, C-Motion, Inc. Germantown, MD, USA) for post-processing. Segment locations were defined using the five-second standing trial taken at the beginning of the experiment. If marker interpolation was required, a third order polynomial was used to fill gaps of a maximum 16 frames (0.5 s) (Howarth and Callaghan, 2010). Once interpolated, the signal was low pass filtered (Butterworth, 2nd order, dual pass) with an effective cut-off frequency of 4 Hz, as determined using a residual analysis. The orientation of each local coordinate system was defined with +y pointing proximally, +x pointing anteriorly, and +z pointing laterally to the right. Joint angles were calculated using a flexion/extension-lateral bend/axial twist rotation sequence, with flexion-extension rotations occurring around the z-axis. All angles were expressed as the rotation (in degrees) from the maximum lumbar extension trial. Angles measured were trunk (trunk with respect to pelvis), lumbar spine (lumbar spine with respect to pelvis), hip angle (thigh with respect to pelvis), and trunk-to-thigh (thigh with respect to trunk). The anterior posterior distance between the location of the trunk center of gravity and the joint center of the right ankle was also calculated. The trunk center of gravity was calculated in Visual3D. This program estimates the geometry of the trunk segment with a cone with the distal and proximal radius defined as one half the distance between the bilateral acromion and iliac crest markers, respectively. The depth was calculated by measuring the person's trunk depth at the level of the xiphoid process.  For the constrained standing trials, the mean angle and distance measurements were taken for each 60-s trial. For the prolonged standing trials, an amplitude probability distribution function (APDF) was used to extract the median posture/location (50th percentile) and range of movement (90th–10th percentiles) for each variable, broken into five 15-min time blocks. Lumbar spine fidgets, shown previously to differ between PDs and non-PDs (Gallagher and Callaghan, 2015), were quantified and defined as a fast, large displacement and return of the lumbar spine angle to approximately the same starting position based on a previous algorithm (Duarte and Zatsiorsky, 1999). The parameters for the fidgets were the same as used previously (Dunk and Callaghan, 2010; Gallagher and Callaghan, 2015) – a change in threshold of ± 3SD, window length of 60 s, and maximum duration of 4 s. Fidgets were calculated for the sagittal plane only.  For constrained standing, outcome measures (Table 2 ) were entered into a two-way general linear model with a between factor of pain group (PDs/non-PDs) and within factor of standing condition (level/sloped).  For prolonged standing, outcome measures (three dimensional lumbar spine fidget and shift frequency and measures from Table 2) were entered into a three way general linear model with a between factor of pain group and within factors of standing condition and time. When data did not meet the sphericity assumption (not immediately passed due to the time factor containing five levels), Huynh-Feldt-Lecourre Epsilon corrections were used and the p-value was adjusted accordingly. For any significant main effects, Tukey post-hoc tests using the least square means were used. For any significant interactions, simple effects were used to assess differences. The alpha level of significance was set at alpha < 0.05 for all tests.   RESULTS   Fifty-three percent of participants (9/17) were categorized as PDs during the level ground trial. Of the nine, four were males and five females. There was a distinct separation of the visual analogue scale scores during the level ground session, with PDs demonstrating an increase in pain scores over the 75 min (Fig. 3 ). The average maximum score (Fig. 4 ) for the PDs during the control session was 16.2 (5.3) mm and 2.3 (3.4) mm for non-PDs. All participants entered the lab with baseline VAS scores of 0 mm.  When standing on the sloped surface, the average maximum pain scores for PDs was 58% less compared to their reports during level round standing (16.2 (5.3) mm for level ground versus 6.8 (5.8) mm for sloped). Of the nine participants categorized as PDs during the level ground condition, only three of nine were still categorized as PDs during sloped standing. One PD reported a higher visual analogue scale on the sloped surface, with a maximum of 18 mm versus a level ground maximum of 10 mm. The other two participants reported scores that were 6 mm and 13 mm less to bring their maximum sloped standing visual analogue scale scores to 10 and 11 mm, respectively.  There were no changes in the visual analogue scale scores of the calf regions between level ground (8.6 mm ± 10.3 mm) and the sloped surface conditions (8.1 mm ± 9.8 mm) and only five of the 17 participants saw greater visual analogue scale scores in their calf region during sloped standing. There was an increase of 6 mm in the reported visual analogue scale scores for the foot region, with scores being higher on the sloped surface (16.0 mm ± 14.3 mm) than on level ground (10.0 mm ± 11.3 mm) and 11 of 17 participants saw an increase in their visual analogue scale scores over time for this region.  There were no main effects or interactions containing pain group for all kinematic variables (Table 2). All participants stood approximately 15 ( ±9) degrees away from maximum lumbar spine extension. The closest variable to demonstrate a main effect of pain group was trunk angle (p = 0.1037). PDs demonstrated a trunk angle that was 4° further away from the maximum trunk extension angle than non-PDs.  The sloped surface induced hip flexion (p = 0.0347), trunk-to-thigh flexion (p = 0.0114), and moved the location of the trunk center of gravity posteriorly (p < 0.0001) by 1.9 cm (level = 4.4 ± 1.94 cm versus; sloped = 2.5 ± 1.72 cm).  For all participants, the lumbar spine was 2–3° less lordotic than during the sloped condition (Fig. 5 ); however, the standard deviation was large in comparison (10–12°) and thus the difference was not significant. There was a main effect of time (p < 0.0001) such that there was a steady increase in lumbar spine flexion over the standing trials, but this was only by two degrees after 75 min.  Non-PD performed more lumbar spine fidgets in the sagittal plane than PDs (p = 0.0412), independent of the standing condition (Fig. 6 ). Non-PDs performed approximately 13 fidgets ( ±6.7) per 15 min during the level ground condition compared to 9 ( ±6.8) by the PDs. There was also a trend towards an interaction between standing condition and time (p = 0.0598). During both conditions, participants performed approximately 14 fidgets during the first 15 min. After this period, fidget frequency remained constant for the sloped surface, but decreased to approximately 10 per 15 min during the level condition and remained there for the rest of the trial.  There was an interaction between pain group and standing condition (p = 0.0217) for the median location of the trunk center of gravity location with respect to the right ankle (Fig. 7 , top row). During the level ground condition, the location of the trunk center of gravity in PDs was on average 3.1 ( ±1.5) cm in front of the right ankle, whereas it was 1.4 ( ±1.8) cm for the non-PDs. During the sloped condition, the locations became similar between the two pain groups, with the trunk center of gravity moving posteriorly and vertically aligned with the right ankle joint (non-PDs = 0.75 ± 1.3 cm; PDs = 0.83 ± 1.3 cm).  Movement of the trunk center of gravity with respect to the ankle joint varied between pain groups and over time (Fig. 7, bottom row). There was a significant main effect of time (p = 0.0002), and a trend towards an interaction between time and pain group (p = 0.0797). Non-PDs moved the location of their trunk center of gravity with respect to the right ankle about 3–4 cm over the standing trials; however, PDs steadily increased their movement from 3 to 5 cm to almost 9 cm by the by the end of the standing trial.   DISCUSSION   Standing on a sloped surface with the ankles in plantar-flexion resulted in lower self-reported reports of LBP development in those who developed LBP during prolonged standing on level ground. While it was hypothesized that the main postural change between the two conditions would be altered lumbar spine angle, this was not the case. The sloped surface had a greater effect on the hips, demonstrating greater flexion of the hip joints and the trunk-thigh angles, and posterior translation of the trunk center of gravity moving to become vertically aligned over the ankle joint. While non-PDs demonstrated more lumbar spine fidgets during level ground standing, lumbar spine fidgets were unchanged when standing on the sloped surface compared to level ground standing.  While previous work on a similar sloped surface found a less lordotic lumbar spine and trunk flexion induced by standing on a decline (Gallagher et al., 2013; Nelson-Wong and Callaghan, 2010b), this study did not show similar results. An external measurement of lumbar spine angle has shown that PD stand with a more lordotic lumbar spine than non-PD (Sorensen et al., 2015); however, an internal measurement of lumbar spine angle using x-rays found that there was no difference in lumbar spine angle when standing on level ground versus a decline (Gallagher et al., 2014). It seems that it is not solely altering lumbar spine angle, but rather postural alterations facilitated through hip and thigh postural changes, that are important for this standing intervention's success. A second study using radiographs found that the majority of the differences in lumbar spine angle of a sample population are found in the lower arc of the lumbar spine (Roussouly et al., 2005). This means that the pelvis and lower limbs must be evaluated together with the lumbar spine instead of just concentrating on the lumbar spine. An in vivo study of natural spine angles also found that the upper and lower lumbar lordosis move independently of each other, pointing to the importance of pelvis and lower limb position (Mitchell et al., 2008).  The location of the trunk center of gravity with respect to the ankle joint during prolonged standing was the only variable that showed an interaction between pain group and standing condition. The trunk center of gravity was more posterior in non-PDs than PDs in level ground standing. During sloped standing, the trunk center of gravity moved posteriorly for all participants compared to level ground standing and was in line with the ankle joint. The difference during level ground standing would mean a greater moment arm with respect to the ankle for the force of the trunk due to gravity in PD. This larger COG moment arm increases the flexor moment and subsequently requires the erector spinae muscles to produce a greater force to counteract this moment. This could result in increased compression and shear on the spine, which cumulatively could lead to pain and discomfort in the lumbar region.  Declined surface sloped standing appears to prompt participants to perform a hip dominant correction. Flexing at the hips and moving the trunk and pelvis as a unit prevents altering the moment induced by the trunk center of gravity at the L5/S1 joint. Flexion of the hips allows for a greater passive force contribution of posterior muscles that cross the hip joint since they are stretched to the right or up the increasing slope on their force-length curves, which increases the contribution of the passive properties to force production. This change could be why we see lower gluteus medius co-contraction, when using this standing aid (Nelson-Wong and Callaghan, 2010b), since the higher passive contribution from the posterior hip muscles can assist in stabilizing the hip joint. While there were no obvious changes in pelvis angle, a slight posterior rotation of the pelvis induced by the sloped surface may also explain the larger L5/S1 anterior-posterior shear previously noted (Nelson-Wong and Callaghan, 2010b).  This study looked at the influence of an engineering intervention on altering standing posture; however, such interventions are not appropriate in all environments (such as a security guard) or in areas where these devices could cause tripping hazards. As a result, future studies should investigate how altering foot position, such as a staggered stance (Fewster et al., 2015; Winter et al., 1996), which will alter hip posture influences LBP development. Second, a successful exercise program for reducing prolonged standing induced LBP development(Nelson-Wong and Callaghan, 2010a) could also influence hip and lumbar spine kinematics and should be investigated in more detail.  While a relationship between less sagittal fidgeting of the lumbar spine and pain development during standing has been shown previously (Gallagher et al., 2014), the sloped surface did not induce altered movement patterns. The relationship between movement and pain development is complex. In this study, we found that non-PDs had more lumbar spine flexion-extension fidgets over the 75-min trial compared to PDs, independent of the standing surface. In a similar study with a 120-min duration, non-PDs only showed this increase during the first 15-min of standing(Gallagher and Callaghan, 2015). In sitting, it is opposite. Those who did not develop LBP while sitting had a more static sitting strategy compared to those who developed low back pain.(Dunk and Callaghan, 2010), citing that the increased movement is a good indicator that a person is already in discomfort (Vergara and Page, 2002). In our study, the decreased lumbar spine fidgets in PDs, which leads to a more constant level of compression and shear, combined with the increased COG moment arm of PDs mean that creep in the posterior tissues of the lumbar spine may occur, initiating a pain pathway that leads to their LBP.  A limitation to this study was that the prolonged standing kinematics were measured over two days for the two occupational standing simulation trails. The order of the conditions was randomized to prevent any learning effects . The strength of this experimental design was that it removed any fatigue or accumulated pain that would occur if both conditions were tested within one day. Second, we did not study intermittent use of the sloped surface, which is more likely to occur due to potential lower limb discomfort that could be caused by the postural changes, as is seen when placing one foot on an elevated surface (Whistance et al., 1995). While the purpose of the study was to alter posture without also inducing cyclic lumbar spine movement, future work should assess the relationship between cyclic postures and prolonged standing induced LBP. Lastly, we have no comparison of what would occur if a person stood on the inclined surface for 75-min. This is an extremely hard position for people to maintain to allow for a comparable study.  When assessing the impact of an intervention over two separate days, the repeatability of pain group classification using the visual analogue scale scores must be discussed. In a previous study where participants performed two 2-h prolonged standing trials separated by four weeks, 83% of the participants remained in their same pain group (Nelson-Wong and Callaghan, 2010d). In this study, all non-PDs remained non-PDs in the sloped standing condition. Only one PD had higher pain scores during the sloped condition and two remained PDs but saw scores that were lower by 10 and 11 mm. Thus, 89% (8 of 9) PDs reported lower pain scores during the sloped standing, thus we can say that the improvement was due to the sloped surface and not participants being improperly classified during the level ground condition.   CONCLUSIONS   Standing on a declining slope surface resulted in a lower of self-reported LBP reports during prolonged standing in those who develop LBP when standing on level ground. Compared to standing on level ground, the sloped surface resulted in larger hip flexion, trunk-to-thigh flexion, and smaller moment arm of the trunk center of gravity with respect to the ankle joint. This change in hip posture could result in higher passive stiffness produced by the muscles crossing posterior aspect of the hip joint to assist with stabilizing the pelvis without the use of the gluteus medius co-contraction. It appears that postural alterations facilitated through the hip joint postural changes are important for a declined standing surface intervention's success.   ACKNOWLEDGEMENTS   During her doctoral work, the Natural Science and Engineering Research Council (CGSD 392190-2010) and Ontario Graduate Scholarship supported KMG. A Tier I Canada Research Chair supports JPC.   REFERENCES", "highlights": "While alternating standing position on a sloped surface has proven successful at reducing low back pain during standing, the purpose of this study was to evaluate standing solely on a declining surface to isolate the influence of the postural change. Seventeen participants performed two 75-min prolonged standing occupational simulations– level ground and declining surface. Fifty-three percent of participants (9/17) were categorized as pain developers during the level ground standing condition. For these same pain developers, their average maximum pain scores were 58% lower during sloped standing. All participants showed greater hip flexion, trunk-to-thigh angle flexion, and posterior translation of the trunk center of gravity when standing on the sloped surface. These postural changes could cause the muscles crossing the hip posteriorly to increase passive stiffness and assist with stabilizing the pelvis. This study stresses the importance of hip kinematics, not just lumbar spine posture, in reducing prolonged standing induced low back pain."}