{"id": "S000368701400266X", "article": "MAIN-TITLE The effect of hair density on the coupling between the tactor and the skin of the human head   HIGHLIGHTS          Obtained vibration detection thresholds for seven locations on the head.      Obtained vibration detection thresholds for those with and without hair.      Hair density slightly impedes vibration signals from reaching the scalp.      Those without hair are most sensitive to vibration at the back/sides of the head.      Those with hair are also most sensitive to vibration at the back/sides of the head.          KEYPHRASES   Tactile sensitivity  Head tactile display  Vibrotactile detection on scalp   When the quantity of information transmitted through one sensory modality increases, the information channel may become overloaded and the person will likely become incapable of processing future incoming information via that mode. As a result, situation awareness and overall user performance will decrease. In such a situation, tapping into and making use of the different perceptual resources of other modalities will lessen the chance of decrements in user performance, and reduce the chance of any one sensory mode becoming overloaded with information (Wickens, 2002). Oviatt (1999) provided an excellent description of the system effectiveness that can be obtained via the simultaneous transmission of information via several sensory modalities: “well-designed multimodal systems integrate complementary modalities to yield a highly synergistic blend in which the strengths of each mode are capitalized upon and used to overcome weaknesses in the other” (p. 74). Thus, save for the visual and auditory modalities, the skin has also been emphasized as an input modality that can be beneficial for the transmission of information, especially in adverse environments (de Vries, Van Erp and Kiefer, 2009; Elliott et al., 2010; Ferris and Sarter, 2009; Jones et al., 2006; Jones and Sarter, 2008; Oskarsson et al., 2012; Piateski and Jones, 2005; Raj et al., 2000; Van Erp, 2001; Verillo, 1966). One example of using the skin to communicate is the tactor-based Tactile Situation Awareness System (TSAS), which was developed to help military pilots mitigate accidents attributed to spatial disorientation. Spatial disorientation occurs when a pilot is unaware of his orientation in space and cannot interpret if the aircraft is heading up or down. The TSAS was introduced as an alternative (to a visual or auditory system), torso-based, tactile solution designed to help pilots overcome spatial disorientation (Rupert, 2000). Through a series of test flights, pilots were able to successfully perform basic maneuvers through the sole use of tactile cues via the TSAS with no visual cues available (Rupert, 1997, 2000). As Oviatt (1999) declared, the TSAS's strength compensated for the perceptual and situation awareness shortfalls experienced by pilots using aircraft visual displays, which according to Rupert (2000) were sometimes a result of the physiological and cognitive changes that occur during flight.  Tactile systems have also improved the quality of care in the operating room and aim to increase the safety of occupants in automobiles. Researchers developed a waist-mounted tactile display and analyzed its capability in helping anesthesiologists to reduce their response times in treating simulated incidences of anaphylaxis (Ford et al., 2008). Diagnosis and treatment response times for anesthesiologists using the waist-mounted display were significantly lower than for anesthesiologists who used standard methodology to diagnose and treat anaphylaxis. A tactile (via seat vibrations) crash avoidance system has been reported as being better in alerting drivers to the location of a potential crash threat than an auditory-only crash avoidance system (Fitch et al., 2007). Scott and Gray (2008) explored the benefit of using tactile signals to warn drivers of a pending rear-end collision compared with visual and auditory warnings, and reported that tactile signals were most effective in warning of a potential rear-end collision. Mohebbi et al. (2009) extended the work of Scott and Gray (2008) to cell phone use while driving, and also found that a tactile rear-end collision warning system was more effective for drivers engaged in cell phone conversations than visual and auditory rear-end collision warning systems.  Most of what is known regarding the tactile modality is based on the research of tactile stimulation of the fingers and hands (Bolanowski et al., 1988; Morioka et al., 2008; Rabinowitz et al., 1987; Stuart et al., 2003; Verrillo, 1962; Wilska, 1954), and on the results of the applied studies in which the tactors were placed on the torso, abdomen, or arm (Bodenhamer et al., 2012; Cholewiak et al., 2004; Cholewiak and Collins, 2003; Morioka et al., 2008; Ooshima et al., 2008; Piateski and Jones, 2005; van Erp, 2005). For example, the potential for limited soldier-to-soldier communication due to degraded visual conditions on the battlefield prompted the design of a torso-based tactile communication system for conveying Army hand-arm signals (Brill et al., 2006). Eriksson et al. (2008) designed a 12-tactor torso belt to test its capability to substitute for a standard visual GPS display for soldier land navigation. Similar to the objective of Eriksson et al. (2008), Dorneich et al. (2006) designed an eight-tactor, torso belt. In the last decade, a good amount of research, knowledge, and work has been expended on improving tactile devices for torso and arm applications (e.g., Brill et al., 2006; Dorneich et al., 2006; Enriquez et al., 2001; Ford et al., 2008; Rupert, 2000; Van Erp, Van Veen, Jansen and Dobbins, 2005) in the hope of alleviating high mental workload often associated with the concurrent use of systems that rely on the same sensory modality (Wickens, 2002).  As a result of the exclusive placement of tactors on the torso to facilitate tactile communication, there is a large gap in knowledge (e.g., tactile sensitivity, detection thresholds, localization accuracy) regarding guidelines for the use of tactile devices anywhere other than on the torso, most notably on the human head. Therefore, significant research is needed to identify psychophysical measures and guidelines to build effective tactile devices for stimulation of the human head, such as those studied by the U.S. Army Research Laboratory (ARL) for use by the U.S. Army infantry soldier. For head-mounted tactile displays, tactors are placed on the head and low frequency pulsing tactile signals are used to convey directional cues for navigation or to alert soldiers to critical events in the environment (e.g., direction of sniper fire). Although the head has been currently accepted by a few researchers as a viable location for placing tactile devices (Bikah et al., 2008; Gilliland and Schlegel, 1994), this is still a fairly uncharted body location for providing information via tactile signals.  While a host of tactile sensitivity information exists for other parts of the body, the same information is lacking for the region of the head. Objective tactile sensitivity data for the head are scarce but are needed to ensure that tactile systems designed for the head are compatible with the sensitivity of the user. The most comprehensive data for tactile sensitivity of the head are provided by the early work of Weber (1834/1978), Weinstein (1968), and Wilska (1954), with almost no follow-up studies within 40 years. Weber (1834/1978) observed that the entire head/scalp is not equally sensitive, and that the crown of the head is less sensitive than the skin near the forehead, temples, and lower part of the back of the head. Weinstein (1968) reported that the face (forehead included) was most sensitive to pressure and for point localizing when a point of reference was used. Wilska (1954) revealed that displacement thresholds for the head were higher than 70% of all the other body locations tested, with thresholds for the head ranging from 4 μm at 200 Hz to 19 μm at 50 Hz. Following this early repertoire of research, Gilliland and Schlegel (1994) are the only contemporaries to report human perceptual measures associated with the detection and localization of tactile signals applied to the head. They reported a detection threshold of 17.5 V (130 g force) for the parietal region of the head. Similar to the findings of localization for the torso (Cholewiak et al., 2004), Gilliland and Schlegel (1994) found that localization accuracy on the head increases as the number of localization sites decreases. In an attempt to mount a tactile system on the head as an alert mechanism to warn users of the presence of radiation in the environment, Bikah et al. (2008) evaluated a number of body locations to use for such a tactile system and reported low frequency (.68–.80 Hz) vibration thresholds for various regions of the head. More of this type of objective tactile information is needed to design, implement, and advance tactile devices for the head.  More recently, Myles and Kalb (2009, 2010) have obtained tactile detection thresholds for the head perimeter and the scalp, and confirmed the findings of Weber (1834/1978), but only for those with little to no hair. They also reported tactile detection thresholds for all regions of the head extending the work of Gilliland and Schlegel (1994). Aligned with the research motives of Gilliland and Schlegel (1994), this study obtained data to improve a head tactile display—specifically, a display to convey directional cues for navigation or to alert soldiers to critical events in the environment. The current study extends Myles and Kalb (2009) and is aimed at determining the effect of hair density on detection thresholds associated with the perception of low frequency vibration stimuli applied to the head. In addition, this study extends the use of head tactile technology to women and men with dense hair by ensuring tactile signals are appropriately amplified for the user population with hair.   METHOD   Seven C2 tactors from Engineering Acoustics Inc. were mounted in a headband designed to hold one tactor at each of seven chosen head locations (Fig. 1 ). The locations were selected from the set of locations used in the international electroencephalography (EEG) 10-20 system of electrode placement (Jasper, 1958) and are shown in Fig. 1. Head locations were randomly chosen such that when combined, a representative from each head region was included: F3 and F8 (frontal region), CZ (central region), PZ (parietal region), T3 and T4 (temporal region), and O2 (occipital region). To accommodate the differences in the head size among the participants, three headbands of size small (50–54 cm), medium (54–58 cm), and large (58–62 cm) were used in the study. Tactor placement at each head location was fixed for each headband.  The computer-generated vibration signal consisted of three pulses of 32, 45, or 63 Hz tone shown in Fig. 2 consisting of three parts—rise, sustain, and fall—each having the same durations. Rise and fall both followed a raised cosine response, while the sustained level was equal to 1.5 V. The signal produced at the output of the computer was sent to an external circuit board for power level adjustment and multiplexing to the seven tactor locations. This function was provided by the onboard microprocessor that was controlled by the computer over a USB connection.  Direct voltage observations of the signal fed to the tactors were not practical due to the differential switching nature of the class D output amplifiers located on the external board. Instead, an indirect measurement (based on the known vibration thresholds for the fingertip; Lamoŕe and Keemink, 1988) was used to determine the required signal voltage needed to adequately displace the tactor to produce a vibration stimulus on the head (Kalb et al., 2008). Because mechanical load impedance measurements for the forehead and fingertip show substantial agreement (Diller et al., 2001), it was assumed that the tactor operated the same on the forehead and fingertip.  Thirty-three college students (13 males and 20 females) were recruited for the study via flyers posted on campus and were paid $20 for completion of the study. The age range of participants was 18–35 years (M = 23.06, SD = 4.04). All ethnicities were represented in the sample, and participants were screened to ensure that adequate contact between the tactors and the participants' heads could be obtained (e.g., certain hair styles would preclude good contact). The study was approved by the U.S. Army Research Laboratory Institutional Review Board.  Hair density was defined in this study as that level of isolation produced by hair in preventing direct tactor contact with the scalp and vibration stimulation on the scalp. Participants were assigned to one of three hair density levels (low, medium, high) using a nonintrusive, visual observation technique. Participants with a bald head, a very low hair cut, or hair that could not be parted using a comb were immediately assigned to the low hair density level. Participants who did not meet the low hair density criteria were assigned to the medium or high hair density level based on a hair density photographic scale (Lacharriere et al., 2001) (Fig. 3 ). The hair density scale is a clinical macroscopic scoring system used to evaluate hair loss and hair growth.  Using a technique similar to Lacharriere et al. (2001) to assess hair density, the participants' hair was parted down the center, and a handheld digital microscope at 20× magnification was used to capture photographs of the scalp. Photographs of the scalp were compared to the hair density photographic scale to assign the participants a hair density level of medium (scores 3–4) or high (scores 5–6). Hair density scale scores 1–2 were not used in this study. Photographs depicting examples of hair density level are in Fig. 4 .  A 3 × 7 × 3 mixed design was used to evaluate the effects of hair density (low, medium, high), head location (CZ, T3, T4, PZ, F3, F8, O2), and signal frequency (32, 45, 63 Hz) on vibration detection thresholds. Low signal frequencies were chosen to reduce the possibility that the vibration from the signals would be audible via either bone or air conduction. Hair density was a between-subjects variable, and head location and signal frequency, were within-subjects variables. The presentation order of head location was randomized and all trials for a head location were completed before moving to the next head location in the sequence. In addition, the presentation order of frequency was randomized within blocks of head location. Vibration detection threshold was recorded as the skin displacement level required for the perception of a vibration stimulus. An ANOVA was used to compare the differences in detection threshold due to hair density, head location, and frequency, using α = .05. A least significant difference post hoc test was used to evaluate factor level mean differences.   PROCEDURE   Each participant was screened to ensure that the tactors could be placed flush against the scalp because certain hairstyles might have prevented proper contact with the scalp. The screening process consisted of placing the headband (containing tactors) on each participant's head and visually examining the position of the tactors. Upon passing the screening, participants were assigned to one of three hair density levels using the hair density classification method. Replacing the headband, participants were seated and the contact force that the headband exerted in keeping the tactors in contact with the head was measured using a Shimpo digital force gauge that indicated the tangential force necessary to overcome static friction for the tactor fixed at the O2 head location (M = .70 N, SD = .11 N, range = .41 N–.87 N). Similar contact forces were assumed for all other head locations.  Vibration signals were presented to the head, one at a time, via the seven tactors. Prior to testing each head location, participants were manually cued regarding which head location was next in sequence. The Zippy Estimation by Sequential Testing (ZEST) psychophysical adaptive procedure was used (King-Smith et al., 1994; Watson and Pelli, 1983) to determine vibration threshold (i.e., the smallest skin displacement level at which an observer could feel vibration). For each signal, participants indicated if they did or did not feel a vibration sensation by using a mouse to click a “YES” or “NO” button on a computer monitor. The signals were presented periodically every 5 s. Each of the 21 conditions (7 head locations x 3 signal frequencies) was presented 10 times for a total of 210 vibration signals transmitted to the head of each participant. The last response for each condition was recorded as the vibration threshold for that condition. Prior to each participant starting the experiment, each tactor was checked by presenting a signal to the tactor, which also served as practice to familiarize the participants with the signals and procedures.   RESULTS   Mean vibration detection thresholds for hair density, head location, and signal frequency are shown in Fig. 5 . The main effect of hair density was significant, F(2, 30) = 8.12, p < .01, η 2 = .35. Post hoc comparisons revealed that vibration detection thresholds were lower for those with no hair (i.e., low hair density) than for those with hair (i.e., medium and high hair density), p < .05 and p < .001, respectively. There were no significant differences in vibration thresholds for those with medium and high hair density, p = .25. A significant main effect was also found for head location, F(6, 180) = 20.45, p < .001, η 2 = .33. Post hoc comparisons with Bonferroni adjustment revealed that vibration detection thresholds measured at CZ were significantly higher than thresholds measured at head locations F3, F8, T3, O2, and T4. Thresholds measured at PZ were significantly higher than thresholds measured at head locations T3, O2 and T4. In addition, thresholds measured at head locations F3 and F8 were significantly higher than thresholds measured at head locations O2 and T4. Therefore, the head locations least sensitive to vibration were located at the top (CZ), backward middle (PZ) and front (F3 and F8) portions of the head, and the locations most sensitive to vibration were located at the sides (T3 and T4) and back (O2) of the head (Fig. 1). Of more importance, a significant head location x hair density, F(12, 180) = 2.15, p < .05, η 2 = .07, interaction effect (Fig. 6 ) revealed that, in general, those with hair had a more difficult time detecting vibration signals on the head. However, that difficulty significantly increased for the least sensitive areas of the head, CZ (thresholds lower for low density than medium or high density, p < .05), PZ (thresholds lower for low density than medium, p < .01, or high density, p < .001; thresholds lower for medium density than high density, p < .01), and F3 (thresholds lower for low density than high density, p < .05). Also for the least sensitive areas of the head, the data suggests that a 40–100% increase in threshold values might be expected for those with the highest hair density, when compared with those with the lowest hair density.  The main effect of signal frequency was significant, F(2, 60) = 5, p < .05, η 2 = .003. Post hoc comparisons revealed that vibration detection thresholds were significantly lower at 63 Hz than at 32 or 45 Hz, p < .05. There were no significant differences in vibration thresholds at 32 and 45 Hz, p = .35. More importantly, a significant head location x frequency, F(12, 360) = 2.53, p < .01, η 2 = .007 interaction (Fig. 7 ) revealed that it was more challenging to detect 32 and 45 Hz vibration signals at the front of the head. Contrary to the larger distributed effect of hair density across head location, the effect of frequency was narrower across head location, where threshold differences were only observed for the frontal head locations F3 (thresholds lower for 63 Hz than 45 Hz, p < .01, or 32 Hz, p < .05) and F8 (thresholds lower for 63 Hz than 32 Hz, p < .05). The hair density × frequency interaction was not significant, F(4, 60) = 2.20, p = .08, η 2 = .003. The three-way interaction was also not significant, F(24, 360) = 1.45, p = .08, η 2 = .008.   DISCUSSION   Previous research to facilitate tactile communication via the head (Myles and Kalb, 2009, 2010) focused on obtaining psychophysical measures that were important for the design of a tactile device to stimulate the human head. The resulting head-mounted tactile display consists of a circular, four-tactor arrangement with a tactor placed at the front (between Fp1 and Fp2), back (between O1 and O2), and both sides of the head (T3, T4) (Fig. 1), and is a viable solution for conveying directional information for navigation and event cueing, which may aid in unburdening the soldier's visual and auditory sensory channels during periods of high visual and/or auditory workload. However, in the previous research, the male military population (restricted to haircuts with very little to no hair) was strictly used as study participants to obtain baseline data to build the head-mounted tactile display without having to address hair as a factor in the perception of vibration signals applied to the head. Such methodology was influenced by the hypothesis that hair was a key factor in the detection of vibration stimulation on the scalp, and that the vibration would radiate across and through the hair fibers, decreasing in magnitude before reaching the scalp rather than being emitted directly from the tactor to the skin surface of the scalp. As a consequence, the vibration signal would weaken once it reached the scalp, rendering those with hair less sensitive to the vibrating stimulus, than if it would have been in direct contact with the scalp. Therefore, this study was executed to improve the design of the current head-mounted tactile display to accommodate users with hair. Furthermore, the applied definition of hair density in this study was the amount of isolation produced by hair in preventing tactor contact with the scalp and vibration stimulation on the scalp.  Hair density contributed a small to moderate significant effect to one's ability to detect vibration stimulation on the scalp, but the effect of hair density across head location was quite interesting and unexpected. Although the authors expected to find a broad effect of hair density, the effect was only concentrated to the least sensitive head locations. Those with hair (tactor isolated from the scalp via hair) were significantly less sensitive to vibration stimuli at head locations CZ, PZ, and F3 than those with no hair (tactor not isolated from the scalp via hair). In other words, those with hair had a more difficult time detecting vibration stimulation on the scalp, when the signals originated from the least sensitive head locations (CZ, PZ, F3). However, they detected vibration stimulation on the scalp equally well as those with no hair when the signals originated from the most sensitive head locations (T3, T4, O2). This information is critical for improving the design of vibrotactile signals for users with hair. To accommodate those with and without hair, and ensure comparable detection levels of vibration signals, signals should be designed 10–25 db above the highest thresholds obtained for those with hair.  Head location also contributed a small to moderate significant effect on vibration detection thresholds. For the side (T3, T4) and back portions of the head (O2), thresholds were significantly lower than thresholds for the front (F3, F8), top (CZ), and backward middle (PZ) portions of the head. This reveals a systematic pattern of vibration sensitivity over the whole head, since the seven head locations in this study were chosen so that each region of the head was represented (except the forehead) to produce a whole-head mapping of sensitivity. Thus, both side and back regions of the head (T3, T4, O2) appear to be the most sensitive to vibration stimulation, while the front, top and backward middle portions of the head (F3, F8, CZ, PZ) appear to be less sensitive to vibration stimulation. The sensitivity pattern found for the head locations in this study is similar to the sensitivity pattern of the scalp reported by Weber (1834/1978).  Despite the differences in vibration detection thresholds for those with and without hair, a similar pattern of vibration sensitivity emerged for the two groups. Overall, regardless of hair density, the order of head location sensitivity (from least sensitive to most sensitive) was CZ, PZ, F3, F8, T3, O2, and T4. This ordinal pattern of vibration sensitivity not only reinforces the vibration sensitivity pattern found in Myles and Kalb (2010), but also indicates that the vibration sensitivity mapping of the head is not altered by hair. Therefore, the current placement of tactors at the sides (T3, T4) and back of the head (O2) remains an optimal tactor arrangement for a head-mounted tactile display for users with hair.  Signal frequency had much less of an effect on vibration thresholds than the other variables. According to the head location × frequency interaction, the effect of frequency was evident only for the front head locations F3 and F8. For these two head locations, significantly lower thresholds were observed at the highest signal frequency than at the two lower signal frequencies. Although no significant differences emerged, lower vibration thresholds were also observed at the highest signal frequency for CZ and PZ. This may imply that those with and without hair may have a more difficult time detecting vibration signals at the least sensitive head locations (especially at the frontal region of the head), if the signals are driven at a frequency of at most 32 Hz. Increased detection of the vibration signals at the insensitive locations on the head improved when the signals were driven at frequencies above 32 Hz. More importantly, for the head locations that were more sensitive to vibration stimulation, comparable detection thresholds were observed at all frequency levels. This informs that vibrotactile signals with higher frequencies should be considered for greatly improved detection if the least sensitive head locations will be used as tactor placements for a head-mounted tactile display. In contrast, a head-mounted tactile display that incorporates use of the most sensitive head locations can use low or high frequency signals, and maintain comparable detection levels of vibration signals among those with and without hair. The trivial effect of frequency on the ability to detect vibration stimulation on the scalp found in this study may not be applicable to all frequencies, because the frequencies used in this study may be perceptually similar. More research is needed to confirm if signal frequency would contribute a larger effect if the frequencies chosen were farther apart on the frequency spectrum, and if a true low-high frequency effect generally exists across hair density and head location.   CONCLUSIONS   Two initial exploits for tactile communication via the head include, conveying directional signals for land navigation and cueing attention to urgent events in the environment. Our past work has supported the design of a head-mounted tactile display that can be used for laboratory- and field-based research studies to further knowledge in this area, while the results of this current study will aid in improving the design of the display itself. Furthermore, the results of this study have also helped to validate three of the four tactor placements (T3, T4, O2) in our current head-mounted tactile display. The three most sensitive head locations in this study (T3, T4, O2) were also found to be optimal locations in our previous studies (for those with no hair), so they may be most conducive for conveying information via the head.  This study confirms that hair density slightly impedes vibration signals from reaching the scalp and reduces vibration sensitivity on the scalp. Although we expected the effect of hair density to be larger, the effect of hair density was smaller and constricted to only the least sensitive head locations. A considerable amount of hair on the scalp does not by design equate to a significant reduction in sensitivity to vibration on the scalp. However, a significant reduction in vibration sensitivity is highly probable for those with hair when vibration signals originate from the least sensitive areas of the scalp. In addition, the effect of frequency on vibration thresholds was trivial and not surprising, as the signal frequencies in this study were very close on the frequency spectrum and assumedly similar in perceived perception.   REFERENCES", "highlights": "The purpose of this study was to determine the effect of hair density on vibration detection thresholds associated with the perception of low frequency vibration stimuli applied to the head. A host of tactile sensitivity information exists for other parts of the body, however the same information is lacking for the head. Thirty-three college students, age 18-35, were recruited for the study. A mixed design was used to evaluate the effect of hair density, head location, and frequency on vibration detection thresholds. Results suggest that hair density might slightly impede vibration signals from reaching the scalp and reduce vibration sensitivity, for the least sensitive locations on the head. This research provides design recommendations for head-mounted tactile displays for women and those with hair that can be used to convey directional cues for navigation and as alerts to critical events in the environment."}