{"id": "S000368701530034X", "article": "MAIN-TITLE Evaluation of the effectiveness of a multi-skill program for training younger drivers on higher cognitive skills   HIGHLIGHTS          The current study measures the effectiveness of an integrated training program that takes only a third as long to complete compared to three individual training programs for hazard anticipation, hazard mitigation, and attention maintenance skills.      Drivers in the SAFE-T-trained group were more likely to anticipate hazards, quicker and more effective at responding to hazards, and more likely to keep glance durations under a critical threshold of 2 s as compared to drivers in the Placebo-trained group.      Drivers in the SAFE-T trained group showed the same effect of attention maintenance training as drivers who had been trained using FOCAL when compared with prior studies.          KEYPHRASES   Driver training  Cognitive skills   Forty-eight students between 16 and 18 years old (9 males and 7 females, mean age = 17.9 years, mean years since licensure = 2.2 years for the Placebo group; 8 males and 8 females, mean age = 18.3 years, mean years since licensure = 2.3 years for the RAPT group; 7 males and 9 females, mean age = 18.0 years, mean years since licensure = 2.1 years for the SAFE-T group) were recruited from the University of Massachusetts and surrounding areas and participated in the study. All participants held a valid driver's license including a junior operator's license. Drivers were paid for their participation.   Driving Simulator – The STISIM (System Technology, Inc.) simulator system housed within the Human Performance Laboratory at the University of Massachusetts Amherst was used for the experiment. The system hardware consisted of a built-up cab, three 60″ screens, three projectors, a sound system, and three computers that controlled graphic images. The built-up cab consisted of an adjustable driver's seat, a steering wheel, and accelerator and brake pedals. Graphic images were projected at the resolution of 1024 by 768 pixels with a refresh rate of 30 Hz.   Eye Tracker – An ASL Mobile Eye (Applied Science Laboratories, Inc.) monocular eye-tracker was used for tracking glance durations and scanning behavior. It consisted of safety goggles tacked with optics – a camera that records the driver's eye, a camera that records the scene image, an ultraviolet light source, and a small reflective spectacle. The data were sampled at 30 Hz. The system software integrated the recorded scene and eye images into a single video of the scene with a superimposed crosshair representing the location of gaze in each frame.  The SAFE-T program (Hamid, 2013) was used for training the three higher cognitive skills. The program was delivered via MS PowerPoint on a desktop computer. All components of the program (HA, HM and AM) follow an evaluation, error feedback and mastery approach, where for inaccurate responses, the participants were required to repeat the training until successful identification of the target zone occurred.  In the HA evaluation section, the program introduced to participants the concept of the target zone and launch zone: The target zone is defined as the area from which a potential hazard could emerge, and the launch zone is defined as the area of the road where the driver should anticipate a potential hazard. The program presented first a top-down view of a training scenario. A subsequent slide showed the view from the driver's perspective of the scenario and asked the participants to identify a location of a potential hazard by moving the mouse to that location and then clicking the left mouse button. A total of four such HA scenarios were included. No actual hazard was ever visible, in either the plan view or the perspective view. As noted above, the evaluation of a participant's behavior in a scenario was followed by error feedback and a chance to master the skill.  The HM evaluation section began with the introduction of the concept of time headway. The time headway when hazards are potential or actual is defined as the time that it would take the driver to reach an area from which a hazard could materialize if the driver continued at the current speed and lateral position. The program informed participants that a 3-s time headway is recommended (Ayres et al., 2001) and that they should change their lateral position accordingly, if a potential hazard appeared. In the HM scenarios, in addition to identifying the location of a potential hazard (since successful mitigation of a potential hazard depends logically upon the recognition of the hazard), participants were asked to choose an action that best mitigates the hazard (changes in speed and/or lane position). A total of four HM scenarios were included. Again, error feedback and mastery sections followed each scenario.  Finally, the segue to the AM evaluation section explained that whenever the participants glanced away from the roadway, they should keep their glances below the 2 s threshold to minimize crash risk (e.g., Klauer et al., 2006). The training program asked them to remember a target street name and to find which street intersects the target street on a map. The views of the forward roadway were alternated with the views of the map via a key press where a car horn sounded if the map was up for longer than 2 s. Participants were deemed successful if they did not make any glances at the map longer than 2 s (the duration for which participants glance at the map while the forward roadway view is invisible). The target street for the task varied across trials. Again, four AM scenarios were included and error feedback and mastery components were included after each of the scenarios. The entire SAFE-T program lasted 40 min on average.  The current version of RAPT (RAPT-3) was used for the RAPT group, providing 9 HA driving scenarios to practice scanning for hazards. RAPT-3 was designed to categorically examine hazardous scenarios and to train drivers to scan safety-critical regions (target zones) thereby reducing the likelihood of a crash. This program specifically assessed latent hazard anticipation events which presented an intrinsic risk of collision with other vehicles or vulnerable road users such as pedestrians (Pradhan et al., 2009a,b). The training utilized hazardous scenarios evaluated in previous studies and obtained on-road perspective views of the scenarios. The RAPT-3 training program started with a set of instructions and an initial practice session to afford participants the opportunity to become familiar with the interface and the tasks to be performed. The training itself involved three sections: pre-test, training and post-test. In the pre-test, the participants used their mouse to click on areas of the scenario presented. A total of 9 scenarios were presented in a sequence. The scenarios were presented using several snapshots (5–12) depending on the complexity of the scenario. The program recorded the coordinates and the click times. Participants received no feedback on the pre-test. In the training component, drivers viewed a top-down schematic of the scenario with relevant explanations involving the riskiness in the specific scenario. Following the training section, participants again viewed perspective views of the respective scenario with up to four opportunities to correctly identify the areas of risk on the sequence of snapshots. The post-test section involved the same 9 sequences of photographs administered in the pre-test. As in the pre-test, the click coordinates and click times were collected but no feedback was provided. SAFE-T provided only four HA scenarios. The RAPT program takes about 45 min to complete.  The Placebo training program was used for the control group, providing basic vehicle maintenance information regarding how to change tires and how to gauge tire pressure. The Placebo training program does not actively train any of the three higher cognitive skills, and lasted 40 min on average.   EXPERIMENTAL DESIGN   All participants completed a single driving simulator evaluation of their HA, HM, and AM skills, immediately after completing a training program (SAFE-T, RAPT, or Placebo). In the simulator evaluation, participants navigated a single “drive set” comprised of four virtual environments. There were 4 drive sets used in the experiment, each representing a different sequence of virtual environments (Town, Highway, Rural and Residential). Each virtual environment contained one HA, one HM, and one AM scenario. The order of the virtual environments within a drive set was counterbalanced across participants, as was the order of the three different tests of the driving skills (HA, MA, and AM) within each of the virtual environments.  As noted immediately above, each participant navigated a single drive set which consisted of a total of 12 scenarios, one HA, one HM and one AM scenario in each of the four virtual environments (Highway, Town, Rural, and Residential). Consider first the four HA and four HM simulator evaluation scenarios. Both the HA and HM scenarios involved a latent hazard that could potentially materialize as a vehicle approaches the launch zone (see Fig. 1 ). The HA and HM skills trained on the PC programs were the same ones that the participants would need to perform on the driving simulator in order to safely navigate the scenarios. Although the simulator scenarios were conceptually the same (e.g., if participants were trained to glance for a pedestrian hidden by a bus in a midblock crosswalk in SAFE-T, they were evaluated on the simulator in a similar scenario), they differed visually from the training scenarios, both in terms of the built and natural environment and the traffic on the road. The scenarios used for evaluation are described in Tables 1 and 2  .  The four AM simulator evaluation scenarios consisted of straight two-lane roads with no lead vehicle events, no ambient traffic, or any other sort of hazard materialization. All AM tasks were in-vehicle tasks that required the driver to glance away from the forward roadway to complete the tasks. For the AM tasks, the participants were asked to perform four different in-vehicle tasks: a) Searching for a CD, b) Depositing Change, c) Dialing a Number, and d) Locating a Street. Auditory instructions and beeps indicated initiation and termination (after 15 s) of the AM tasks respectively. The task was initiated at a fixed location on the roadway in each scenario.   PROCEDURE   The 48 participants were randomly assigned either to the SAFE-T, RAPT or the Placebo condition in such a way that 16 participants were in each condition. They completed the assigned training program, followed by a practice drive to get acquainted with the simulator including the AM tasks. After the practice drive, participants drove one drive set of 12 experimental scenarios on the simulator. Participants were instructed to drive as they would on an actual road following all traffic rules, signs and speed limits.   RESULTS   A single rater, blind to the identity of the condition to which a participant had been assigned, counted the number of scenarios with correct anticipatory glances (i.e., glances towards the target zone while the participant was in the launch zone), and performance accuracy was calculated for each participant for each of the four anticipation and four mitigation scenarios. Data were submitted to a one-way analysis of variance (ANOVA) with Group (SAFE-T, RAPT, Placebo) as the between-subjects factor, followed by a series of t-tests, separately for the anticipation scenarios and mitigation scenarios with the Holm-Bonferroni correction for multiple comparisons. Figs. 2 and 3  present the mean proportion of correct glances for the three groups for the anticipation and the mitigation scenarios respectively. There was an overall effect of training [F (2, 45) = 4.00, p = .025, MSE = 3.90]. Glances of the SAFE-T trained and RAPT trained groups initiated in the launch zone landed on the target zone more frequently than those of the Placebo group in the hazard anticipation scenarios [for SAFE-T vs. Placebo, M = .73, 95% CI [.55, .91] vs. M = .47, 95% CI [.27, .66], independent-samples t(30) = 2.41, p = .048; for RAPT vs. Placebo, M = .72, 95% CI [.55, .89] vs. .47 95%, CI [.27, .66], independent-samples t(30) = 2.40, p = .048] while the proportions did not reliably differ between SAFE-T and RAPT [independent-samples t(30) = .10, p = .921, for SAFE-T vs. RAPT]. Results for the hazard mitigation scenarios were similar to those for the anticipation scenarios, but the effect fell short of statistical significance [F (2, 45) = 2.21, p = .122, MSE =1.62]. A series of t-tests revealed that the SAFE-T and RAPT programs produced a marginally greater number of correct glances compared with the Placebo group [for SAFE-T vs. Placebo, M = .86 95%, CI [.76, .96] vs. .73 95% CI [.63, .84], independent-samples t (30) = 2.41, p = .068; for RAPT vs. Placebo, M = .88 95% CI [.78, .97] vs. .73 95% CI [.63, .84], independent-samples t (30) = 2.42, p = .786], and again, the SAFE-T program produced a comparable level of improvement on hazard anticipation behavior [for SAFE-T vs. RAPT, independent-samples t (30) = .28, p = .781].  In the four HM scenarios, the lateral position of the driver's vehicle was analyzed in three scenarios (car parking, work-zone, and bicycle passing bus) and vehicle velocity in the other (pedestrian at a stop sign). For this analysis, only the vehicle data of drivers who successfully anticipated the hazards was used. In the work-zone scenario (Fig. 4 ), the SAFE-T group began mitigating the hazard at an earlier epoch than the Placebo-trained group. For example, although the lateral position did not differ between the three conditions at 10 s before passing the hazard [F (2, 43) = 1.79, p = .18], at 6 s before passing the hazard, the SAFE-T group differed in terms of hazard mitigation from the Placebo group [independent-samples t (29) = 2.31, p = .028]. Interestingly, drivers in the RAPT group started mitigating the hazard earlier than those in the Placebo group [independent-samples t (29) = 1.73, p = .09] but later than those in the SAFE-T group, even though the RAPT program does not specifically train such mitigation behaviors. In the two other scenarios, where the lateral position of the drivers was analyzed, participants in the SAFE-T and RAPT group tended to mitigate the hazards but the difference between these groups and the Placebo group fell short of statistical significance, perhaps due to too low or too high levels of saliency of the hazards: few subjects correctly anticipated the hazard in the car parking scenario while almost all subjects successfully anticipated the hazard in the bicycle scenario. In the scenario with a pedestrian at a stop sign, the velocity of the vehicle in the SAFE-T group was reliably slower than that in the Placebo group (Fig. 5 ). Again, the RAPT group did mitigate the hazard but not to the extent as the SAFE-T group did. [For example, at 8 s after the stop, M = 19.3 vs. 7.3 mph, independent-samples t (19) = 2.62, p = .01 for Placebo vs. SAFE-T, but M = 19.3 vs. 10.6, independent-samples t (22) = 1.85, p = .08 for Placebo vs. RAPT].  As noted above, a glance time of 2 s or longer was chosen as the critical threshold level for the comparison (e.g. Klauer et al., 2006). There was an overall effect of training group [F (2, 45) = 4.603, p = .042, MSE = .876]. The Placebo and RAPT groups showed in-vehicle glances longer than 2 s more often than the SAFE-T group [for Placebo vs. SAFE-T, M = .19, 95% CI [.09, .29] vs. .07 95% CI [.03, .12], independent-samples t (30) = 2.74, p = .010; for RAPT vs. SAFE-T, M = .21, 95% CI [.11, .32] vs. .07 95% CI [.03, .12] independent-samples t (30) = 2.99, p = .022], while the proportions of glances longer than 2 s were similar between the RAPT and Placebo groups [independent-samples t (30) = .37, p = .671]. Additionally, the complementary cumulative distribution function (CDF) plotted against various threshold values was calculated for each of the three training groups (Fig. 6 ). The complementary CDF here indicates the probability of executing an off-road glance longer than a given threshold value. Consistent with the previous report (Pradhan et al., 2011), the complementary CDF for the SAFE-T group was shifted towards the left compared to that for the Placebo and RAPT groups, indicating that the training was effective in reducing glance durations not only at the 2-s threshold but also across different threshold values.   DISCUSSION   The current study examined the effectiveness of an integrated program for training novice drivers on three safety-critical skills: hazard anticipation, hazard mitigation, and attention maintenance with greater efficiency than the three individual training programs. In HA tasks, compared to the Placebo group, there was a 26 percentage point gain in the percentage of hazards correctly anticipated by the SAFE-T group, a difference indistinguishable from the 25 percentage point gain in the percentage of hazards correctly anticipated by the RAPT group. However, both gains were smaller in magnitude than that in a previous study of RAPT (approximately 38.1 percentage points; Pradhan et al., 2009a,b). The difference in the effect size in the HA scenarios between the present and previous studies might have arisen from the difference in the driving scenarios evaluated in earlier studies and the scenarios evaluated in this study.  The SAFE-T group also mitigated hazards earlier and more rapidly than the Placebo-trained group in two scenarios and anticipated the hazards more often than the Placebo group. HM scenarios inherently contain latent hazards more salient to cue mitigation of the hazards than the HA scenarios, perhaps resulting in a smaller effect size of the SAFE-T on the HA performance in the HM than the HA scenarios. Of particular interest is the mitigation behaviors of RAPT trained drivers who anticipated the hazard. They did mitigate the hazard, even though they had not been trained specifically to do such. But the magnitude of the mitigation behaviors of the RAPT trained drivers was not of the same magnitude as was observed for the SAFE-T group, implying that drivers can, to some extent, infer on their own how to avoid a latent hazard, assuming that they anticipated it. The differences in velocity (2–3 mph) and lane position (few inches) across the two groups, though small in magnitude, are important to consider because a number of safety-critical situations could occur on the roadway wherein the margin for successful mitigation is minimal.  Finally, the SAFE-T group successfully reduced the proportion of off-road glances greater than 2 s compared to the RAPT and Placebo groups. Studies previously examining the effectiveness of another AM training program (FOCAL) showed that FOCAL can successfully reduce the proportion of glances longer than 2 s by 9.4 percentage points (e.g. Pradhan et al., 2011). Although FOCAL was not evaluated in the current study, SAFE-T was found to reduce the proportion of glances longer than 2 s by at least 11.7 percentage points. These results clearly indicate the effectiveness of the AM portion of the SAFE-T program -- even with reduced exposure (15 min vs. 40 min, for SAFE-T and FOCAL, respectively) -- in minimizing especially long off-road glance durations while engaged in various in-vehicle tasks. The RAPT group, post-training, did not reduce the proportion of longer glances, suggesting that the RAPT-trained drivers did not generalize the learning content of the RAPT program to the attention maintenance skills. The same failure of RAPT to reduce the proportion of especially long glances was found in another study (Pradhan et al., 2009a,b), but is still surprising to a certain degree as RAPT encourages drivers to actively explore visual driving scenes for a potential hazard. The clear inference would appear to be that glances away from the roadway will interfere with the detection of latent hazards. But this did not happen, indicating that the cognitive skills that the RAPT trains do not generalize to attention maintenance.  The current set of results suggests that younger drivers can be trained to improve various aspects of their higher cognitive performance (HA, HM & AM) within a shorter span of time using an integrated training program. Why is the SAFE-T training program effective for improving the three skills in one third of the time that each of the individual training program can take? First, it appears that SAFE-T may have identified a balance in the number of exemplars provided with respect to exposure as compared to previous programs, thereby providing a more ideal platform to help novice drivers generalize the learned skill to different road environments in an optimal manner within a shorter time span. Second, in the SAFE-T program, training of one skill could have facilitated another, though the relation is complex. This theoretical speculation raises an interesting question: what are the relationships among the HA, HM, and AM skills? As mentioned above, the RAPT-trained drivers mitigated hazards even though they were not specifically trained to do so, showing some generalizability of the HA skill to the HM skill. Future research should explore the links between the three skills for improving the current training program.  The current effort should be extended to examine whether the SAFE-T training program is effective for training young novice drivers on the three skills to the comparable levels of older experienced drivers, as the individual programs can do (e.g., Divekar et al., 2013; Hamid et al., 2014; Muttart et al., 2013). Additionally, it is important that future research examine whether results from the simulator-based study translates to similar behavior in more realistic environments particularly closed tracks and the open road, ultimately providing a baseline for the relation between novice driver training and crash rates. Future research could also examine the long-term effectiveness of the program: the effects of the integrated program may not persist as long as those in the individual training programs such as RAPT, ACT, and FOCAL. Finally, future research should consider whether the training program would be as effective if it were used on a mobile platform (iPad, smart phone). The desktop and the laptop are becoming something of a relic. How much of the effect of the various training programs to date depend on the screen size is not clear, but should be evaluated.  In summary, the SAFE-T training program led to significant improvements in the three higher cognitive skills, HA, HM and AM. The effects were close to those found in other similar training programs (RAPT, ACT, and FOCAL). The results clearly show that the program holds great promise for improving young drivers' safety-critical skills in a much shorter span and to a level akin to that of existing programs.   ACKNOWLEDGEMENTS   Thanks are due to Pascale Carayon and three anonymous reviewers for helpful comments on an earlier draft of the manuscript and William Barges for preliminary data collection.  This research was funded in part by grants from the New England University Transportation Center and the Liberty Mutual Research Institute for Safety to D. F. and a Liberty Mutual-UMass Amherst Post-Doctoral Research Fellowship awarded to Y.Y.   REFERENCES", "highlights": "Training programs exist that prove effective at teaching novice drivers to anticipate latent hazards (RAPT), mitigate hazards (ACT) and maintain attention (FOCAL). The current study (a) measures the effectiveness of a novel integrated training program (SAFE-T) that takes only a third as long to complete compared to the three individual training programs and (b) determines if integrating the training of all the three higher cognitive skills would yield results comparable to the existing programs. Three groups were evaluated: SAFE-T, RAPT and Placebo. The results show that the drivers in the SAFE-T-trained group were more likely to anticipate hazards, quicker and more effective at responding to hazards, and more likely to maintain glance durations under a critical threshold of 2 s as compared to drivers in the Placebo-trained group who received a control program that does not actively train on any of the three cognitive skills. Moreover, the results show that the drivers in the SAFE-T trained group were just as likely to anticipate hazards as the drivers in the RAPT trained group. Finally, when compared with prior studies, the drivers in the SAFE-T trained group showed similar effects of attention maintenance training.   Young novice drivers are overrepresented in automobile fatalities when compared to older, more experienced drivers. For example, per 100 million miles traveled in 2008, the fatal crash rates for drivers aged 16–19 was approximately 4.6 times higher than that for drivers aged 30–69 (IIHS, 2012). Some of the increase in the crash rates for novice drivers can be attributed to their willingness to engage in risky driving behaviors, such as speeding (Ivers et al., 2009). Strikingly, however, an analysis of 1000 crashes involving novice drivers identifies cognitive factors such as attentional and visual search failures as key contributors to over 65% of vehicular crashes while the risk-seeking behaviors account for only approximately 5% of such crashes (McKnight and McKnight, 2003). Moreover, although failure to modulate speed under various traffic conditions accounts for about 21% of the crashes, this may be partly due to the novice drivers' inability to perceive critical hazards while driving (e.g. Mourant and Rockwell, 1972). Other studies have identified such cognitive factors as particularly critical to novice drivers' safety (e.g. Treat et al., 1979), and shown that age-related differences in visual scanning performance are more likely a result of inexperience than they are of an increased willingness to accept the risks that arise from not scanning (Gregersen, 1996).  Recent driving simulator studies which record driver and vehicle behaviors have focused on examining and developing specific training programs for improving driver performance across three cognitive skills that are known to be critical to driver safety, hazard anticipation, hazard mitigation, and attention maintenance. First, hazard anticipation (HA) is defined as the ability to scan the areas of the roadway in order to identify and react to a hazardous event, especially those events that are latent (have not yet materialized). Novice drivers glance less frequently towards areas with latent (potential) hazards, compared with experienced drivers (Pradhan et al., 2005). Such glances are important because they can reduce the risk of a crash. Pradhan et al. (2009a,b) developed and evaluated a PC-based driver training program in the field, Risk Awareness and Perception Training (RAPT; Fisher et al., 2004), which aims to improve scanning behavior in novice drivers, especially for potential hazards even when the hazards do not materialize. The program allows trainees to see a top-down view of each scenario where hazards are predictable, but hidden from the driver by the built or natural environment (i.e., latent hazards). No hazards actually materialized in any of the scenarios. The trainees were asked to identify the area of the scenario that could contain a latent hazard by using the mouse to place an icon on the potential target zone (the area where the latent hazard is located). In a subsequent on-road evaluation (Taylor et al., 2013), RAPT-trained drivers correctly glanced at the target zone about 64% of the time (vs. 37% for Placebo-trained drivers), proving the effectiveness of the RAPT program in increasing novice drivers' hazard anticipation abilities.  Second, hazard mitigation (HM) is defined as any action that a driver undertakes in an attempt to respond to potential or actual hazards on the road. As with HA, novice drivers performed worse than experienced drivers in evaluations of HM. For example, in various scenarios involving curves (Muttart et al., 2013) and intersections (Muttart et al., 2014), the novice drivers made fewer anticipatory glances and began mitigating markedly later than their experienced counterparts. Anticipate, Control, and Terminate (ACT) is a training program that teaches drivers first to anticipate and then to mitigate a hazard successfully. ACT-trained novice drivers' performance on hazard anticipation and mitigation at curves improved to a level similar to that of the experienced drivers' performance, showing the effectiveness of the ACT training program (Muttart, 2013).  Lastly, attention maintenance (AM) is defined as the ability of drivers to maintain their attention on the forward roadway. Off-road glances longer than 2 s elevate the risk of a crash (Klauer et al., 2006). As with the other skills, novice drivers perform more poorly, in this case being more likely to show longer off-road glances compared to more experienced drivers (Chan et al., 2010). Specifically, in several in-vehicle tasks (finding a CD and dialing a phone number, for example), novice drivers glanced inside the vehicle for a duration greater than the 2 s-threshold more frequently than the experienced drivers (Chan et al., 2010), especially later in a sequence of in-vehicle glances (Yamani et al., 2015). FOrward Concentration and Attention Learning (FOCAL) is a program that aims at training novice drivers to limit their glances inside the vehicle to no longer than 2 s. The program has been shown to be effective in reducing in-vehicle glance durations both in a simulator (Divekar et al., 2013) and on the open road (Pradhan et al., 2011).  Of current interest is the evaluation of an integrated training program, SAFE-T, developed by Hamid (2013), that has been shown to reduce the effect among nurses long periods of wakefulness have on each of the above three critical driving skills (e.g., Hamid et al., 2014). The nurses were all experienced drivers. The current study addresses whether the integrated training program will prove as effective among novice drivers at mitigating the effects of inexperience as it does among nurses at mitigating the effect of long periods of wakefulness. As discussed above, although individual skill-specific programs are now available to effectively train novice drivers to anticipate hazards (RAPT), to mitigate hazards (ACT), and to maintain attention (FOCAL) on the forward roadway while driving, it remains to be shown whether novice drivers can be trained on all the three skills within a single integrated training program with greater efficiency taking only a third of the time compared with the three individual training programs.  First, among novice drivers as opposed to nurses, with SAFE-T the time devoted to each skill may not be enough. Novice drivers simply may not have the experience that can speed their learning, something that the nurses did have. Second, there could be both retroactive and proactive interference when SAFE-T is used with novice drivers (e.g., Underwood, 1948). That is, the three areas could potentially interfere with one another retroactively or proactively in the learning process because the skills are similar. This potentially is especially high among novice drivers when the learning of three different skills is crammed into a relatively short period of time. Third, the fact that training can reduce the effects of long periods of wakefulness in each of the three skills does not mean that training can reduce the effects of inexperience on all the three skills.  The current study aims to evaluate an integrated program from both a theoretical and applied standpoint. Theoretically, the evaluation will answer the above three questions. Practically, a training program that addresses all the three critical skills and requires only 40 min of a novice driver's time is much more likely to be used than are three separate training programs, each of which requires more time individually than does the integrated program overall.  SAFE-T uses a training method (e.g. error management approach; Gist et al., 1989) similar to the existing programs (RAPT, ACT, and FOCAL). Thus, assuming that neither the decrease in exposure, the potential for interference, or the different domain of application entirely negate the effect of training, we hypothesize that novice drivers trained on the SAFE-T program are more likely to anticipate hazards, are quicker to mitigate them, and are more likely to maintain their attention on the forward roadway while driving than are a control group of novice drivers. Moreover, we have decided to compare the effect size of SAFE-T with the effect size of one of the training programs, RAPT, to determine whether the decrease in exposure and potential for interference decrease the size of the effect of SAFE-T on hazard anticipation (the same skills that RAPT is designed to train)."}