{"id": "S000368701400194X", "article": "MAIN-TITLE Thermal discomfort and hypertension in bus drivers and chargers in the metropolitan region of Belo Horizonte, Brazil   HIGHLIGHTS          This study was conducted with a sample of Brazilian collective transportation workers.      Prevalence of hypertension was higher in workers that reported thermal discomfort.      Our findings call for reflection about social protection needed for these workers.      Our findings encourage transport policies about bus climatic conditions.          KEYPHRASES   Bus driver  Hypertension  Hot temperature   Hypertension is a serious public health problem in Brazil. In a recent survey conducted with a representative sample of a Brazilian adult population, the prevalence of self-reported hypertension was 20% (Brazil, 2012). In the City of Belo Horizonte, the diagnosis of hypertension was reported at 20.8% of the adult population (Lima-Costa et al., 2012).  Increased arterial pressure represents a linear, continuous and independent risk factor for cardiovascular diseases (CVDs), which are responsible for more than a third of all deaths in this country, with emphasis on ischemic heart disease (IHD) and brain stroke (BS). It is estimated that hypertension explains 47% and 54% of the multifactorial etiology of IHD and BS, respectively (Williams, 2010).  Apart from the high magnitude of CVDs, they are responsible for a large proportion of hospital admissions, generating social and economic burdens. Almost 20% of expenditure relating to hospitalizations in the Brazilian public healthcare system in 2006 was due to CVDs-related costs (Brazil, 2013). Early retirement due to disability and prolonged absenteeism are reflections of diminished capacity to work caused by CVDs sequelae (Azambuja et al., 2008), thus justifying the focus on occupational groups, among other reasons.  The findings of previous studies demonstrated the relationship between individual and behavioral factors with hypertension (Echouffo-Tcheugui et al., 2013). However, the association between the working environment and hypertension is little explored, despite the plausibility of this relationship (Lin et al., 2009). Regarding the bus microclimate, there are only a few studies concerning this topic, which have shown inconsistent results (Li et al., 2011; Vangelova & Deyanov, 2007).  Therefore, the aim of the present study was to analyze the relationship between perceptions of the internal temperature of buses and detection of hypertension among collective transportation workers in the metropolitan region of Belo Horizonte.  The present study was cross-sectional and formed part of a broader project that included other outcomes and was named “Health and working conditions of drivers and chargers of urban public transportation in the cities of Belo Horizonte, Betim and Contagem, MG, Brazil”.  The eligible population in the three cities investigated was 17,470 workers (Belo Horizonte = 6500 drivers and 6750 chargers; Betim = 696 drivers and 524 chargers; Contagem = 1800 drivers and 1200 chargers) (Traffic and Transport Company of Belo Horizonte city, 2009).  In the sample calculation, the prevalence of the hypertension outcome was taken to be 22% (Benvegnu et al., 2008), with 80% statistical power, 95% confidence level, prevalence ratio of 2.00 and expected losses of 20%, thus yielding a total of 526 subjects. The sampling process was performed with selection of quotas proportional to the total number of professionals in each of the three cities, according to their occupation (drivers and chargers).  However, this was a wider survey in which other outcomes of lower prevalence were also investigated and, in the end, 1607 individuals were interviewed, of whom 853 were drivers and 754 were chargers. Their distribution was as follows: Belo Horizonte (72% drivers and 80% chargers), Contagem (20% drivers and 14% chargers) and Betim (8% drivers and 6% chargers). Therefore, the number of respondents was 114% above the calculated sample size for the outcome of interest (hypertension) and, thus, the statistical power increased considerably.  Data collection was carried out by means of face-to-face interviews with the aid of netbooks between April and June 2012, in the morning and afternoon shifts. Exclusive software was developed for the research project, taking into consideration the objectives of making it possible for the interviewer to fill out a digital questionnaire, and enabling online data processing.  Data from the literature and previous interviews with union representatives and workers were the basis for designing the tool for data collection. It included 82 questions relating to the following factors: demographic data (sex, age, skin color and marital status); socioeconomic data (schooling and family income); working conditions (job, working shift, number of hours at work, length of time worked at the company, holidays and working schedule); internal working environment (noise, vibration, illumination and temperature); external working environment (traffic and noise); ergonomics; personal protective equipment; lifestyle and habits (smoking, drinking, physical activity and sociocultural activities); health conditions (medications used and diseases diagnosed); anthropometric data (weight and height); violence (traffic accidents and conflicts with passengers); and quality of life.  Research procedures and instruments were previously tested in a pilot trial (30 participants). Specific workshops led by the research coordinators were held in order to train the 22 interviewers, who were recruited from courses at the Federal University of Minas Gerais. The reliability of the interview was assessed by reapplying some selected questions from the original questionnaire to some of the same respondents (12% of all participants).  The interviews were carried out at four metro/bus stations in Belo Horizonte and at 35 resting places in the three cities. These resting places were selected because they concentrate the majority of the buses, trips and registered workers. They are used by bus workers to have a pause after a trip of 60–90 min. An average of 80% of all passengers using the bus services pass through these four selected stations (Traffic and Transport Company of Belo Horizonte city, 2009).  The research project was widely publicized through a local radio station, in a program specifically directed towards urban collective transportation workers. Furthermore, posters and leaflets were distributed before the field team began its work.  The exposure variable “thermal discomfort” was determined based on the answers to the following question in the questionnaire: During the time you are working, what is your perception of the temperature inside the bus? The possible answers were: tolerable, disturbs a little, disturbs a lot or unbearable.  The following variables were considered to have the potential to confound the relationship between the internal temperature of the bus and hypertension: sex (male or female); age (18–29 years of age, 30–39 years, 40–49 years, 50–59 years or 60 or more years); family income (up to two minimum salaries, two to four minimum salaries, or four or more minimum salaries; the minimum monthly salary at that time was R$ 622.00); smoking (Considering smoking to be the habit of having smoked at least 100 cigarettes or five packs, how do you classify yourself? Nonsmoker, former smoker, current smoker); physical activity (How often do you practice physical activities? Never, once to twice a week, three or more times a week); sociocultural activities (Do you participate in cultural activities (cinema, theater or exhibitions)? No or yes); body mass index (BMI) (calculated by means of the following equation: weight (kg)/height (m)2; <25 (normal), 25–29.9 (overweight); or ≥ 30 (obese); both weight and height were self-reported by the participant); vibration of the body (During your work, do you feel your body vibrate? Never, rarely, sometimes, often or always); illumination inside the bus (During your work, what do you think about the lighting inside the bus? Good, average, bad or very bad); and noise inside the bus (In general, the noise inside the bus is: minimal, reasonable, high or unbearable).  The outcome variable, hypertension, was determined from the answers to two questions: (1) Do you have a medical diagnosis of high pressure (hypertension)? (2) At present, are you using medications prescribed by a doctor to treat high pressure (hypertension)? For both questions, the possible answers were no and yes.  Individuals were considered to have hypertension if the answer to at least one of the questions was yes. When the participant answered no to both questions, this person was classified as having normal blood pressure.  The sample was characterized through calculating the absolute and relative frequencies of the following variables: demographic (sex and age), socioeconomic (family income), lifestyle (smoking, physical activity and sociocultural activities), anthropometric (BMI) and conditions inside the bus (temperature, vibration of the body, noise and illumination), according to the categories of the exposure variable (internal temperature of the bus). Statistical differences were assessed using the Pearson chi-square test.  Bivariate analysis was carried out to assess the crude association between the perception of temperature inside the bus and each covariable of interest with hypertension. The strength of the associations was measured by means of prevalence ratios (PR) and their respective 95% confidence intervals (95% CI).  The independent association between the perception of the temperature inside the bus and hypertension was assessed by means of multiple Poisson regression models with robust variance, adjusted for potential confounding factors. Thus, the PR and its respective 95% CI were calculated using the category “tolerable” as the reference, regarding the perception of temperature inside the bus. In model 1, the adjustment variables considered were sex, age and family income. For model 2, all variables of model one were considered and, additionally, smoking, physical and sociocultural activities done and BMI were included. Finally, for model 3, the variables from model two were considered and, additionally, vibration of the body, illumination and noise inside the bus were included.  We also produced interactions terms between the temperature and other environmental factors inside the bus, such as the driver's body vibration, illumination and noise. The independent associations between these interactions with hypertension were also tested.  For all analyses, the statistical significant level was set at 5% (p < 0.05).  In this study, we have opted to use PR estimated by Poisson regression models with robust variance as measure of strength association. However, it is very important to highlight that there is no consensus regarding which measure of strength association is best for cross-sectional studies, PR or Odds Ratio. The latter measure was judged inappropriate because it overestimates the strength of association when a higher rate of the outcome is expected. In this case, PR was proposed as an adequate measure of strength association (Barros and Hirakata, 2003; Coutinho et al., 2008).  This research project was approved by the Ethics Committee for Research on Humans of the Federal University of Minas Gerais (Protocol number CAAE – 02705012.4.0000.5149). All participants signed a free and informed consent statement.   RESULTS   Regarding the exposure variable, the participants perceived the temperature inside the bus as follows: tolerable = 26.5%; disturbs a little = 28.6%; disturbs a lot = 34.8%; and unbearable = 10.2%.  Most workers were male (87.1%), aged less than 40 years of age (67.4%), with family income of up to four minimum salaries (68.7%), reporting sociocultural activities (67.7%), sedentary (50.9%) and weight and height compatible with excess weight (overweight/obesity = 49.2%). In addition, 15.8% of the participants were smokers (Table 1 ).  There were a higher proportion of individuals over the age of 50 years (15.2%), who earned up to two minimum salaries (32.9%) and who did not have sociocultural activities (42.1%), among those who considered the temperature inside the bus to be unbearable (Table 1).  Considering the internal environment of the bus, 33.4% of the participants reported that they never or hardly ever felt their body vibrating, and the majority of them reported that they worked inside the bus with good illumination (67%) and with high/unbearable noise (51.1%) (Table 1).  Among the participants who classified the internal temperature of the bus as unbearable, there were higher proportions of individuals who also reported that during their work they always felt their body vibrating (47.6%), perceived that the internal illumination was very bad (6.1%) and said that the noise inside the bus as unbearable (48.8%) (Table 1).  In general, the prevalence of hypertension was 14.3% and, at the bivariate level, the following characteristics were significantly associated with this outcome: 1) positive association – female sex, older age, overweight/obesity, former smoker and perception of the internal temperature of the bus as unbearable; 2) negative association – participation in sociocultural activities and physical activity once or twice a week (Table 2 ).  In the multivariate analysis on the data, after adjustment for sex, age and family income (Model 1), the thermal discomfort remained independently associated with hypertension: disturbs a lot (PR = 1.46; 95% CI = 1.07–1.99); unbearable (PR = 1.66; 95% CI = 1.14–2.43) (Table 3 ). The additional adjustment for smoking, physical activity, sociocultural activities and BMI (Model 2) decreased the strength of the associations between thermal discomfort and hypertension: disturbs a lot (PR = 1.38; 95% CI = 1.01–1.89) and unbearable (PR = 1.65; 95% CI = 1.13–2.42) (Table 3). Finally, the additional adjustment for vibration of the body, illumination and noise inside the bus (Model 3) led to increased strength of association with hypertension: disturbs a lot (PR = 1.41; 95% CI = 1.02–1.95) and unbearable (PR = 1.74; 95% IC = 1.16–2.63) (Table 3).  The interactions between temperature and other environmental factors inside the bus, such as vibration of driver's body, illumination and noise were not independently associated with hypertension (data not shown).  The prevalence of hypertension in the group of bus workers was 14.3%. Thermal discomfort was independently associated with this outcome [disturbs a lot (PR = 1.41; 95% CI = 1.02–1.95) and unbearable (PR = 1.74; 95% CI = 1.16–2.63)]. Therefore, the prevalence of hypertension was 41% and 74% higher, respectively, in the groups that reported thermal discomfort at levels that disturbed a lot or were unbearable, in comparison with those who qualified the internal temperature of the bus as tolerable. However, although consistent, interpretation of these results requires care for at least three reasons: a) the information on hypertension was not obtained by measuring the arterial pressure, but from self-reports. However, this has been a standard for hypertension diagnosis, already validated in other observational studies, including cohorts of international importance (Fiebach et al., 1989; Alonso et al., 2005); b) in cross-sectional studies, it is not possible to identify the direction of observed associations; c) although subjective evaluation of thermal discomfort is valid, the individual's emotional status influences the response and may be affected not only by the working environment but also by family life. Personality traits influence individual vulnerability to the hazards of work, thus modulating the responses to questionnaires. However, there are advantages in this study that addressed the occupational exposure variable through subjective data. Subjective assessment in conjunction with physical parameters can be used, by means of questionnaires, to investigate the correlation between objective and subjective data regarding the thermal environment. It is worth emphasizing that thermal comfort is a mental expression that means satisfaction with the environmental temperature. Therefore, in order to address this subject, it is necessary to use subjective evaluation (Shek and Chan, 2008).  The prevalence of hypertension observed in our study was lower than what has been estimated in other epidemiological investigations on groups of urban public transport workers (Benvegnú et al., 2008; Costa et al., 2003; Gus et al., 2004; Wang and Lin, 2001). The difference may be due to methodological variations. In the present study, the outcome of interest was obtained through self-reports based on two objective questions: (1) Do you have a medical diagnosis of high pressure (hypertension)? (2) At present, are you using medications prescribed by a doctor to treat high pressure (hypertension)? Using this approach, subjects with hypertension without confirmation by a medical doctor would not be taken into consideration. On the other hand, in the abovementioned studies, hypertension was confirmed through specific reading of arterial pressure. Even if this methodological procedure can be accepted in population inquiries, the possibility of overestimation of the obtained rates cannot be discarded (Brazilian Hypertension Society, 2010).  When we compare the proportion of participants diagnosed with hypertension in our study (14.3%) with the frequency of self-reported hypertension evidenced in adult population of the City of Belo Horizonte (20.8%), once again, the prevalence that we identified was lower. However, in this case, there were no methodological variations in hypertension diagnosis, and the differences of prevalence might be explained due to a healthy worker effect (Monson, 1986; Koskela, 1997). The logic underlying of healthy worker effect is an expression of the relationship between the demand and the supply of jobs available in a society. Healthy individuals are more active in seeking a job (self-selection) and more easily selected (employer selection). However, when a worker is sick, he or she leaves or is formally withdrawn from work place (sick leave, transfer to the administrative sector or early retirement) (Monson, 1986; Koskela, 1997).  With regard to an association between the internal temperature of the bus and arterial hypertension, this is a plausible and pioneering finding in Brazil. Hemodynamic changes are part of the thermoregulatory system, and higher heart rate and higher cardiac debit are expected when vasodilation of blood vessels located on the body surface takes place in response to an increase in environmental temperature. The signals that are picked up by thermoreceptors located in the skin are interpreted by the anterior hypothalamus, thus leading to a physiological repercussion that aims to maintain an adequate internal body temperature for organs and tissues to function. However, maintenance of thermoregulatory mechanisms under situations of prolonged exposure to thermal stressors may change these physiological responses to pathological ones (Lin et al., 2009). In summary, the characteristics of the thermal environment are considered to be strong stressor factors that can be directly associated with changes to the cardiocirculatory system.  Repeated cardiovascular hyperactivity and/or incomplete recovery of cardiovascular changes induced by thermal stress and other types of stress may lead to development of essential arterial hypertension (Schnall et al., 1998). Persistent and significant increases in blood pressure may be attributed to stressful working conditions, leading to hypertension. A study that assessed workers at a wood processing plant in Botucatu, SP, Brazil, concluded that the group subjected to higher environmental stress presented greater elevation of blood pressure and heart rate (Rocha et al., 2002). Excessive cardiovascular morbidity was documented in the subgroup of drivers (Rydstedt et al., 1998).  General symptoms like fatigue and mood fluctuations were more notable in a group of subjects exposed to higher temperatures (30 °C) than in a group exposed to average temperatures (22 °C), which led to impairment of performance of the first group's activities (Lan et al., 2011a, 2011b). Thermal and climate conditions that are inappropriate for development of activities may worsen the working environment, compromise physical and mental performance and increase the risk of accidents (Martinet and Meyer, 1999). Microclimate design failures, air pollution and low humidity have a negative effect on the performance of activities. Inadequate humidity may lead to excessive sweating and evaporation of liquid from the respiratory tract, thereby affecting the drivers' performance. These are situations that give rise to reduced safety in traffic.  Prevention of hypertension depends on intervention in its main risk factors, particularly modifiable ones like occupational hazards that can directly influence arterial pressure levels. Habits and lifestyle traits such as excess weight/obesity, salt and alcohol intake and sedentary life are also modifiable (Artazcoz et al., 2007; Brazilian Hypertension Society, 2010; Pimenta et al., 2012). Changes in habits and lifestyle are influenced by work characteristics. It is worth emphasizing that labor environments are important scenarios for implementation of health promotion programs (World Health Organization, 2010).  To ensure passengers' comfort during the bus ride, it has been suggested that the equipment needs to be adequate (Han and Naeher, 2006). However, the approaches used for passengers do not mention the bus workers who share the same environment. Passengers are disadvantaged through the workers' clear vulnerability caused by the length of exposure.  Policies for safe and healthy transportation, to promote healthy municipalities, aim to decrease the occurrence of traffic accidents, attenuate noise on the streets and in homes, and control pollutant emission. Collective urban transportation is also a strategic way to reduce urban agglomeration, traffic chaos and stress on main roads (Pan American Health Organization, 2009). However, it is rare to see interest in protecting the health of the professionals who are essential for providing these services.  The transport sector is an important arena of demands and different agendas within Brazilian society (Vasconcellos et al., 2011). The study participants who were approached in the field by the trained team only rarely refused to provide information, and this shows the strength of the present survey for its intended purposes. The results presented here call for reflection on the social protection needed for this work and the workers, while also encouraging linkage between collective transport policies and actions within the occupational sphere, focusing on transformation of the climatic conditions of buses.  No authors in this study have actual or potential conflict of interest including any financial, personal or other relationships with other people or organizations within three (3) years of beginning the work submitted that could inappropriately influence this work.   ACKNOWLEDGMENTS   The authors wish to thank the collaboration of the bus drivers and chargers, participants of this study.   REFERENCES", "highlights": "This study aimed to assess the relationship between perception of temperature inside the bus and hypertension among 1126 collective transportation workers in metropolitan region of Belo Horizonte, Brazil. Thermal discomfort was determined based on the perception of temperature inside the bus. Hypertension was determined if participant had a medical diagnosis of this disease. Prevalence ratios (PR) for hypertension and their respective 95% confidence intervals (95% CI) were adjusted using multivariate Poisson regression analysis. The perceptions of temperature inside the bus were tolerable (26.5%), disturbs a little (28.6%), disturbs a lot (34.8%) and unbearable (10.2%). The prevalence of hypertension was 14.3%. The thermal discomfort categories of disturbs a lot (PR = 1.41; 95% CI = 1.02–1.95) and unbearable (PR = 1.75; 95% CI = 1.16–2.63) were independently related to hypertension. Thermal discomfort was associated with a higher prevalence of hypertension. This finding should be considerate in new policies for public transportation."}