{"id": "S000368701400146X", "article": "MAIN-TITLE Risk factors for carpal tunnel syndrome related to the work organization: A prospective surveillance study in a large working population   HIGHLIGHTS          The study showed the association of CTS with some factors related to the work organization.      Payment on a piecework basis was associated with increased risk of CTS.      Work pace dependent on automatic rate was associated with increased risk of CTS.      Work organization should be an important target for the prevention of CTS.          KEYPHRASES   Carpal tunnel syndrome  Work organization  Psychosocial factors   Carpal Tunnel Syndrome (CTS), which is the most common entrapment neuropathy of the upper extremity in the working populations (Hagberg et al., 2005; Roquelaure et al., 2006; Palmer et al., 2007; Dale et al., 2013), represents a major occupational health problem with high social and economic implications (Palmer et al., 2007).  Several personal and medical factors can increase the risk of CTS (overweight, diabetes mellitus, thyroid disorders, rheumatoid arthritis) (Stevens et al., 1992; Atcheson et al., 1998; Becker et al., 2002; Burt et al., 2011), but the most significant are not modifiable (e.g., middle age (40–60 years) and female gender). Many biomechanical (Viikari-Juntura and Silverstein, 1999) and epidemiological studies (Roquelaure et al., 1997; Leclerc et al., 1998; Gell et al., 2005; Roquelaure et al., 2001a; Nathan et al., 2005; Armstrong et al., 2008; Shiri et al., 2009; da Costa and Vieira, 2010) support the association between CTS and occupational factors, namely mechanical exposure in the workplace. Five recent systematic reviews of the literature and a meta-analysis concluded that there is an association between CTS and work-related repetitive movements, exposure to hand–arm vibration, forceful manual exertion, bending/twisting of the wrist and combinations of these factors (Palmer et al., 2007; van Rijn et al., 2009; Barcenilla et al., 2012). Most occupational factors can be modified by preventive interventions in the workplace in contrast to most personal/medical factors. Moreover, the potential impact of such intervention might be important on the prevalence of CTS in the working population (Roquelaure et al., 2009).  Despite a growing number of studies on occupational stress, the relationships between CTS and work-related psychological factors at work remain unclear (van Rijn et al., 2009; Harris-Adamson et al., 2013). Work organization factors relate to the structural task and/or organizational-level aspects of the work process (Huang et al., 2002). Lean production systems and the related new systems of work organization are thought to intensify work pace and job demand and consequently to increase the risk of musculoskeletal disorders (Landsbergis et al., 1999), because of higher exposure to repetitive movements and lack of recovery time (Koukoulaki, 2014). Although no literature review has revealed work organization as a possible determinant of CTS, some epidemiological findings suggest relationships between increased risk of CTS and the characteristics of the work process. This has been demonstrated for “just-in-time” production processes (Leclerc et al., 1998), high-paced work depending on strictly quantified targets (Rigouin et al., 2013), very short cycle time and lack of change in activity or breaks during repetitive work (Roquelaure et al., 1997). The results concerning the impact of job rotation are conflicting (Roquelaure et al., 1997; Mathiassen, 2006; Maghsoudipour et al., 2008; Wells et al., 2010; Rigouin et al., 2013).  Increasing understanding of the impact of work organization on the risk of CTS is a major issue in the context of globalization of the economy, rationalization of production and flexibility of employment leading to “work intensification” (Landsbergis et al., 1999; Koukoulaki, 2014). As for the other risk factors for CTS, most results on the psychosocial and organizational risk factors have been based mainly on cross-sectional or retrospective surveys (van Rijn et al., 2009). There is therefore a need for prospective studies to confirm associations in representative samples of workers and industries. A recent large prospective study conducted in industrial and service workers focused on physical exposure and showed a dose response relationship between the hand activity level (ACGIH threshold limit values) and CTS. Recent coordinated prospective studies in US workers from various industries identified high job strain as a risk factor for CTS and social support as protective from CTS. However, they did not report any association with factors related to the characteristics of the work organization (Harris-Adamson et al., 2013).  The surveillance program for upper-extremity musculoskeletal disorders (UE-MSD) implemented by the French Institute for Public Health Surveillance in the Pays de la Loire region includes information on CTS, personal/medical factors and exposure to work-related factors (i.e., biomechanical, psychosocial and work organization factors) in workers of various industry sectors and occupations. Our aim in this study was to assess the effects of personal/medical factors and work-related factors on the incidence of CTS in the working population, with a special focus on factors related to work organization.   METHODS   This prospective study was based on two successive surveys of a large sample of workers in the French Pays de la Loire region, gathered between 2002 and 2005 and then between 2007 and 2010 (Roquelaure et al., 2006). The region contains 5.6% of the French working population, and its diversified socioeconomic structure is close to that of France as a whole (Ha et al., 2007).  At the time of the first survey, all French salaried workers, including temporary and part-time workers, underwent a regularly scheduled mandatory health examination by an occupational physician (OP) in charge of the medical surveillance of a group of companies. Between 2002 and 2005, 83 OPs (18% of OPs of the region) participated in the study. They were representative of the region's OPs in terms of working time and geographic and economic sectors covered (16). Subjects were selected at random, following a two-stage sampling procedure: first, 15–45 half-days of scheduled examinations for each OP were chosen for sampling by the investigators. Then, using random sampling tables, each OP included 1 out of 10 workers from the schedule on the half-days of worker examinations being considered. A total of 3710 workers (2161 men (58.2%) with mean age 38.5 years (standard deviation: 10.4), and 1549 women (42.8%), mean age 38.9 years (standard deviation: 10.3)) were included. The workers came from numerous companies and the distribution of occupations in the study sample was close to that of the regional workforce (Table 1 ) (16).  The workers first surveyed between 2002 and 2005 were reassessed between 2007 and 2010. Retired people, those on parental leave or long-term sick leave and those currently unemployed were excluded. Several reminders were sent out to all Occupational Medicine Departments, and then to each OP currently responsible for the medical surveillance of at least one worker of the cohort. For workers who had changed OP, the research team systematically contacted the last OP responsible for their medical surveillance.  The presence of non-specific wrist pain during the preceding 12 months and the preceding 7 days was identified using the Nordic style questionnaire (Hagberg et al., 2005). In cases of upper-limb symptoms occurring during the preceding 12 months, a physical examination was performed by the OP using a standardized clinical procedure that strictly applied the methodology and clinical tests of the ‘European Consensus Criteria Document for the Evaluation of the Work-relatedness of MSDs’ to diagnose MSD (Sluiter et al., 2001). Each OP received guidelines describing the clinical procedure (including diagnostic criteria charts and photographs of clinical tests) and underwent a 3-h training program to standardize physical examinations.  Symptom criteria for CTS were the presence of symptoms on the day of the medical examination (or for at least 4 days during the preceding 7 days) including intermittent paresthesia or pain in at least two of the first three digits; either of these also being present at night (causing pain in the palm, wrist, or radiating proximal to the wrist). The criteria for physical examination signs criteria were positivity of at least one of the following tests during the physical examination: flexion and compression test, carpal compression test, Phalen's test and Tinel's test. The case definition of CTS used in this study was based on symptoms only (“symptomatic CTS”), whether physical examination signs were positive or not. The definition of CTS based on both symptoms and physical signs was used only for complementary analyses.  Known or potential risk factors for hand–wrist disorders were grouped into four groups: (1) personal/medical factors, and three categories of work-related risk factors including (2) organizational, (3) biomechanical and (4) psychosocial work-related factors (Hagberg et al., 2005; Bongers et al., 2006; Palmer et al., 2007; van Rijn et al., 2009). The personal and work-related factors during a typical workday in the preceding 12-month period were assessed at baseline using a self-administered questionnaire, while medical factors were evaluated by interview during the physical examination at baseline.  Age, obesity, hand dominance, thyroid disorders. Age was considered as continuous variable, after verification of the linearity of the logit, and we calculated odds ratios for a one-year increment in age.  The factors related to work organization studied were: time constraints (paced work, work pace dependent on automatic rate, colleagues' work, quantified targets, customers' demands, permanent controls or surveillance), overtime hours, work with temporary workers, lack of prior information regarding the amount of work to be done each day, variable weekly workload and payment on a piecework basis.  The biomechanical factors were assessed as a whole (without hand by hand analysis): use of vibrating hand tools (≥2 h/day), exposure to cold temperature (≥4 h/day), holding tools/objects in a pinch grip (≥2 h/day), extreme wrist bending posture (≥2 h/day), pressing with palm base (≥2 h/day) and force over 5 on a visual analog scale (0–9). A combined variable into three categories was created with the biomechanical factors listed above: no exposed, exposed to one factor, exposed to two factors or more.  Psychosocial work factors were assessed using the validated French version of Karasek's «Job Content Questionnaire» (JCQ) (Niedhammer, 2002) and the median scores of the national French SUMER study (Niedhammer et al., 2006).  The outcome was defined per subject, and therefore bilateral cases of CTS counted as one disorder, not two. The relationships between CTS and potential risk factors were studied by binary logistic regression modeling.  A three-level process was followed until a final model was selected. In stage 1, analyses were performed with each of the potential explanatory variables adjusted for gender, and non-significant variables (p-value ≥ 0.20) were excluded from further analyses, except for age which was forced into all models. In stage 2, the independent variables not excluded in stage 1 were grouped into the above four groups of potential determinants. Backward multivariate logistic regression models were then used for each of the four groups of factors with age forced into the model. Only significant variables (p-value < 0.10) were retained after this stage. In stage 3, all remaining variables were included in a global multivariate logistic regression model until a final model was selected; only significant variables with a p-value < 0.10 were retained. A factor was considered to be a confounder when its removal changed the estimate of the beta coefficients for at least one parameter by more than 10%. The goodness of fit of the logistic model was determined by the Hosmer and Lemeshow test (2000). A sensitivity analysis was also performed for CTS defined by the occurrence of symptoms and positive physical examination signs.  All analyses were performed with the statistical software package SAS (version 9.4: SAS Institute. Inc., Cary. NC. US).  Each subject provided informed written consent to participation in this study at baseline and the study received approval from France's National Committee for Data Protection (Commission Nationale de l'Informatique et des Libertés), first in 2001, and then in 2006.   RESULTS   Of the 83 OPs who participated at baseline, 60 surveyed at least one of the 3710 workers between 2007 and 2010. Of the OPs who did not participate in the baseline study, 94 became responsible for the medical surveillance of at least one worker and 85 agreed to participate. A total of 1228 workers were excluded (death, retirement, parental leave, long-term sick leave, etc.). Of the 2482 remaining workers, 23 refused to participate and 848 did not undergo the second physical examination because they had no mandatory examination scheduled between the time the investigator learned that he was responsible for a worker and the end of the follow-up period. Finally, 1611 (64.9%) were re-examined (Fig. 1 ).  The follow-up rate did not differ with gender (42.6% for men vs. 44.5% for women) or baseline occupational category. However, it increased with age (until 44 years for men and 49 years for women) and with the length of service in the initial job. Fewer temporary workers and workers in the agriculture sector were re-examined.  The following analyses were based on 1532 workers (884 men and 648 women) without CTS at baseline and without a missing value for the diagnosis of CTS (Fig. 1). The men worked mainly in the manufacturing industry and services sectors as skilled and unskilled blue collar workers, and women mainly in the services sector as low-grade white collar workers (Table 1).  Fifty-nine (21 men and 38 women) incident cases of “symptomatic CTS” (3.9% (2.9–4.8)) were diagnosed among the 1532 workers without CTS at baseline. The incidence of “symptomatic CTS” among workers without CTS at baseline was higher in women than men (5.9% [95% CI 4.1–7.7] vs. 2.4% [95% CI 1.4–3.4]; p < 0.001) and varied according to occupational category and industry sector (Table in Appendix A). Physical signs were also present in 11 men (1.2% [95% CI 0.6–2.2]) and 25 women (3.9% [95% CI 2.4–5.3]). “Symptomatic CTS” was bilateral in 26 cases (44%), and most unilateral cases involved the right or dominant hand (74%). No difference was observed between unilateral and bilateral “symptomatic CTS” according to personal/medical factors and work-related factors.  The Table in Appendix B summarizes the distribution of the main factors studied according to occupational category. As shown in Table 2 , bivariate analyses showed the association of “symptomatic CTS” with several factors related to personal/medical characteristics, work organization and biomechanical constraints but no psychosocial factors.  The multivariate analyses showed an association between “symptomatic CTS” and both personal/medical factors and work-related factors (Table 3 ). The work-related factors included biomechanical and organizational factors, but no psychosocial factors. The risk of CTS was higher for women (OR = 2.9 [1.7–5.2]), and increased linearly with age (OR = 1.04 [1.00–1.07] for 1-year increment), but not with obesity. The risk of CTS was also higher in case of exposure to two or more biomechanical factors. As shown in Table 3, two characteristics of the work organization remained in the multivariate risk model after adjustment for the personal/medical factors and biomechanical factors: payment on a piecework basis (OR = 2.0, 95% CI 1.1–3.5) and work pace dependent on automatic rate (OR = 1.9, 95% CI 0.9–4.1).  The sensitivity analyses showed that the risk model for the 36 cases of CTS defined by symptoms and CTS defined by both symptoms and positive physical signs was similar and highlighted the same two factors related to the work organization: payment on a piecework basis (OR = 3.0, 95% CI 1.5–5.9) and work pace dependent on automatic rate (OR = 2.3, 95% CI 1.0–5.6).   DISCUSSION   Our prospective study showed that several factors related to the work organization were associated with CTS, after adjustment for personal/medical factors and biomechanical work-related risk factors.  In terms of personal factors, a higher incidence of CTS was observed in women, in agreement with previous longitudinal studies in the working population (Nathan et al., 2005; da Costa and Vieira, 2010; Silverstein et al., 2010; Dale et al., 2013; Harris-Adamson et al., 2013). The risk of incident CTS, as observed at baseline among the same sample of workers, increased linearly with age (Rigouin et al., 2013). This agrees with clinical reports of a higher prevalence of CTS in patients aged 40–60 years (Stevens et al., 1992; Atcheson et al., 1998) and longitudinal surveys in the working population (Harris-Adamson et al., 2013). However, other longitudinal studies of industrial and clerical workers did not find such an association (Nathan et al., 2005; Gell et al., 2005; Werner et al., 2005).  No association was observed with obesity, contrary to several longitudinal surveys (Roquelaure et al., 2001a; Becker et al., 2002; Nathan et al., 2005; Harris-Adamson et al., 2013). The lack of association could probably be explained by the low statistical power of the study. Due to the small number of cases, we could not study any possible association of CTS with general diseases, such as diabetes mellitus (Atcheson et al., 1998; Becker et al., 2002) or rheumatic arthritis (Palmer et al., 2007).  The main result of the study was the association of CTS with factors related to the work organization. Such association remained statistically significant after adjustment for the main personal/medical and biomechanical risk factors. This was observed not only for symptomatic CTS, but also for CTS defined more strictly (symptoms and positive signs on physical examination). The biomechanical factors considered as potential confounders in the logistic model are known to increase the risk of CTS: use of hand-held vibrating tools, wrist deviation, high force of handgrip or pinch grip (Palmer et al., 2007; van Rijn et al., 2009; Barcenilla et al., 2012), external pressure on the base of the hand (Leclerc et al., 1998) and exposure to cold environment or products (Chiang et al., 1990; Werner, 2006).  Payment on a piecework basis compared to payment according to working hours increases the risk of CTS by two or three-fold according to the definition of the outcome. With this mode of payment, the salary is determined by the number of objects made or tasks completed. This method of payment has been reported in low-paid manual industries (Lacey et al., 2007) known to be at high risk of CTS, namely garment blue-collar workers (Wang et al., 2005), agricultural (Roquelaure et al., 2001b) and temporary workers (Roquelaure et al., 2012). We previously showed that payment on a piecework basis for pruning was an independent risk factor for hand paresthesia in Champagne vineyard workers (Roquelaure et al., 2001b). Piece rate wages encourage employees to work faster and thus to increase the mechanical load applied on the hand–wrist structures. These workers are more likely to carry on with their work despite injury or symptoms of the hand and wrist. However, we cannot exclude the possibility that indirect factors could account for this association, namely lower socioeconomic status and higher psychological distress due to job insecurity (Lacey et al., 2007).  The study also found an association between CTS and exposure to work pace dependent on automatic rate. Such paced work is characteristic of the work organization in the manufacturing and meat processing industries, involving assembly line workers performing highly repetitive tasks and jobs organized according to the Taylor principles of work (Johansson et al., 2010), that are known to increase the risk of CTS (van Rijn et al., 2009; Dempsey et al., 2010). In terms of other modalities of work pace, we observed an association (univariate analyses) between work pace dependent on colleagues' work and quantified targets and CTS, but the associations were not statistically significant after adjustment for potential confounders.  The follow-up study did not confirm the previous cross-sectional study (Rigouin et al., 2013) concerning the increased risk of CTS in the case of work requiring overtime hours. Overtime might reflect high levels of time pressure and workload that could increase the mechanical load applied to the hand/wrist region, but little evidence is available in the literature (Trinkoff et al., 2006; Caruso and Waters, 2008). Long working hours and overtime hours were found to be associated with increased arm/hand discomfort in 260 Swedish visual terminal workers, after adjustment for potential confounders (Bergqvist et al., 1995). In our study, no relationship was observed between CTS and other characteristics of the work organization, such as job rotation between several workstations through the working week, and work with temporary workers.  When the psychosocial factors were considered, no association was found with any dimension of the “demand-control-support” model of stress at work. This contrasts with findings among automobile assembly workers (Werner et al., 2005), and above all with the previous cross sectional part of the study showing associations of CTS with low skill discretion among men and high levels of psychological demand among women (Rigouin et al., 2013). However, according to recent systematic reviews of literature, reports on psychosocial risk factors for CTS remain conflicting (van Rijn et al., 2009; da Costa and Vieira, 2010).  The study did not find any association of CTS with keyboard or computer work in these workers exposed to various working constraints in various industry sectors. This could be explained by the small number of workers performing highly repetitive clerical tasks. Despite this limitation, our result agrees with systematic literature reviews stating that the evidence is insufficient to conclude that computer work (mouse and keyboard) causes CTS (Palmer et al., 2007; Thomsen et al., 2008; van Rijn et al., 2009; Andersen et al., 2011).  The study presents several limitations. A total of 56.6% of the baseline cohort could not be followed up for physical examination. Of these, 58.5% were no longer being monitored by any OP of the network because they had left their baseline jobs without informing their OP. In some cases, their OP had refused to participate. The follow-up period coincided with a major economic crisis in the region between 2008 and 2009, during which the regional salaried workforce decreased by 3.4% and that of temporary employment agencies even by 33.7% according to the French Economic Institute (INSEE, 2010).  The lowest participation rate was among young workers, workers in temporary employment at baseline and those with a short length of service at baseline. This was to be expected because of the difficulty of following up young workers in insecure employment. This was amplified by the economic crisis which strongly affected temporary employment and younger workers. On the whole, workers with a risk factor for UE-MSD at baseline were less often available for the second physical examination, even though workers in the industrial sector in France have more frequent mandatory physical examinations. We suspect that the economic crisis may have excluded from work (and from follow-up) workers most exposed to the risk of UE-MSDs, including workers in the manufacturing industry. A study on the impact of loss to follow-up in epidemiological studies on UE-MSDs (Bildt et al., 2001) found that the differences in the characteristics between participants and those lost to follow-up did not influence the risk ratios for associations between exposure factors for UE-MSDs and UE-MSD status. We therefore believe that there was no major selection bias associated with the quality of the follow-up.  This study was nested in a surveillance program for MSDs. CTS was assessed clinically by trained OPs using a rigorous physical examination including standardized provocation tests (Sluiter et al., 2001). In this paper, the case definition used was based only on symptoms and did not require any positive examination sign or nerve conduction study. This was useful from an epidemiological surveillance point of view. However, it is probable that several workers suffering from CTS symptoms did not have actual slowing of the median nerve (Gerr and Letz, 1998). Nevertheless, a recent review by Palmer et al. (2012) concluded that in population-based etiological research, simple case definitions of distal upper limb musculoskeletal disorders should normally suffice. Furthermore, the comparison of different case definitions of CTS in a large US cohort, including the one we used in the present study (Sluiter et al., 2001), and definition including nerve conduction study (Rempel et al., 1998), showed a fairly good agreement between different case definitions, even those which only included symptoms. This, in addition to sensitivity analysis, suggests that the results can be compared across different research studies of risk factors for CTS (Descatha et al., 2011).  Due to cost and time limitations, direct exposure measurements by observation were not possible in this surveillance program. We used a self-administrated questionnaire to assess the work-related factors, which is a common surveillance technique. Questions were asked regarding a typical workday in the preceding 12-month period to limit recall errors (Miranda et al., 2006). Only assessment of the overall job level was performed and no task by task analyses were undertaken in cases of multitask activities due to time limitation. Awkward postures were presented in picture form to facilitate workers' understanding and increase the validity of self-assessment of posture. Furthermore, as far as possible, standardized and validated instruments, such as the European consensus for biomechanical factors and the Karasek Job Content Questionnaire for psychosocial factors were used.  In conclusion, this study showed the multifactorial origin of incident CTS and highlighted a limited number of personal/medical factors and work-related risk factors. Among work organizational factors, payment on a piecework basis and work pace dependent on automatic rate were associated with CTS. The importance of these factors is not diminished by the relative impact of biomechanical factors, such as exposure to pressing with the base of the palm and cold temperature. The study confirms that in addition to mechanical exposure, work organizational constraints should be an important target for strategies for the prevention of CTS in the working population.  The Pays de la Loire study received the approval of the French National Committee for Data Protection (CNIL: Commission Nationale Informatique et Liberté) and was supported by the French Institute for Public Health Surveillance, Saint-Maurice, France (Grant 9/25/2002–5 “réseau expérimental de surveillance des troubles musculo-squelettiques”) and the French National Research Agency (ANR-Grant SEST-06-36).  The authors declare that they have no conflict of interest.   ACKNOWLEDGMENTS   We thank the occupational physicians involved in the sentinel network: Doctors Abonnat, Adam, Addou, Agullo, Ansaloni, Aubrun, Banon, Bardet, Barraya, Beaurepaire, Becquemie, Berthelot, Bertin, Bertrand, Bidron, Biton, Biziou-Fouere, Bizouarne, Boisse, Bonamy, Bonneau, Bouchet, Bouguer, Bourrut-Lacouture, Bourven, Bradane, Breton, Bricaud, Caillon, Camer, Cesbron, Chabot, Charlon, Chevalier, Chisacof, Chotard, Clement dit Pontieu, Compain, Coquin-Georgeac, Cordes, Cormier, Couet, Coutand, Da Costa, Dachert, Dadourian, Danielou, Darcy, Davenas, De Lansalut, De Lescure, Diquelou, Dopsent, Dubois, Dufrenne-Benetti, Dupas, Durand, Durand-Perdriel, Evano, Fache, Faline, Fontaine, Fosse, Frampas-Chotard, François, Garrabe, Gasseau, Giffard, Girard, Girardin, Guerin, Guessard, Guillaumin, Guillier, Guillimin, Guinel, Harinte, Harrigan, Hefti, Herrouet, Herson, Hervio, Hirigoyen, Houssin, Husquin, Jahan, Jarry, Jube, Kalfon, Kergresse, Khouri, Krai, Labraga, Laine, Laine-Colin, Lamotte, Lasnier, Laventure, Le Clerc, Le Dizet, Le Mauff, Lechevalier, Lecompte, Ledenvic, Leroux, Leroy-Maguer, Levrard, Levy, Ligeard, Logeay, Louineau, Lourtis, Lucas, Maeker, Maison, Mallet, Marquiset, Martin, Martin-Laurent, Mazoyer, Meritet, Meyer, Michel MC, Michel R, Migne-Cousseau, Moisan, Morvan, Mouchet, Moui, Nivet, Page, Parrot, Patillot, Perou, Pierfitte, Pinaud, Pineau, Pizzalla, Plessis, Plouhinec, Pocreaux, Prod'homme, Puichaud, Quince, Rabjeau, Raffray, Riberot, Riou, Robin, Robin-Riom, Roesch, Rouault, Roussel, Roux, Russu, Saboureault, Schlindwein, Soulard, Souvre-Debray, Spiesser, Thomas, Thomasset, Thomson, Tillette, Treillard, Tripodi, Verrier, Voisin.     Table 1A  Distribution of cases of symptomatic CTS according to occupational category and industry sector.          (N = 1532, n SCC = 59)    N   n CTS  %      Occupational category    Craftsmen, salesmen, self-employed (PCS 21–23, 31) 9 0 0.0   Professionals (administrative, managerial & technical occupations) (PCS 33–38) 105 2 1.9   Administrative intermediate occupations (PCS 42, 45–46) 133 1 0.8   Nursing, health & social activities (PCS 43) 69 3 4.4   Technicians, associate professional, supervisors (PCS 47–48) 158 3 1.9   Government and public service employees (PCS 52–53) 138 10 7.3   Employees of corporate administrative services (PCS 54) 154 6 3.9   Trade and commerce employees (PCS 55) 85 2 2.4   Personal service employees (PCS 56) 51 2 3.9   Skilled industrial blue collar worker (PCS 62) 168 2 1.2   Skilled craft blue collar worker (PCS 63) 106 7 6.6   Drivers (PCS 64) 52 1 1.9   Material handlers (PCS 65) 52 1 1.9   Unskilled industrial blue collar worker (PCS 67) 200 16 8.0   Unskilled craft blue collar worker (PCS 68) 40 2 5.0   Unskilled agricultural blue collar worker (PCS 69) 8 1 12.5         Industry sector    Agriculture (NAF 01) 13 2 15.4   Food products and beverages (NAF 14–15) 123 4 3.3   Shoes, textiles, clothing (NAF 17–19) 34 4 11.8   Other manufacturing industries (NAF 20–28, 34–37) 297 9 3.0   Computer, electric, electronic, medical, precision equipment (NAF 29–33) 114 3 2.6   Construction, electricity, gas and water supply (NAF 40–45, 90) 86 4 4.7   Sales, whole sale trade, retail trade (NAF 50–52) 183 8 4.4   Hotel and restaurant (NAF 55) 24 1 4.2   Transport, storage and communication (NAF 60–64) 96 2 2.1   Insurance, financial intermediation, real estate activities (NAF 65–76) 111 2 1.8   Labor recruitment, temporary work, industrial cleaning (NAF 74) 92 3 3.3   Public administration, defense, social insurance activities, education (NAF 75–80) 164 6 3.7   Health and social activities (NAF 85, 91) 173 11 6.4   Recreational activities, personal services activities (NAF 92–95) 21 0 0.0           Table 1B  Distribution of exposure to the main work-related risk factors according to occupational category.                              Occupational category, n (%)  N  Paced work Work pace dependent on automatic rate Work pace dependent on customers' demands Work pace dependent on the colleagues' work Work pace dependent on quantified targets Work pace dependent on permanent controls Overtime hours Variable weekly workload No prior knowledge of the workload Payment on a piecework basis Work with temporary workers Job task rotation Use of vibrating hand tools (≥2 h/day) Exposure to cold temperature (≥4 h/day) Holding tools/objects in a pinch grip (≥2 h/day) Extreme wrist bending posture (≥2 h/day) Pressing with the palm base (≥2 h/day) High hand force (VAS > 5) High psychological demand Low skill discretion Low decision authority Low supervisor support Low colleagues support     Professionals (administrative, managerial & technical occupations) (PCS 33–38)  105   1 (1.0)   1 (1.0)   73 (70.2)   32 (31.1)   42 (41.2)   16 (15.7)   94 (90.4)   82 (78.1)   11 (10.5)   28 (26.7)   21 (20.0)   29 (30.2)   0 (0.0)   0 (0.0)   2 (1.9)   10 (9.5)   3 (2.9)   2 (1.9)   85 (81.7)   16 (15.2)   5 (4.8)   32 (30.5)   8 (7.7)         Intermediate occupations  362   10 (2.8)   14 (3.9)   212 (58.9)   98 (27.4)   154 (43.0)   77 (21.5)   261 (72.7)   210 (58.2)   30 (8.3)   14 (3.9)   81 (22.4)   116 (34.7)   17 (4.7)   8 (2.2)   16 (4.4)   65 (18.2)   10 (2.8)   17 (4.8)   206 (57.4)   116 (32.4)   68 (18.8)   132 (37.0)   35 (9.8)     Nursing, health & social activities (PCS 43) 69 4 (5.9) 6 (8.8) 42 (61.8) 19 (27.9) 11 (16.4) 20 (29.4) 47 (68.1) 35 (51.5) 2 (2.9) 9 (13.2) 19 (27.5) 29 (43.3) 2 (2.9) 1 (1.5) 3 (4.4) 12 (17.7) 2 (2.9) 7 (10.6) 38 (55.9) 19 (28.4) 15 (21.7) 23 (33.8) 4 (5.8)    Administrative intermediate occupations (PCS 42, 45–46) 133 2 (1.5) 3 (2.3) 82 (61.7) 23 (17.6) 51 (38.6) 24 (18.2) 86 (65.7) 78 (58.7) 8 (6.0) 29 (21.8) 26 (19.6) 35 (29.2) 3 (2.3) 1 (0.8) 3 (2.3) 15 (11.4) 2 (1.5) 1 (0.8) 73 (55.7) 50 (38.2) 21 (15.8) 46 (35.4) 13 (10.0)    Technicians, associate professional, supervisors (PCS 47–48) 158 4 (2.6) 5 (3.2) 87 (55.4) 56 (35.7) 91 (58.0) 33 (21.0) 126 (80.3) 97 (61.4) 19 (12.0) 41 (27.0) 35 (22.2) 52 (35.9) 12 (7.6) 6 (3.8) 10 (6.4) 38 (24.4) 6 (3.8) 9 (5.8) 94 (59.5) 45 (28.5) 31 (19.6) 62 (39.5) 18 (11.5)        Low-grade white collar workers  428   25 (6.1)   9 (2.2)   220 (52.0)   79 (19.3)   111 (27.1)   82 (19.9)   235 (55.4)   195 (46.1)   22 (5.1)   9 (2.2)   91 (21.3)   133 (32.6)   16 (3.8)   8 (1.9)   23 (5.4)   98 (23.1)   8 (1.9)   48 (11.4)   191 (45.4)   262 (62.1)   167 (39.5)   150 (35.9)   77 (18.4)     Government and public service employees (PCS 52–53) 138 12 (9.0) 5 (3.8) 53 (39.6) 34 (25.8) 38 (28.6) 34 (25.6) 65 (47.8) 63 (46.7) 7 (5.1) 21 (15.7) 32 (23.2) 49 (37.1) 8 (5.8) 1 (0.7) 6 (4.4) 29 (21.3) 2 (1.5) 17 (12.5) 54 (40.0) 91 (67.4) 65 (48.5) 56 (42.4) 26 (19.4)    Employees of corporate administrative services (PCS 54) 154 0 (0.0) 0 (0.0) 89 (58.2) 25 (16.7) 41 (27.0) 25 (16.6) 83 (54.3) 68 (44.2) 4 (2.6) 17 (11.4) 28 (18.2) 35 (23.5) 2 (1.3) 1 (0.7) 7 (4.6) 16 (10.4) 3 (2.0) 3 (2.0) 77 (50.0) 87 (57.6) 49 (31.8) 49 (31.8) 24 (15.8)    Trade and commerce employees (PCS 55) 85 9 (11.4) 2 (2.5) 52 (61.2) 9 (11.4) 15 (19.7) 17 (21.5) 52 (61.9) 28 (33.3) 8 (9.4) 22 (26.2) 23 (27.1) 27 (33.3) 1 (1.2) 6 (7.1) 8 (9.5) 23 (27.1) 2 (2.4) 18 (21.2) 38 (45.2) 56 (65.9) 34 (40.0) 29 (34.1) 16 (18.8)    Personal service employees (PCS 56) 51 4 (8.2) 2 (4.1) 26 (51.0) 11 (22.5) 17 (34.7) 6 (12.2) 35 (68.6) 36 (72.0) 3 (5.9) 10 (22.7) 8 (15.7) 22 (47.8) 5 (10.0) 0 (0.0) 2 (4.0) 30 (61.2) 1 (2.0) 10 (20.0) 22 (45.8) 28 (54.9) 19 (38.0) 16 (34.0) 11 (23.4)        Skilled blue collar workers (BCW)  378   51 (13.9)   59 (16.0)   138 (37.1)   113 (30.9)   215 (58.1)   111 (30.2)   216 (57.9)   207 (54.9)   52 (13.8)   59 (16.0)   115 (30.5)   147 (39.5)   101 (26.7)   35 (9.3)   35 (9.3)   167 (45.0)   54 (14.4)   113 (29.9)   144 (38.1)   225 (59.7)   127 (33.7)   150 (39.9)   85 (22.7)     Skilled industrial BCW (PCS 62) 168 29 (17.5) 46 (27.5) 40 (24.0) 58 (35.2) 116 (69.9) 65 (38.9) 84 (50.6) 82 (48.8) 21 (12.6) 24 (14.9) 70 (41.9) 74 (44.6) 45 (26.8) 8 (4.8) 21 (12.5) 77 (46.7) 20 (12.0) 39 (23.2) 65 (38.7) 120 (71.4) 67 (39.9) 81 (48.5) 42 (25.2)    Skilled craft BCW (PCS 63) 106 9 (8.6) 5 (4.7) 49 (46.7) 25 (23.8) 44 (41.9) 22 (21.0) 67 (63.8) 52 (49.1) 20 (18.9) 24 (23.8) 16 (15.1) 37 (35.2) 47 (44.3) 12 (11.3) 10 (9.5) 61 (59.2) 27 (25.7) 41 (38.7) 36 (34.0) 37 (34.9) 29 (27.6) 33 (31.4) 18 (17.1)    Drivers (PCS 64) 52 4 (8.3) 3 (6.4) 33 (67.4) 9 (19.2) 28 (56.0) 9 (19.2) 41 (78.9) 46 (88.5) 7 (13.5) 21 (41.2) 10 (19.2) 9 (18.0) 3 (5.8) 10 (19.2) 2 (3.9) 12 (23.5) 4 (7.7) 18 (34.6) 24 (46.2) 37 (71.2) 16 (30.8) 23 (44.2) 15 (29.4)    Material handlers (PCS 65) 52 9 (18.4) 5 (10.4) 16 (31.4) 21 (42.9) 27 (55.1) 15 (30.6) 24 (48.0) 27 (52.9) 4 (7.7) 9 (18.0) 19 (36.5) 27 (52.9) 6 (11.5) 5 (9.6) 2 (3.9) 17 (32.7) 3 (5.8) 15 (28.9) 19 (36.5) 31 (60.8) 15 (28.9) 13 (25.0) 10 (19.2)        Skilled blue collar workers (BCW)  248   51 (21.3)   65 (26.8)   53 (22.1)   92 (38.2)   160 (65.8)   78 (32.4)   88 (35.9)   112 (45.3)   28 (11.3)   65 (26.8)   106 (42.7)   111 (45.7)   55 (22.2)   25 (10.1)   42 (16.9)   140 (56.9)   26 (10.5)   80 (32.4)   108 (43.7)   196 (79.4)   149 (60.6)   97 (39.8)   50 (20.6)     Unskilled industrial BCW (PCS 67) 200 51 (26.4) 63 (32.3) 42 (21.9) 81 (42.0) 143 (73.3) 74 (38.1) 67 (34.0) 88 (44.2) 20 (10.0) 58 (29.4) 95 (47.5) 95 (48.2) 40 (20.0) 19 (9.5) 39 (19.5) 116 (58.6) 23 (11.6) 68 (34.2) 94 (47.0) 159 (79.9) 130 (65.0) 79 (40.1) 42 (21.3)    Unskilled craft BCW (PCS 68) 40 0 (0.0) 1 (2.5) 10 (25.0) 10 (25.0) 13 (32.5) 2 (5.1) 14 (35.0) 21 (52.5) 7 (17.5) 4 (10.3) 7 (17.5) 13 (33.3) 15 (37.5) 3 (7.5) 2 (5.0) 19 (47.5) 3 (7.5) 11 (27.5) 11 (27.5) 31 (77.5) 13 (33.3) 16 (41.0) 7 (18.4)    Unskilled agricultural BCW (PCS 69) 8 0 (0.0) 1 (12.5) 1 (12.5) 1 (12.5) 4 (50.0) 2 (25.0) 7 (87.5) 3 (37.5) 1 (12.5) 2 (25.0) 4 (50.0) 3 (42.9) 0 (0.0) 3 (37.5) 1 (12.5) 5 (62.5) 0 (0.0) 1 (12.5) 0 (0.0) 6 (75.0) 6 (85.7) 2 (25.0) 1 (12.5)         REFERENCES", "highlights": "The study aimed to determine the risk factors for incident carpal tunnel syndrome (CTS) in a large working population, with a special focus on factors related to work organization. In 2002–2005, 3710 workers were assessed and, in 2007–2010, 1611 were re-examined. At baseline all completed a self-administered questionnaire about personal/medical factors and work exposure. CTS symptoms and physical examination signs were assessed by a standardized medical examination at baseline and follow-up. The risk of “symptomatic CTS” was higher for women (OR = 2.9 [1.7–5.2]) and increased linearly with age (OR = 1.04 [1.00–1.07] for 1-year increment). Two work organizational factors remained in the multivariate risk model after adjustment for the personal/medical and biomechanical factors: payment on a piecework basis (OR = 2.0, 95% CI 1.1–3.5) and work pace dependent on automatic rate (OR = 1.9, 95% CI 0.9–4.1). Several factors related to work organization were associated with incident CTS after adjustment for potential confounders."}