{"id": "S000368701400091X", "article": "MAIN-TITLE Sex differences in lifting strategies during a repetitive palletizing task   HIGHLIGHTS          We examine the difference between three groups of workers (expert males, novice males and females).      The workers had to transfer 24 15-kg boxes from one pallet to another at a self-paced and then at an imposed pace.      The patterns of interjoint coordination were different between expert males and females during lifting.      The lifting strategy of females likely stretches spine passive tissues, which put them at greater risk of back injuries.          KEYPHRASES   Manual material handling  Lifting  Sex   Manual material handling (MMH) tasks have been associated with low back injuries in a large number of studies (Hoogendoorn et al., 1999; Kuiper et al., 1999; Lötters et al., 2003; National Research Council, 2001; da Costa and Vieira, 2010; Nelson and Hughes, 2009). The National Research Council (2001) indicated that heavy lifting shows the greatest risk for injury when loads are lifted from low heights, when the distance of the load from the body is large, and when the trunk assumes a flexed, asymmetric posture. The risk should decrease as the physical exposure to these factors also decreases. Our previous studies (Plamondon et al., 2010, 2012) demonstrated that expert male workers differed from novice male workers mostly in the posture-related variables, with experts more often adopting a recognized safe back posture. An extension of this work is to determine whether females work differently than males when lifting a given absolute load (in kg), as the load is not scaled to strength capabilities in work settings.  The large majority of studies on MMH are on male participants and it is not known if the findings can be extrapolated to females (Lindbeck and Kjellberg, 2001) considering they are smaller in size and not as strong as males. For instance, on average, a female's lifting strength ranges between 45 and 76% of a male's, depending on the measurements used (Kumar and Garand, 1992; Mital et al., 1997; Stevenson et al., 1990). According to Zhang and Buhr (2002), back and leg muscle strengths are two primary limiting factors of a person's lifting capacity.  Several studies have indicated that sex differences in anthropometry and strength could explain the differences in lifting styles. In the Li and Zhang (2009) study, males were more likely to use the back-preferred strategy, whereas females more often used the leg-preferred strategy. Furthermore, participants with a back-preferred strategy had more back strength than knee strength, whereas participants with the leg-preferred strategy had more knee strength than back strength. Marras et al. (2003) indicated that females adopted a lifting style that made more use of their hips, whereas much of the lifting motion for males was from the lumbar spine. According to these authors, females' greater dependence on the pelvis may be due to their limited strength capacity in the lumbar region. Also, males produced higher spine loads when performing identical heavy physical tasks. However, as males tolerate higher compressive forces than females, women were closer to their tolerance values and therefore at higher risk of injury. Davis et al. (2003) found that the only sex difference was for sagittal trunk flexion, males bending their trunk further (by about 5°) than females. Interestingly, for lifting close to the floor, the hips of females dominated and the lifting style resembled more of a squat lift than a stoop lift. Males also adopted more of a squat lifting style when close to the floor.   Lindbeck and Kjellberg (2001) emphasized the importance of interjoint coordination in the biomechanics of lifting. Several papers investigated the coordination between lower extremity joints and the back and found that as the load weight increased, the lumbar spine motion was lagging further behind the lower extremity joint motion. In other words, the knee extension proceeded sooner than the back extension as the load lifted was increased; or the lumbar spine extension was delayed with heavier loads (Davis and Troup (1965); Scholz, 1993a, 1993b; Scholz and McMillan, 1995; Burgess-Limerick et al., 1995).  Interjoint coordination appears to vary between sexes as well. Lindbeck and Kjellberg (2001) found that the hip-knee coordination was more in phase (synchronized) in females during a squat lift, the hip extension lagging more behind knee extension in males. This is surprising as females are generally weaker than males, but to take into account the differences in physical capacity between sexes, females were given less weight to lift (8.7 kg) than the males (12.8 kg). To control for sex differences in body size and strength, Albert et al. (2008) adjusted the weight of the load relative to the lifting capacity (20% relative load) as well as the height of the lift relative to the subjects' height. Their results revealed that there were no significant sex effects in the posture adopted at the start of the lift and in the lifting interjoint coordination. The common pattern disclosed by the interjoint coordination analyses was the trunk lagging behind the knee early in the lift. In a more recent study, Sadler et al. (2011), using principal component analyses, found no sex differences as regards to the lifting technique. However, the two load conditions in their study involved very light standardized loads (0% and 10% of maximum isometric back strength), which might not be challenging enough to reveal sex differences.  The body size and physical capacity of males and females are no doubt different, which has the potential to influence lifting strategies in the work setting, i.e., when load height and mass are not adjusted to the worker's body size and strength. How this is so is not very clear at this moment. There are very few studies that differentiate males and females in MMH, and the work context generally studied consists of sagittal lifts from the floor to a shelf. Moreover, the majority of the participants have no experience in MMH. Plamondon et al. (2010, 2014) published two studies on the difference between expert and novice male workers. We propose to extend this work with female workers having experience in MMH. This study aimed to investigate whether a challenging task of multiple depalletizing-palletizing would make female workers differ from their male counterparts (expert and novice workers). During this task, the workers had to continuously transfer 24 15-kg boxes from one pallet (depalletizing) to another (palletizing) at two different lifting frequencies: self-paced and imposed pace (9 lifts/min). It was hypothesized that the lifting style of female workers would be significantly different from that of males, as shown by measures of joint motions, back loading (L5/S1 moments) and interjoint coordination.   METHOD   The method used in this study is similar to the one used previously (Plamondon et al., 2014). Initially only males (experts and novices) were studied and subsequently, female workers were invited to do the same type of task. The study for both genders was divided into three experimental sessions, but only the second session, which specifically involved repetitive transfers of boxes from one pallet to another, is the object of the present paper. Most of the sections below present the main steps in the method used, which was already detailed in Plamondon et al. (2014). Only the most important elements are repeated here.  Initially, two groups of male subjects were recruited. The first group consisted of 15 male experts who met the following three criteria: a minimum of 5 years of experience; a low lifetime incidence of injuries (particularly to the back); and no injury in the year preceding the study. The second group consisted of 15 male novices meeting the following criteria: 3–6 months of handling experience and no incidence of injury in the year preceding the study. The third group was 15 females who originally had to meet the same criteria as our expert male workers. Each worker had to fill out the standardized Nordic questionnaire for the analysis of musculoskeletal symptoms (Forcier et al., 2001; Kuorinka et al., 1987) and had to meet the inclusion criteria. However, the recruitment of females was difficult and the criterion of a low lifetime incidence of back injury had to be dropped. Consequently, females having more lifetime injuries to the back were not classified as experts but as workers with experience. None of the subjects had musculoskeletal problems during the tests that could affect the normal performance of their work. Table 1 presents the subjects' main anthropometric characteristics. The female group differs from the males with regard to height and strength. These variables should therefore have some impact on the different biomechanical parameters. It should be noted that the three groups were significantly different with regard to experience, but all groups had experience in MMH (expert males ranged from 6.5 to 33 years; novice males from 1 month to 1.5 years; females from 4.8 to 13 years). The age of the novice workers was significantly lower than that of the two groups with experience (expert males and females).  All participants completed the informed consent forms approved by the Ethics Committee of the University of Sherbrooke (Faculty of Medicine and Health Science). The subjects were allowed at least one day of rest between sessions, and the three sessions were generally completed in less than 10 days.  The MMH task consisted for the males in transferring 24 15-kg boxes from one pallet (depalletizing) to another (palletizing), and back, five times over a period of 30 min (total box transfers: 240). The five-trip sequence was divided into two parts: the first part consisted of two round trips for all 24 boxes on the pallet (total of 96 boxes handled), performed at a rhythm the subject would use in an eight-hour day for this type of manual handling (self-paced). The second part (imposed pace) consisted of three round trips for all 24 boxes (total of 144 boxes) at a nine-box-per-minute rhythm to increase challenge and potentially fatigue. The females had to do the same first two round trips at the self-paced rhythm (96 boxes), but only one round trip at the imposed pace (48 boxes instead of 144 boxes for the males). A safety reason explains this choice as we did not know if the imposed pace would be too intense for the females and increase their risk of injuries. The height of each pallet was 16 cm and the box dimensions were 26 cm deep by 35 cm wide by 32 cm high. The subjects were instructed to remain on the force platform (Fig. 1 ) and to pile the boxes (total of 24) in a column stacking pattern 4 layers high (1st layer = 16 cm above the floor, 2nd = 48 cm, 3rd = 80 cm; 4th = 112 cm) by 6 boxes/layer (3 in the front row, 3 in the back row).  The description of the MMH task is as follows: at the signal of the experimenter, the worker started the depalletizing task (or lifting phase) by grasping the first box at the front of the top row. The choice of which box to lift (in the depalletizing task) and its destination position (in the palletizing task) was left up to the worker. The worker continued the transfer until all the boxes were moved to the destination pallet. Once finished, he immediately started to move them back to the first pallet, then repeated this until the round trips were completed. The transfer of boxes at the imposed pace was similar to the self-paced task with the exception that (1) the pace was controlled, with the subjects regularly informed if they were too fast or too slow.  Workers' localized muscular fatigue was evaluated three times during the experiment with a standardized isometric sub-maximal task using surface electromyography (EMG). In addition, the subject's perception of overall physical fatigue and of back muscle fatigue was assessed with a CR-10 Borg's scale (Borg, 1982).  Photogrammetric measuring systems, video cameras and an in-house force platform (1.90 m × 1.30 m) were used to collect the kinematic and kinetic data necessary for the use of a dynamic 3D linked-segment model to estimate the net moments at L5/S1. Fatigue was estimated by means of EMG (localized back muscle fatigue), heart rate and Borg's scale (perception of local and overall fatigue) (details in Plamondon et al., 2014).  At the beginning of the experiment, the participants were instructed about the importance of reproducing the technique they normally used in their work. No lifting technique was ever prescribed to the participants and no comments were given about the technique they used. The worker was asked to perform the self-paced transfer of boxes immediately followed by the task at the imposed pace of 9 lifts/min. The rest time between the end of the self-paced and the start of the imposed-pace transfer did not exceed 5 min. The state of physical fatigue for each subject was evaluated at the beginning and after each pace condition by means of a sub-maximal isometric task and a Borg's assessment.  The participants were instrumented for use of a dynamic 3D linked-segment model to estimate the net moments at L5/S1 expressed in the coordinate system of the pelvis (flexion-extension, lateral bending and torsion moments). The Grood and Suntay (1983) method was used to estimate 3D angular motion. The flexion/extension rotation is about the transverse axis of the pelvis (proximal segment), the torsion rotation is about the longitudinal axis of the trunk (distal segment), and the lateral bending rotation is about the floating axis normal to the two preceding axes.  Five transfers of 15-kg boxes (2 self-paced round trips and 3 imposed-pace round trips) were performed by the males and three transfers (2 self-paced round trips and 1 imposed-pace round trip) by the females. Considering the large number of data, it was decided to analyze only the last round trip of each pace with the 15-kg boxes. As there are two directions in a round trip, a going and a return, only the results in the going direction are presented here, which represented 2160 samples (45 subjects × 24 boxes × 2 paces). The going direction was broken down into two different phases: a lifting phase (depalletizing) and a deposit phase (palettizing). The lifting phase included a pre-lift (gripping), where the box is brought close to the subject without being lifted, and lifting of the box (take-off). The deposit phase begins after the lifting phase and continues to the deposit of the box until its final destination on the pallet. The duration of the flight phase (meaning the time during which the weight of the box was completely supported by the subject) was divided into two equal sections (time/2), such that the first section was an integral part of the lift and the second an integral part of the deposit.  The mean HRs were calculated for the two last goings. EMG fatigue includes the RMS and MF values of the right and left longissimus muscles for the three EMG tests. Borg's assessments were recorded, one after each EMG test.  Peak values were calculated in each phase (in the lifting phase and in the deposit phase) for the resultant moment at L5/S1 (i.e., the vector sum of the three moment components) and the asymmetrical moment (i.e., the vector sum of the lateral bending and torsion moment components). Also, at the instant of the peak resultant moment (during the lifting and the deposit phases), the following were calculated (for details, see Plamondon et al., 2014): occurrence of the peak resultant moment (interpretation: 0%–50% = % of flight time in the lifting phase; 51%–100% = % of flight time in the deposit phase), lumbar flexion angle, lumbar lateral bending angle, lumbar torsion angle, lumbar flexion angular velocity, trunk inclination, horizontal distance of the hands from the L5/S1 joints, and the right and left knee flexion angles. The lumbar flexion angle was also transformed to take into account the effect of age, since lumbar flexibility decreases with age (Troke et al., 2005; Intolo et al., 2009). Each subject's lumbar flexion angle was divided by his corresponding predicted maximum flexibility (data from Troke et al., 2005) to obtain a lumbar flexibility index. In addition, several other variables were calculated: task duration, pre-flight time, flight time, post-flight time, and the cumulative moment at L5/S1 estimated as the sum of the resultant moment during the flight time.  To take into account the anthropometric difference between males and females, the HAT (head + arms + trunk) weight moment from L5/S1 was used. The resultant moment, the asymmetrical moment and the cumulative moment were divided (normalized) by the HAT moment of the subject. Moreover, the horizontal distance of the hands from the L5/S1 joints was divided by the height of the subject.  Interjoint coordination, as assessed using relative phase angle (RPA) analyses (Burgess-Limerick et al., 1993, 1995; Albert et al., 2008), was studied during the lifting phase of each box transfer, from the floor level of the pallet exclusively (n = 24 lifts per subject). Relative phase can be defined as the relationship of the movement and relative timing between adjacent joint pairs (Albert et al., 2008). Relative phase variables were estimated between knee and hip (K–H; right and left), and between hip (right and left) and trunk (H-T). The method used was the one described in Burgess-Limerick et al. (1993). Only the rotation in the sagittal plane (in the flexion-extension plane) was considered here. The specific phase analyzed extends from −10% to 30% of the lifting phase (0% = take-off of the box from the floor; 50% = end of the lifting phase; 100% = end of the flight time). The 30% threshold was used because the subject generally completed the lifting of the box at that time and was about to start turning towards the destination pallet. RPAs were calculated by subtracting the phase angle of the distal joint from the phase angle of the proximal joint at each normalized time point. A difference of 0° indicates that the two segments are moving perfectly in phase whereas a difference of 180° indicates that the segments are perfectly out of phase. In our convention, a positive phase value indicates that the distal joint is leading the motion of the proximal joint, while a negative relative phase value indicates that the proximal joints are moving ahead of the distal joints. Maximum and minimum values of relative phase between joints were calculated and their occurrence expressed as a percentage of the flight time duration.  First, two-way mixed-model ANOVAs were applied to measure the effects of group (three groups: expert males, novice males and females) and pace (two paces: self-paced and imposed pace) on the fatigue parameters: Borg's assessment, heart rate and back muscle fatigue (EMG). Second, two four-way mixed-model ANOVAs were performed on the biomechanical variables extracted from the lifting phase and from the deposit phase. There were four independent variables: 1) Group (G) with three groups 2) height (H) of the boxes (four heights) 3) horizontal distance (D) of the boxes (two distances); and 4) pace (P) with two paces. The lifting phase (G, H lifting, D lifting and P) and the deposit phase (G, H deposit, D deposit and P) were analyzed independently. As the task duration, flight time and cumulative loading cover both phases, the vertical height (H) and horizontal distance (D) levels considered were, exceptionally, those of the lifting phase. As this study aimed to investigate whether a challenging MMH task would make female workers differ from their male counterparts (expert and novice workers), the main interest of this paper is about the group effect (G) and the dual interactions between: group and height (G × H); group and horizontal distance (G × D); and group × pace (G × P). Therefore it was decided to present only the data relating to these differences.  A one-way, repeated ANOVA was applied to measure the group effect on the maximum and minimum RPAs and their occurrence. The statistically significant variables were then used in a logistic regression to measure their accuracy in classifying subjects into their respective groups. Furthermore, the 24 RPA curves of each subject were classified with cluster analyses to identify similar and dissimilar patterns, using the medoid partitioning algorithm. The medoid of a cluster is defined as the object for which the average dissimilarity to all other objects in the cluster is minimal. Once the medoids are found, the data are classified into the cluster of the nearest medoid (NCSS software, version: 07.1.14; NCSS, Kaysville, UT, USA). Two methods of classification with medoids were used. The first was to find the most representative medoid (method: Spath, Objective Function: Mean Distance). To do so, the 24 patterns were partitioned into two clusters, and the medoid that characterized most of the patterns was chosen as the worker's most representative pattern. Then, all the representative medoids were used to classify the subjects into the appropriate group (experts, novices, females). A second method was to take the average of the 24 patterns as the worker's representative one, and then use the cluster's medoid to classify the subjects into the appropriate groups.  NCSS software (version: 07.1.14; NCSS, Kaysville, UT, USA) was used to process the statistical data. In order to be able to carry out parametric analyses, the data were transformed based on the fundamental law of probabilities (van Albada and Robinson, 2007) allowing normal distributions to be obtained according to the Wilk–Shapiro test. Also, to offset a violation of sphericity in the mixed-model measurement ANOVAs, the probability threshold was adjusted using the Geisser greenhouse epsilon correction factor. For all statistical tests, a significance level of p < 0.05 was used. Tukey–Kramer multiple pairwise comparisons were performed in the case of significant Group effects.   RESULTS   This paper is mainly on the differences between male and female workers and how these differences evolve through other MMH parameters (interactions with height, distance and pace). As the data between expert males and novice males are already published (Plamondon et al., 2014), those of the novice males were removed from some Figures. However, all statistical analyses include the data for the male novices and when necessary, their results are incorporated back into the text. Hereafter, the term “males” refers to both the expert and novice male groups.  Females were significantly slower in their lifting pace than males (Table 2 ), especially during the self-paced task where experts had a pace of 8.9 lifts/min in comparison to 7.3 lifts/min for females. The imposed-pace MMH task was significantly more demanding than the self-paced task, which led to a significantly higher HR and a higher perception of overall physical fatigue as well as perception of back muscle fatigue (Table 2), but no group differences were observed. Both an increase in the EMG amplitude and a decrease in the EMG median frequency of the back muscles were observed from the beginning to the end of the transfers, but no difference was found between the two pace conditions and no G × P interaction reached statistical significance. Overall, these results show that for all subgroups equally, there was some cumulative fatigue from the beginning of the transfer (rest) to the self-paced task, but the imposed pace did not further increase back muscle fatigue.  There was a significant difference in the task duration, as well as for both pre-flight and post-flight times, between expert and female workers, with females taking more time to complete the box transfers (Table 3 ). Interestingly, flight time was quite similar between males and females, but not the pre-flight and post-flight time. This indicates either that females may have found it more difficult to move the boxes on the pallets or they took the time to move the boxes closer to their trunk. In fact, the analysis of the significant G × D interactions (for task duration and flight time) reveals that females took more time when retrieving boxes from the rear of the pallet.  Differences between groups and double interactions (G × H, G × D and G × P) were examined for the peak resultant moments and corresponding variables. None of the G × P interactions were significant during the lifting phase, and only three variables during the deposit phase reached statistical significance, but were of minor importance. Therefore, it was decided not to report these interactions in Table 4 .  As expected, the peak resultant moment at L5/S1 was significantly lower in females (Fig. 2 ; Table 4) during the lifting and deposit phases. The significant G × H interactions (Table 4; lifting and deposit) were mainly due to the lower resultant moment in the experts in the upper positions (2, 3 and 4) compared to females (Fig. 2) and also to novices. Another interesting interaction, G × D (deposit), stemmed from the females, who differed from the males in having a smaller difference in resultant moment between the front and back row positions of the boxes. In other words, females adjusted better when the box was in the back row. When this resultant moment was normalized with the HAT moment (Table 5 ), there was no statistical difference between the three groups when lifting, though the normalized moment for the females and the novices showed a tendency to be higher than that of the experts. On deposit, this moment is statistically higher for the females than for the experts. Interactions were not appreciably different from those of the non-normalized resultant moment.  There proved to be major differences between the three groups of handlers in four categories of kinematic variables measured at the time of peak resultant moment (Table 4). First, trunk inclination from the vertical was significantly higher in females and novices, about 10° more than for experts. The same was true for the lumbar flexion angle, but the difference between females and experts was not significant (Fig. 3 ). Second, the box-L5/S1 horizontal distance was significantly lower in females than in novices and experts (i.e., than in males), by 7 cm and 3 cm respectively, and this was true when lifting as well as depositing the boxes (Fig. 4 ). When this horizontal distance was normalized for body size (subject's height), the females remained significantly closer to the boxes than the novices (Table 5). The G × D interaction observed with this variable stems from the females remaining closer to the box than the males when the box is lifted from or deposited in the back row on the pallet, compared to the front row. In addition, this interaction remained when the distance was normalized (Table 5). Third, the lumbar flexion angular velocity (8°/s) was significantly lower for females than for experts during lifting (14°/s) or for novices during deposit (12°/s). Fourth, knee bending angles showed significant G × H interactions during lifting, which are explained by experts bending their knees more than females or novices, but only when the load was on the floor (Fig. 5 ). At last, all groups showed small posture asymmetries when lifting or depositing the boxes, with lumbar torsion and lateral bending angles remaining less than 5° on average.  The peak asymmetrical moments were significantly lower in females (Table 4). Analyses carried out on normalized moments showed significantly lower moments in females, but relative to novices only (Table 5). However, normalization eliminated the difference when the boxes were deposited. The cumulative resultant moment was significantly lower in females (by about 30 Nms; Table 4) than novices but, once normalized, these moments became significantly higher in females than males (Table 5). In other words, females have to generate greater lumbar net loading, in relative terms.  Interjoint coordination analyses disclosed major differences between experts and females. First, before lifting the box from the floor, females had similar knee flexion than experts (Table 6 ; no differences) but at the time of the peak resultant moment, females had extended their knees considerably in comparison to the experts (24° more extension, Table 6). Second, the maximum and minimum values of the left and right knee-hip and hip-back RPA, as presented in Table 7 , show that females had significantly higher maximum amplitude of RPA than the experts (and sometimes the novices), regardless of the joint pair studied. This means that in most cases knee extension initially led hip extension and hip extension initially led lumbar vertebral extension, but for the females the deviation from perfectly in-phase (RPA = 0°) was significantly larger than the experts. In other words, women showed a more sequential pattern in their interjoint coordination than experts. Later in the cycle, it was the opposite patterns, the distal joint usually leading the proximal one. However, the differences between groups were smaller and not always statistically significant (Table 7). The average patterns (mean of the 24 trials/subject) of the left hip-back relative phase angle of each group of subjects are presented in Fig. 6 .  The significant variables in Table 7 were used as input in the logistic regression analyses to classify the workers into their respective groups. On average, 75% of the females and experts were classified in the right group (Table 8 ), but only if the novice group was excluded. The patterns of the novices were difficult to classify, being more variable than the other two groups. The strategy used to carry out medoid clustering analyses (best individual vs mean of 24 lifts) led to approximately the same grouping results. When the number of clusters was set to two, 10 to 14 experts were classified into one cluster and 10 to 14 females were classified into the other one, depending on the joint pairs (Table 8). The novices were distributed relatively equally into the two clusters for the knee-hip joint pairs, but for the hip-back pairs they were mostly (over 10) in the expert males. When the number of clusters was set to three, females (14) and novices (9) were distributed into two clusters for the knee-hip pairs and experts (10) in the last one. In the cases of the hip-back pairs, females (12) were part of one cluster, and experts (13) and novices (13) in the other two. These results confirm the robustness of the patterns adopted by experts and females.   DISCUSSION   This study showed that female workers differed from males mostly in the way they lifted the boxes from the ground, especially regarding knee and back postures and coordination. Lumbar loading findings were more ambiguous. Females showed lower peak L5/S1 resultant moments than males but, once normalized with the HAT moment, this difference disappeared and even became significantly larger compared with experts during the deposit phase. The same trend was seen for cumulative net loading. On the other hand, females had lower asymmetrical moments and were always closer to the box. This study is unique in the fact that females had experience (as the other groups) and did the same task as males. In addition, the repeated transfer of boxes from one pallet to another has been rarely studied in the biomechanical literature, and no major constraints were imposed on the subjects during the task except for the imposed-pace condition, which was designed to challenge the MMH skills of the subjects.  Probably the most interesting result of this study was the way females differed from experts in their patterns of interjoint coordination during lifting of the boxes at the floor level. All subjects had a distal-to-proximal sequence in their pattern, meaning that the knees were leading the hips and the hips were leading the back during the initial phases of the lift. Davis et al. (2003) observed a similar pattern with the participants of their study (males and females with limited MMH experience), particularly closer to the floor. However, the sex difference observed in the current study lies in the amplitude of the RPA, with females showing significantly higher amplitudes than experts and sometimes than novices. Females had a more distal-to-proximal pattern of extension of the knee, hip and lumbar joint than experts. In other words, females had a more sequential pattern of interjoint coordination while experts had a more synchronous pattern (Fig. 7 ). What appears to be a squat lift, as observed in females at the beginning of the lift, was in fact a stoop lift one or two tenths of a second later, because females exerted a quick extension of the knees without a corresponding extension of the hip or the back. Then this action was followed with an extension of the hip and finally an extension of the back. The coordination pattern among experts was more synchronous, with less delay between the motion at the knees, hips and back. The pattern of interjoint coordination was so different between females and expert males that the classification of each group with the logistic regression as well as with the cluster analyses was very good (Table 8).  This distal to proximal coordination pattern during the extension of the knees, hips and back is well known, especially when the lifted load is increased. Davis and Troup (1965) as well as Schipplein et al. (1990) noted a change in technique from squat lifting to stoop lifting with heavier weights. Several studies (Davis and Troup, 1965; Scholz, 1993a, 1993b; Scholz and McMillan, 1995; Burgess-Limerick et al., 1995) reported that as load increases, the more the interjoint coordination is sequential, which delays lumbar spine extension. This happens when the lifting technique used was a squat (leg lift) at the initiation of the lift. Davis and Troup (1965) saw in this pattern of coordination a dangerous situation in which the workers tend to change a flexed squat lift into a stoop lift. On the other hand, Burgess-Limerick et al. (1995) discussed several mechanical advantages of such an approach: 1) trunk extension strength is increased with lumbar flexion if the velocity of lumbar extension is reduced; 2) the quick knee extension (with the contraction of the monoarticular knee-extensor muscles) may contribute to hip extension through a tendinous action of the hamstring. According to the same authors, the changes in coordination pattern with increasing load have the effect of reducing the muscular effort required and thus delay the effects of fatigue, which may favor this technique over others. The problem with this type of technique is the large stresses that are applied on the posterior spinal ligaments when the lumbar spine is in full flexion. Our data indicated that on average, females were close to their full lumbar flexion (lumbar flexibility index at peak resultant moment) when lifting the boxes at the bottom of the pallet: females = 106%, experts = 84%, and novices = 98%. This is only an approximation, as the maximal lumbar flexibility of our subjects was estimated from a normative database (Troke et al., 2005). According to Dolan et al. (1994), many individuals can bend their lumbar spine by 110% or more of their static full range during dynamic movement. Fortunately, back muscles provide a margin of safety for the underlying spine so that the point of injury would be at about 130% on the in vivo scale. Several authors (Adams et al., 2002; Burgess-Limerick, 2003; McGill, 2007; Marras, 2008) have recommended avoiding such extreme lumbar postures, especially in flexion. Recently, Solomonow (2012) indicated that repetitive lumbar flexion-extension and the associated repeated stretching of the various viscoelastic tissues (ligaments, fascia, facet capsule, discs, etc.) cause micro-damage in these tissues and acute inflammation which, over time, become chronic disorders. A difficulty here for the workers is to choose consciously between a technique that appears to reduce muscular effort (fatigue) and another one that is apparently less efficient, but safer for the back.  In previous papers (Plamondon et al., 2010, 2014), we suggested that workers should keep a safety margin, as the experts do, by bending their lumbar spine less. Lumbar flexion, trunk inclination and knee flexion, particularly during lifting from the floor level, were major features that distinguished expert males from novice males (Plamondon et al., 2010, 2014). The current results indicate that the behavior of the females was similar to that of the novice males, that is, their trunk was more bent and their knees less bent (at the instant of the peak moment) than the experts during lifting close to the floor. The pattern of interjoint coordination is certainly a major factor in the posture found at the instant of the peak moment. Interestingly, Marras et al. (2003) as well as Davis et al. (2003) found that females adopt a straighter trunk posture (less lumbar flexion) than males during handling tasks, but it is not clear if this was observed at the beginning of the lift or at peak loading. Moreover, for boxes close to the floor, the hips dominated, the lifting style resembled more of a squat lift than a stoop lift, and the motion was much more coordinated (Davis et al., 2003). Marras et al. (2002, 2003) observed that during the lifting phase, females flexed their hips more than the males did, which in turn decreased lumbar spine flexion. However, it is not clear if the coordination patterns of males and females were more sequential or synchronized.  An important question is why females used a more sequential coordination pattern than experts. It is known that back and leg strength could affect the way the load is lifted (Li and Zhang, 2009; Zhang and Buhr, 2002), which may in turn at least partly explain the present findings. The correlation coefficient between leg lifting extension strength (Table 1) and the hip-back maximal RPA amplitude was about −0.5 (P < 0.01). Therefore, strength can explain some of the variance but other factors must be taken into account as some females with less strength than males are able to use a pattern comparable to experts, and novices with more strength can use a pattern similar to females. Interestingly, Lindbeck and Kjellberg (2001) and Albert et al. (2008) did not find an exaggerated sequential coordination pattern among their female subjects, and, as opposed to our results, Lindbeck and Kjellberg (2001) found that the hip-knee interjoint coordination was more synchronized in females relative to males. On the other hand, in both studies, the mass of the load was adjusted to the strength of the subjects, females having to lift about 7–8 kg and males 12–13 kg, and no subjects had experience in MMH. Experience may have some impact here, as the coordination pattern strengthens with time (Abernethy et al., 1997). With experience, experts learn to protect their back and at the same time to minimize their fatigue. On the other hand, novice workers (male or female) don't have the skill of experts but still want to reduce muscular effort and avoid fatigue, which might force them to use a more sequential pattern. The advantage of novice males over females is that they have the strength to move, over time, to a more synchronized interjoint pattern to protect their back. Furthermore, as the female workers had to lift the same absolute loads (in kg) as males in their work settings, which means that the corresponding relative loads (relative to strength) were higher, they could have been forced to adapt to the task with a more sequential pattern, which would not be the case for male workers.  Resultant and asymmetric moments were significantly lower in females than males. This was anticipated given their anthropometric differences. When the moments were normalized for HAT moment, the differences were no longer significant even if the females were significantly closer to the boxes than the novices. Marras et al. (2002) reported the same finding when the sagittal trunk moment was normalized under very constrained conditions. However, these researchers indicate that there can be significant sex differences in lumbar loading (compression and shear forces) because of differences in handling strategies, as well. The authors explained that as females in their study had 30% less back extension strength, they had to make kinematic compensations to lift the boxes. For this reason, the females experienced greater lumbar loading than the males, with compression loads of approximately 47% of their compression force tolerance as compared with males—whose compression values represented about 38% of their tolerance. As a result, Marras et al. (2002, 2003) concluded that females are at greater risk of low back injury than males under identical lifting tasks (same absolute load). This interpretation is in keeping with the results of our study. Lastly, when the cumulative moment is not normalized, the females are subjected to lesser loads than the novices (significant) and the experts (not significant). However, normalizing this moment showed that females were subjected to a significantly greater relative lumbar load than males even if the females did not take longer to perform the transfer during the flight (Table 3).  In several distribution centers or in supercenters, men and women will usually have to lift the same loads. However, females being on average weaker than males (Table 1), this means that they will generally have to lift higher relative loads in proportion to their strength. As they probably have learned from colleagues or in training programs, females will probably bend their knees in a squat posture to protect their spine when lifting boxes from the floor. The problem is that most of the females in this study were in a squat position before initiating the lift but were in fact doing a stoop-lift one or two tenths of a second later. As pointed out by Scholz (1993b), designating a lifting technique as a squat-lift has little meaning except in terms of the posture assumed at the beginning of the lift. The present findings showed that the lumbar spine of females was close to full flexion at the time the peak resultant moment was applied, which may, over time, increase the risk of back injuries. On the other hand, Burgess-Limerick et al. (1995) showed that this interjoint coordination was a very efficient muscular strategy and the difficulty, as stated earlier, is for the worker to choose between a technique that appears to reduce muscular effort and another one that is less efficient, but safer. Burgess-Limerick (2003) suggested favoring a semi-squat posture at the start of the lift and avoiding a stoop-lift, which appears to be the technique adopted by our group of experts by keeping a safety margin for the spine. Are females able to copy the males' lifting technique if they don't have the same muscular capacity? According to Theberge (2012), teaching females to move like males may be ineffective, so alternative training methods should be considered for them.  The significant difference in the task duration indicated either that females found it more difficult to move the boxes on the pallets or that they took the time to move the boxes closer to their trunk. For both reasons, self-pacing appears to be safer. It is important to mention here that all workers (not only the females) were at higher risk of injuries during the lifting (or deposit) of boxes at the bottom of the pallet. As soon as the boxes were taken at higher levels, the risk in terms of back loading and back posture decreased considerably (Figs. 2 and 3). Therefore increasing the box height to work at hip level is a technical control useful for both males and females (Plamondon et al., 2014).  The limitations are the same as those discussed in Plamondon et al. (2010, 2014). One of our major concerns was to allow the workers as much freedom as possible to apply their usual working techniques. Some of them may have modified their usual work technique because they were not familiar with the laboratory conditions or to obtain the investigator's approval, even if they were told to perform the tasks as they usually did in their work setting. We also make the choice to always put the self-paced condition first, followed by the imposed-paced condition, to preserve the natural pace of the workers. The two pace conditions were not randomly assigned, but in general the three groups performed in the same way (G × P interaction not significant for kinematics and net loading variables) under comparable levels of fatigue. More specifically to this study, the females did only one trip under the imposed-pace condition in comparison to three for the males. This is because we were afraid that the imposed pace would be too intense for the females and increase their risk of injuries. It is not possible to know if the addition of two more round trips at the imposed pace would have been too stressful for the females, but they did not have much difficulty finishing the imposed task and their physical fatigue was equivalent to that of the males after both pace tasks. With more fatigue, the results of the females could have been different. Finally, it is possible that the differences observed in the present study between males and females are not attributable to sex alone, since age, MMH experience and lifetime past injuries differed among the three groups. In an ideal situation, experts and females with the same characteristics would have been selected (age, experience, low lifetime injuries, etc.), but the recruitment of females (and experts) was very challenging as they number far fewer than novice males. On the other hand, the three groups are representative samples of individuals working in distribution centers, which increases ecological validity. Consequently, these results have some usefulness for those working toward better integration of females in a male-designed working environment.   CONCLUSION   This study showed that female workers differed from males mostly in the way they lifted the boxes from the ground, especially regarding knee and back postures. Lumbar loading findings were more ambiguous. Females showed lower peak L5/S1 resultant moments than males but once normalized, this difference disappeared and even became significantly larger compared with experts during the deposit phase. The same trend was seen for the cumulative net loading. On the other hand, females had lower asymmetrical moments and were always closer to the box. Probably the most interesting result was the way females differ from experts in their patterns of interjoint coordination during the lifting of the boxes near the floor level. It appears that the females had a more distal-to-proximal pattern of extension of the knee, hip and lumbar joint than experts; clearly females had a more sequential pattern of interjoint coordination and experts had a more synchronous pattern. This had the consequence of putting the females at greater risk of back injuries due to the excessive back flexion at peak loading that this type of coordination yielded. As observed in our previous studies comparing experts and novices, differences observed for females are especially important when the box is located on the floor where the back posture and back loading are at their greatest magnitude. This could have a major impact on the distribution of internal forces within the spine structures.  All of the authors conceived and designed the study and prepared this manuscript. All of the authors read and approved the final manuscript.  The authors declare that they have no competing interests.   ACKNOWLEDGMENTS   This study was funded by the Institut de Recherche Robert Sauvé en Santé et en Sécurité du Travail du Québec (IRSST), grants #099-211 and #099-466.   REFERENCES", "highlights": "Forty-five manual material handlers (15 females, 15 expert males and 15 novice males) performed series of box transfers under conditions similar to those of large distribution centers. The objective of the study was to verify whether sex differences in joint motions and in back loading variables (L5/S1 moments) exist during multiple box transfers. The task consisted in transferring 24 15-kg boxes from one pallet to another (4 layers of boxes; 6 boxes/layer: 3 in the front row, 3 in the back) at a self-determined pace and then at an imposed pace of 9 lifts/min. Full-body 3D kinematic data were collected as well as external foot forces. A dynamic 3D linked segment model was used to estimate the net moments at L5/S1. The results show that the peak L5/S1 moment during lifting for females was significantly lower than for males, but once normalized to body size the difference disappeared. In general, the female workers were very close to the posture adopted by the novice males at the instant of the peak resultant moment. However, females were closer to the box than the male workers. One major sex difference was seen when lifting from the ground, with the use of interjoint coordination analyses. Female workers showed a sequential motion initiated by the knees, followed by the hip and the back, while expert males showed a more synchronized motion. The lifting strategy of females likely stretches lumbar spine passive tissues, which in turn put them at greater risk of back injuries. As observed in our previous studies, these differences between expert males, novice males and females are especially notable when the box is lifted from the ground."}