{"id": "S000368701300152X", "article": "MAIN-TITLE Neck and shoulder muscle activity during standardized work-related postural tasks   HIGHLIGHTS          A broad range of work-related postural tasks was standardized using a computer guided task paradigm.      The sternocleidomastoid and upper trapezius muscles were mildly active during the majority of postures investigated.      Certain head and neck tasks activated the sternocleidomastoid, whilst shoulder and arm tasks activated the upper trapezius.      The muscle activity did not differ significantly between male and female participants.      This study provides reference values for further investigation of these muscles in the natural work environment.          KEYPHRASES   Electromyography  Sternocleidomastoid  Trapezius   Work-related musculoskeletal disorders (WMSDs) consist of a group of conditions that affect the muscles, skeleton, cartilage, ligaments and nerves, resulting in pain and functional impairment. These disorders are induced or aggravated by work and the circumstances of its performance (Staal et al., 2007). WMSDs represent a widespread occupational health issue, and contribute to sick leave, reduced productivity, reduced quality of life and premature retirement from the workforce (Åkesson et al., 1997; Burke et al., 1997; Mohl, 1998; Woolf and Åkesson, 2001).  Work involving prolonged static postures may be a significant risk factor for WMSDs (Keyserling, 2000). Sustained muscle activity, especially of Type I motor units, is likely to be an aetiological factor of these conditions (Hägg, 1999; Veiersted et al., 1993). Human muscles are not well adapted to continuous long-lasting contractions, but require rest periods to recover from even very low-level exertion (Sjøgaard et al., 1985). It has also been suggested that during low intensity contraction, especially when the contraction imposed is static and long-lasting, muscle tissue may display changes in blood flow (Larsson et al., 1999), contractile activity (Jaspers et al., 1999; Larsson et al., 1990), and eventually changes in morphology (moth eaten fibres, ragged red fibres and zones lacking activity) (Lindman et al., 1990, 1991). Tissue damage during these sustained contractions may be attributable to the accumulation of calcium ions in the muscle tissue sarcoplasm (Gissel, 2000). Moreover, mechanisms akin to local nociceptor sensitisation can play a role in the pathogenesis and escalation of this condition via postulated feedback loops (Simons, 2004).  There is some evidence which points to a gender difference in musculoskeletal disorders (De Zwart et al., 2001). Female workers have been reported to suffer more from upper extremity musculoskeletal disorder than their male counterparts (Treaster and Burr, 2004). WMSDs among female workers have been reported in various occupational groups such as among newspaper employees (Bernard et al., 1994), salespeople (Skov et al., 1996), or dentists (Marshall et al., 1997). The reason for these gender related differences is unknown. Biological factors such as a smaller cross-sectional area of the trapezius muscle and greater amount of Type I muscles fibres in females have been claimed as reasons for these gender differences (Lindman et al., 1990, 1991). One hypothesis could be that differences in muscle activity between sexes may account for this gender difference (Nordander and Ohlsson, 2008).  The trapezius and sternocleidomastoid muscles are frequently involved in a large proportion of WMSDs associated with the upper extremity (Buckle and Devereux, 2002). The trapezius muscle spans the upper trunk and shoulder girdle, linking the shoulder and neck. It has a significant role in supporting and stabilizing the scapula for task-oriented work, and in movements of the upper limb relative to the axial skeleton (Brinckmann et al., 2002; Jensen et al., 1999). The trapezius is the most reported muscle in upper body WMSDs (Sommerich et al., 2000; Visser and van Dieën, 2006).  Both the trapezius and sternocleidomastoid are also anatomically superficial muscles, and therefore readily accessible to surface electromyography (EMG). Quantitative EMG analysis of these muscles has been previously used to assess the activity patterns of workers in the natural work environment (Kleine et al., 1999; Mathiassen et al., 2003), as well as to compare the activity pattern of workers suffering from neck pain with healthy workers (Johnston et al., 2008; Szeto et al., 2009). Nonetheless, there are no data describing the amount of effort exerted by neck and shoulder muscles during a variety of postural tasks that are commonly observed in vocational activities. The intensity of muscle contraction can be estimated using surface EMG and then expressed as percentage of the activity produced during maximum voluntary efforts (Konrad, 2005; Netto and Burnett, 2006). Normative data are needed in order to interpret contraction levels of these muscles collected in a natural work environment and from there, to further investigate any possible causal links between muscle hyperactivity and WMSDs. To the best of our knowledge, no previous research has investigated contraction levels of the trapezius and sternocleidomastoid muscles across a broad spectrum of standardized postural tasks in healthy subjects.  The aim of the present study was to assess the activity level of the sternocleidomastoid (SCM) muscle and upper trapezius (UT) muscle during static postures under controlled and standardized conditions. Effort was made to investigate a large number of tasks that reproduced static postures commonly seen during seated work. In addition, it was hypothesized that the muscle activity levels would differ between male and female participants.   METHODS   The Human Ethics Committee of the University of Otago approved the study protocol (10/104). Seventeen asymptomatic right-handed university students were recruited from the University of Otago. The inclusion criteria included patients over 18 years of age, who had to be right-handed and had not suffered any musculoskeletal pain in the past month. The volunteers were carefully informed about the experimental procedures and written consent was obtained. Study participants (n = 17) consisted of nine females and eight males. They ranged in age from 20 to 26 years (22.8 ± 1.7 years) with a mean height of 171 ± 8.2 cm and mean weight of 63.9 ± 10.6 kg.  Muscle activity was quantified by unilateral recording from the right sternocleidomastoid and upper trapezius muscles using surface electromyography (EMG). Self-adhesive, pre-gelled disposable Ag–AgCl surface electrodes (Blue Sensor N-00-S, Medicotest A/S, Denmark) were used. The skin overlying the upper trapezius and sternocleidomastoid muscles was rubbed vigorously with alcohol wipes to reduce the skin impedance. The first pair of electrodes was placed with a centre-to-centre distance of 20 mm on the right sternocleidomastoid muscle, half the distance between the mastoid process and the sternal notch (Cram et al., 1998). The second pair of electrodes was placed on the right upper trapezius muscle, two-thirds the distance from the spinous process of the seventh cervical vertebrae (C7) and the lateral edge of the acromion (Zipp et al., 1989). The reference electrode was placed on the skin overlying the C7.  The EMG wires were connected to a four-channel EMG amplifier (ML866 PowerLab 4/30, ADInstruments, NSW, Australia). The amplifier output was connected to a laptop computer. The two raw EMG signals and one audio signal with dual tone multi-frequency (DTMF) sounds were sampled at 4096 Hz and band-pass filtered with a bandwidth of 25–1000 Hz (at −3 dB) and a high pass filter for the DTMF sounds (>25 Hz). The EMG signals were A/D converted and the DTMF task definers were automatically detected by a custom-made script (Matlab 8.0, The Mathworks, Natick, MA, USA) thus delimiting each EMG segment for subsequent analyses.  Sternocleidomastoid and upper trapezius muscle activities were recorded under computer guidance whilst the participants were performing a series of postural tasks using specifically designed software (Farella et al., 2008). This software displayed detailed instructions about the postural tasks to be performed by means of explanatory text, still images and audio files. Timing was given by countdown and progress bars, which facilitated the subject to be alert as to onset, maintenance, and cessation of each task. DTMF sounds lasting 300 ms each were generated by the software at the beginning and the end of each postural task, acting as task definer and time markers for offline analyses.  Six round orange markers (area = 0.5 cm2) were attached to the skin overlying the glabella, pogonion, on both ears and left and right acromion as a visual reference for the video recording during the task paradigm. Video recordings of each participant performing the postural task paradigm were made using a tripod mounted Panasonic SD-60 HD video recorder that digitally stored footage onto 16 GB super X SD memory cards. Offline analysis of the video clips of each participant synchronized with their EMG signals confirmed the correct performance of the series of postural tasks. The video analysis was performed by one assessor and all performances were correct.  At the beginning of the experiment the subjects were asked to perform the maximal voluntary contraction (MVC) of each muscle for normalization. The MVC for the sternocleidomastoid muscle was achieved by maximal contralateral neck rotation, and the MVC for the upper trapezius muscle was achieved by bilateral upper arm abduction against resistance. The MVC was performed three times with a 10 s rest period. During the following 20 min, subjects were asked to perform 36 tasks in a specific order according to the computer generated task paradigm. These included postural tasks such as varying degrees of flexion, extension and rotation of the neck, protrusion and retrusion of the neck, minimal to maximal rotation of the neck and trunk, shoulder shrug, head leaning, camera shot and varying degrees of side and forward arm abduction. Some tasks were required to be performed on either the ipsilateral side or contralateral side. The ipsilateral side in the study was the right side and the contralateral side was the left side as the participants were all right-handed. The investigated tasks are summarized in Appendix 1. All postural tasks were set to last for 9 s each and were separated by a rest period of at least 10 s.  In this study, participants were asked to perform some tasks; such as neck and trunk flexion, extension and lateral flexion three times. During the first performance, the participants were asked to perform the task to a certain degree; this was measured by a cervical range of motion goniometer (CROM goniometer, Performance Attainment Associates, Roseville, MN), which was placed on the participant's head. The goniometer helped to standardize these postural tasks to within a 10° range for accuracy. During the second performance, the participants were asked to perform the task to their comfortable limit of motion. This was defined as performing the task until the participant felt an onset of tightness, or discomfort or secondary movement. In the third performance, the participants were asked to perform the task to their maximum limit; this was defined as performing the task to an overextended position.  Muscle activity was calculated by normalizing the EMG amplitude to the peak EMG value found during maximal voluntary contraction for each muscle (EMG%MVC) (Konrad, 2005; Netto and Burnett, 2006). EMG amplitude was calculated by the root mean square (RMS) values of the raw EMG signals. With the only exception being the maximal voluntary contraction tasks, the mean EMG amplitude was calculated over a signal portion lasting 3 s taken from the middle of the task duration, so that the activity ramps indicating task onset and cessation were discarded. The intensity of muscle activity was arbitrarily ranked as light (<3%MVC), moderate (3%MVC ≤ EMG ≤ 8%MVC), and substantial (>8%MVC) (Farella et al., 2008). Differences between the EMG amplitude of the sternocleidomastoid and upper trapezius muscles were calculated for each task and plotted.  Data were analyzed using conventional descriptive statistics, to test how the different muscles and tasks affected EMG signals. The assumptions of normality for EMG data were checked using Kolmogorov–Smirnov test and if appropriate data were log converted. The outcome measure was analyzed by means of a linear mixed model: subject (random factor), muscle (fixed factor), sex (fixed factor), task (fixed factor) and their first-order interactions “muscle × sex”, and “task × sex”. All analyses were performed using Statistical Package for the Social Sciences (SPSS Inc 20.0, Chicago, Illinois, US) and Statistical Analysis Software (SAS Institute, Cary, North Carolina, US). The p-value was set at 0.05 and differences were considered statistically significant at that level.   RESULTS   EMG data expressed as percentages of maximum voluntary contraction were not always normally distributed. With a few exceptions, however, the EMG data passed the normality tests after being log-converted (Table 1 ). The majority of postural tasks produced light to moderate (0%MVC ≤ EMG ≤ 8%MVC) activity of the sternocleidomastoid and upper trapezius muscles (Table 1). However, maximal contralateral trunk and neck rotation, comfortable contralateral neck rotation, head leaning, head retrusion, maximal neck flexion, maximal ipsilateral neck flexion and 45° ipsilateral neck rotation substantially activated the sternocleidomastoid muscle (>8%MVC) (Fig. 1 A). Additionally, shoulder shrugging, ipsilateral arm 90° side lift, camera shot and ipsilateral arm 90° forward lift yielded substantial activity in the upper trapezius muscle (Fig. 1B).  In order to determine the relative activation of the two muscles investigated, differences between EMG amplitude of the sternocleidomastoid and upper trapezius muscles were calculated for each task and plotted as activity difference %MVC (Fig. 2 ). The sternocleidomastoid muscle was more active during postural tasks involving head movements such as contralateral trunk and neck rotations and head leaning. During trunk and arm movements, the sternocleidomastoid muscle was minimally active compared to the upper trapezius muscle. The upper trapezius muscle was up to 20%MVC more active than the sternocleidomastoid muscle during trunk and arm movements. The shoulder shrug produced the highest activity in upper trapezius muscle with minimal activation of the sternocleidomastoid. Other tasks that activated the upper trapezius muscle more than the sternocleidomastoid muscle included camera shot and ipsilateral 90° side and forward lifts. About half of the tasks yielded minimal (≤1%MVC) activity difference between the two muscles. Normalised muscle activity did not differ significantly between male and female participants (F = 3.1; p = 0.078). No significant interaction was found between “Muscle” and “Sex”, or between “Task” and “Sex” (F ≤ 2.0; p ≥ 0.153).   DISCUSSION   The EMG findings of this study have helped to quantify the level of muscle activity of the sternocleidomastoid and upper trapezius muscles during various postural tasks related to work. This insight is useful because with greater understanding of the levels of muscle activity during different work postures we may better hypothesize which tasks may put workers at greater risk of WMSD.  The level of muscle activity may constitute an important risk factor for development of musculoskeletal disorders. An increased rate of musculoskeletal complaints in the neck and shoulders in workers has been correlated to an increased level of muscle activity of the upper trapezius muscle (Visser and van Dieën, 2006). Workers with complaints from the neck and shoulder regions demonstrated a significantly higher static EMG level when performing the different work tasks than those without complaints (Veiersted et al., 1990). In our study, tasks such as contralateral trunk and neck rotations, head leaning, shoulder shrugging, camera shot and ipsilateral forward and side arm lifts at 90° yielded substantial muscle activity compared to the other tasks. These tasks and the levels of muscle activity yielded may require further investigation in a natural work setting to determine the risks of these postures in an unrestrained environment.  The maintenance of certain postures may demand a high level of muscle activity. Previous studies have found significant associations between various postures and musculoskeletal disorders of the neck and shoulder (Buckle and Devereux, 2002). The series of postural tasks in this study were chosen because it represented a wide spectrum of postures that could be seen during all types of work. Neck flexion was investigated because there was a strong albeit not significant trend for greater sternocleidomastoid electromyographic activity in workers with neck pain (Falla et al., 2004). Our study found that maximal neck flexion produced substantial muscle activity. In previous studies, the sternocleidomastoid muscle showed no change in muscle activity between natural head position and neck flexion (Forsberg et al., 1985). Our study contradicted this; it showed that all levels of neck flexion yielded more muscle activity than natural head position. However, our study did not investigate duration of the tasks and this should be investigated further in future studies because time spent in forward neck flexion has been significantly associated with neck and shoulder disorders (Ohlsson et al., 1995). Neck rotation has been positively associated with self-reported neck symptoms with an odds ratio of 2.4 (Dartigues et al., 1988), and in our study neck rotation was shown to produce substantial muscle activity of the sternocleidomastoid muscle.  Working with a heavily twisted or bent neck and trunk can result in pronounced activity of the muscles. Our study has shown that neck and trunk rotation produces substantial muscle activity in the sternocleidomastoid muscle. Studies have reported that rotation of the trunk is a risk factor for neck pain (Johansson and Rubenowitz, 1994; Johansson, 1995; Viikari-Juntura et al., 1994; Yu and Wong, 1996). The head leaning posture consists of twisting and bending of the neck and trunk. Head leaning is frequently seen during dental work, especially in the most common tasks performed by dentists, dental examination, tooth drilling and tooth cleaning (Finsen et al., 1998). This posture produced substantial activation of both the sternocleidomastoid and upper trapezius muscles.  Working above shoulder height is widely recognized as a risk factor for shoulder-related musculoskeletal disorders. One review concluded that there was evidence for a relationship between repeated or sustained shoulder postures, with greater than 60° of abduction and musculoskeletal disorders of the shoulders (Bernard, 1997). The review suggested that tasks requiring shoulder flexion or abduction of greater than 60° are unacceptable. Our study showed that both forward and side arm abductions greater than 90° produced substantial upper trapezius muscle activity, which could be linked to muscle fatigue and impairment of blood flow in the trapezius muscle (Herberts et al., 1980; Järvholm et al., 1991).  In general, the contraction levels showed a gradient during the transition from a predefined angle, comfortable range to maximum range of movement. However this was not the case for some tasks such as neck extension, where the gradient was less pronounced. This may be ascribed to recruitment of other synergistic muscles not assessed in the present study.  Epidemiologic, clinical, and experimental evidence points to sex differences in musculoskeletal disorders. Women tend to have a higher prevalence of musculoskeletal problems compared to men (Wijnhoven et al., 2006). Men and women differ in regard to body size and functional capacity and, perhaps, in factors such as muscle physiology and mix of fast- and slow-twitch muscle fibres. This study showed an inconclusive result in determining whether there was a difference in muscle activity between male and female participants. The statistical analysis yielded a relatively low p-value (p = 0.078), which although not statistically significant points at a marginal relationship between gender and muscle activity, thus indicating that a larger sample size may have yielded statistically significance.  This is the first study to our knowledge to quantitatively assess electromyographic activity of the sternocleidomastoid and upper trapezius muscles during a large number of standardised postures related to work. The ranking of the intensity of muscle activity allows a quick and simple categorization of the amount of muscle activity a certain postural tasks yields. This aids as a quick reference for future studies related to posture and muscle activity. The findings from this study provide normative values, which will be a useful baseline for future recordings of muscle activity during work in a natural, unrestrained work environment.  Specifically designed software was utilized to guide participants during assessment of the neck and shoulder muscle activity. This software helped the participants perform each postural task accurately and allowed standardization of tasks between participants.  Limitations that may have affected the study outcome include the difficulty of standardizing MVC. Normalizing techniques for EMG analysis from previous neck and trunk muscle studies suffer from a lack of consensus (Mathiassen et al., 1995). Additionally there is also debate as to whether maximal contractions are necessary or even valid (Mathiassen et al., 1995; Sommerich et al., 2000). The ability of any EMG technique to accurately relate the true magnitude of muscle activity as well as discriminate between the activity of under and overlying muscles needed to be considered carefully. The sternocleidomastoid muscle is a superficial and distinct muscle with little cross talk with surrounding muscles. However, the upper trapezius is less superficial and overlies a multitude of other discrete, often synergistically functioning muscles, and cross-talk is an inherent issue. The upper trapezius muscle was selected because of its pathophysiological importance and its frequent use in evaluation of occupation loads. Vocational activities associated with seated static postures have previously shown to generate relatively high mean loads in the trapezius muscles (Milerad et al., 1991; Takala and Viikari-Juntura, 1991). In this study, EMG data were not always normally distributed and this should be taken into account in future studies, where EMG data expressed as percentage of maximum voluntary contraction may need to be log-converted.  The use of EMG normalization may possibly affect the result of gender comparisons. With the lack of EMG normalization, however, the impact of gender on EMG may be even higher. Indeed, there are gender-related differences in skinfold thickness covering different muscles (Marini et al., 2007). The subcutaneous fat acts as low-pass filter for EMG frequency content and can affect both the frequency spectrum and amplitude of collected signals. This has been clearly demonstrated for the masticatory muscles (van der Glas et al., 1996) and for upper arm muscles (Bilodeau et al., 1992), but probably applies to most other muscles.  The static tasks we have studied are not fully representative of the combinations of static postures and complex movements seen in a natural environment. Therefore, further study into muscle activity patterns during a natural work environment is essential with portable EMG and video. Different aspects of muscle activity pattern, including intensity, duration and fatigue are likely to be important determinants in the cause of musculoskeletal complaints, therefore further investigation into these other aspects are currently being performed by our group (McNee et al., 2013).   CONCLUSION   In summary, the contraction levels of the sternocleidomastoid and upper trapezius muscles were investigated using surface electromyography during a large number of standardized tasks. These postural tasks are representative of vocational activity in seated static work. The findings of our study provided new insight into EMG muscle activity during a broad range of postural tasks and may provide a basis for further investigation into the activity of these muscles in a natural work environment.   ACKNOWLEDGEMENTS   The authors would gratefully like to acknowledge the New Zealand Dental Research Foundation Board, Sir John Walsh Research Institute and the Education and Research Development Group (ERDG) for funding this study.                REFERENCES", "highlights": "The aim of the present study was to assess the activity levels of the sternocleidomastoid muscle and upper trapezius muscle during static postures under controlled and standardized conditions, and to determine whether the muscle activity differed between sexes. Electromyographic (EMG) activity was recorded unilaterally from the sternocleidomastoid and upper trapezius muscle in 17 participants whilst they were performing various postural tasks. EMG amplitude was measured by the root mean square values of the raw signals and normalized to peak maximum contractile values for each muscle (%MVC). The intensity of muscle activity was ranked as light (<3%MVC), moderate (3%MVC ≤ EMG ≤ 8%MVC), and substantial (>8%MVC). During most tasks the two muscles contracted light to moderately. Head leaning and shoulder shrugging postures yielded substantial muscle activity in both muscles. Muscle activity did not differ significantly between male and female participants (F = 3.1; p = 0.078). Our findings provided normative values, which will enhance future studies of muscle activity during work in a natural, unrestrained environment."}