{"id": "S001048251400136X", "article": "MAIN-TITLE Cascaded-Automatic Segmentation for Schistosoma japonicum eggs in images of fecal samples   HIGHLIGHTS          The cascaded method applies suitable methods in each step for particular segmentation objects.      We use the method of Radon-Like Features for noise reduction and boundary enhancement.      We construct one suitable method for removing irregular noisy points from the images.      A classification model based on SVM is built for identifying eggs.          KEYPHRASES      Schistosoma japonicum egg  Automatic Segmentation  Microscopic image   The microscopic image recognition of parasite eggs is one of the most important means of diagnosis for humans infected by parasites. In recent years, parasite researchers and computer researchers have been cooperatively studying to enable the automatic recognition of parasite eggs in microscopic images in order to reduce the erroneous judgment rate that is caused by individual׳s lacking experience in manual identification. They also aimed to achieve remote real-time differential diagnosis. To date, many research papers have focused on how to classify specific kinds of eggs, and only a few papers have dealt with how to identify the accurate borders of a parasite egg [1–10]. Among these, papers [6,9,10] were from China, while the other reports were from outside of this country. Automatic segmentation of parasite eggs image is very important for the extraction of characteristics and the classification of parasite eggs in later stages. If the automatic segmentation of parasite eggs is not performed, they cannot be recognized automatically. In the aforementioned papers, only a few have reported on automatic segmentation based on the threshold method of parasite egg objects [1,3,4,6]. Other reports on the segmentation of parasite eggs can only be made with human participation to accurately obtain parasite eggs from images. In these research, Yang et al. [1] started research into the recognition of parasite eggs in fecal samples, but the experimental materials contained much less noise than those utilized in this paper, which were captured directly from fecal samples without any preprocessing. Dogantekin et al. [3] and Castañón et al. [4] proposed two different parasite egg segmentation methods based on threshold operations, but the threshold method was too simple to resolve the problem identified in the current paper. In addition, reported segmentation methods are generally applied to parasite egg images which are obtained from culture medium containing smaller background noise. Nevertheless, egg images from clinical testing samples are often obtained from fecal extracts; they have the same features regarding the surrounding and internal contents. Also, it is difficult to accurately identify egg boundaries from fecal extract images with heavy background noise using the approach based on threshold segmentation. Therefore, to achieve computer automatic-recognition and real-time diagnosis for clinical parasite eggs, it is necessary to use an automatic segmentation approach for parasite egg images that are gathered from fecal extracts. After analyzing the disadvantages of existing methods and performing a number of experiments, a Cascaded-Automatic Segmentation method from coarse to fine, which solves the boundary segmentation of eggs in fecal sample images, is presented in this paper. This method is based on a combination of state-of-the-art methods used in all of the steps in the processing flow. Those methods perform very well in their own domain, but making them work together is still a very challenging task. The images of samples captured from fecal extracts have very heavy noise interference. In particular, eggs and their surrounding debris show the same appearance, and the key features of eggs are only around their edge. Therefore, the key step to automatically recognize and classify eggs using a computer is identifying the boundary regions of eggs. The processing flow of the method is shown in Fig. 1. First, original images were filtered and enhanced by a method named Radon-Like Feature filter [11,12], which enhances the boundary of the parasite egg. Then, a point set filter was applied to filter out the noisy points and improve the segment performance. This filter is based on a number of existing methods in the domain of image thinning, labeling and connected component analysis [13–20]. Next, the Randomized Hough Transform method was used to extract the point set of a raw edge [21–26]. Lastly, the point set extracted in the above step was used as the initial point set in a segmentation method named the active contour model, which extracts the accurate edges of the egg [27–35]. Here, we describe in detail all of the methods used and present some experimental results and parameters used in these experiments.  Seventy-three cases of Schistosoma japonicum eggs in fecal samples and 43 cases of Clonorchis sinensis eggs in samples were obtained from clinics. They were supplied by Professor Wu Zhong-dao׳s team of the Parasite Research and Teaching Department, Zhongshan School of Medicine in Sun Yat-sen University. These samples were collected in Jiangxi and other regions in China. The microscopic images were acquired using an 8 million pixel digital microscope acquisition system. Overall, 104 images contained parasite eggs and 12 images did not. The resolution of these images was resized to 256×192 pixels.  The Radon-Like Features method was proposed by Kumar et al. of Harvard University, for use in the enhancement and segmentation of neuron cell images [11]. This technique differs greatly from traditional de-noising and enhancement algorithms due to its multi-dimensional, multi-scale and multi-directional filtering properties. In this approach, the enhanced image was generated by averaging the multi-dimensional feature vectors, while the feature vectors were obtained from the original image that was processed by Gaussian-Second-Derivative filters in multi-directions and multi-scales and then operated using an integral line in multiple directions. Because this approach synthetically considers the effects of multi-scale and multi-directional features on enhancement results, it has strong adaptability for images with very complex scenes and heavy background noise. The Radon-Like Features algorithm processes can be divided into four steps.  Step 1 involves processing the original images using the following formula:  (1)  R ( x , y ) =   max   σ , ϕ   Δ G ( σ , ϕ ) ⊗ I ( x , y )   where G(σ,ϕ) is the Gaussian-Second-Derivative (GSD) filter, σ and ϕ are the scale and the orientation of the GSD function, respectively, and ⊗ denotes the convolution. We can get m×n GSD filters when letting σ take m different values and ϕ take n different values, and then the transformation R(x,y) captures response of the most dominant GSD filter at each pixel.  In Step 2, the set P of the boundary points of R(x,y) is found by using a Canny operator  (2)  P = C a n n y ( R ( x , y ) )      Step 3 calculates the integral in formula (3) with 10°/step from 0° to 1360°  (3)  T ( I , l ( t ) ) =    ∫    t   i       t   i + 1      R ( l ( t ) )  ∂ t   | | l (   t   i + 1   ) − l (   t   i   ) |   |   2     , t ∈ [   t   i   ,   t   i + 1   ]   where t  i is a point of the set P of the boundary points calculated by formula (2), and l is a line which starts at the point t  i and whose direction angle increases by 10°/step. If t  i+1 is on the line segment at one direction and with a start-point of t  i , t shall be one point of the line segment between the nodes t  i and t  i+1. From formula (3), if the pixel in R(x,y) is not in set P, the linear integral values along 36 directions for formula (3) are all zero; if the pixel in R(x,y) is in set P, 36-dimensional eigenvector along l in 36 directions is obtained using formula (3). Then, the mean of 36-dimensional eigenvector obtained for each pixel is the result of the enhancement process. After the original image of fecal extract (shown in Fig. 2(a)) is processed using steps 1–2, the enhanced result is obtained (see Fig. 2(b)). In order to generate an initial boundary-point set, or one with some noise remaining, the image processed by the above steps also needs to be binary-processed after the enhancement is completed. The binary processing method is as follows:  (4)  t h r e a s =   T   min   + (   T   max   −   T   min   ) λ      (5)  T ′ =  {      1 ,     T > t h r e a s       0 ,     T ≤ t h r e a s         where T is an enhanced image, T  max and T  min are its maximum and minimum, respectively, λ is a ratio parameter for selecting threshold, and T′ is the final binary image obtained, as shown in Fig. 2(c).  It can be seen from Fig. 2(c) that a lot of noise still remains in the image processed by the Radon-Like Features approach and binarization because fecal extracts contain a large amount of noise. The initial point set, which was used for segmentation based on the Active Contour Model, is still not able to be directly derived from it. For the segmented eggs, pixels of the connected point set formed by noise are less obvious than the pixels of the boundary formed by the studied egg. Therefore, a threshold value is given to determine whether the connected region is formed by noise or by the studied egg itself. If the percentage of pixels from one connected region and the sum of the pixels of all connected regions are greater than the threshold value, the connected region is the boundary of the studied egg. Furthermore, when there is more than one egg in the image, it is possible to detect connected regions with pixel percentages greater than the threshold value, thus enabling their boundaries to be located.  To reduce the noise interference on the performance of the egg detection and improve its detection accuracy, “thinning and connected-component” analysis was applied to the binary image T′ before making the boundary detection of eggs; this was achieved by the previous filtering. According to the characteristics of the binary image of eggs, a one-dimensional vector of pixels in connected regions of the image T′ is constructed by P i x e l C o u n t = {   z   i   |   z   i   = C o u n t ( i ) ,  i = 1 , 2 , … } , where i represents the i-th connected region, and   z   i   = C o u n t ( i ) is the number of pixels contained in the i-th connected region. A ranking function of the set “PixelCount” is defined by P C R a n k ( i ) = R a n k ( S o r t ( P i x e l C o u n t , ‘ d e s c e n d ’ ) , i ) , where the order location of pixel numbers of the i-th connected region “PCRank(i)” is the ranking of the sequence that consists of sorting numbers of all connected regions in the image T′ in descending order, which reflects the amount of pixels contained in the i-th connected region more or less than those of other connected regions in the image T′. Then, the following four criteria for reducing noise are used: the pixel-number ordinal of a region, St1, the pixel-number proportion of a region, St2, the center deviation of a region in the x direction, St3, and the center deviation of a region in the y direction, St4. Four conditional formulae are used as follows:  (6)  P C R a n k ( i ) ≥ S t 1      (7)    C o u n t ( i )   C o u n t ( t o t a l )   =   C o u n t ( i )    ∑  i ∈ T ′    C o u n t ( i )    ≤ S t 2      (8)    |   X   C e n t e r   ( i ) − ( W i d t h ( T ′ ) / 2 ) |   ( W i d t h ( T ′ ) / 2 )   > S t 3      (9)    |   Y   C e n t e r   ( i ) − ( H e i g h t ( T ′ ) / 2 ) |   ( H e i g h t ( T ′ ) / 2 )   > S t 4   where C o u n t ( t o t a l ) is the sum of all pixel numbers for all of the connected regions in T′,   X   C e n t e r   ( i ) and   Y   C e n t e r   ( i ) are the mean of all pixel-coordinates of the i-th region in the x direction and the y direction, respectively, W i d t h ( T ′ ) is the width of T′, and H e i g h t ( T ′ ) is the height of T′. In this paper, St1=4, St2=0.1 and St3=St4=0.8.  During the “thinning and connected-component” analysis, T′ was first thinned [12–15], and then connected-component analysis was implemented on the thinned binary image [16–20]; next all connected-components were labeled. The number of pixels of each connected region in the thinned binary image was counted and the set P i x e l C o u n t was formed by them; following this, a connected region was used to assess whether the noise component was a result of the calculations of formulae (6)–(9). If an analysis result for a connected region met formulae (6)–(9), it was considered noise and needed to be removed from T′.  As S. japonicum eggs are elliptical objects, the ellipse detection method [21–26] can be used to detect the elliptical target in its image, and make the ellipse boundary the initial points for accurate segmentation. The ellipse detection method used in this paper was the Randomized Hough Transform [21,22]. This method was first proposed by Xu; however, the problem of how to convert a normal ellipse equation, which is a form of a nonlinear equation, from coordinate space to parameter space remained unsolved. Then, Mclaughlin [22] and Lu and Tan [23] successfully converted an elliptical equation to a linear equation in different ways, thus making Randomized Hough Transform widely applicable to the detection of ellipses. The processing flow of ellipse detection is shown in Fig. 3.  After the “thinning and connected-component” analysis was completed, the ellipse detection was processed according to the flow chart shown in Fig. 3. Five points were randomly selected out of the proceed T′ and it was determined whether these five points met the conditions for forming an ellipse. If they were appropriate, the coordinate parameters of the five points were converted to a set of ellipse parameters. If z=(x,y) represents a pixel in the binary image T′, then the following general equation of quadratic curve can be used:  (10)  a   x  2  + 2 b x y + c   y  2  + 2 d x + 2 f y + g = 0      It can be seen from the above equation that the general calculation of a quadratic curve has 6 degrees of freedom. However, it requires only 5 parameters to determine an ellipse, so it is necessary to draw 5 parameters of the ellipse accurately from formula (10) to change it into the form of certain constraints. In this paper, the following equation was used for the detection of elliptical parameters:  (11)    x  2  +   y  2  + U (   x  2  −   y  2  ) − V 2 x y − R x − S y − T = 0      Substituting coordinates of the five pixels (z  i =(x  i ,y  i ), i=1,…,5) randomly chosen from the binary image in formula (11), we obtained the parameters [U, V, R, S, T]. By comparing the coefficients between Eq. (10) and formula (11), it is possible to obtain the following results: a=1−U, b=−V, c=1+U, d=−R/2, f=−S/2, and g=−T. If the coefficients [a, b, c, d, f, g] met formulae (12) and (13) simultaneously, pixels z  i =(x  i ,y  i ), i=1,…,5 could be considered as being on the ellipse, and the elliptical parameters [X  c , Y  c , a′, b′, ϕ] passing through five pixels were obtained by formulae (14)–(18), where (X  c , Y  c ) were the center coordinates, a′ and b′ were the major and minor radii of the ellipse (respectively), and ϕ was the angle of the major axis that rotates around the X-axis counterclockwise.  (12)  Δ ≠ 0 ,  J > 0      (13)  Δ / I < 0   where   Δ =  |     a   b   d     b   c   f     d   f   g     |  ,  J =  |     a   b     b   c     |  ,  I = a + c      (14)    X   c   =   c d − b f     b  2  − a c        (15)    Y   c   =   a f − b d     b  2  − a c        (16)  a ′ =     2 ( a   f  2  + c   d  2  + g   b  2  − 2 b d f − a c g )   (   b  2  − a c ) [     ( a − c )  2  + 4   b  2    − ( a + c ) ]          (17)  b ′ =     2 ( a   f  2  + c   d  2  + g   b  2  − 2 b d f − a c g )   (   b  2  − a c ) [ −     ( a − c )  2  + 4   b  2    − ( a + c ) ]          (18)  ϕ =  {       1 2    cot   − 1    (    a − c   2 b    )      a < c        π 2  +  1 2    cot   − 1    (    a − c   2 b    )      a > c            In the paper, five one-dimensional accumulators were used to accumulate a set of effective elliptical parameters [X  c , Y  c , a′, b′, ϕ] according to the literature [23]. Then, the above process was repeated, from randomly chosen pixels to calculating parameters and S times, and estimating where to detect an ellipse in the current set of points using the following formula:  (19)    M i n ( M a x ( C o u n t ( i ) ) )  S  ≥ T h r e a s  i = 1 … 5   where Count(i) is the i-th of five one-dimensional accumulators, Threas is a ratio threshold for determining whether there is an ellipse in the assigned set of points, and Threa=0.6 (in this paper). If the accumulator met the conditions of formula (19) through S loops, the five peaks in five accumulators would provide five estimated parameters of the detected ellipse.  The results obtained for dealing with Fig. 2(c) using “thinning and connected-component” analysis are shown in Fig. 4. The oval object in Fig. 4 was detected by Randomized Hough Transform, and the ellipse is shown in Fig. 5. It is necessary to state that the major and minor axes of the ellipse detected here were reduced by 5% in order to improve the robustness of active contour segmentation in the subsequent step. The aim of this was to make all of the initial points fall uniformly within eggs, thereby approaching the egg׳s boundary in a stably-inflated way using the Active Contour Model. Here, it is helpful to improve the overall stability of the algorithm and segmentation accuracy. It can be seen from Fig. 5 that the result of the algorithm is very satisfactory, as the red curve shows the detected ellipse target.  Through a series of cascading operations, from noise filtering to elliptical object detection, the region and boundary of the egg can be approximately targeted. If the boundary points of the ellipse obtained are set as the initial point set of the egg segmentation, the egg boundary can be accurately identified using the Active Contour Model [27–35].  The Active Contour Model, also called Snakes, is a local optimal solution close to the initial boundary. The minimum formula is as follows:  (20)    E   s n a k e   =  ∫ 0 1   ( α   E   e l a s t i c   ( v ( s ) ) + β   E   b e n d i n g   ( v ( s ) ) d s  +  ∫ 0 1   γ   E   e x t e r n a l   ( v ( s ) ) d s    where ν(s)=[x(s),y(s)], s∈[0,1], and ν(s) is the expression of the set of the initial boundary points after parameter normalization, that is, the set of elliptical boundary points obtained in the third step.  (21)    E   e l a s t i c   ( v ( i ) ) =   | d ′ − |   v   i   −   v   i − 1   | |     max   1 ≤ j ≤ M   { | d ′ − |   v   j   −   v   j − 1   | | }     In this equation,   E   e l a s t i c   is the elastic energy after neighborhood normalization, where M=3, the normalized area is a range 3×3, and d′ is the average distance between all adjacent points and control points.  (22)    E   b e n d i n g   ( v ( i ) ) =   |   v   i − 1   − 2   v   i   +   v   i + 1     |  2      max   1 ≤ j ≤ M   { |   v   j − 1   − 2   v   j   +   v   j + 1     |  2  }     where   E   b e n d i n g   is the bending energy after neighborhood normalization, and M is the same as that in formula (21).  (23)    E   e x t e r n a l   ( v ( i ) ) = −   M a   g   v ( i )   − M a   g   min     M a   g   max   − M a   g   min       where M a   g   v ( i )   , M a   g   v ( i )   = − | ∇ [   G   σ   ( x , y ) ⊗ I ( x , y ) ] | is the negative gradient modulus of convolving the image I(x,y) with the two-dimensional Gaussian function, whose standard deviation is σ at point ν(i), M a   g   min   and M a   g   max   are the maximum and the minimum gradients, respectively, in the area ranging 3×3 and ν(i) is its center. The segment result of Fig. 2(a) is shown in Fig. 6, where the blue curve is the final boundary of the egg.  All of the algorithms described above were implemented in MATLAB 7.9.0, where all of the algorithm parameters of Cascaded-Automation Segmentation were set as follows:  (1) The direction parameters and the scale parameters of the Gaussian Second Derivative Filter in the Radon-Like Features enhancement algorithm were m=3 and n=12, σ=[1.4, 2, 2.8], ϕ=[0, π/6, 2π/6, 3π/6,… 11π/6], the rotation step of the direction was 10 and the threshold for making the image binary was λ=0.35.  In the algorithm of the ellipse target detection based on Randomized Hough transform, four criteria for reducing noise by the “thinning and connected-component” method were St1=4, St2=0.1, St3=0.8, and St4=0.8, with the determining threshold value of elliptical object detection was Threas=0.6.  The normalized parameter of the Active Contour Model algorithm was M=3.  We chose a mean-square error (MSE) and peak signal to noise ratio (PSNR) to evaluate the quality and changing degrees of pictures after de-noising. The formulae used are as follows:  (24)  P S N R = 10   log   10    (      255  2    M S E    )       (25)  M S E =  1 K  ( Σ   S   1   −   S   0   ) ;   where S 1 is the original image, S 0 is the de-noised image and K is the size of the picture. Smaller MSE indicates that the error between the original image and the de-noised image is smaller; a higher PSNR indicates that the performance of the de-noising method is better.  The evaluation results of de-noising with Radon-Like Features and traditional methods are listed in Table 1.  It can be seen from Table 1 that the PSNR value of de-noising and enhancing with the Radon-Like Features method is 40.0718 and the MSE value is 6.3959; the MSE is the smallest and the PSNR is the highest compared with other methods of noise reduction. This indicates that this method has high de-noising performance and good usability with a small loss of useful information in the images.  We performed comparative experiments of automatic segmentation in the sample images of 60 cases separately using “Cascaded-Automatic Segmentation” and traditional segmentation methods. The traditional method in the paper involved processing sequences of segmentation under the MATLAB 7.9.0 environment, including gray-scale transformation, contrast adaptive histogram equalization, 5×5 template median filtering noise, enhancement of the image contrast with a Laplacian operator, edge detection with the Canny operator, and smoothing of the image edge with Diamond Structure Element. The segmentation results for both methods are listed in Table 2.  The “Cascaded-Automatic Segmentation” program was implemented on the sample images of 60 cases; some of their automatic segmentation results are shown in Fig. 7. Although the illumination, noise pollution, egg boundary definitions and egg positions were different, they were all segmented and labeled accurately. It is clear, therefore, that good segmentation results for parasite eggs captured from a variety of conditions can be obtained by using the Cascade-Automatic Segmentation approach proposed in this paper.  For those sample images containing several similar elliptical targets, multiple targets can be segmented using the Cascade-Automatic Segmentation approach, and it can then be determined whether the image shows S. japonicum eggs or noise depending on the edge characteristics of S. japonicum eggs. The sample images of 2 cases were analyzed in this paper; the automatic segmentation results are shown in Fig. 8.  There are significant differences in the appearance of S. japonicum eggs and those of C. sinensis. The size of the long axis of C. sinensis eggs ranges from 27 to 35μm, and the short axis ranges from 12 to 20μm; the long axis of S. japonicum eggs is from 70 to 100μm, and the short axis ranges from 50 to 60μm. With regard to shape, C. sinensis eggs are similar in shape to sesame, while S. japonicum eggs are elliptical or nearly round. In addition, the shells of C. sinensis eggs are thicker; there is a protruding cap at the narrow end and little spots on the other end. Due to the differences between C. sinensis eggs and S. japonicum eggs, the smooth edge of the egg shell can allow identification of S. japonicum eggs, as the edge of a C. sinensis egg is not smooth and is discontinuous, occasionally containing other elements. In order to effectively and quickly distinguish between S. japonicum eggs and C. sinensis eggs, the grayscale image of the egg must be processed by smoothing before edge extraction is performed. The segmentation results generated by implementing comparative experiments on S. japonicum eggs from 30 cases and C. sinensis eggs from an additional 30 cases are shown in  Tables 3 and 4.  In this experiment, we randomly selected S. japonicum eggs from 20 cases, C. sinensis eggs from 20 cases and impurity noise images from 20 cases which were used as training samples. S. japonicum eggs from another 16 cases, C. sinensis eggs from 13 cases and noise images from 19 cases were also used as predicting samples. The five-dimensional morphological features of all samples were extracted using the Quantitative Analysis Tool Software for Parasite Images [36]; these included long axis, ratio of long axis over short axis, thickness of shell, perimeter of shell and area of egg. A classification model based on SVM for parasite eggs was created using the libsvm tool kit on the five-dimensional feature data of the training sample, and the predicted samples were then classified and identified in the classification model. The classification results are listed in Table 5.   DISCUSSION   In order to apply a computer image recognition system to the clinical examination of parasites, it is necessary to study the image recognition technology of eggs in fecal extracts. The images of samples captured from fecal extracts have very heavy noise interference. In particular, eggs and their surrounding debris show the same appearance, and the key features of eggs are found in their edge. Therefore, obtaining the boundary regions of eggs is key for automatically recognizing and classifying eggs using a computer. Our proposed method has been proven using 60 cases of segmentation experiments, as the accurate marking rate of eggs was 100%. When this is compared to the 38% marking rate achieved by the traditional segmentation method, it is clear that the Cascaded-Automatic Segmentation method can greatly improve the accuracy and robustness of the traditional methods for S. japonicum eggs in the presence of heavy noise due to the use of fecal extracts. Also, this provides a good reference for the segmentation of other types of eggs collected from fecal extracts.  The Cascaded-Automatic Segmentation Method proposed in this paper shows improved coarse-to-fine segmentation according to the unique characteristics of eggs, which is achieved by integrating the Boundary Enhancement based on Radon-Like Features, Image Binarization, Ellipse Detection based on Randomized Hough Transform and Accurate Boundary Segmentation based on Active Contour Model algorithms. This method can be used to accurately identify the boundary of S. japonicum eggs in images that are generated from fecal extracts. Additionally, it can also be applied to the identification of C. sinensis eggs and multi-target detection. In this research, it was shown that parasite egg images from fecal extracts usually contain heavy noise, which makes egg identification difficult. Thus, a robust de-noising operation must be applied in the preprocessing step. In our experiments, the performances of some common de-noising methods, such as wavelet de-noising and medium filter, failed to provide satisfactory results. One reason for this may be that the noise pattern of fecal extracts is more complex and irregular than white noise. Images of S. japonicum eggs are simple segment targets because their appearance is an ellipse-like shape. According to the apparent characteristics, we applied the Radon-Like Feature filter, Binary Processing, “Thinning and Connected-Component Analysis” and Randomized Hough Transform to the image for de-noising and identifying initial points of the image segmentation during preprocessing. First, the original images were filtered and improved using a Radon-Like Feature method that would enhance the boundary of parasite egg. Then, the binary processing method was applied to filter out noise and reduce the complexity of identifying an initial target. Afterwards, “Thinning and Connected-Component Analysis” was applied to remove irregular noisy points from the processed image, which was considered an improved method compared to the already existing methods in the domain of image thinning, labeling and connected component analysis. In order to quickly obtain accurate segmentation results while processing noise in images by the above method, it is necessary to test criteria for reducing noise according to environmental conditions of collecting samples; also, this method should increase boundary smoothing in the preprocessing phase according to the characteristics of different types of eggs. The Randomized Hough Transform method was used to extract points of the raw edge after removing some of interference noise from the image. The points extracted in the above step were used as the initial points for accurate segmentation, and the Active Contour Model was used to extract the edges of the egg. Finally, a S. japonicum egg was successfully and accurately identified and labeled.  A classification model based on SVM can provide 93.8% and 92.3% recognition accuracy for S. japonicum and C. sinensis eggs, respectively, due to the following five-dimensional features: long axis, ratio of long axis over short axis, thickness of the shell, perimeter of shell and area of the egg. In order to more effectively discriminate a segmented target, and identify whether it is a parasite׳s egg and what kind of parasite it is, the classification model can be improved using the normal characteristics and abstract characteristics of parasite׳s eggs [37] to achieve automatic identification of these eggs.  In this study, we tried to segment and locate targets from multiple egg images of 2 cases using the Cascaded-Automatic Segmentation method. The experiment shows that this method can achieve automatic segmentation and positioning. In the future, it will be necessary to develop an online method for automatic identification by integrating the techniques of automatically pushing pieces, focusing and searching an image area with a microscope, in order to provide a method for automatically measuring the infection rate of parasitic diseases in the clinic.   SUMMARY   The paper proposes a Cascaded-Automatic Segmentation (CAS) approach by which S. japonicum eggs of fecal samples can be automatically segmented from their microscopic images, even with heavy noise. Firstly, image contrast degrees between egg borders and the background of all samples were strengthened by the Radon-Like Features algorithm and the enhanced image was processed into a binary image to obtain an initial data set. Then, the elliptical targets were located using Randomized Hough Transform (RHT). The fitted data of an elliptical border were considered the initial border data and the accurate border of a S. japonicum egg was finally segmented with Active Contour Model (Snake).  In our present study, 73 cases had S. japonicum eggs in the fecal samples; 61 images showed a parasite egg and 12 images did not. Although the illumination, noise pollution, boundary definition of eggs, and egg position are different, they were all segmented and labeled accurately in microscopic images. This proves that accurate borders of S. japonicum eggs could be recognized precisely by the proposed method and the robustness of the method is good, even in images with heavy noise. Therefore, our proposed method can overcome the disadvantages of the traditional threshold segmentation method which has limited adaptability to images with heavy background noise.  We certify that (1) all the listed authors have participated actively in the study and meet the requirements of the authorship; (2) all the authors have read and approved the submitted manuscript; (3) the manuscript reports unpublished work which is not currently under consideration elsewhere and will not be submitted to another journal until a final decision has been made; (4) none of the authors have any conflicts of interest with regards to this research.   ACKNOWLEDGMENTS   We would like to take this opportunity to express our thanks to Professor Dong Zhengyu from Zhongshan School of Medicine for proofreading this paper and all of the staff in the laboratory of Pathogeny Biology who collected the samples of parasite eggs. It is their excellent and patient work that has made this research possible. The study was funded by the Chinese Important Scientific Research Project on Infectious Diseases (Grant no. 2008ZX10004-011).   REFERENCES", "highlights": "Background To recognize parasite eggs automatically, the automatic segmentation of parasite egg images is very important for the extraction of characteristics and genera classification.  Methods A Cascaded-Automatic Segmentation approach was proposed. Firstly, image contrast between the border of an egg and its background for all samples was strengthened by the Radon-Like Features algorithm and the enhanced image was processed into a binary image to get an initial set. Then, the elliptical targets are located with Randomized Hough Transform (RHT). The fitted data of an elliptical border are considered the initial border data and the accurate border of a Schistosoma japonicum egg can be finally segmented using an Active Contour Model (Snake).  Results Seventy-three cases of S. japonicum eggs in fecal samples were found; 61 images contained a parasite egg and 12 did not. Although the illumination, noise pollution, boundary definitions of eggs, and egg position are different, they are all segmented and labeled accurately.  Discussion The results proved that accurate borders of S. japonicum eggs could be recognized precisely using the proposed method, and the robustness of the method is good even in images with heavy noise. This indicates that the proposed method can overcome the disadvantages of the traditional threshold segmentation method, which has limited adaptability to images with heavy background noise."}