{"id": "S001048251400119X", "article": "MAIN-TITLE Averaging of diffusion tensor imaging direction-encoded color maps for localizing substantia nigra   HIGHLIGHTS          A method for averaging diffusion direction-encoded color maps is presented.      Application in a large sample of healthy controls shows improved signal-to-noise.      Averaging in standard space helps distinguish substantia nigra from neighboring nuclei.      Substantia nigra on average maps agrees with atlas locations and individual raters.          KEYPHRASES   Diffusion tensor imaging  Substantia nigra  Red nucleus  Midbrain  Basal ganglia   Diffusion tensor imaging (DTI) is a form of magnetic resonance imaging (MRI) that is sensitive to the diffusion of water molecules [1]. Since brain tissue is coherently organized and therefore presents barriers to random diffusion, DTI has proven extremely helpful for systematically mapping in vivo the white matter architecture of the human brain [2,3]. DTI has also been used for mapping the location and subdivisions of subcortical nuclei, most notably the thalamus [4], which contains extensive connectivity with the cortical mantle. Other smaller nuclei, such as the subthalamic nucleus (STN) and substantia nigra (SN), can be visualized albeit with varying degrees of difficulty on individual subject DTI datasets [5,6], but are nonetheless critical to locate. This is especially true for targeted electrical stimulation that can alleviate some symptoms of devastating neurological disorders like Parkinson’s disease [7,8]. Yet, deep brain stimulation implants are complicated by failure rates during the targeting of small subcortical structures [9,10]. Averaging of multiple direction-encoded color maps (DECM) is one simple method for potentially improving signal-to-noise and visualization of these structures within individual subjects for targeted surgical procedures.  Another challenge is visualizing consistent patterns of the orientation of the diffusion signal across groups of subjects. While the most widely referenced DTI brain atlases present color-coded diffusion orientation maps constructed from individual subject data [11], emerging techniques seek to combine data from multiple subjects in standard space to map consistent patterns of diffusion orientation [12]. These types of DTI population studies are important for building confidence about the average location and variability of brain structures that are difficult to localize. They are also important for tracking changes over time, as degeneration occurs slowly during aging and the accumulation of iron can affect the MRI signal [13–15].  The SN, a nucleus containing dopaminergic projection neurons, is vulnerable to degeneration even before the initial symptoms of Parkinson’s disease manifest [16]. The SN is difficult to resolve on a conventional T1-weighted MRI. However, several specialized MRI sequences and analysis techniques have been used to improve the ability to resolve the SN, including proton density-weighted MRI with short inversion-time recovery images [17], neuromelanin-sensitive MRI [18], quantitative T2 mapping [19], segmented inversion recovery ratio imaging [20–22], a combination of T2⁎ and diffusion-weighted imaging [23,24], connectivity-based parcellation using probabilistic diffusion tractography [25], and multispectral MRI sequences [26].  Several of these specialized techniques have been deployed with the goal of distinguishing the pars compacta (SNc) from the pars reticulata (SNr) subdivisions of the SN. However, these studies [17,25] have provided ambiguous results regarding decreases in the volume of the SNc, the subdivision containing excitatory dopaminergic projections to the dorsal striatum, in Parkinson’s patients. While it has been demonstrated that the SN can be resolved on individual subject DTI DECM [6,11], questions remain about the consistency with which the SN can be identified from these color maps across subjects. Additional questions remain about the location of SN on these color maps with respect to stereotactic coordinates of the SN referenced from available brain atlases.  To address these questions, we developed a simple method for averaging direction-encoded anisotropy-modulated color maps in standard space. Then we explored the improvement that signal averaging affords for localizing the SN in relation to other structures of the human midbrain. We chose the SN because its small size presents a continual challenge for localization, its critical landmark status for deep brain stimulation, and its importance as a candidate biomarker of early degeneration in patients at risk of developing Parkinson’s disease [27]. Our primary objective is to demonstrate, using a large sample of healthy controls, the utility of a simple and fast directional anisotropy averaging approach for visualizing the SN in relation to nearby structures, including the red nucleus (RN) and cerebral peduncle. Using two blinded raters, we then explore the location of the SN on average DECM with respect to the delineation of this structure on individual subject DTI datasets, and in relation to reported SN coordinates from the most frequently cited brain atlases.   METHODS   A diffusion-weighted imaging sequence was obtained from 58 normal control subjects (mean age 34.1, 28 females, 5 left handed) using a 3T Philips MRI scanner (32 diffusion directions; repetition [TR]/echo time [TE] 8500/67ms; flip angle=90 degrees; 128×128 matrix, FOV=224mm; 2mm thick axial slices; b-value=800s/mm2). A high-resolution 3D T1-weighted magnetization-prepared rapid acquisition turbo field echo sequence (TR/TE=8.4/3.9ms; flip angle=8 degrees; matrix size=256×256; field of view=240mm; 1.0mm thick sagittal slices) was acquired in each subject, as well as a T2-weighted turbo-spin echo 3D volume acquisition (TR/TE=2500/367ms; echo-train length=120; pixel bandwidth=380; flip angle=90 degrees; matrix size=256×256; field of view=240mm; 1.0mm thick sagittal slices) in a subset of 16 subjects.  Analysis was performed in Analysis of Functional Neuroimages (AFNI) [28]. For each subject, the T1-weighted MRI volume was stripped of scalp and skull. To correct for subject motion over time, individual diffusion-weighted volumes were then aligned to the skull-stripped T1 volume in native space. Separately, the T2-weighted volume was aligned to the T1 volume.  At each voxel of the 32 aligned native-space diffusion volumes, a diffusion tensor was estimated by a linear least squares fitting method to obtain the three shape (eigenvalues) and three orientation parameters (eigenvectors) of the diffusion ellipsoid:  (1.1)    D  ¯    ¯   =  (        D   x x         D   x y         D   x z           D   y x         D   y y         D   y z           D   z x         D   z y         D   z z        )  →   λ   1   ,   λ   2   ,   λ   3   ,   ν   1   ,   ν   2   ,   ν   3        Using the eigenvalues, the extent of anisotropy, ranging from 0 to 1, was expressed at each voxel by computing fractional anisotropy (FA):  (1.2)  FA =    3 2          (   λ   1   −  λ ^  )  2  +   (   λ   2   −  λ ^  )  2  +   (   λ   3   −  λ ^  )  2        λ   1   2   +   λ   2   2   +   λ   3   2              With the trace:  (1.3)   λ ^  = (   λ   1   +   λ   2   +   λ   3   ) / 3      With respect to the orientation parameters, we discard v 2 and v 3 and use v 1 at each voxel, which is the orientation of the major eigenvector and represents local tissue orientation as defined by the principal diffusion direction. The major eigenvector v 1 is a unit vector consisting of x, y, and z components (v 1=[x,y,z] where x 1+y 1+z 1=1). The x, y, and z components are mapped to a combination of red, green, and blue (RGB) colors representing left–right, anterior–posterior, and superior–inferior principal diffusion directions. For example, when v 1 is [1,0,0] the RGB channels receive [255,0,0] representing a primarily left–right diffusion orientation, and when v 1 is [1/√2, 1/√2, 0] the RGB channel is [181,181,0] which maps to the color yellow.  In native space, the computed 24-bit v 1 orientation vector map was then split into three separate 8-bit volume maps, v 1x , v 1y , v 1z , which are the three color channels making up a combination RGB at each voxel.  Separately, the native space skull-stripped T1 MRI volume was spatially normalized to the Montreal Neurological Institute (MNI) Colin N27 average brain, and a 12-parameter affine transformation matrix was saved. The T2 volumes were also spatially normalized using the same transform.  Then, each separate 8-bit component color channel map, v 1x , v 1y , v 1z , was spatially transformed to MNI space by applying the transform derived by affine normalization of the skull-stripped T1 to MNI space. The three spatially normalized color channel maps were concatenated to form a new 24-bit RGB major eigenvector map, v 1norm=[v 1xnorm+v 1ynorm+v 1znorm], and multiplied by FA to produce an intensity modulated DECM in MNI space. Finally, the DECM in MNI space were averaged across subjects and used to construct a single average color map. Averages of the T1 and T2 volumes were also created for comparison.  To explore how efficiently the SN could be localized using DECM information from single-subject DTI data, two raters blinded to each other’s measurements and to the final average DECM outlined the SN bilaterally as a volume of interest (VOI) mask in a subset of 11 subjects. Their native space VOI masks were then spatially summed, and each pixel value was expressed as a percentage of agreement from 0 to 100. A value of 100 means that both raters agreed, in all subjects, that a given pixel belonged to the SN.  To provide statistical quantification of the improvement in discerning the SN as increasing numbers of DECM are averaged, a signal-to-noise analysis was performed. Within the combined 827 pixel left and right SN volume of interest mask (Fig. 3), a regional mean and standard deviation for each color channel was computed and used to compute a signal-to-noise ratio (SNR) as the number of samples in the average was increased from 4 in increments of 4:  (1.4)  SNR =  μ σ        RESULTS   Coronal slices from a single healthy control ( Fig. 1a–c), and from the average T1, T2, and DECM (Fig. 1d–f) highlight the differences in contrast between the imaging modalities, and demonstrate the improvement in contrast obtained by signal averaging. The crosshairs in Fig. 1a–f are centered at MNI (x=−11, y=−18, z=−9), the location of left SN referenced from the Talairach daemon [29]. A faint band of gray can be seen below the crosshairs in the average T1 slice (Fig. 1d). This band, putative SN proper, becomes darker and more pronounced below the crosshair in the average T2 slice (Fig. 1e) and extends inferiorly. The putative red nucleus (RN), located medially and more superior to the SN, can also be seen clearly in the average T2 slice (Fig. 1e). Whereas both the SN and RN appear dark in the average T2, these structures have different tissue orientation signatures as revealed by the average DECM (Fig. 1f), with SN appearing green and the RN appearing red.    Fig. 2 shows the average T2 and average DECM with the upper midbrain magnified. The SN is seen in a magnified upper midbrain view of the average T2 as a hypointense area between the crosshairs, while the RN is visualized as an area of circular hypointensity located more superior and medial (Fig. 2a, coronal). The SN is further distinguishable on the average DECM as a green band located inferolateral to the RN (Fig. 2d, coronal), medial to the cerebral crus (Fig. 2e, axial), and anterior and inferior to the STN and thalamus (Fig. 2f, sagittal).  The inter-rater agreement map ( Fig. 3), where a value of 100 means that both raters agreed in all subjects that a given pixel belonged to the SN, is overlaid on the average DECM (Fig. 3a–c) and occupies the area of the green band in Fig. 2d–f, distinguishable from RN and considered as putative SN proper. Inter-rater reliability was high (0.692, p<0.018). The coordinate centers of mass of the left and right summed SN agreement map are located at MNI coordinates x=−8, y=−21, z=−12 and x=8, y=−21, z=−14, respectively. These centers are 5.2 and 6.5mm (Euclidean distances) from the MNI coordinates of the left and right SN in the Talairach atlas [29]. They are also in the range of the area labeled as SN on the single subject color-coded FA map of the most popular DTI atlas [MNI x=−10, y=−15, z=−7.5 [11]] as well as a group connectivity-based parcellation map [MNI x=−9, y=−18, z=−13 [25]].  A SNR computed within the combined left and right SN region of interest (Fig. 3) is plotted for each color channel as a function of number of subject maps averaged, increasing from 4 subjects in increments of 4 ( Fig. 4). An analysis of variance (ANOVA) showed a main effect of color channel (F (2,39)=207.98, p<0.001) indicating ability to distinguish statistically among the three channels, with the green channel showing as expected the highest regional mean value in the SN than either the blue or red channels. These quantitative results are in agreement with the visual pattern indicating mostly green signal in the SN (Fig. 2d–f). For the green channel, the SNR increases from a low of 4 subject averages, exceeds 5 with 12 subject averages, and peaks at just below 6 with 28 averages. SNR in the green channel is higher in a range of 20 to 32 subject samples compared to a range of 4 to 16 subject samples (t (6)=2.951, p=0.013), but adding more subject samples does not increase the SNR further.  Finally, the clarity afforded by the average DECM allowed us to segment the left and right RN and SN separately and display them as volumetric renderings with the average T2 as a background image ( Fig. 5). The relative arrangement of these nuclei, with the SN located more anterior and inferior and the RN located more superior and medial, agrees with other imaging and histological descriptions [17].   DISCUSSION   DTI has been widely applied to mapping brain white matter connectivity using fiber tractography techniques [30,31]. It has also been used to segment brain regions by mapping the spatial variations in the preferred direction of water diffusion using computed diffusion tensors. Since different brain regions contain different tissue orientations, the first eigenvector of the diffusion tensor can capture spatially coherent diffusion signatures in white and gray matter, allowing mapping of subcortical nuclei [32,33]. This technique forms the basis for existing DTI brain atlases, where DECM from individual subjects are presented on a slice-by-slice basis in standard, usually Talairach or MNI, space [11]. Smaller subcortical nuclei, like the STN and SN are harder to visualize from individual DTI datasets [5,6]. While they can be seen to some extent on single-subject grayscale FA maps [34], and to a better extent on single-subject DECM, individual variability leaves several questions about how these smaller structures may be localized with confidence across large populations of healthy controls and patient groups [6].  To address this question we developed a simple method for averaging DECM across subjects. We computed, for each subject, the diffusion tensor and resultant DECM in the native imaging space after motion correction to correct for volume-to-volume rotational and translational shifts. Color map intensity was modulated by FA and the 24-bit volume was split into three native space volumes where each represented RGB color channels, respectively. Each of these native space 8-bit color channel maps were mapped to MNI space using an affine transform, computed by normalization of a co-registered high-resolution T1-weighted MRI. Finally, the spatially normalized color channel maps were unified to form a single intensity modulated 24-bit DECM in MNI space. These maps were then averaged across 58 healthy control subjects.  We interpreted the average DECM in relation to the SN, a subcortical area containing dopaminergic projection neurons that is small and generally accepted to be difficult to localize using a range of MRI techniques [17,18,22,24–26,35]. The resulting average DECM showed a clear improvement over single-subject color maps for visualizing the SN and distinguishing it from neighboring structures including the STN, RN, and cerebral crus. This improvement was quantified with a SNR analysis, which showed that in putative SN the SNR of the green color channel improved as the number of scans in the average increased from 4 to 28, exceeding the critical Rose criterion [36] of 5 at 12 averages. Furthermore, the coordinate location of the SN on the average DECM was within a matter of millimeters to SN locations reported in a digital version of the Talairach atlas [29], the Mori DTI atlas [11], and a recent paper localizing the SN using probabilistic connectivity mapping [25]. Finally, the location of the SN on the average DECM agreed with the results of two raters who, blinded to each other’s results and to the average map, outlined the SN on a random subset of individual healthy control datasets.  The technique described here for averaging direction-encoded color information from multiple DTI datasets has improved our confidence in localizing the SN in a large sample of healthy controls, especially since the locations we found for the SN from our average map agree with reported SN locations by other groups using different techniques. However, there are a number of caveats and qualifications for the data presented here. First, the gold standard for localizing a structure such as the SN is histological comparison, which was not attempted. Second, computing a diffusion tensor and estimating ellipsoidal parameters are used here to estimate the preferred direction of water diffusion. The limitations of the diffusion tensor approach are well documented [3], and averages computed from higher order models are likely to provide better and more accurate estimates [12,37,38].  Furthermore, we make no claims here about the ability to localize SN subdivisions such as the SNc from the SNr from the computed imaging maps [25,39]. Our results likely reflect broader SN proper and a contribution of neighboring nigral projections to other brain areas. Future interpretations of our results in the context of those achieved by other techniques, like neuromelanin-sensitive and multispectral MRI sequences and probabilistic connectivity mapping, are needed to understand how to best parcellate the SN subdivisions. Existing connectivity-based parcellation algorithms depend on knowledge of which brain areas are differentially connected to the SNc and SNr and the few studies that have attempted SN parcellation have used a priori anatomical knowledge to constrain the problem. Advances in connectivity-based parcellation could be facilitated by improvements in MRI hardware to increase spatial resolution of the diffusion-weighted images, by having algorithms consider the whole-brain search space, and by using DECM averaging as presented here to identify SN proper as input to define the entire parcellation region.  Finally, we limited analysis of the preferred tissue diffusion direction in the upper midbrain to a sample of healthy individuals, and limited intensity modulation of the color maps to FA. The subjects studied here represent a broad sample of young and old, and none have degenerative diseases like Parkinson’s or related disorders that would be predicted to alter, in some cases drastically, the size and shape of the SN [40,41]. Future studies are needed that investigate other tensor metrics, like mean, axial, and radial diffusivity that may change differently as a function of pathology [34], and compare aged healthy controls to patients with neurodegenerative disorders to understand how the tissue diffusion orientation changes as a function of disease state progression.   SUMMARY   We have shown feasibility of SN localization and SNR improvement by averaging in standard space FA volumes containing color information about the preferred direction of water diffusion. This approach should be helpful for supplementing DTI atlases that rely on DECM obtained from individual subjects [42], and for SN identification across a population when special MRI acquisition sequences are not available but conventional DTI data do exist. The averaging of DECM in stereotaxic space should be explored further, especially for guiding optimal seed placement in group resting-state functional magnetic resonance imaging (fMRI) studies [27] and for exploring SN shape changes in Parkinsonian and other types of neurodegeneration.  Support for this study was provided by Adriana Blood Endowed Chair in Neurology, Kanaly Foundation for PD Research, Ann Vande Vanter Fund for MSA Research and the Vivian L. Smith Foundation for Neurological Research. Partial funding for the purchase of the Philips 3T scanner used to collect the imaging data was provided by NIH S10 RR19186. This work was supported by the Center for Clinical and Translational Sciences, which is funded by the National Institutes of Health Clinical and Translational Award UL1 RR024148 [and/or TL1 RR024147, KL2 RR024149] from the National Center for Research Resources.  None declared.   ACKNOWLEDGEMENTS   We thank Vipulkumar S. Patel, RT, MR for help with MRI scanning and Vicki Ephron, RN for help with patient scheduling.   REFERENCES", "highlights": "Diffusion tensor imaging (DTI) is a form of MRI that has been used extensively to map in vivo the white matter architecture of the human brain. It is also used for mapping subcortical nuclei because of its general sensitivity to tissue orientation differences and effects of iron accumulation on the diffusion signal. While DTI provides excellent spatial resolution in individual subjects, a challenge is visualizing consistent patterns of diffusion orientation across subjects. Here we present a simple method for averaging direction-encoded color anisotropy maps in standard space, explore this technique for visualizing the substantia nigra (SN) in relation to other midbrain structures, and show with signal-to-noise analysis that averaging improves the direction-encoded color signature. SN is distinguished on averaged maps from neighboring structures, including red nucleus (RN) and cerebral crus, and is proximal to SN location from existing brain atlases and volume of interest (VOI) delineation on individual scans using two blinded raters."}