{"id": "S001048251400225X", "article": "MAIN-TITLE Computer-aided design of the human aortic root   HIGHLIGHTS          We have created four typical models of human aortic root based on ECHO and CT data.      We performed detailed analysis of aortic root elements dynamic during cardiac cycle.      The separate material description of annulus and sinuses can improve FEA results.          KEYPHRASES   Aortic root  Computed tomography  3D modeling  Echocardiography  Finite element analysis   Transcatheter aortic valve implantation (TAVI) is a common procedure used for the treatment of patients with severe symptomatic aortic stenosis (AS) who are not candidates for open chest surgery. During the last decade, more than 50,000 implants in over 40 countries around the world have been placed, demonstrating the reliability and quality of this technique. Despite the fact that TAVI is a preferable option for many groups of patients, its implementation can be associated with a number of complications caused by prosthesis design, namely, prosthesis migration [1], coronary ostias occlusion [2] induced by the disproportion between the frame and the recipient׳s aortic root (AR), paravalvular regurgitation [3], and atrioventricular block [4].  Novel approaches in the development of prostheses for TAVI, for example finite element analysis (FEA), involve generating accurate 3D models of the AR. Previous studies demonstrated that FEA can successfully predict biomechanical behavior of prosthesis and therefore can help to foresee potential complications and risks [5–7]. Hence, the use of FEA may greatly favor the optimization of prostheses for TAVI and similar procedures.  There are two commonly accepted approaches for the development of 3D models of the AR [8,9]. The first approach involves the development of one general model for all patients with a simplified geometry of AR elements. The main drawback of this model is that the standardised size may not fit well to all patients. Another important problem is that this model does not account for the dynamic data of the main AR elements, such as aortic annulus (AA) and sinotubular junction (STJ) systolic/diastolic dynamics. Another technique that has become increasingly popular in recent years is the “patient-specific” computer-based design of the AR [10–12], which is based on the computed tomography (CT) or magnetic resonance imaging (MRI) of the organ. In this model, the prosthesis is tailored to the individual according to the parameters of the AR elements. Despite good reliability and accuracy, this approach requires the de novo construction of the model, which increases calculation cost and time spent on prosthesis development.  Here we report a computer-aided approach for the development of 3D models of the AR for TAVI. Having calculated AR elements in a large cohort of patients, we constructed 4 models of the AR based on size, in accordance with the standard numbering of classic frame prostheses [13]. Furthermore, our model can be used for the numerical simulation of prosthesis–aortic root interaction and also may predict possible risks and complications during the implantation.  We examined 117 patients aged 18–81 with and without aortic valve disease using the transthoracic ECHO method (n=58 and 59, respectively). We used this approach not only because of its safety, but also because it is recommended as an optimal method for the evaluation of the aortic rim diameter [14]. All patients with aortic valve disease had AS with various degrees of aortic valve regurgitation (mild, moderate, moderately severe, and severe). ECHO was conducted using the ultrasound diagnostic scanner Vivid 7 Dimension (“General Electric”, USA) with the M4S-RS transducer at 1.5–3.6MHz frequency. The diameters of AA and STJ and the distance between AA and STJ were measured in longitudinal parasternal position Fig. 1.  In addition, we also used CT to measure AR elements. CT allowed us to reveal the sinuses of Valsalva, as their visualization is restricted by 2D ECHO [3]. We collected the data from 20 patients aged 60–65 years without aortic valvular diseases who underwent coronary CT. The analysis was performed using the Siemens Sensation SOMATOM 64 CT scanner (“Siemens”, Germany). Scan direction was craniocaudal, and CT characteristics were the following: field of view 200mm, pitch 0.7mm, tube voltage 120kV, electrocardiogram sync 1mm and section thickness 1mm. The contrast agent Ultravist at iodine concentration of 370mg/mL was used for intravenous injection at a dose rate of 1–1.5mL/kg of body weight. The analysis of sections was performed in coronal, sagittal and axial planes. The sections were reconstructed at the Leonardo workstation (“Siemens”, Germany). 3D-reconstruction of the sections was made in MPR-mode with the maximum slice thickness of 1–3mm and also using the VRT software (“Siemens”, Germany). CT images were analyzed according to the following criteria: the major and minor diameters of AA ( Fig. 2A), the STJ diameter, the distance between AA and STJ, the height of coronary ostia (Fig. 2B), the depth of sinuses of Valsalva (Fig. 2C), and the ascending aorta flaring angle (right and left) (Fig. 2D). Considering the complexity of AR geometry, parameters such as AA–STJ distance and depth of sinuses were measured referring to all three valve leaflets. The height of coronary arteries was measured between AA and lower edge of their ostias for both vessels. The aorta flaring angles were measured in the 3D representation of CT data referred to the coronal plane for both sides of the aorta.  Statistical analysis was performed utilizing the STATISTICA 8.0 for Windows software package (“StatSoft”, USA). The differences were tested using Student׳s t test for normally distributed continuous variables and Mann–Whitney U test for categorical variables. Means, standard deviations, and medians with quartiles were calculated to describe the characteristics of subjects involved in the study. Kruskal–Wallis test was performed when comparing three or more groups. The correlation between parameters was assessed with Spearman׳s rank correlation coefficient. Regression analysis was performed to evaluate the dynamic changes between systolic and diastolic parameters. P values less than 0.05 were considered as statistically significant.  All the parameters required for the design of 3D models were determined at peaks of systole and diastole. 3D models were created using the computer-assisted UGS NX 7.0 design software (“Siemens”, Germany). The modeling was based on the supporting elements (points, lines) in planes and sections, corresponding to the data obtained from ECHO and CT. Final 3D models were built by the consecutive connection of the supporting elements with second-order surfaces.  FEA validation of the developed aortic root models was performed using different parameters of material models obtained from literature [15,16]. ABAQUS 6.12-1 CAE software (“Dassault systemes”, France) was used for numerical simulation. For the determination of the optimal element size we performed the sensitivity analysis on the AR model “No. 19”. The starting mesh element size 0.1×0.1mm2 was increased by the factor of 4 times, 9 times, 16 times and 25 times. During the analysis, the three parameters were measured: maximum von Mises stress, radial displacement, and calculation time. Calculation time was normalized to the one obtained with the initial mesh size. The analysis showed that the mesh size of 0.2×0.2mm2 had a good agreement with the reference (deviation on stress and displacement did not exceed 5%) and acceptable calculation time ( Fig. 3).  Based on the results of the sensitivity analysis, the model “No. 19” was meshed with 21 504 shell elements (S3 and S4 type). The artificial thickness of the shell elements was 0.8mm for the AA zone, 1.3mm for the sinuses of Valsalva, and 1.8mm for the STJ [17]. To simulate the biological tissue behavior the following isotropic linear materials were used: the model with the Young׳s modulus (E) of 1.3MPa and Poisson׳s ratio (ν) of 0.49 for the whole 3D AR ( Fig. 4A) [16]; and the separate material description for the AA zone: Young׳s modulus of 13.8MPa and Poisson׳s ratio of 0.49 (Fig. 4B) [15]. Loading of the model was performed with the physiological pressure of 120mmHg in systole and 80mmHg in diastole. The Z-axis movement of the top and the bottom edges of the AR models was constrained (Fig. 4). The relative change of AA and STJ diameters during the cardiac cycle was measured for further comparison with the data obtained from ECHO.   RESULTS   The statistical analysis of the ECHO results showed that the AA diameter, the STJ diameter, and the AA–STJ distance did not differ between subjects with and without aortic valve disease in diastole (р=0.06, р=0.27, and р=0.18, respectively). The analysis of systolic/diastolic changes in the parameters of the AR by ECHO showed significant differences in the diameter of the AA (p<0.05), although neither STJ diameter nor AA–STJ distance differed between subjects (p=0.69 and p=0.82, respectively).  The main factor for the selection of the size of the heart valve prosthesis is the rim diameter, which is equal to the AA diameter; therefore, we grouped the ECHO data according to the AA diameter in diastole ( Table 1). As a result, we obtained 4 groups of the AR models: No. 19 (18mm≤AA<20mm), No. 21 (20mm≤AA<22mm), No. 23 (22mm≤AA<24mm), and No. 25 (24mm≤AA<26mm). Such a division was based on most common sizes of aortic valve prostheses. Paired comparison of the AR elements in diastole demonstrated significant differences (p<0.05) in the AA dimension between all groups and the STJ parameter between No. 19–21 and No. 23–25 groups (p<0.05). The STJ diameter in groups No. 21 and No. 23 showed no significant differences (p=0.35). The AA–STJ distance had no significant differences in pairs No. 19 and No. 21 (р=0.19), No. 21 and No. 23 (р=0.31), and No. 23 and No. 25 (р=0.29).  We could not group the CT data because the AA diameter did not correlate with right (p=0.05) and left (p=0.02) ascending aorta flaring angles, the height of right (p=0.27) and left (p=0.10) coronary ostias, depth of Valsalva sinuses: (p=0.33 for the right coronary cusp, ρ=0.19 for the left coronary cusp, and p=0.02 for the noncoronary cusp). In addition, there was no correlation between the AA diameter and the AA–STJ distance (p=0.02 for the right coronary cusp; p=0.24 for the left coronary cusp; p=0.19 for the noncoronary cusp). Also, there was no significant difference between the depth of the sinuses of Valsalva measured at right, left and noncoronary cusps. The analysis of the AA–STJ distance also showed no statistical differences between measurements with relation to the cusps. The same results were obtained for the height of coronary ostias and ascending aorta flaring angle. Based on CT data, we calculated median, minimum, maximum and quartiles for all AR elements.  The analysis of CT data ( Table 2) revealed the elliptical shape of the AA. Regression analysis showed the increase in the major AA diameter by 6.4% in systole relatively to the size of the AA in diastole with a borderline significance (p=0.057). The same parameter for the minor AA diameter was 12.4% (p<0.05). Unlike the AA, the axial section of the STJ was round in both systole and diastole with a 9.2% increase of the STJ diameter in systole as compared to diastole (p<0.05). Dynamic change of the AA–STJ distance was observed for all coronary cusps; however, statistically significant differences were obtained only for the left coronary cusp, which increased by 10.7% in diastole (p<0.05). Diastolic increase in the AA–STJ distance of the right coronary cusp was at borderline significance (8.7%, p=0.064). The height of left and right coronary ostias remained unchanged during the cardiac cycle (p=0.13 and p=0.39, respectively).  Based on the analysis of the data obtained from CT and ECHO, 4 3D-models of human AR were constructed ( Fig. 5).  The three parameters obtained by ECHO in diastole were used for the construction of support elements: the AA diameter, STJ diameter and AA–STJ distance. For the sinuses of Valsalva modeling, additional parameters obtained by CT in diastole were used: the depth of the sinuses, the height of the coronary arteries, and ascending aorta flaring angle ( Table 3). The combination of the above-mentioned supporting elements with second-order surfaces allowed us to obtain the spatial configuration of the AR, taking into account the AA diameter ( Fig. 6).  FEA experiment with the first material model (E=1.3MPa, ν=0.49 for the whole AR) showed that the AA diameter increased by 12.0% and that the STJ increased by 3.7%. The application of the second model (E=1.3MPa, ν=0.49 for the STJ zone and the Valsalva sinuses; E=13.8MPa, ν=0.49 for the AA zone) increased the AA and STJ by 2.0% and 3.4%, respectively. To obtain good agreement between FEA and ECHO results, the second material model was modified by iterative testing of various Young׳s moduli of the AA, sinuses and STJ zones. As a result, the following parameters were applied for the final material model: Young׳s modulus of 2.1MPa for the whole AR model (except the AA zone); Young׳s modulus of 4MPa for the AA zone ( Fig. 7).   DISCUSSION   In medical implantation industry, the development of a computer-based 3D model of an organ is one of the most important problems [18]. The models obtained in our study have a number of advantages in comparison with other models that are currently being used for these purposes. First, we constructed the 4 AR models based on the size of the AA, which represent the most common sizes of the AR in a population. Second, our approach can be used for the numerical simulation of prosthesis–aortic root interaction to assess the area of the contact zone, evaluate radial forces, prosthesis fixation and to evaluate the tension and irreversible deformation of the artificial heart valve. Finally, friction forces, which could be additionally included into the models, help to assess the safety of the implantation in terms of potential risks and complications.  In order to develop 4 size-based 3D models of the AR, we measured AR elements in a cohort of patients with and without AS; the analysis of the data showed no statistically significant differences between these groups. Previous studies devoted to this issue show conflicting results. On the one hand, recent analysis of CT data by Tops et al. (2008) showed no significant differences between patients with and without severe stenosis [9]. On the other hand, the studies by Ben-Dor I et al. (2005) and Paul Stolzmann (2011), based on transesophageal echocardiography (TEE) and CT, respectively, showed statistical differences between patients with and without AS [19,20].  The data obtained from ECHO are consistent with previous findings. The study from Bierbach et al. (2010) demonstrated that the average diastolic AA diameter in a control cohort was 21±2.8mm, which is 3.2% less than that in our study. Further, the authors observed that the STJ diameter was 2.6% smaller than that in our study (25±3.7mm), and the height of the sinuses of Valsalva was 5.1% less than that documented in our data (22.4±4.2mm) [21]. Dynamic analysis of the geometric characteristics during the full cardiac cycle showed that the dimension change of the AA diameter is 4.6%, which is in agreement with previous reports [22].  The data obtained from CT indicated that the shape of the AR is cylindrical in systole and trapezoidal in diastole, which is again consistent with previous studies [23,24]. Interestingly, there are some quantitative differences when comparing our CT results with the results from similar studies. In a study involving patients with normal ARs performed by Kazui et al. (2006), the AA diameter in diastole was 22.1±2.2mm (the average AA diameter was 21.6mm in our study) and the STJ diameter was 27.2 ±3.1mm (26mm in our study) [25]. Another report conducted by Jin-Sun Park et al. (2011), analyzed the CT data of the normal ARs, showing that the height of left and right coronary ostias were 12.5±1.3mm and 13.0±1.8mm, respectively [26], although in our study these parameters were 15.4mm and 16.3mm, respectively. These disparities may be explained, on the one hand, by anatomical features of the subpopulation of examined cohort and, on the other hand, by the fact that ECHO and CT methods depend on the operator who performs the measurement.  Accurate FEA requires correct material properties along with adequate 3D modeling, both of which directly affect the quality of results. However, the majority of previously reported methodologies [10,16,27] routinely use one material AR description, which may be inaccurate due to the different structure of the AA tissue [15]. Our data demonstrates that the use of simplified material model can significantly distort the results of FEA. For example, numerical simulation with the first material model increased the STJ diameter 2.6 fold as compared to ECHO data resulting in a 5% deviation of the final corrected material model. The use of single material model description for whole aortic root can lead to incorrect results of FEA of aorta-prosthesis interaction. Therefore, we recommend the use of different material properties of the AA zone even in the case of isotropic linear materials.  To conclude, we proposed four 3D models of human AR with unique geometry based on computational analysis of ECHO and CT data. Further basic, clinical, and computational research is necessary for the improvement and modernization of prostheses for TAVI.  It is important to highlight limitations of our work. The first one is the absence of valvular apparatus, which limits the use of obtained models for hydrodynamic experiments. Also, the models do not account for the elliptical shape of the AA because it is recommended to use the average AA diameter when selecting the size of the prothesis [28]. Indeed, this is why we calculated the average AA diameter. Furthermore, the simple approximation of material behavior was applied in the current study to demonstrate the potential application of the models. To obtain more accurate FEA results, we recommend the use of the non-linear material model.   SUMMARY   The development of computer-aided 3D models of the aortic root is one of the most important problems in constructing the prostheses for transcatheter aortic valve implantation. In our study, we created four models of human aortic root with unique geometry based on ECHO and CT data according to the diameter of the aortic annulus. Also, the performed detailed statistical analysis in combination with the public domain data comparison confirms reliability and accuracy of our approach. Furthermore, the current study showed different approaches to using material models during numerical simulations: applying the different material properties to the aortic annulus zone in our model can improve the quality of the results of finite element analysis. To summarize, our models may be used for the development of new prostheses that can help to evade potential complications and risks associated with implantation.  The authors declare no conflicts of interest statement.   ACKNOWLEDGMENTS   The authors would like to express their gratitude to Dr. S. Semenov, Head of the Department of Heart Disease Diagnosis, Research Institute for Complex Issues of Cardiovascular Diseases, for general support.  Supplementary data associated with this article can be found in the online version at doi:10.1016/j.compbiomed.2014.08.023.      Supplementary Data        REFERENCES", "highlights": "The development of computer-based 3D models of the aortic root is one of the most important problems in constructing the prostheses for transcatheter aortic valve implantation. In the current study, we analyzed data from 117 patients with and without aortic valve disease and computed tomography data from 20 patients without aortic valvular diseases in order to estimate the average values of the diameter of the aortic annulus and other aortic root parameters. Based on these data, we developed a 3D model of human aortic root with unique geometry. Furthermore, in this study we show that by applying different material properties to the aortic annulus zone in our model, we can significantly improve the quality of the results of finite element analysis. To summarize, here we present four 3D models of human aortic root with unique geometry based on computational analysis of ECHO and CT data. We suggest that our models can be utilized for the development of better prostheses for transcatheter aortic valve implantation."}