{"id": "S001044851400147X", "article": "MAIN-TITLE Compliant assembly variation analysis of aeronautical panels using unified substructures with consideration of identical parts   HIGHLIGHTS          Finite element models of compliant parts are condensed into unified substructures.      Substructures are reused among identical parts by transformation.      The propagation of deviations during assembly is modeled based on substructures.      An aeronautical panel assembly case is studied following the proposed method.          KEYPHRASES   Compliant variation analysis  Assembly  Aeronautical panel  Substructure   The skin–frame structured panels, as shown in Fig. 1 (a), are widely used in the aerospace industry, especially in the fuselage manufacturing  [1]. As important components of an aircraft, the geometrical quality of the panel subassemblies casts significant influence on the feasibility of subsequent assembly processes, as well as the aerodynamic characteristics and fatigue durability of the aircraft. Assembly variation analysis is an effective theoretical tool to control geometrical quality, i.e., the geometrical variations. Especially in the product development stage, this tool is widely adopted to predict the variation propagation in the assembly process and help to optimize the design  [2–5].  The kinematics-based methods were earlier developed to model variation propagation in the assembly process  [6–9]. However, for compliant parts, geometrical deviations are not only generated by kinematic motions but also by deformations introduced by loads or overconstraints. Parts of aeronautical panels are usually compliant since they are characterized by large size and small thickness, and subject to overconstraints when being assembled, as shown in Fig. 1(b); hence deformations should be taken into consideration in the assembly variation analysis of aeronautical panels.  To account for deformations of compliant parts, theories of elastic mechanics were introduced into variation analysis  [10]. Due to the irregular shapes and complicated boundary conditions of realistic parts, it is usually impossible to solve the assembly mechanics problems analytically, yet Finite Element Method (FEM) is needed to model the parts and resolve for numerical solutions. The most straightforward way to perform compliant variation analysis using FEM is the Direct Monte Carlo method  [11–13]: Finite Element Analysis (FEA) is executed to analyze the assembly deformation for a deterministic case, while Monte Carlo simulation is adopted to repeat the analysis iteratively to obtained enough statistical samples. The Direct Monte Carlo method is simple and robust, and can produce more accurate results integrating complicated nonlinear FEM  [12,13]; however it is very time-consuming since FEA needs to be run iteratively.  To improve the efficiency of compliant variation analysis, Liu and Hu  [11] developed the Method of Influence Coefficient (MIC). Based on linear elastic assumption, sensitivity matrices were used to formulate the relationship between the part deviations and the assembly spring-back deviations. These sensitivity matrices can be obtained using the unit force response method, which is substantially a regression method using the FEA results as sample data. Since only a few variables, e.g., the displacements at weld locations are considered, a sensitivity matrix based model is usually much smaller than the complete FEM models; hence the efficiency is improved significantly compared to the Direct Monte Carlo method.  Researchers from Brigham Young University developed another method, i.e., the Linear Contact Method to account for the gap-closure deformation in variation analysis  [14–16]. The equivalent deformation of parts being fastened was formulated through an Equivalent Stiffness, which was composed with the reduced stiffness matrices of parts at the fastening nodes. These reduced stiffness matrices were obtained using substructuring method. It is a more flexible method than the unit force response method, since specific displacement boundary conditions needed not to be pre-introduced.  The MIC and the Linear Contact Method have significantly improved the efficiency of compliant variation analysis, and made it more efficiency-acceptable to further perform or integrate advanced analysis, such as multistage assembly analysis, process optimization and contact analysis. Integrated with state space modeling method  [17,18], the MIC were extended to multi-station assembly systems by Camelio et al.  [19] and Yue et al.  [20]. In combination of MIC and nonlinear programming, Camelio et al. [21] and Cai  [22] conducted robust fixture design. Based on MIC, Long  [23] and Jin et al.  [24] conducted sensor placement optimization of sheet metal assembly, Wärmefjord et al.  [25] optimized the spot welding sequence. Based on MIC as well, Dahlström et al.  [26], Gerbino et al.  [27] and Ungemach et al.  [28] developed different strategies to consider the contact effect in compliant variation analysis.  Though a much leaner Deviation Propagation Model (DPM) can be obtained using MIC or linear contact method, the process of modeling may be complicated since FEA runs must be executed to acquire the sensitivity matrices or reduced stiffness matrices for every substep of the assembly process. This is especially the case when the assembly process involves a large number of parts and subprocesses, such as the assembly of aeronautical panels. To improve the efficiency of DPM construction, a substructure based method is proposed in this paper to perform compliant assembly variation analysis. Following this method, Finite Element (FE) models of compliant parts are condensed into substructures, while identical parts are considered that once one of their substructures is generated, the others can be obtained just by transformation of the generated one. By properly selecting the retained Degrees of Freedom (DOFs), the same substructures are applicative throughout the overall modeling process. Based on these unified substructures, the DPM of aeronautical panel assembly process is constructed, without needing to carry out extra FEA runs. And with Monte Carlo (MC) simulation on the attained DPM, statistical variation analysis is performed eventually.  This paper is organized as follows: Section  2 presents the model reduction method of substructuring, and the transformations of substructures. Then in Section  3, the process of DPM construction based on substructures is illustrated. Section  4 concludes the process of performing statistical variation simulation combining the DPM and MC method. A case study is presented in Section  5. And finally, conclusions are drawn in Section  6.  The FE models of realistic parts usually consist of great amount of discrete nodes and thus have large DOFs, which will bring expensive computational cost in the variation analysis. In this section, the substructuring method is used to condense a complete FE model into a leaner substructure and hence reduces the model size.  For a part made of linear elastic material which deforms within its elastic limit, the linear relationship between its displacements and the forces can be formulated as  (1)   [         K    ̃      cFcF           K    ̃      cFcu           K    ̃      cFr             K    ̃      cucF           K    ̃      cucu           K    ̃      cur             K    ̃      rcF           K    ̃      rcu           K    ̃      rr       ]   {       u     cF           u     cu           u     r       }  =  {       F     cF           F     cu           F     r       }  .   According to the characteristics on boundary conditions during the assembly process, DOFs are generally fall into three categories: (1) DOFs subject to constant loads during the assembly process, e.g., free DOFs subject to zero loads or constant environmental loads such as gravity, decorated with a subscript “cF”; (2) DOFs whose displacements remain constant during the assembly process, decorated with a subscript “cu”; (3) DOFs of which both displacements and loads are variables during the assembly process. They will be retained for the variation analysis, decorated with a subscript “r”. The displacements and loads of the latter DOFs may vary due to: (1) different steps of the process; (2) different samples, i.e., different individuals of the product or different iterations of MC simulation; (3) different schemes of the process. All the stiffness submatrices are constant and decorated with a topscript “       ˜    ”.  As the first step to analyze how a compliant part deforms during the assembly process, the constant boundary conditions can be pre-introduced. They can be written as  (2)   {       F     cF    =      F    ̃      cF           u     cu    =      u    ̃      cu           F     r    =    F     r     v    +      F    ̃      r          where the third equation divides the total loads on the retained DOFs into two parts: the constant environmental loads      F    ̃      r    , and the variable parts    F     r     v    . Substitute Eq. (2) into Eq. (1), we have  (3)   (      K    ̃      rr    −      K    ̃      rcF         K    ̃      cFcF    − 1        K    ̃      cFr    )     u     r    =    F     r     v    +      F    ̃      r    −      K    ̃      rcF         K    ̃      cFcF    − 1        F    ̃      cF    +  (      K    ̃      rcF         K    ̃      cFcF    − 1        K    ̃      cFcu    −      K    ̃      rcu    )       u    ̃      cu    .   For the calculation of    u     r    and    F     r      (    F     r     v    )  , Eq. (3) is equivalent to Eq. (1) but with smaller size, where  (4)       K    ̃      rr    ′   =      K    ̃      rr    −      K    ̃      rcF         K    ̃      cFcF    − 1        K    ̃      cFr      is the reduced stiffness matrix with condensed mechanical characteristics of the part, and   (5)       F    ̃      r    ′   =      F    ̃      r    −      K    ̃      rcF         K    ̃      cFcF    − 1        F    ̃      cF    +  (      K    ̃      rcF         K    ̃      cFcF    − 1        K    ̃      cFcu    −      K    ̃      rcu    )       u    ̃      cu       (6)     F     r    ′   =    F     r     v    +      F    ̃      r    ′      are the relevant reduced environmental load vector and reduced total load vector respectively, a prime is used to denote the reduced matrix or vector. The reduced stiffness matrix and the reduced environmental load vector together constitute the substructure of a part. Note that, the reduced stiffness matrix may be singular if the restraints of the “cu” DOFs cannot fully eliminate the kinematic motion of the part. To accomplish the calculation of Eq. (3), supplementary displacement constraints must be introduced.  The unknown displacements of the “cF” DOFs and unknown forces of the “cu” DOFs cannot be obtained from Eq. (3). If some of them are required, the related DOFs should be classified into “r” DOFs rather than “cF” or “cu” DOFs. So the retained DOFs should include: (1) DOFs of which both displacements and loads vary during assembly process, mainly the Key Control Characteristics (KCCs) with interactions with other parts or fixtures; (2) DOFs whose information need to be queried, mainly the Key Product Characteristics (KPCs).  The condensation process above is based on a static formulation, so it is named Static Condensation or Guyan Condensation after its proposer Guyan  [29–31]. This process may be as time consuming as conducting an ordinary FEA run since matrix inversion is involved, but the condensed substructure is applicable as long as Eq. (2) is satisfied. So throughout the overall process of static compliant variation analysis, by properly selecting the retained DOFs, a compliant part, or rather, the large-sized complete FE model of this part can be represented with a much leaner unified substructure without loss of accuracy.  A condensation example of a clip which is widely used as connecting parts in aeronautical panels, is shown in Fig. 2 . Its FE model consists of 627 nodes and 582 shell elements whose size is approximately 5×5 mm2. None of these nodes is subject to constant displacement constraints throughout the assembly process, and there are 617 free nodes subject to gravity load only. The remaining 10 nodes include: 2 locating nodes and 1 riveting node onto the skin, 2 riveting nodes with a premounted stringer, 1 located node for a postmounted sheetframe and 4 riveting nodes with it. These 10 nodes are retained after the condensation, together with 5 of the free nodes which are retained for measuring.  The material is Al alloy with thickness h = 1.6   mm  , Young’s modulus E = 86   GPa  , Poisson’s ratio υ = 0.33 and density ρ = 2770   kg  /    m    3   . The FE model is constructed in ABAQUS®, and the stiffness matrix and gravity vector of the whole structure are formed internally. Then the unified substructure of the retained nodes, i.e., the reduced stiffness matrix and gravity vector are generated following Eqs. (4) and (5), which is also implemented in ABAQUS®. We have   (7)       K    ̃      rr    ′  clip    =    [    1037.65        ⋱        122973    ]    90 × 90      (8)       G    ̃      r    ′  clip    =    {    9.19205  e  − 06     ⋮     − 9.05903  e  − 04    }    90 × 1   .    Their scales are just about 1/42 of the original stiffness matrix and gravity vector.  Because of structural symmetry, the aeronautical panel assemblies often contain batches of identical parts, especially in the frames. Since these identical parts only differentiate from each other in positions and orientations, the generated substructure of one of them can be reused among the others; nevertheless transformation needs to be made when their orientations differentiate.  Without loss of generality, we use two clips, clip A and clip B to illustrate the process of substructure transformation, as shown in Fig. 3 . The unified substructure of clip A has been generated under the global Coordinate System (CS), as Eqs. (7) and (8).   Transformation of reduced stiffness matrix: Suppose that there is a CS   X   ̇     Y   ̇     Z   ̇   , under which clip B holds the same orientation as clip A does under the global CS X Y Z , as shown in Fig. 3(a). There is  (9)       K    ̃     ̇       B    =  [         K    ̃     ̇       cFcF     B           K    ̃     ̇       cFcu     B           K    ̃     ̇       cFr     B             K    ̃     ̇       cucF     B           K    ̃     ̇       cucu     B           K    ̃     ̇       cur     B             K    ̃     ̇       rcF     B           K    ̃     ̇       rcu     B           K    ̃     ̇       rr     B       ]  =  [         K    ̃      cFcF     A           K    ̃      cFcu     A           K    ̃      cFr     A             K    ̃      cucF     A           K    ̃      cucu     A           K    ̃      cur     A             K    ̃      rcF     A           K    ̃      rcu     A           K    ̃      rr     A       ]  =      K    ̃      A      where the parameters with topscript “ ⋅ ” are achieved under CS   X   ̇     Y   ̇     Z   ̇   , while parameters without “ ⋅ ” are under the global CS. Substituting Eq. (9) into (4), we have   (10)       K    ̃     ̇       rr    ′  B    =      K    ̃      rr    ′  A       (11)       K    ̃      rr    ′  A    ⋅      u    ̇      r     B    =      F    ̇      r    ′  B    .    Assume that the transformation matrix from CS X Y Z to CS   X   ̇     Y   ̇     Z   ̇   of    u     r     B    and    F     r    ′  B    is    T     total    . We have   (12)       K    ̃      rr    ′  A    ⋅    T     total    ⋅    u     r     B    =    T     total    ⋅    F     r    ′  B       (13)       K    ̃      rr    ′  B    =    T     total    − 1        K    ̃      rr    ′  A    ⋅    T     total    .    And    T     total    can be written as:  (14)     T     total    =    [       T    3 × 3          ⋱           T    3 × 3      ]    6 n × 6 n     where  T  is the relevant CS transformation matrix for a single 3D vector, and n is the number of retained nodes.  Since displacement and force are vector quantities, translation of parts, i.e., the difference in position between clip A and clip B will have no impact on the transformation.  T  is just an orientation transformation matrix, whose determinant  (15)   ‖  T  ‖  =  {    1 ,   rotation only     − 1 ,   rotation & reflect .           Transformation of reduced load vector: According to different characteristics of the loads to be reduced, the transformation can be partitioned into two cases.   Case 1: The loads to be reduced are those whose orientations stick with the part orientation, e.g., internal heat stress and residual stress of parts. This is similar to the characteristics of stiffness matrix, and so does the transformation process.  In this case, besides Eq. (9), there are  (16)   {         F    ̃     ̇       r     B    =      F    ̃      r     A             F    ̃     ̇       cF     B    =      F    ̃      cF     A             u    ̃     ̇       cu     B    =      u    ̃      cu     A          substituted into Eq. (5), we have   (17)       F    ̃     ̇       r    ′  B    =      F    ̃      r    ′  A       (18)       F    ̃      r    ′  B    =    T     total    − 1   ⋅      F    ̃     ̇       r    ′  B    =    T     total    − 1   ⋅      F    ̃      r    ′  A    .        Case 2: The loads to be reduced are those whose orientations remain constant as the part orientation changes, e.g., gravity.  In this case, project the gravity of clip B onto the normal directions of CS   X   ̇     Y   ̇     Z   ̇   , as shown in Fig. 3(b). We have  (19)       G    ̃     ̇       B    =      G    ̃     ̇       B     x    ̇     ⋅ cos     α   ̇      B    +      G    ̃     ̇       B     y    ̇     ⋅ cos     β   ̇      B    +      G    ̃     ̇       B    z   ̇     ⋅ cos     γ   ̇      B      where      G    ̃     ̇       B    x   ̇     ,      G    ̃     ̇       B    y   ̇     and      G    ̃     ̇       B    z   ̇     are three virtual gravity load cases of clip B along the normal directions of CS   X   ̇     Y   ̇     Z   ̇   respectively, and cos     α   ̇      B    , cos     β   ̇      B    , cos     γ   ̇      B    denote the direction cosines which can be further written as  (20)   {    cos     α   ̇      B        cos     β   ̇      B        cos     γ   ̇      B       }  =  T  ⋅  {    cos   α    A        cos   β    A        cos   γ    A       }    where cos   α    A    , cos   β    A    , cos   γ    A    are the direction cosines of      G    ̃      A    under CS X Y Z , and  (21)   {    cos   α    A        cos   β    A        cos   γ    A       }  =  {    0     − 1     0    }    where, “−1” indicates that the gravity load is along the negative direction of axis Y . After condensation, there is  (22)       G    ̃     ̇       r    ′  B    =      G    ̃     ̇       r    ′  B    x   ̇     ⋅ cos     α   ̇      B    +      G    ̃     ̇       r    ′  B     y    ̇     ⋅ cos     β   ̇      B    +      G    ̃     ̇       r    ′  B     z    ̇     ⋅ cos     γ   ̇      B    .   Suppose that      G    ̃      Ax    ,      G    ̃      Ay    and      G    ̃      Az    are three virtual gravity load cases of clip A along the normal directions of CS X Y Z respectively, so there is  (23)   {         G    ̃     ̇       B    x   ̇     =      G    ̃      Ax             G    ̃     ̇       B    y   ̇     =      G    ̃      A   y             G    ̃     ̇       B    z   ̇     =      G    ̃      A   z    .       Following Eq. (17), we have  (24)   {         G    ̃     ̇       r    ′  B    x   ̇     =      G    ̃      r    ′  Ax             G    ̃     ̇       r    ′  B    y   ̇     =      G    ̃      r    ′  A   y             G    ̃     ̇       r    ′  B    z   ̇     =      G    ̃      r    ′  A   z    .       Substituted into Eq. (22), there is   (25)       G    ̃     ̇       r    ′  B    =      G    ̃      r    ′  Ax    ⋅ cos     α   ̇      B    +      G    ̃      r    ′  Ay    ⋅ cos     β   ̇      B    +      G    ̃      r    ′  Az    ⋅ cos     γ   ̇      B       (26)       G    ̃      r    ′  B    =    T     total    − 1   ⋅      G    ̃     ̇       r    ′  B    =    T     total    − 1   ⋅  (      G    ̃      r    ′  Ax    ⋅ cos     α   ̇      B    +      G    ̃      r    ′  Ay    ⋅ cos     β   ̇      B    +      G    ̃      r    ′  Az    ⋅ cos     γ   ̇      B    )  .       So before performing a transformation of the reduced gravity vector, condensation should be conducted upon a total of 3 virtual gravity load cases of clip A first, rather than condensing      G    ̃      A    only. Each of the 3 virtual gravity load case is along one of the normal directions of CS X Y Z separately. We have  (27)   [         G    ̃      r    ′  Ax           G    ̃      r    ′  Ay           G    ̃      r    ′  Az       ]  =    [    3.34472  e  − 02   − 9.19205  e  − 06   6.02762  e  − 05     ⋮   ⋮   ⋮     − 3.05533  e  − 02   9.05903  e  − 04   − 2.06845  e  − 03    ]    90 × 3     which will form an orthonormal basis for composing the actual reduced gravity load.   Construction of the CS transformation matrix   T  : The CS   X   ̇     Y   ̇     Z   ̇   cannot be established directly, however its transforming relationship with CS X Y Z can be derived with the help of local part CSs.  As shown in Fig. 3(a), CSs   X   A     Y   A     Z   A   and   X   B     Y   B     Z   B   are local CSs of clip A and clip B respectively. For a 3D vector, supposing the transformation matrix from CS X Y Z to CS   X   A     Y   A     Z   A   is    T     A    , the transformation matrix from CS   X   A     Y   A     Z   A   to CS   X   B     Y   B     Z   B   is    T     AB    , and the transformation matrix from CS   X   ̇     Y   ̇     Z   ̇   to CS   X   B     Y   B     Z   B   is    T     B    . Then  T  can be formulated as  (28)   T  =    (    T     B    )    − 1   ⋅    T     AB    ⋅    T     A    .   Since clip B holds the same orientation under CS   X   ̇     Y   ̇     Z   ̇   as clip A does under CS X Y Z , there is  (29)     T     A    =    T     B    .   Substituted into Eq. (28), we have  (30)   T  =    (    T     A    )    − 1   ⋅    T     AB    ⋅    T     A    .      The local part CS can be established using 4 characteristic points on the part, where the first 3 points are not collinear and the total of 4 points are not coplanar. To reduce the calculation error, it would be better that the first 3 points are selected as apart as possible. As shown in Fig. 4 , 4 riveting points on the clip are selected,   P   1   as the origin, the direction X of the part CS is from   P   1   to   P   2   . Its unit vector is  (31)       e    ⇀     1   =    {      P   2   x −   P   1   x     P   2   y −   P   1   y     P   2   z −   P   1   z    }     |  {      P   2   x −   P   1   x     P   2   y −   P   1   y     P   2   z −   P   1   z    }  |    .   The direction Y is perpendicular to the direction X , while pointing to   P   3 .   Its unit vector is  (32)        e    ⇀     2   =    {      P   3   x −   P   1   x     P   3   y −   P   1   y     P   3   z −   P   1   z    }  −  ζ  ⋅  {      P   2   x −   P   1   x     P   2   y −   P   1   y     P   2   z −   P   1   z    }     |  {      P   3   x −   P   1   x     P   3   y −   P   1   y     P   3   z −   P   1   z    }  −  ζ  ⋅  {      P   2   x −   P   1   x     P   2   y −   P   1   y     P   2   z −   P   1   z    }  |        ζ =    (   P   2   x −   P   1   x )   (   P   3   x −   P   1   x )  +  (   P   2   y −   P   1   y )   (   P   3   y −   P   1   y )  +  (   P   2   z −   P   1   z )   (   P   3   z −   P   1   z )       (   P   2   x −   P   1   x )    2   +    (   P   2   y −   P   1   y )    2   +    (   P   2   z −   P   1   z )    2     .    And the direction Z is perpendicular to direction X and Y , while pointing to   P   4   . Its unit vector is  (33)        e    ⇀     3   =  {       {      ζ   1       ζ   2       ζ   3      }     |  {      ζ   1       ζ   2       ζ   3      }  |    ,     ζ   4   < 0     −    {      ζ   1       ζ   2       ζ   3      }     |  {      ζ   1       ζ   2       ζ   3      }  |    ,     ζ   4   > 0           ζ   1   =   P   1   y ⋅   P   2   z +   P   2   y ⋅   P   3   z +   P   3   y ⋅   P   1   z −   P   1   y ⋅   P   3   z −   P   2   y ⋅   P   1   z −   P   3   y ⋅   P   2   z       ζ   2   =   P   3   x ⋅   P   2   z +   P   2   x ⋅   P   1   z +   P   1   x ⋅   P   3   z −   P   1   x ⋅   P   2   z −   P   2   x ⋅   P   3   z −   P   3   x ⋅   P   1   z       ζ   3   =   P   1   x ⋅   P   2   y +   P   2   x ⋅   P   3   y +   P   3   x ⋅   P   1   y −   P   1   x ⋅   P   3   y −   P   2   x ⋅   P   1   y −   P   3   x ⋅   P   2   y       ζ   4   =   ζ   1   ⋅  (   P   4   x −   P   1   x )  +   ζ   2   ⋅  (   P   4   y −   P   1   y )  +   ζ   3   ⋅  (   P   4   z −   P   1   z )     in Eqs. (31)–(33),   P   i   x ,   P   i   y and   P   i   z , i = 1 – 4 , are the coordinates of   P   1   –   P   4   .  Finally,    T     A    ,    T     AB    can be constructed with the unit direction vectors of the relevant CSs   (34)     T    i j    A    =      e    ⇀     i    A    ⋅      e    ⇀     j      (35)     T    i j    AB    =      e    ⇀     i    B    ⋅      e    ⇀     j    A       where i ,  j = 1 – 3 ,      e    ⇀      A    ,      e    ⇀      B    ,    e    ⇀   are the unit direction vectors of CS   X    A      Y   A     Z   A   ,   X   B     Y   B     Z   B   and X Y Z respectively. They should be evaluated under the same CS, and for convenience, that will be the global CS X Y Z .  The global coordinates of the points used to construct the part CSs of clip A and clip B are as below:  (36)   [      P   1    A          P   2    A          P   3    A          P   4    A       ]  =  [    − 398.4   − 301.46   1907.272     − 398.4   − 451.783   1892.831     − 388   − 385.152   1950.742     − 374   − 297.894   1950.382    ]  ,   [      P   1    B          P   2    B          P   3    B          P   4    B       ]  =  [    − 398.4   85.405   1907.272     − 398.4   − 64.775   1892.831     − 388   12.076   1950.742     − 374   97.506   1950.382    ]  .   Following Eqs. (30)–(35), the transformation matrix  T  can be obtained:  (37)   T  =  [    1   − 4.54782  e  − 07   − 4.30584  e  − 06     − 4.14041  e  − 07   0.979867   − 0.199652     4.30994  e  − 06   0.199652   0.979867    ]  .   Then following Eqs. (7), (13), (14) and Eqs. (14), (20), (21), (26), (27) respectively, reduced stiffness matrix and gravity vector of clip B are acquired eventually.   (38)       K    ̃      rr    ′  B    =    [    1037.65        ⋱        123121    ]    90 × 90      (39)       G    ̃      r    ′  B    =    {    − 3.03309  e  − 06     ⋮     2.59326  e  − 04    }    90 × 1   .       After all of the compliant parts involved in the assembly process have been condensed into unified substructures, boundary conditions on the retained DOFs can be further introduced according to specific assembly process, and the relationship between the deviations of sources and the assembled product, i.e., the DPM, can be formulated.   Table 1 shows a typical example of the aeronautical panel assembly process, which involves a skin and a single stringer. This process consists of three basic subprocesses: (1) Fixturing. As shown in Table 1(a), the skin is clamped onto the fixture by 4 locating holes; (2) Locating by DA holes. As shown in Table 1(b), the stringer is located onto the prefixtured skin by 3 pairs of predrilled holes on them using dowels. These part–part locating holes are called “Determinant Assembly” (DA) holes in the aeronautical industry  [32,33]. Since the tying effect of the dowels, this step is not only a locating process but also a fastening one; (3) Riveting. As shown in Table 1(c), the two parts are riveted together at the riveting holes, which have been reamed out to guarantee the concentricity before riveting.  A more complicated assembly process of actual aeronautical panels can also be decomposed into the aforementioned subprocesses, while these basic subprocesses can be further decomposed into the classic Position, Clamp, Fasten and Release (PCFR) subprocesses  [34], as shown in Table 1. Here, the kinematic displacement is accounted for together with deformation, and the “Position” subprocess is integrated into the “Clamp” subprocess. The remaining “Clamp”, “Fasten” and “Release” subprocesses are called the element subprocesses in this paper.  Note that: (1) Restricted by the structure, the DA holes of frame parts such as stringer and clip are usually placed collinearly, in this case, the out-of-plane rotational DOFs of the DA holes should also be constrained to avoid under-constraint, as shown in Table 1(b); (2) Because of the reaming out before riveting, the in-plane translational DOFs will not be constrained at the riveting holes in the “clamp” stage, as shown in Table 1(c).  So an actual aeronautical panel assembly process can be eventually decomposed into a number of element subprocesses. The subDPMs of these element subprocesses can then be constructed separately.  In this section, besides the three kinds of element subprocesses mentioned above, the applying of gravity will be treated as a fourth element subprocess, and the subDPMs of these four kinds of subprocesses will be formulated.   Clamp: In this subprocess, the clamped DOFs of the clamped part/subassembly are constrained to certain positions, which is fixture for the locating holes or another part/subassembly for DA/riveting holes.  The retained DOFs of the clamped part/subassembly are classified into three sorts: (1) DOFs fixed at where they are, i.e., the prefixed DOFs by fixture, decorated with a superscript “B”; (2) DOFs to be clamped, decorated with a superscript “C”; (3) the remaining DOFs which are free, decorated with a superscript “E”. We have  (40)   [         K    ̃      rr    ′  BB           K    ̃      rr    ′  BC           K    ̃      rr    ′  BE             K    ̃      rr    ′  CB           K    ̃      rr    ′  CC           K    ̃      rr    ′  CE             K    ̃      rr    ′  EB           K    ̃      rr    ′  EC           K    ̃      rr    ′  EE       ]   {    d    u     r     B        d    u     r     C        d    u     r     E       }  =  {    d    F     r    ′  B        d    F     r    ′  C        d    F     r    ′  E       }  .      The sources of deviations in this subprocess are  (41)  d    u     r     C    = d      u    ˆ      r     C    =      P    ̃      r     CT    +    u     r     CT    −      P    ̃      r     C    −    u     r     C      where      P    ̃      r     C    and    u     r     C    are the nominal coordinates and existing deviations by this subprocess of the clamped DOFs on the clamped part/subassembly,      P    ̃      r     CT    and    u     r     CT    are the nominal coordinates and existing deviations by this subprocess of the “target” DOFs, i.e., the clamp-to DOFs on fixture or a premounted part/subassembly, and the topscript “ˆ” on d    u     r     C    denotes it is a known input for this subprocess.  So the boundary conditions of this subprocess are  (42)   {    d    u     r     B    =  O      d    u     r     C    = d      u    ˆ      r     C        d    F     r    ′  E    =  O  .       Substituted into Eq. (40), the variation of deviations and forces in this step can be acquired   (43)  d    u     r    =  {    d    u     r     B        d    u     r     C        d    u     r     E       }  =  {     O      d      u    ˆ      r     C        −    (      K    ̃      rr    ′  EE    )    − 1        K    ̃      rr    ′  EC    d      u    ˆ      r     C       }  =  [     O       I      −    (      K    ̃      rr    ′  EE    )    − 1        K    ̃      rr    ′  EC       ]  d      u    ˆ      r     C       (44)  d    F     r    ′   =  {    d    F     r    ′  B        d    F     r    ′  C        d    F     r    ′  E       }  =  [         K    ̃      rr    ′  BB           K    ̃      rr    ′  BC           K    ̃      rr    ′  BE             K    ̃      rr    ′  CB           K    ̃      rr    ′  CC           K    ̃      rr    ′  CE             K    ̃      rr    ′  EB           K    ̃      rr    ′  EC           K    ̃      rr    ′  EE       ]   [     O       I      −    (      K    ̃      rr    ′  EE    )    − 1        K    ̃      rr    ′  EC       ]  d      u    ˆ      r     C    =  [         K    ̃      rr    ′  BC    −      K    ̃      rr    ′  BE       (      K    ̃      rr    ′  EE    )    − 1        K    ̃      rr    ′  EC             K    ̃      rr    ′  CC    −      K    ̃      rr    ′  CE       (      K    ̃      rr    ′  EE    )    − 1        K    ̃      rr    ′  EC         O     ]  d      u    ˆ      r     C    .    Then following Eq. (41), and denoting the transition matrices in Eqs. (43) and (44) as   S    du    C   and   S    dF    C   respectively, we have  (45)   {       u     r     ( i )           F     r    ′  ( i )       }  =  {       u     r     ( i − 1 )           F     r    ′  ( i − 1 )       }  +  {     d     u     r     ( i )         d     F     r    ′  ( i )       }  =  {       u     r     ( i − 1 )           F     r    ′  ( i − 1 )       }  +  [       S     du    C  ( i )           S     dF    C  ( i )       ]   {      P    ̃      r     CT    +    u     r     CT   ( i − 1 )    −      P    ̃      r     C    −    u     r     C   ( i − 1 )    }    where the superscripts “  ( i )  ” and “  ( i − 1 )  ” denote “of/after this subprocess” and “by this subprocess” respectively.   Fasten: In this subprocess, each of the fastened DOFs of one part/subassembly is tied to the relevant DOF of another at where they are using rivets or dowels. This subprocess will not cause deformation since local plastic deformation is not considered in this paper, while the pairs of tied DOFs will move together from then on.  Supposing the two fastened parts/subassemblies are A and B, classify the retained DOFs of them into two sorts separately: (1) DOFs to be fastened, decorated with a superscript “F”; (2) the other DOFs, decorated with a superscript “O”. Combining the linear elastic equations of these two parts/subassemblies, we have  (46)   [         K    ̃      Arr    ′  OO           K    ̃      Arr    ′  OF               K    ̃      Arr    ′  FO           K    ̃      Arr    ′  FF                 K    ̃      Brr    ′  OO           K    ̃      Brr    ′  OF               K    ̃      Brr    ′  FO           K    ̃      Brr    ′  FF       ]   {    d    u     Ar     O        d    u     Ar     F        d    u     Br     O        d    u     Br     F       }  =  {    d    F     Ar    ′  O        d    F     Ar    ′  F        d    F     Br    ′  O        d    F     Br    ′  F       }  .      And the boundary conditions of this subprocess are  (47)  d    u     Br     F    = d    u     Ar     F      substituted into Eq. (46), we have  (48)   [         K    ̃      Arr    ′  OO           K    ̃      Arr    ′  OF              K    ̃      Arr    ′  FO           K    ̃      Arr    ′  FF    +      K    ̃      Brr    ′  FF           K    ̃      Brr    ′  FO              K    ̃      Brr    ′  OF           K    ̃      Brr    ′  OO       ]   {    d    u     Ar     O        d    u     Ar     F        d    u     Br     O       }  =  {    d    F     Ar    ′  O        d    F     Ar    ′  F    + d    F     Br    ′  F        d    F     Br    ′  O       }  .   And the reduced stiffness matrix of the assembly AB can be acquired  (49)       K    ̃      ABrr    ′   =  [         K    ̃      Arr    ′  OO           K    ̃      Arr    ′  OF              K    ̃      Arr    ′  FO           K    ̃      Arr    ′  FF    +      K    ̃      Brr    ′  FF           K    ̃      Brr    ′  FO              K    ̃      Brr    ′  OF           K    ̃      Brr    ′  OO       ]  .   As for the total deviations and forces of the subassembly/assembly, we have  (50)   {       u     ABr     ( i )           F     ABr    ′  ( i )       }  =  {       u     Ar     O   ( i − 1 )           u     Ar     F   ( i − 1 )           u     Br     O   ( i − 1 )           F     Ar    ′  O   ( i − 1 )           F     Ar    ′  F   ( i − 1 )    +    F     Br    ′  F   ( i − 1 )           F     Br    ′  O   ( i − 1 )       }  =  [     I               I        O             I            I               I        I             I      ]   {       u     Ar     O   ( i − 1 )           u     Ar     F   ( i − 1 )           F     Ar    ′  O   ( i − 1 )           F     Ar    ′  F   ( i − 1 )           u     Br     O   ( i − 1 )           u     Br     F   ( i − 1 )           F    ′    O   ( i − 1 )     Br             F     Br    ′  F   ( i − 1 )       }  = ⋯  {       u     Ar     ( i − 1 )           F     Ar    ′  ( i − 1 )           u     Br     ( i − 1 )           F     Br    ′  ( i − 1 )       }  .       Release: In this subprocess, the clamped DOFs or just part of the clamped DOFs are set free, and the clamped subassembly/assembly springs back.  Classify the retained DOFs of the released subassembly/assembly into three sorts: (1) DOFs fixed at where it is, decorated with a superscript “B”; (2) DOFs to be released, decorated with a superscript “R”; (3) the remaining DOFs which are free, decorated with a superscript “E”. We have  (51)   [         K    ̃      rr    ′  BB           K    ̃      rr    ′  BR           K    ̃      rr    ′  BE             K    ̃      rr    ′  RB           K    ̃      rr    ′  RR           K    ̃      rr    ′  RE             K    ̃      rr    ′  EB           K    ̃      rr    ′  ER           K    ̃      rr    ′  EE       ]   {    d    u     r     B        d    u     r     R        d    u     r     E       }  =  {    d    F     r    ′  B        d    F     r    ′  R        d    F     r    ′  E       }  .   Since after releasing, only gravity will be left on the released DOFs, there is  (52)     F     r    ′  R    + d    F     r    ′  R    =      G    ̃      r    ′  R      where    F     r    ′  R    is the total forces on the released DOFs by this subprocess. And the sources of deviations in this subprocess are  (53)  d    F     r    ′  R    = d      F    ˆ      r    ′  R    =      G    ̃      r     R    −    F     r    ′  R    .      So the boundary conditions of this subprocess are  (54)   {    d    u     r     B    =  O      d    F     r    ′  R    = d      F    ˆ      r    ′  R        d    F     r    ′  E    =  O  .       Substituted into Eq. (51), the variation of deviations and forces in this subprocess can be acquired (see Box I ).   Gravity loading: In this subprocess, the reduced gravity load is applied onto a part.  Classify the retained DOFs of the part into two sorts: (1) DOFs fixed at where they are, decorated with a superscript “B”; (2) the remaining DOFs which are free and subject to gravity load only, decorated with a superscript “E”. We have  (58)   [         K    ̃      rr    ′  BB           K    ̃      rr    ′  BE             K    ̃      rr    ′  EB           K    ̃      rr    ′  EE       ]   {    d    u     r     B        d    u     r     E       }  =  {    d    F     r    ′  B        d    F     r    ′  E       }  .      The sources of deviations in this subprocess are the reduced gravity vector      G    ̃      r    , and the boundary conditions of this subprocess are  (59)   {    d    u     r     B    =  O      d    F     r    ′  E    =      G    ̃      r     E          substituted into Eq. (58), the variation of the deviations and forces in this subprocess can be acquired   (60)  d    u     r    =  {    d    u     r     B        d    u     r     E       }  =  {     O         (      K    ̃      rr    ′  EE    )    − 1        G    ̃      r     E       }  =  [     O     O       O       (      K    ̃      rr    ′  EE    )    − 1      ]       G    ̃      r       (61)  d    F     r    ′   =  {    d    F     r    ′  B        d    F     r    ′  E       }  =  [         K    ̃      rr    ′  BB           K    ̃      rr    ′  BE             K    ̃      rr    ′  EB           K    ̃      rr    ′  EE       ]   [     O     O       O       (      K    ̃      rr    ′  EE    )    − 1      ]       G    ̃      r    =  [     O         K    ̃      rr    ′  BE       (      K    ̃      rr    ′  EE    )    − 1        O     I     ]       G    ̃      r    .    Denoting the transition matrices in Eqs. (60), (61) as    S     du    G   and    S     dF    G   respectively, we have  (62)   {       u     r     ( i )           F     r    ′  ( i )       }  =  {       u     r     ( i − 1 )           F     r    ′  ( i − 1 )       }  +  {    d    u     r     ( i )        d    F     r    ′  ( i )       }  =  {       u     r     ( i − 1 )           F     r    ′  ( i − 1 )       }  +  [       S     du    G  ( i )           S     dF    G  ( i )       ]       G    ̃      r    .      The timing of applying gravity should be paid attention to. It would be better to apply the gravity onto a part as soon as enough kinematic constraints have been introduced, which will be more closed to the actual conditions, though the timing will have no impact at all on the final results if the DPM is purely linear.  By substituting the relevant unified substructures and boundary conditions into Eqs. (43)–(45), or (49)–(50), or (55)–(57), or (60)–(62), subDPM of every element subprocess involved in the assembly process can be constructed without executing extra FEA runs. And then by combining these subDPMs sequentially, i.e., taking the output of the  ( i − 1 )  th subDPM as the input of the i th subDPM, the multistage DPM of the overall process is eventually obtained:  (63)     X     ( n )    =   f   n    ( …   f   2    (   f   1    (    X     ( 0 )    ,     u     fix    ,       G    ̃      r    )  )  )    where  X  is a state vector of deviations and forces of all the parts involved in the assembly,    u     fix    is the deviation vector of the fixture,      G    ̃      r    is the reduced gravity of the parts, and   f   i   is the subDPM of the i th element subprocess.  Compared to the original complete FE models, Eq. (63) is an explicit and much leaner model to formulate the deviation propagation, since only the KC DOFs are considered using substructures. And the process of constructing this DPM is efficient, since no extra FEA run is needed.  Since the process of assembly is generally a random process, to evaluate this process, statistical analysis will be needed rather than a single case analysis. This is what distinguishes “variation analysis” from a general deformation analysis using FEM. With the DPM obtained in Section  3, there are two common methods to perform statistical analysis: (1) Analytical method  [10,11,14–16], which analytically estimates the moments of output, i.e., the assembly deviations based on the moments of input, i.e., deviations of parts and fixtures, and their relationship, i.e., the DPM; (2) Numerical method  [10–12,26,28], i.e., the MC method, which repeats the deviation propagation analysis iteratively with the DPM and random source deviations to accumulate enough samples of assembly deviations, whose statistical characteristics are then be evaluated. The analytical method is efficient but limited to conditions where the DPM is explicit and linear, while the MC method is a more general method since it works well even when the DPM is implicit and nonlinear. In this paper, we choose the MC method to insure the generality. The process of performing statistical compliant variation analysis using unified substructures is concluded in Fig. 5 .  The first step is to construct the FE models of the compliant parts. And if there is a batch of identical parts in the assembly, just model one of them. Afterwards, generate the stiffness matrices and gravity vectors based on these FE models. Then condense them into unified substructures and make transformation if needed for reuse to other identical parts, following the procedures illustrated in Section  2. After the unified substructure of every compliant part is obtained, the DPM is then constructed according to the assembly process, following the procedures illustrated in Section  3. At last, statistical analysis is performed using MC simulation. Iteratively, random deviations of the sources, i.e., KCs of parts and fixture, are generated according to their tolerances, and then substituted into DPM to acquire the relative assembly deviations. A number of researches have been conducted in the field of generating deviations from tolerance  [14,15,35–39], mainly on the consideration of geometrical covariance. But in this paper, for simplicity, we just assume that these deviations are independent and follow normal distributions, holding a relationship with their tolerances as T = 6 σ .  This example is a panel subassembly of the side fuselage, whose size is about 2000×2000×200 mm3. The subassembly consists of a skin, 4 stringers, 6 clips and 2 sheetframes, as shown in Fig. 6 . The assembly sequence is skin–stringers1–4–clips1–6–sheetframes1–2.   Material properties: The material of the skin and stringers is Al–Li alloy with Young’s modulus E = 86   GPa  , Poisson’s ratio υ = 0.33 and density ρ = 2600   kg  /    m    3   , while the thickness of the skin is 2 mm and stringers is 1.27 mm. The material of the clips and sheetframes is Al alloy with thickness h = 1.6   mm  , Young’s modulus E = 86   GPa  , Poisson’s ratio υ = 0.33 and density =2770 kg/m3.   Interactions among parts and fixture: The skin is located and fixed at the fixture at 4 earholes and another 18 locating blocks which only control the normal-surface directions, represented with yellow triangles in Fig. 6. The stringers are then located onto the skin by DA holes, and riveted with the skin. The clips are located onto the skin as well, while riveted with both the skin and one of the stringers. At last, the sheetframes are located onto the clips and riveted with them. The DA holes and riveting holes are represented with blue crosses and red dots respectively, as shown in Fig. 6.   Sources of deviations: The sources of deviations are the manufactured deviations at KCs of the parts and fixture. It is assumed that these deviations are independent and follow normal distribution, and hold a relationship with their tolerances as T = 6 σ . The tolerance scheme is listed in Table 2 .  The FE modeling of the skin, one of the stringers, one of the clips and one of the sheetframes are conducted with shell element (S4/S3) in ABAQUS®, so does the generation of their unified substructures. The unified substructures of the remaining 9 parts are acquired just by transformation of the generated ones, conducted in MATLAB®. By substructuring, the total nodes of the models are reduced from 75,818 to 574.  The DPM is then constructed according to the assembly process. The overall process is decomposed into 25 basic subprocesses: the fixturing of the skin, the locatings and rivetings of the 12 frame parts, and further into a total of 86 element subprocesses: 25 “clamp” subprocesses, 24 “fasten” subprocesses, 24 “release” subprocesses and 13 “gravity loading” subprocesses. With the unified substructures and interaction conditions stated in Section  5.1, subDPMs of these four kinds of subprocesses are constructed following the relative procedures illustrated in Section  3.2, and finally combined into an overall DPM. The DPM construction work is performed in MATLAB®  as well, while no extra FEA run is executed. And by contrast, up to 273 cases need to be analyzed by FEA using the MIC to construct the DPM.  To validate the accuracy of the constructed DPM, a deterministic deviation propagation analysis is conducted, with both DPM and complete FEA. The complete FEA is conducted in ABAQUS®  with complete FE models. Predefined fields are used to carry out multi-step analysis, and MPC ties to simulate the fastening between parts.  The source of deviation is a −1 mm deviation at earhole 3 in the fixture, and the corners of the skin are chosen to place the measure points as shown in Fig. 6, where deviations in the normal-surface direction are measured. For simplicity, results are shown after every 5 subprocesses. The comparison of the analysis results from the DPM to complete FEA is shown in Fig. 7 , drawn with scatters and lines respectively. It is observed that, the results from the DPM are coincident with those from complete FEA.  With the constructed DPM, statistical variation analysis is performed in MATLAB®  using MC simulation, iterations =500. The distributions and statistical characteristics of the assembly deviations are shown in Fig. 8 and Table 3 .  The evolution of the statistical variations as the assembly process advances is also investigated, as shown in Fig. 9 (a). For simplicity, only the results after a part is completely assembled are shown. It reveals that the variations do not accumulate and increase acutely throughout the assembly process, this may be due to: (1) The skin is overconstrainted on the fixture throughout the assembly process, which will stiffen the skin equivalently, and thus reduce the impact of the frame parts on the assembly variations [11]; (2) Frame parts are relatively small to the skin, and have little impact on the MPs far from them.  The first hypothesis can be supported by investigation of the reacting forces at the fixturing spots. As shown in Fig. 9(b), reacting forces in normal-surface direction at the 4 earholes are investigated; the results indicate that, the reacting forces increase significantly, while the skin is restricted to deform. And if we release the subassembly/assembly from the fixture every time before measures are taken, the variations will increase much more acutely as the assembly process advances, as shown in Fig. 9(c). Note that, the variation of MP3 is much larger than the other 3 MPs, it can be explained by the fact that the 3 reference points of the first measure datum, i.e., earholes 1, 2 and 4, are close to MP1, MP2 and MP4 respectively.   CONCLUSIONS   A new method for performing aeronautical panel assembly variation analysis is proposed. By static condensation and transformation, all of the compliant parts are condensed into unified substructures which are much smaller than the complete FE models. And based on these unified substructures, the overall process DPM is constructed by integrating the subDPM of every subprocess. Finally, statistical variation analysis is performed with MC simulation on the constructed DPM. An aeronautical panel assembly case is studied following the proposed method, and both the model size and FEA runs needed for DPM construction are reduced. The analysis results show that, the assembly of frame parts may not have significant impact on the geometry of the skin if the skin is overconstrainted on the fixture throughout the assembly and measure process.  The proposed method is efficient both in modeling and computing while maintaining the same accuracy as complete FEA. Besides aeronautical panels, it can be used to analyze the assembly process of other mechanical products as well.   ACKNOWLEDGMENTS   The work described in this paper is supported in part by the grants from the Foundation for Innovative Research of the National Natural Science Foundation of China (No. 51121063), the Program of Introducing Talents of Discipline to Universities of China (No. B06012) and the Special Funding Project for Technology Innovation of Commercial Aircraft Corporation of China Ltd. (No. 821203-04). The authors are grateful for these financial supports.   REFERENCES", "highlights": "The assembly process of aeronautical panel usually involves numerous parts and subprocesses. Thus a large number of Finite Element Analysis (FEA) runs are required to construct its compliant Deviation Propagation Model (DPM), when using the traditional compliant assembly variation analysis methods such as the Method of Influence Coefficients and the Linear Contact method. In this paper, an efficient DPM construction method based on substructures is proposed to reduce the modeling complexity. Finite element models of compliant parts are condensed into substructures which have relatively fewer Degrees of Freedom (DOFs). And for the identical parts commonly used in the aeronautical panels, once the substructure of one part is generated, the substructures of the others can be obtained by transformation of the generated one. By properly selecting the retained DOFs, the same substructures are applicative throughout the overall modeling process. Based on these unified substructures, the DPM of aeronautical panel assembly process is constructed, without executing extra FEA runs. A case study on a panel subassembly of the side fuselage is used to illustrate the proposed method. The results show that, this method reduces the model size as well as the model construction work, while maintaining the same accuracy as complete finite element analysis conducted in a commercial software package.       (55)  d    u     r    =  {    d    u     r     B        d    u     r     R        d    u     r     E       }  =  {     O         [         K    ̃      rr    ′  RR           K    ̃      rr    ′  RE             K    ̃      rr    ′  ER           K    ̃      rr    ′  EE       ]    − 1    {    d      F    ˆ      r    ′  R         O     }     }  =  [     O         [      K    ̃      rr    ′  RR    −      K    ̃      rr    ′  RE       (      K    ̃      rr    ′  EE    )    − 1        K    ̃      rr    ′  ER    ]    − 1       −    (      K    ̃      rr    ′  EE    )    − 1        K    ̃      rr    ′  ER       [      K    ̃      rr    ′  RR    −      K    ̃      rr    ′  RE       (      K    ̃      rr    ′  EE    )    − 1        K    ̃      rr    ′  ER    ]    − 1      ]  d      F    ˆ      r    ′  R       (56)  d    F     r    ′   =  {    d    F     r    ′  B        d    F     r    ′  R        d    F     r    ′  E       }  =  [         K    ̃      rr    ′  BB           K    ̃      rr    ′  BR           K    ̃      rr    ′  BE             K    ̃      rr    ′  RB           K    ̃      rr    ′  RR           K    ̃      rr    ′  RE             K    ̃      rr    ′  EB           K    ̃      rr    ′  ER           K    ̃      rr    ′  EE       ]   {     O         [         K    ̃      rr    ′  RR           K    ̃      rr    ′  RE             K    ̃      rr    ′  ER           K    ̃      rr    ′  EE       ]    − 1    {    d      F    ˆ      r    ′  R         O     }     }  =  [         K    ̃      rr    ′  BR       [      K    ̃      rr    ′  RR    −      K    ̃      rr    ′  RE       (      K    ̃      rr    ′  EE    )    − 1        K    ̃      rr    ′  ER    ]    − 1   −      K    ̃      rr    ′  BE       (      K    ̃      rr    ′  EE    )    − 1        K    ̃      rr    ′  ER       [      K    ̃      rr    ′  RR    −      K    ̃      rr    ′  RE       (      K    ̃      rr    ′  EE    )    − 1        K    ̃      rr    ′  ER    ]    − 1        I       O     ]  d      F    ˆ      r    ′  R    .    Then following Eq. (53), and denoting the transition matrices in Eqs. (55) and (56) as    S     du    R   and    S     dF    R   respectively, we have  (57)   {       u     r     ( i )           F     r    ′  ( i )       }  =  {       u     r     ( i − 1 )           F     r    ′  ( i − 1 )       }  +  {    d    u     r     ( i )        d    F     r    ′  ( i )       }  =  {       u     r     ( i − 1 )           F     r    ′  ( i − 1 )       }  +  [       S     du    R  ( i )           S     dF    R  ( i )       ]   {      G    ̃      r     R    −    F     r    ′  R   ( i − 1 )    }  ."}