{"id": "S001048251500222X", "article": "MAIN-TITLE Evaluation of the continuous detection of mental calculation episodes as a BCI control input   HIGHLIGHTS          The mental calculation task proposed produces EEG dynamics similar to MI.      The mental task realization is always verifiable.      Performance of the detection of task episodes is above the standard for MI.      Classification is done using only eight input features, both spectral and non linear.          KEYPHRASES   Mental calculation  Scaling exponent  PSD  BCI  SVM   Brain Computer Interfaces (BCI) can be divided into two major categories, depending on the instant when instructions from the user are received by the system [1]. The synchronous BCI, exemplified by the traditional P300 Speller, covers implementations that cue up when the mental activity must be executed. For the second class, asynchronous BCI, the operation is completely paced by the user. Event Related Desynchronization/Synchronization (ERD/ERS) paradigms become dominant for such type of applications [2]. The operation of an asynchronous BCI takes into consideration that the subject can activate the BCI at any moment; thereby, the system must be capable of changing from standby to active states according to the user׳s willing. The use of mechanisms like Motor Imagery (MI), which produce changes on ERD/ERS, has been proposed to control this type of BCI, because changes of the EEG dynamics can be modulated entirely by the subject without needing stimulation to elicit them. Several factors play important roles for a good operation of such paradigms. For instance, the power on the mu band achieved by the user during resting periods [3,4], or the relationship between the power over the alpha and theta bands [5]. The use of the ERD/ERS paradigm then supposes that the subject is actually performing the imagination of a motor task. But the correct execution of such task is not verifiable by an external element, because only the feedback is actually related to the execution of the corresponding task. Yet, a bad calibration will produce a poor performance. In principle, improvements may be achieved by changing feedback strategies [6], and/or modifying the resting paradigm [3]. Nonetheless, it is considered that between 10 and 30% of the population is not able to control a BCI based on this paradigm [4]. A study presented by Guger et al. [7] shows that in about 48% of sessions subjects achieved an accuracy between 50 and 69%. Additionally, proficient subjects may need several training sessions before reaching a reliable level. The selection of other mental tasks that elicit detectable changes on the ongoing EEG could then be useful for those subjects that cannot control reliably a MI-BCI, like it happens to subjects with cerebral palsy or other neural diseases that affect the motor cortex [8], perhaps accelerating the adaptation to its use or even increasing the degrees of freedom of the system [9,10].  Paradigms that elicit Steady State Potentials (either visual, auditory or somatosensory [11]) could also be used as inputs for an asynchronous system, but an exogenous stimuli is still unavoidable by demanding the subjects to attend it. This condition is not possible for subjects affected with some kind of neural disabilities like palsy or Parkinson׳s disease. Some other paradigms like silent reading, imagining a 3D figure rotation, mental calculation or even silent singing, also elicit changes on the dynamics of the EEG signals and on the cortical networks as occurs with MI [12–14]. Given that these tasks are endogenous and self-controlled by the user, any of them could be used to control an asynchronous BCI, without the need of an exogenous stimuli.  For instance, mental arithmetic as a task to control a BCI was first suggested by Keirn and Aunon [13], who classified segments of EEG recordings associated with the execution of one of five different tasks. Their experiments were performed without interleaving tasks and each paradigm was repeated five consecutive times. In a posterior work, Anderson et al. [15] classified the data obtained by Keirn and Aunon using a neural network, and Obermaier et al. [16] experimented with a similar paradigm including again an arithmetic task. Another approach was followed by Penny et al. [17], identifying either mental arithmetic versus MI or baseline versus MI. Their paradigm consisted in successive interleaved periods to perform any of these tasks; features extracted from an AR model and power spectral analysis were used again as input for the classification. Roberts et al. [18] used an experimental paradigm similar to that used by Penny, but changed the duration of the block size. In a later work, the same group suggested that the use of non-linear characteristic could improve the classification performance [19]. These two experimental setups (either Penny et al. [17] or Roberts et al. [18]) indicate that mental calculation is easier to detect in combination with MI. These four studies use the same mental calculation task: ‘the serial subtractions of seven from a large number’, and the classification was obtained using artifact-free segments, which are not possible in an actual BCI system. Yet, the utilization of more complex arithmetic operations has not been explored. Experiments led by Fernández et al. [20], showed that the execution of mental arithmetic produces significant changes on spectral power in all bands and on several sites. Dehane et al. [21,22] have demonstrated that the execution of an arithmetic task involves several networks, located mainly on the parietal lobe and angular gyrus and that, depending of the operation that is presented, different mechanisms can be activated in order to solve the task. Furthermore, an advantage of assessing a mental calculation task as control of BCI systems relies, first, on the possibility of verifying that the users are actually doing the calculation, which is important to perform a good calibration process; and second, on the fact that any person with basic arithmetic training may be able to participate (even BCI naive subjects). Both are characteristics that the classical MI paradigm lacks, and that may speed up the process of setting a BCI with a new user.  This paper evaluates the performance of a continuous detection of mental computation versus resting episodes, simulating the conditions for an online BCI, by using short analysis windows (two seconds length) and few EEG channels (four), which could be useful to build a switch and/or add a degree of freedom to an actual system. The mental task suggested here involves a broader approach than those previously presented, using four basic operations in a scheme that involves both, remembering results, and combining operations with and without carry. Several evaluations were attained, first, a cross-validation test (during the same session), and second, by transferring the model generated with data from one session to analyze recordings from different sessions. This last evaluation, which has not been reported before, helps to identify if it is possible to start a BCI session by avoiding a set up procedure for the system. Additionally, the classification performance using linear (PSD) and non-linear (Scaling Exponent) features, either individually or in combination, was also evaluated.  For the mental calculation experiments fifteen volunteers were recruited (eight female), aged 25.3±3.47 years old, all with high school studies completed. The volunteers participated during three experimental sessions on different days according to their time availability (the elapsed time between consecutive sessions ranged from 6 to 110 days). In each session, two or three runs of the mental calculation paradigm were completed depending on the fatigue that each subject expressed. An experimental run involved the solution of fourteen series of three to five mental calculation operations, previously defined and randomly selected. For all operations, the results and operands were integers lower than 100. A detailed explanation of the paradigm is presented in the next section.  A 32 channel EEG montage was used; the electrodes were located at the positions: Fp[z,1,2], AF[7,3,z,4,8], F[7,3,z,4,8], Fc[3,4], T[7,8] C[3,z,4], Cp[3,4], PO[3,4], P[7,3,z,4,8] and O[1,2,z]; using the right mastoid as ground and linked-ears as reference. All recordings were acquired using a g.USBamp system (from g.tec medical engineering, Austria), with a sampling rate of 512sps, a bandpass filter between 0.1 and 60Hz and a notch filter centered at 60Hz. These parameters are in accordance with standard practices to reduce contamination from several artifacts, like EOG [23,1].  Subjects were seated in front of a monitor and instructed to mentally solve the operations indicated, avoiding movements as much as possible. Subjects verbalized the final results at specific times and their answers were contrasted against the correct value. Those episodes with a mismatched response were discarded for the analysis (4–36% of the trials were rejected by this criterion); thereby ensuring that subjects completed the task and were not guessing the answer. This decision was taken to avoid periods of “false” task realization similar to those that may occur within the MI paradigm.  An entire run was composed of an initial period of 20s with a blank screen, 14 sets of interleaved operation-resting and 20 additional seconds of a blank screen, a complete run duration ranged between 406 and 425s. The operation-resting sets consisted in the presentation of five different type of stimuli, always in same order, intending to generate periods of activation (mental calculation) and resting states (idle). These stimuli were grouped as follows: Cue (“X” on screen, ready), Begin (one number between 1 and 20), Operate (mental calculation, operation and number), Answer (“=” on screen, verbalize answer) and Rest (blank screen, idle). All stimuli had a duration of two seconds and the inter-stimulus interval was randomly selected between 625 and 725ms ( 625 ≤ ISI ≤ 725 ). A set of operations was defined from the appearance of a Cue screen until the last Rest screen (just before the next Cue). A screen sequence used for these experiments is exemplified in Fig. 1 .  The operands of each calculation were: the previous result or the number at the Begin stimulus, and the actual one shown on the current screen (it means that the subject must concatenate consecutive operations as depicted in Fig. 1). In each run of the experiment, fourteen sets of operations were randomly selected from a database of 96 sets. The sets were equally distributed in 3, 4 or 5 mental calculations, and blank screen subsets of 4, 3 or 2; respectively (neither Cue, Begin nor Answer screens are included in these counts). A complete set lasted between 26.2 and 27.5s (corresponding to 11 screens of two seconds plus the inter-stimulus times), and no repetition of the same set was allowed during a run. The duration of the blocks, Operate and Rest, was large enough to produce detectable changes on the ongoing EEG similar to those of the MI paradigm [24]. The different number of calculations and resting windows were chosen to avoid the habituation of subjects.   METHODS   All EEG recordings were referenced using the “common average” to increase the signal-to-noise ratio [25] and filtered with a Butterworth lowpass linear filter at 40Hz to diminish the effect caused by muscular artifacts [1,23]; raw ADC conversion data were used. All these considerations were followed to reduce the computation load. The EEG data of each session were arranged in epochs, of two seconds length synchronized with the presentation of the Operate and Rest screens; for each set of calculations the Operate state was then comprised of 4, 5 or 6 and the Rest state by 4, 3 or 2 epochs. For each epoch and each channel, two indices were estimated to characterize distinct features of the EEG dynamics:  •  Power spectral density over the beta band (PSD,   β   PSD   [14–35]Hz [26]; assessed using the Welch periodogram method with a window length of 1 second, overlapping 90% and using 1024 points of resolution.   Scaling exponent (SE,   α   SE   ); estimated using the algorithm proposed by Peng [27–30], within a range from 20 to 500ms (n from 10 to 256 samples and linear detrending). See Appendix A for more details on its calculation.  Using the sets of both indices, the Area Under the ROC Curve (AUC) 1   1 Due to the imbalance over the number of windows associated to each period, the AUC was used as the parameter to evaluate the differences between the data distributions of the different sets and the performance in the classification task [31–33]. was estimated over each channel and each index separately, to find differences between Operate and Rest states. For this evaluation either   β   PSD   or   α   SE   indices were used as single features to separate classes. The AUC values were sorted and the four channels that presented the highest values, two for   α   SE   and two for   β   PSD   , were selected as input channels for the BCI-simulation operation. If any electrode of this selection coincided, the following channel with the highest AUC value was chosen. This selection was restricted to AF[3,z,4], F[7,3,z,4,8], FC[3,4], C[3,z,4], CP[3,4] and P[3,z,4] channels, due to neurophysiological considerations related to mental calculations [21,22,26,34,35].  To evaluate the performance of the paradigm described on Section 2.2 as a BCI implementation, the AUC of two classification processes was estimated. First for a Cross Validation (CV), using data of only one session and bootstrapping; and second for an inter Session Validation (iSV) using a model generated from one session to classify data from the other sessions. For this purpose the following strategy was used.  First, spectral and scaling indices (   β   PSD   and   α   SE   ) were estimated over the four selected channels, using a sliding window of two seconds length with an overlapping of 70%; thus, every 600ms these values were assessed and a control output of the BCI was obtained (posterior probability reported by classifier). The parameters to estimate the indices were the same as those used for the Section 3.1, but for this step the epochs were not synchronized with the stimulus presentation, because of the random selection for the ISI duration. Both indices were filtered using a simplified Kalman filter (known as the alpha-beta filter that is described in [36–38]) using constant parameters for all subjects (α=0.2 and β=0.01, these values were empirically estimated). This filtering was applied to reduce the variance of the running indices associated with estimation inaccuracies. All running estimations were arranged and labeled guided by the type of screen presented. Whereas the Begin and Operate stimuli were considered as Active, the Rest screens were regarded the complementary set. Giving different duration of each set, the number of screens used for this step ranged from 17 to 26 for the first set and from 8 to 17 for the other set. The Cue and Answer stimuli were discarded, neither to generate the model nor to evaluate the performance. The combination of indices values, in total eight(four for each   β   PSD   and   α   SE   indices), were used as entry features of a Support Vector Machine (SVM) to discriminate the two states [39], using the LIBSVM implementation [40].  The second phase of the BCI simulation consisted in the generation of a classification model that optimizes the separation between both states and the evaluation of its AUC value to classify new data. Given the data and context [39], a SVM with radial kernel was selected as a classifier and its hyperparameters (cost and γ) were optimized according with AUC values, using a 20-fold repeated random sub-sampling process [41,40]. Due to computational requirements, indices values were fitted in the range 0–1, using a sigmoidal transformation whose parameters were estimated for each index and each channel; these parameters were included as part of the model to analyze EEG data recorded on other sessions (iSV). In this step, independent classifications using only   β   PSD   or   α   SE   , were also tested. These three evaluations (indices used individually and combined) are considered as the CV process shown in the Results section.  Finally, once that the model was generated (having the classifier and sigmoidal transformation parameters), the performance to discriminate states acquired on different days (other sessions) was assessed. Thus, the models derived from each session were used to evaluate the remaining two sessions, and the performance was evaluated using again the AUC. This evaluation is called here inter Session Validation (iSV). 2   2 Flow chart of the Methods can be found in the supplementary material.     RESULTS    Fig. 2 shows the distribution of the channel selection probability to conform the analysis set for the mental state identification of the fifteen subjects (ratio between the times that each channel was selected divided by the total number of sets). The majority of selections resided over parietal-central areas and remarkably the Pz channel was selected almost 60% of the times. According to Dehaene et al. [42] and Vuokko et al. [34], the parietal cortex is the area where the numerical representation resides, suggesting that this area is likely involved in the identification process of mental calculation.  The mean values of   β   PSD   and   α   SE   estimated over Pz for each of the fifteen subjects are shown in Fig. 3 (a) and (b), respectively. The same behavior is observed for all sessions, in general   β   PSD   values increase during resting periods and the opposite relation occurs with   α   SE   . Fig. 3 shows those subjects with statistical significant difference ( p < 0.05 , using a t-test, red dots in the figure) following these tendencies. Individual comparisons of both conditions indicate the existence of significant differences for the   β   PSD   index in 11, 10 and 11 subjects for each respective session, while a similar number of individual differences for the   α   SE   index (9, 10 and 11) is also observed. Those subjects that did not seem to present individual differences, were not the same on both indices, suggesting an individual tendency to achieve a better classification level with one or the other index [30].  The mean AUC values obtained for each session are shown in Table 1 and their distributions in Fig. 4 . It is appreciated that the combination of indices ([   β   PSD       α   SE   ]) achieves a significant better classification p < 0.015 versus the utilization of just one of them (   β   PSD   or   α   SE   ), according with a t-test for multiple comparisons. The performance comparisons of each independent index show significant differences just for one session (S003). For all sessions the mean population AUC value of   α   SE   becomes larger than the values achieved for   β   PSD   . Also an ANOVA test was performed to compare performances along sessions, finding no significant differences ( p > 0.05 ), neither for each index nor their combination. These results indicate that the best identification for a BCI control would be achieved using the combination [   β   PSD       α   SE   ] as input features, and that there is no statistical evidence of an improvement of the performance associated with having practiced the paradigm in previous sessions. Yet, for all combinations, there seems to be a reduction of the variance and in general the highest mean values of AUC are associated with the third session (Table 1).  As stated in Section 3.2, the models generated for each session were used to identify the mental activity on the remaining two sessions. Table 1 shows the mean AUC value obtained for this evaluation, and Fig. 4 shows the distributions. The mean iSV values assessed per subject are presented in Fig. 5 . As can be observed, nine out of fifteen subjects could be considered as potential BCI “literates” (60% of the population, under this paradigm), but only two, those marked with an “⁎” in Fig. 5 offered a significant difference from the BCI “literates” threshold [43].  Two examples of subjects that either achieved low or high AUC values for the iSV validation are depicted in Fig. 6 . The posterior probability output of the SVM (SVMpp) is proposed as a signal to operate a BCI on-line control. For subject #10 (AUC=0.82, Fig. 6(a)) it is evident that the SVMpp signal follows the changes associated with the execution of the task, even in the period were the subject mismatched the final result (green block). For subject #11, with a low performance (AUC=0.61, Fig. 6(b)), the SVMpp signal is harder to associate with the sequence of mental states, despite that the bigger values do seem to occur inside the blue blocks (Activity).   DISCUSSION   The mean AUC values achieved for the CV process confirm that it is possible to use a mental calculation paradigm as a BCI control (at least for one degree of freedom). The correct classification of periods performing mental arithmetic versus rest, was expected because of the EEG changes in several and well identified networks, just as presented in [20–22,42,35]. Like a recent publication demonstrated, subjects affected by cerebral palsy can use basic mental arithmetic as a BCI control task by achieving a performance better than a random operation [8]. Notwithstanding that a full comparison with previous works cannot be established, because of the differences between paradigms and the parameters of evaluation, it is noted though that the utilization of a paradigm like the one proposed here would improve the performance of an arithmetic-BCI by involving relevant dynamic mental driven-changes as depicted in Fig. 6. Previous studies that identified arithmetic versus other tasks, obtained mean accuracy values with an overall evaluation of 0.613 [17] and 0.865 by rejecting epochs (0.532 for non-rejection) [18]; 0.53 for the identification an scenario involving other four classes (with an overall performance of 0.526) [16]; and 0.577 for the identification of an scenario versus three others (with an overall performance of 0.61) [14]. All these results seem closer to a chance level than the results presented in this paper, i.e. AUC=0.88. This improvement probably results from the use of a paradigm that incorporates several mental processes, and not only the serial subtractions of the same number, and from the use of a combination of linear and non-linear features, confirming the results of Roberts et al. [19] and Bojorges-Valdez et al. [30]. Nonetheless, it is still necessary to evaluate the interference caused by the feedback, the effect of no stimulation to guide the task, as well as other causes of possible distraction to assess in more detail the level of performance for a BCI based on mental calculation. It is important to note that the utilization of cues in this experimental setup may affect in two ways: either because the presentation of the cues generates an evoked potential, or because the guidance of the subject through the test (by indicating the operation to perform) makes it easier to follow the periods of activity and rest. Yet, even by eliciting an evoked potential, the estimation of the indices is not substantially affected, owing to the fact that the visual evoked potential is mainly generated by components on alpha band and from occipital regions [44,45], and the fact that the SE is an index estimated under the consideration of non-stationarities [27] like happens during an evoked potential. The guidance of the subject in this evaluation is indispensable, to ensure the execution of the task; but for an online BCI operation, the beginning and ending of the tasks would be completely decided by the subject. For this reason, a further experimentation with no guidance is still needed to assess a better evaluation of the mental calculation as a BCI control.  Interestingly, the utilization of the SE index (   α   SE   ), related to the signal dynamics and not only the spectral power, improves the identification of the mental task. As can be seen in Fig. 4, the mean AUC value is larger when the combination of indices is used, showing significant differences for all sessions ( p < 0.05 , t-test). In population terms, the use of either PSD or SE achieves similar results (no statistical differences were found, except for the S003 session), but all mean AUC values of   α   SE   were larger than those of   β   PSD   and some subjects are more sensitive to one or the other index, in accordance with previous findings [30]. The evaluations of the CV process also suggest that a lower level of “illiteracy” would become manifest if the proposed BCI is calibrated and used in the same session, compared against a MI-controlled BCI (see CV values in Table 1 and Fig. 4). It seems that there is no clear effect associated with training the subjects. ANOVA tests show no significant differences, meaning that subjects could perform acceptable levels from the first time of use. Additionally, even if a calibration obtained several days before is rather used, the subject could mildly use the BCI just as it seems to happen with the current paradigms based on a Motor Imagery (MI) strategy, which are dependent on a calibration obtained on the same day (see iSV values in Figs. 4 and 5 and [4,5,7,46]). The differences on the performance shown between CV and iSV, may result from changes on the mean values of the PSD [3,4], and this factor may also become important for the SE. These changes affect in two ways, either by the sigmoidal transformation or by the data distribution in the new space; both affect the boundaries previously defined for each class. A more detailed analysis in this particular point must be addressed to confirm these ideas.  For the signal analysis scheme presented here, it was not necessary to perform an exhaustive search for specific frequency bands, neither for the optimal channel combination of each subject, which for the MI strategy seems unavoidable [47,48]. This characteristic could reduce the calibration time, without introducing a reduction of the BCI performance. Furthermore, the mental calculation verification allowed the possibility of achieving a consistent epoch labeling. This situation has a positive impact on the calibration of the BCI, because it avoids the use of epochs where the execution of the task is questionable. Despite that for the paradigm presented here it is necessary to stimulate the subject by presenting the operation to be performed, this could be eventually substituted in a real BCI system in several ways; for example, asking subjects to complete a series like: 3, 5, 8, 10, 13,… In this example only the adding operation is involved, but its completion requires that the subject remembers the previous result, the actual summand to be used, and eventually some operations will present carry.  The mean values of the indices associated with the different states of the mental calculation task demonstrate that during its execution an ERD/ERS like process seems to occur (Fig. 3). Whereas the value of   β   PSD   decreases during the mental activity [24,49], the value of   α   SE   increases [50]. This suggests that areas related to the task are shifted out from a desynchronized (irregular) “idle” state, resulting in variations of the PSD and/or SE values, which are detectable and can be associated with the involved mental states. Because PSD is related to the energy and SE with the structure of the signals, they measure in principle different properties of the time series. This supports that the combination of both indices becomes a better descriptor of mental state changes, a situation that actually is not fully exploited in the current BCI systems.   CONCLUSIONS   The mean AUC values for the CV process indicate that the selection of a mental calculation paradigm, like the one described here, can be used to control a BCI system. The mean indices values estimated for the Pz channels (Fig. 3) seem to indicate that an ERD/ERS process, as in MI, is occurring with this paradigm. Yet the AUC values achieved seem better than those reported for the state-of-art MI based BCIs. Actually, the iSV process shows an acceptable performance, even by using a calibration setup obtained several days before, a condition that is currently not possible with the MI paradigm. The results also show no real effect associated with practice of the paradigm by the user, suggesting that naive subjects would achieve a good control of the BCI just from the first operating session. Despite that the results presented here point towards a superior performance, an evaluation in a more complex environment must still be done by increasing degrees of freedom and/or adding a feedback stimulus.  Finally, the utilization of an SE characteristic in conjunction with   β   PSD   power resulted in an improvement of the mental state identification. The combination of both indices achieves significant better AUC values than those obtained by using either of them alone. Additionally, for the CV evaluation, no subjects were considered on a BCI “illiteracy” condition when both indices were used. This result suggests that the combined use of these features could improve the performance of a BCI.   SUMMARY   This paper presents an evaluation of the continuous detection of mental activity episodes to control a BCI, similar to that used by Motor Imagery (MI). The silent computation of basic arithmetic operations using positive integers was proposed instead of the task of imagining the extremities movement. Thus, the paradigm comprised a series of concatenated operations, presented on a monitor. At the end of each series, subjects verbalized their answers and these were used to identify periods with a correct performance. This verification is not possible within MI-like paradigms. Thereby, periods with incorrect answers were not used here neither to construct the model nor to evaluate the performance of the identification of mental activity episodes. This paradigm was evaluated by analyzing the EEG recordings of fifteen subjects who performed three experimental sessions on different days. The performance was measured in two ways: by a cross-validation process using data of the same session, and by transferring the model obtained from one session to the others. The EEG signals were processed using sliding windows of two seconds length to estimate the power spectral density over the beta band (   β   PSD   [14–35]Hz), and the scaling exponent (   α   SE   ) obtained via detrended fluctuation analysis within scales covering the 20–500ms range. These indices were smoothed with a Kalman filter to track changes related to the execution of the mental activity. For the identification of the activity periods, the values of   β   PSD   and   α   SE   estimated from four EEG channels, specifically selected for each subject, were then employed as inputs of support vector machines with radial kernel. Notwithstanding that several days passed between sessions, the results of the cross- and inter-session validation indicated that a mental calculation paradigm can be used to control a BCI system; finding a performance improvement when the combination of spectral and scaling characteristics is used.  None declared.   ACKNOWLEDGEMENTS   Financial support from the Mexican National Council of Science and Technology (CONACyT) for ERBV is gratefully acknowledged (scholarship 16848).  Detrended Fluctuation Analysis, first proposed by Peng et al. [27], is a method used for detection of long-range correlations. The procedure could be summarized as follows. Given an original time series x [ i ] , i = 1 , 2 , … , N , first it is created a new series by a cumulative sum  (1)  y [ j ] =   ∑   i = 1   i = j   ( x [ i ] −   x   ^   )   where   x   ^   is the mean value of x series. Then, the y [ j ] series is divided into subsequences of same length or scale n, and for each one a regression with a polynomial of order k is obtained y  n . Special case is when k=1, thereby a linear trend is removed. The RMS fluctuation F of y [ j ] is computed as function of n   (2)  F [ n ] =      1   N      ∑   j = 1   N     ( y [ j ] −   y   n   [ j ] )   2          These F values are studied as a power law relationship with n, and the scaling exponent α, is the best fit for F [ n ] ~   n   α   .  Supplementary data associated with this article can be found in the online version at doi:10.1016/j.compbiomed.2015.06.014.     Application 1       REFERENCES", "highlights": "This paper presents an evaluation of the continuous detection of mental calculation episodes, which may be useful for users who strive to operate current BCI paradigms or even for augmenting degrees of freedom. The experimentation consisted in the alternated realization of basic arithmetic mental calculations and resting periods. EEG data were analyzed using sliding windows of 2s length. The experimental population was comprised of fifteen healthy subjects who participated in three sessions on different days. The features used for the classification process were the power spectral density over the beta band ([14–35] Hz) and the scaling exponent obtained via detrended fluctuation analysis. Both indices were estimated over four channels, specifically selected for each subject. The performance was evaluated using the Area Under the ROC Curve (AUC) by measuring the overall classification performance of each experimental session with a cross-validation procedure, and by transferring the model obtained from one session to the others called inter Session Validation (iSV). The best AUC values computed in each cross-validation session were: 0.87±0.067, 0.89±0.056 and 0.88±0.040 respectively; and the iSV provided a value of 0.67±0.122. These high values indicate that a mental calculation paradigm and a combination of features can efficiently control a BCI system. Notwithstanding that several days passed between sessions, the AUC mean value estimated for the iSV is similar to the performance of a motor imagery-BCI calibrated on the same day."}