{"id": "S001048251400211X", "article": "MAIN-TITLE Fully automated liver segmentation from SPIR image series   HIGHLIGHTS          A novel fully automated liver segmentation method is proposed.      The accuracy of the proposed method is 96%.      Processing all slices in a data set without any user interaction requires less time.      The proposed segmentation method is successful even if there is a cyst in the liver.          KEYPHRASES   Variational level set  SPIR  Liver segmentation  Signed pressure force function  Active contour   Liver is an essential organ with several vital functions such as protein synthesis and detoxification. Additionally, it regulates biochemical reactions that include the synthesis or breakdown of complex and small molecules and produces bile, which is an alkaline compound aids in digestion. Yet, no technique or device can compensate for the absence of the liver. The only available option is liver transplantation, which is a major and risky surgery. Although transplantation from cadavers utilized to be the first choice, transplantation from living donors has become a choice of treatment due to the shortage of cadaver donation in recent years [1]. Before the surgical procedure, the livers that belong to the living donor and the recipient are evaluated: to identify the liver region, to determine the size mismatch, to measure liver volume, and to analyze the vascular structure. Knowledge obtained by the evaluation is needed to decide whether the donor and recipient is a good match and when the transplantation should be performed. The success of the surgical operation and reduction of complications (which may occur during or after the operation) to minimum level depends on accuracy of anatomic information of the portal and hepatic veins, compatibility of these vessels and liver volume. Therefore, precise measurements and analysis of liver and vessels that requires accurate liver segmentation from all image slices have vital importance for liver transplantation at pre-evaluation stage [2].  Several automatic and semi-automatic liver segmentation methods from Computed Tomography (CT) [3] and from Magnetic Resonance (MR) images [4–11] have been proposed to overcome problems of manual liver segmentation. An important problem of manual segmentation is that liver boundaries can be identified differently by different radiologists and even by the same radiologist at a different time (i.e. inter and intra-reader variability). Thus, segmentation results depend on experience and skills of radiologists. Also, it is very time consuming and tedious task because of the high number of image slices and data sets. However, automatic or semi-automatic liver segmentation is more challenging problem than manual segmentation due to inhomogeneous intensities, similar intensity values and unclear edges between liver and other abdominal organs (i.e. kidneys, heart, stomach, spleen). Anatomical shape of the liver are varies in different slices, which complicates the process further.  Although recently published good hybrid methods [12–14] were shown to be effective in segmenting organs, because of the imaging modality differences and the notion of individual organ segmentation in our case using specific MR sequence for liver, full evaluation and comparison to the methods in our work is outside the scope of their paper. The use of images that are generated with different imaging modalities affects accuracy of results obtained from these segmentation methods. Since, appearance of liver surfaces in different imaging modalities are different, as illustrated in Fig. 1, which shows abdominal CT images [14] and Spectral Pre-saturation Inversion Recovery (SPIR) images from our data set. In SPIR image sequences, surface of the liver may appear different even in the same data set, and even in succeeding slices (Fig. 1d and e) because of clearly visible veins in the liver, gallbladders, which are seem on SPIR unlike CT images, and different slice thicknesses used for CT and SPIR image sequences. Also, the authors identify in their papers [12–14] that the effectiveness of object detection with the proposed multi-object recognition strategy depends on the number and distribution of objects considered in the model assembly.  Multi-organ segmentation based techniques [15,16] using CT images in the state of the art have their own drawbacks. For example, in [15], authors propose an atlas-based multi-organ segmentation method. The first step is to select suitable atlases for an image from a database by measuring image appearance in this method. Second, registration is applied by using the selected atlases and the target image. Then, a local atlas weighting is performed on an organ-by-organ basis and atlas labels are weighted for each voxel by a patch-based segmentation algorithm. Finally, a graph-cut based coarse-to-fine weighting algorithm is applied to incorporate topological information and smoothness constraints. However, potential misregistrations may cause inaccurate results with the segmentation method. In another multi-object segmentation method [16], a transformation matrix is produced by registration of PET and CT images from test data sets. A probabilistic liver CT atlas is generated with affine registration of the transformation matrix and a probabilistic multi-organ atlas, which is obtained from training CT data sets. The liver CT atlas is mapped onto low-contrast CT images to assign a prior probability value for each pixel. Liver is segmented with Gaussian mixture model by using the prior probabilities. Parameters for expectation maximization are obtained from a region of the liver on the PET image. However, this approach requires a large number of training data sets and registration of images accurately. Also, correct estimation of region of interest in PET images is required to segment liver images accurately.  In the state of the art, there is a probabilistic approach [7] for automated liver segmentation method from T1 weighted MR images. The first step is manual segmentation of liver on training data sets by experts in this study. The next step is to generate probability maps by incorporating prior knowledge about tissue properties and locations of the liver. Then, the position probabilities, which are determined from the probability maps, and the tissue probabilities, which are determined according to the intensity distributions in the MR data sets, are calculated for liver, kidney and stomach. The intensities in all different weighted MR channels are combined to calculate tissue probabilities. Therefore, dimensionality reduction with linear discriminant analysis is applied by using training images. The four-dimensional data is reduced to three-dimensional MR data. The last step is to apply region growing algorithm [17] for liver segmentation. However, accuracy of results mainly depends on probability maps. Therefore, a large number of training data, which represent more variation, is required to generate the optimal probabilistic map.  In a more recent study [18], authors apply a marker-controlled watershed method with a classifier to obtain liver using parameters from a training data set. However, overlapping of coefficients may cause misclassification in some MR images. The solution for the misclassification problem is to add more seed points manually by users. Therefore, results may not always be accurate with this method.  Level Set Methods (LSMs) [19] are based on the curve evolution theory [20]. According to this theory, the deformation of a curve is written by a Partial Differential Equation (PDE). The importance of PDEs has been increased in segmentation area since the first implementation of the LSMs as image segmentation at the beginning of the 1990s. The main reason for this is that a segmentation problem can be transformed into a PDE framework. Also, PDEs can use regularizers with these segmentation models. Another reason is that finite difference methods can be used to solve PDEs. Also, PDEs can be extended from two dimensions to higher dimensions. In addition to these advantages, the solutions from the PDEs are fast and they are able to perform an image segmentation operation interactively. The main idea behind the LSM is to represent an active contour as the zero level set of a smooth function, which is a higher dimensional and called as the Level Set Function (LSF), and to evolve this contour to the edges of the desired objects. An important advantage of the level set approach is that the geometric properties of the contour can be obtained using a level set of the surface. Since, the arc-length parameterization and the curve derivatives according to it are geometric, intrinsic and also invariant to Euclidean transformations [21]. Another advantage is that, following of contour evolution in three dimensional spaces is similar to following in two dimensional spaces because propagating surfaces are easily obtained by extending the arrays and gradient operators. Also, LSFs are signed distance functions which define the closest distance between each pixel and the zero level set. Therefore, active contours can break or merge during evolution and handle topological changes. In addition, the LSF remains as a whole function on the fixed Cartesian grid that provides efficient computations.  In our previous work [10], we present an overview on liver segmentation methods in MR images and show comparative results of seven different liver segmentation approaches chosen from deterministic (K-means based), probabilistic (Gaussian model based), supervised neural network (multilayer perceptron based) and deformable model based (level set) segmentation methods. The results of quantitative and qualitative analysis show that our level set based approach is a reasonable method for liver segmentation from SPIR images.  In this study, we propose a Full-automated Liver Segmentation (FLS) from SPIR image series for pre-evaluation of liver transplantation by using a variational level set approach. This work improves our recently published semi-automatic method [10], which uses a Signed Pressure Force (SPF) function based energy functional and user defined initial contour on pre-processed SPIR images that show liver vessels very clear.  The organization of the remaining parts of the paper is as follows. Relevant level set based medical image segmentation methods are presented in Section 2. Our previous semi-automatic method, on which the work in this study is based, is briefly reviewed in Section 3. Contributions of this study, which are automated detection and exclusion of structures (e.g. cysts and other bright white regions on the skin), automatic definition of initial contours and computation of weight value for the length term of the active contour, are given in Section 4. Experimental results and comparative performance analysis for the proposed method and the semi-automatic method are represented in Section 5. Finally, conclusions and discussions are given in Section 6.  Level set [19] based medical image segmentation methods have been more popular in the last fifteen years due to the flexibility of the level set technique to adapt to different problems by incorporating several prior knowledge [22–28]. Two major challenges have to be addressed while developing a level set based image segmentation technique. The first one is stopping the evolution of the curve efficiently at the desired boundaries without over (i.e. leakage) or under segmentation. The second difficulty is representation of level set functions by signed distance functions because level set methods do not implicitly preserve level set functions as signed distance functions in practice. Therefore, in conventional level set approaches, the level set function causes irregularities during curve evolution. These irregularities result in unstable evolution due to numerical errors. Re-initialization is the typical approach to keep the level set function as a signed distance function. In re-initialization process, the degraded level set function is replaced with a signed distance function, whose gradient is equal to a unit vector. However, re-initialization is a serious problem since it is not clear how and when it should be applied to restore the degraded level set function as a signed distance function [29]. Therefore, various Variational Level Set Methods (VLSMs) have been proposed to avoid re-initialization (re-distancing) problem by regularizing the level set function as a signed distance function (by handling topological changes).  VLSMs, which are based on an energy functional, provide higher computational efficiency and easier implementation. Minimization of the energy functional in VLSMs is similar to an edge detection method. In these alternative approaches, the energy functional is defined with the level set function. Then, a partial differential equation is obtained by using this energy functional instead of an Eulerian equation as in classical level set methods [30,31]. Among different VLSMs, Li et al. [32] proposed to use a distance regularization term in the Distance Regularized Level Set Evolution (DRLSE) method.  The DRLSE approach is based on a potential function and forces the gradient magnitude of the level set function to one of its minimum points. It eliminates the computationally expensive re-initialization process. However, this method uses constant coefficients and the traditional edge stopping function, which is Gaussian filter based, to remove the effect of noise in the energy formulation. The Gaussian filter results in blurred edges while reducing the image noise. Also, this method is very sensitive to position, shape and size of the initial contour on SPIR images. It is observed that this approach causes unstable evolution and cannot segment liver from SPIR datasets successfully [10].  To overcome all problems in the DRLSE, we have proposed a novel semi-automated VLSM based liver segmentation from SPIR image series in our previous work [10], which is called as SLS (Semi-automated Liver Segmentation) method in this study.  Experimental results and quantitative performance analysis of the SLS method show that pre-processing and binary regularization and also an adaptive SPF function based edge indicator in the energy functional provide efficiently segmented liver images. We describe the pre-processing step, energy functional and also the edge indicator briefly in this section.  The first step for liver segmentation is pre-processing, which detects and removes kidney, spleen, heart, gallbladder and spine automatically from abdominal images, to suppress their interference in the liver segmentation process. These organs are first detected using anatomical knowledge and morphological operations are applied on these detected structures. Binary morphological image reconstruction [33] is applied with an appropriate marker image (seed region) on the organ. The required mask for image reconstruction is obtained by choosing the cluster that shows the organ, after clustering of the original image with Gaussian mixture model [34,35].  An example in Fig. 2 shows different steps of the SLS algorithm and how irrelevant organs are extracted on an example slice (Fig. 2a) with a mask image (Fig. 2b) and a marker image for spleen and stomach. First, boundaries from the left and right hand side (the first non-zero values) are detected, which are shown as blue lines in Fig. 2c. The mid-line between these blue lines corresponds to the position of the spine (shown with the yellow line in Fig. 2c). For spleen extraction, the anatomical knowledge that spleen is located at the bottom-left side of an abdominal image is used. Besides, it is observed that spleen is always clustered as the third cluster (Fig. 2d) when the original image is clustered into four clusters by K-means clustering algorithm: (1) background region, (2) dark gray tissues, (3) bright gray tissues (corresponds to spleen) and (4) brightest tissues. A marker image that includes some part of the spleen is obtained at the left side of the spine by using the middle of the yellow and blue lines (shown as red color in Fig. 2d). The spleen image (Fig. 2e) is obtained after morphological image reconstruction with the marker, which is shown as green frame (Fig. 2d) and the mask image. Similarly, stomach extraction is performed with the knowledge that stomach is located at the left hand side of the spine and above the spleen. A seed region is selected by using the mid-point of the yellow line and red line at the left side of the spine (Fig. 2f). In this case, the original image is clustered into four clusters after the spleen extraction. The last cluster that includes stomach is chosen in order to use as the mask image. Fig. 2g shows the mask and marker image for stomach, which are used to apply binary morphological image reconstruction. The pre-processed image without the spleen and stomach is presented in Fig. 2h.  Kidneys, which have similar gray level values with the liver, may cause over-segmentation. Similarly, the spine may affect curve evolution due to its high intensity value. Fig. 3 demonstrates an example SPIR slice (Fig. 3a) to show kidneys and the spine (Fig. 3b), which also shows the gallbladder.  Kidneys and spine are extracted in the pre-processing stage with an algorithm similar to those of the stomach and spleen extraction and the details are given in [10]. The anatomical knowledge that kidneys are inside the ribs and located in the bottom-left and bottom-right side of abdominal images is used for kidney extraction. A seed region that includes some part of the right kidney is obtained at the right side of the spine. The third cluster that includes the right kidney is chosen in order to use as the mask image. The segmented right kidney is obtained after morphological image reconstruction with the mask and the selected seed region as the marker image. Similarly, the left kidney is detected and extracted automatically by selecting the seed region at the left side of the spine.  To explain the applied energy functional, let us assume that the active contour is defined as C =  {   (  x , y  )  ∈ Ω | ϕ ( x , y ) = 0  }  , where ϕ ( x , y ) = 0 is the zero level set function, Ω ⊂ ℜ and the image I : Ω → ℜ is defined on Ω . The energy functional to be minimized, which consists of the length and area term with their coefficients is given as,  (3.1)  E ( ϕ ) = λ   L   g   ( ϕ ) + α   A   g   ( ϕ ) ,  α ∈ ℜ ,  λ > 0   here λ, α corresponds to weight values and  |    C   p    |  > 0 , is the edge indicator function. The term   L   g   ( ϕ ) is the length of the active contour and expressed as   L   g   ( ϕ ) =  ∫ Ω   g δ ( ϕ )  | ∇ ϕ | d x d y , where δ(.) is the Dirac delta function. The term   A   g   ( ϕ ) is the area in the active contour and computed with the Heaviside function H(.) as   A   g   ( ϕ ) =  ∫ Ω   g H ( − ϕ )  d x d y . The weight value of the area term is calculated by using summation of absolute values of minimum and maximum curvature terms to increase the speed of the motion [10].  To obtain a minimum value of a function, a study state solution of the gradient of this function can be found. The gradient flow equation of the energy functional E(ϕ) (3.1) is written as,   ∂ ϕ   ∂ t   = −   ∂ E   ∂ ϕ   , where   ∂ E   ∂ ϕ   is the Gateaux derivative of E(ϕ). This is an evolution equation of a time dependent level set function ϕ(x,y,t) with a spatial variable x and y. The evolution direction of ϕ(x,y,t) is opposite of the Gateaux derivative (i.e. −   ∂ E   ∂ ϕ   ), which is the direction of the steepest descent of the energy functional E(ϕ). Therefore, the gradient flow is known as gradient descent flow or steepest descent flow.  Edge based level set methods [32,36,37] usually use a regular, positive and decreasing edge indicator function g, such that   lim   t → ∞   g ( t ) = 0 to stop level set evolution at boundaries. The edge indicator function is the absolute of the gradient of the convolved image with Gaussian function to remove the effect of noise in the energy formulation, and written as,  (3.2)  g ( | ∇ I | ) =  1  1 + | ∇   G   σ   × I   |  2         The level set function stops when the value of the edge indicator function approaches to zero, which means that the active contour will be stopped where the gradient of the image is large enough for g → 0 . However, it is never equal to zero for digital images since the discrete gradients are bounded. It causes unstable evolution due to noise and non-homogeneous intensities in abdominal SPIR images. The Gaussian filter cannot preserve edge information while removing the noise effect and causes blurring especially at weak edges. Choosing a small sigma value for the Gaussian kernel may lead to sensitivity to noise. In this case, the curve evolution will not be stable. Choosing a big sigma value may cause boundary leakage problem, which results inaccurately segmented images. Therefore, determination of the optimal standard deviation is a dilemma for liver segmentation from SPIR datasets due to unclear boundaries and noise. Different alternative solutions have been proposed in the literature to overcome this problem [38–40]. In the SLS method, an edge indicator is defined with a novel SPF function and its gradient to take into account edges for stable results as,  (3.3)  g = SPF ( I ( x ) ) + ∇ SPF ( I ( x ) )      The applied adaptive SPF function according to the intensity values outside and inside the active contour is,  (3.4)  SPF ( I ( x ) ) =  {        I ( x ) − (   C   1   +   C   2   ) / 2   max  (  |  I ( x ) − (   C   1   +   C   2   ) / 2  |  )    ,     if  (   C   1   > 10 ×   C   2   )  or  ( max ( I − a v g ) < 5 × a v g )         I ( x ) −  min (   C   1   ,   C   2   )   max ( | I ( x ) −  min (   C   1   ,   C   2   ) | )   ,     else         where the term avg corresponds to (   C   1   +   C   2   ) / 2 ,   C   1   and   C   2   are average intensity values outside and inside the active contour, respectively, which are defined as,  (3.5)    C   1   =    ∫ Ω   I ( x )   H   ε   ( ϕ ) d x     ∫ Ω     H   ε   ( ϕ ) d x        C   2   =    ∫ Ω   I ( x ) ( 1 −   H   ε   ( ϕ ) ) d x     ∫ Ω   ( 1 −   H   ε   ( ϕ ) ) d x         The partitioned SPF function (3.4) means that if the average intensity value in the active contour is greater than ten times of the average intensity value of outside the contour (i.e. the average intensity values inside and outside the active contour are not close) or the difference between intensity values of each pixel and the mean intensity value of inside and outside average intensities is greater than the five times of the mean intensity value then select the first part. Otherwise, select the second part of the SPF definition. Since, the initial contour is always defined inside the liver in our application. Therefore, if values of   C   1   and   C   2   are close on a pre-processed image then contrast of the image is very low. Then, the difference between each pixel value and the minimum average intensity value is efficient for curve evolution. The adaptive SPF based edge indication function gives effective results even at weak boundaries.  Although the SLS method provides successfully segmented liver images with low computational complexity, it has the following limitations: First, effects of cysts and other bright white regions on the skin have not been properly handled. Second, the method requires a user defined initial contour for each slice in a data set. Third, some of the parameters used in the algorithms are determined heuristically. In this study, we present an approach that overcomes these limitations by detecting and excluding of cysts (see Section 4.1) and bright white regions on the skin (see Section 4.2) and also generating initial contours automatically (see Section 4.3). Moreover, we propose a novel approach to compute the weight value for the length term (Section 4.4) in the applied energy functional (3.1).   Fig. 4 shows the overall structure of our segmentation algorithm. As can be seen in this flowchart, first an initial liver image is obtained from a chosen initial slice. The initial liver image is used to generate the initial contour for the succeeding slice. All slices are segmented iteratively beginning from the initial liver image to the last slice, and again from the initial liver image to the first slice in the image sequence. The first step of the iterative segmentation algorithm is pre-processing (Section 3.1). Our proposed approach for detection and extraction of cysts and bright white regions on the skin is integrated into this step. Second step is generation of initial contour from previous segmented liver image (Section 4.3). Afterwards, necessary parameters, which are SPF function, edge indicator function, weight value of the area term and length term, are computed (Section 3.2, Section 3.3 and Section 4.4). Finally, gradient of the energy functional is calculated until its minimum value is found by using the gradient descent flow equation. Once the liver image is obtained, it is used to generate the necessary initial contour for liver segmentation for the next slice. This iterative process continues until all slices are segmented ( Fig. 4).   PROPOSED METHOD   This section explains the four important steps of the proposed approach that are integrated to our previous method [10] to overcome its limitations.  In this study, upper abdominal MR data sets have been used. The data sets were obtained from ten different patients (four men and six women; age range, 52–81 years) using a 1.5T MR imaging device (Gyroscan Intera, Philips, ACS-NT, Best, The Netherlands). The examined 16bit DICOM images are fat suppressed T2-weighted (TR/TE, 1600/70ms; flip angle, 90°; slice thickness, 8mm) SPIR images (0.63pixel per mm and the pixel size is 1.58×1.58mm) in the axial plane with a resolution of 256×256. Also, images with different resolutions (i.e., 288×288 and 320×320) have been tested.  A cyst on the liver seems as bright white in abdominal SPIR images ( Fig. 5a). Cyst detection and extraction is applied in the pre-processing step after removing irrelevant organs. We observed that existence of a cyst negatively affects curve evolution due to its high intensity values. This leads to erroneous results when the area under the cyst is larger than the area of a vessel on the liver. Therefore, cyst detection and extraction is applied after getting the number of slices that include the cyst as a user defined parameter. Extraction of the cyst according to its intensity and size is easier if we use the pre-processed image (Fig. 5b) of the slice because a cyst is always clustered in the last cluster when the pre-processed image is clustered into four clusters, (see Section 3.1). Therefore, the image in the last cluster is chosen (Fig. 5c) and the largest connected component is detected to use as a marker, which includes some part of the cyst. The image in the third cluster shows the appropriate mask (Fig. 5d). Binary morphological image reconstruction algorithm is applied with the marker and mask images. Then the cyst, i.e. the reconstructed image, (Fig. 5e) is extracted. The pre-processed image (Fig. 5f) after cyst extraction is used for liver segmentation. Gallbladder (Fig. 3b) extraction is performed with the same algorithm since a gallbladder is similar to a cyst in the liver and seems as bright white.    Fig. 6a shows two bright regions at the top side on the skin that occurs as a result of insufficient presaturation band localization. These parts may lead to inaccurate edge indicator (3.3) due to inaccurate selection in the SPF function (3.4). We have also removed these bright white regions that are seen on the skin in some slices to reduce their potential undesired effects during curve evolution. Similar to the cyst extraction process, binary image reconstruction algorithm is applied with a mask and marker image. The necessary mask image is obtained by choosing the image in the third cluster (Fig. 6c), which include bright gray level tissues and bright white tissues. A marker is obtained by intersecting the image in the last cluster (includes bright white regions and vessels) with the image that is outside of the previous segmented liver image. This intersection produces the image that shows only some part of the bright white regions on the skin while excluding vessels (Fig. 6d). Then, the reconstructed image by the morphological binary image reconstruction is removed and the pre-processed image (Fig. 6e) is obtained for liver segmentation.  Initialization of contours is a key challenge for level set based segmentation methods [41]. When done manually, each user can draw different initial contours at different locations and sizes. The user defined initial contours can cause inaccurate or non-robust segmentation results regardless of the number of iterations. Finding the correct number of iterations for each initial contour is not easy at each slice. Therefore, we need to apply level set approaches for liver segmentation automatically to overcome these drawbacks and obtain acceptable results from all slices in a dataset.  The liver shape in a slice is close to the liver shape of the previous or next slices with respect to other slices in the dataset. Therefore, the shape of an initial segmented liver image can be used as the initial contour for all the slices in a data set. This approach was used in our previous automatic liver segmentation method, which is called as automatic DRLSE with the SPF method [10]. There are some drawbacks of this approach, which are related to both the applied energy functional and generated initial contour. The first drawback is on how to choose the value of the standard deviation of Gaussian kernel. This kernel is used both in the traditional edge stopping function, which is integrated into the length and area terms of the active contour, and also in the SPF function. The other drawback is that using a constant standard deviation value for a data set does not always produce successful results for liver segmentation for all slices in a given data set. The constant weight values for the length and area term cause undesired results due to the vascular structure of liver and non-homogenous intensity values. Also, irregular shape of the liver reduces usability of the shape of the segmented liver in the previous slice as the initial contour for the next slice.  To overcome these drawbacks, we have defined a novel SPF function based edge indicator without using Gaussian function in the SLS method as explained in Section 3. The algorithm of the SLS method requires a manually initialized contour on the liver at each slice. However, manually drawing an initial contour on each slice in a data set increases segmentation time and is also very tedious because of increasing number of data set. The user defined initial contour has to be drawn inside or outside of the liver without leakage. Moreover, if the liver is partitioned then an initial contour has to be drawn on each partition by the operator. Therefore, in this study, to improve the semi-automatic SLS method, we have proposed to generate the necessary initial contour automatically for each slice without any user interaction, which increases the efficiency and improves the accuracy and consistency of the method.  We observed that the shape of the segmented liver image in one slice is not always useful as an initial contour for liver segmentation for succeeding slices because liver shapes are not regular. Also, differences in slice thickness of data sets make this problem more challenging. These identified factors in addition to noise and inhomogeneous intensities lead to over/under segmented liver images. Therefore, in this study, we have generated an initial contour automatically from the shape of an initially segmented liver instead of using its shape directly as an initial contour. For this purpose, similar to the marker image in the iterative Gaussian mixture model based method [10], first, we have used the initial liver image ( Fig. 7a), which is the segmentation result of a selected slice (generally the mid-slice in a data set), where liver boundaries are usually well-defined so that the liver can be segmented by simple (e.g. K-means) clustering. Then, we have obtained the skeleton (Fig. 7b) of the initial liver image. Second, we have filled all holes (Fig. 7c) after intersecting the skeleton image and the succeeding pre-processed image with binary ‘AND’ operation. Then, dilation operation is applied with a disk shaped structuring element (radius is 1). After dilation, we have applied median filtering to remove small spots from the image. Fig. 7d shows the generated initial contour as binary that is also shown on the succeeding slice, which will be the next processed image, as red color (Fig. 7e). The effect of the filling holes and dilation operations by using another segmented liver image (Fig. 7f) and skeleton (Fig. 7g) is given in Fig. 7h after the intersection process. After dilation and median filtering, the generated initial contour (Fig. 7i) is shown in Fig. 7j as red color.  All slices are segmented iteratively by beginning from the initial liver image to the last slice and from the initial liver image to the first slice in the image sequence.  The applied energy functional (3.1) is composed of length and area of the active contour. All VLSMs based on the length and area terms use constant weight values, which are chosen according to the experience of authors, for these terms [42–44,32,36]. Segmentation results are sensitive to chosen weight parameters. However, each data set has a different contrast ratio. Further, liver has a vascular structure and non-uniform intensity values. Different intensity gray levels of an image require different weight values, which makes it a challenge to choose the optimal λ value. In addition, using the same constant weight value during curve evolution will not always produce acceptable results for liver segmentation from SPIR image data sets even the most optimal constant value is chosen. Therefore, we have used adaptive weight values by computing automatically according to the feature of the curve for the length and area terms in the SLS method [10]. Although the implemented formulation that is given for the λ parameter seems efficient, we propose another computation for this parameter, which also provides smoothness, in this study.  The isoperimetric ratio is the value of shape of compactness, which is an intrinsic property of objects and used as a shape descriptor in pattern recognition [45]. We have computed the isoperimetric ratio, (    L g 2  ( ϕ )    A g  ( ϕ )   ) , at each iteration during curve evolution and assigned its value to λ in our energy functional (3.1), and obtained the following equation.  (4.1)  E ( ϕ ) =     L   g   2   ( ϕ )     A   g   ( ϕ )     L   g   ( ϕ ) + α   A   g   ( ϕ ) E ( ϕ ) =     L   g   3   ( ϕ )     A   g   ( ϕ )   + α   A   g   ( ϕ )      Eq. (4.1) implies that we increase the compactness degree of the closed curve by multiplying the isoperimetric ratio    L   g   2   ( ϕ )  /    A   g   ( ϕ )  with the length term   L   g   ( ϕ ) . Therefore, the advantage of using the isoperimetric ratio as the weight value instead of the λ coefficient is to increase smoothness of the curve. In addition, we assign the minimum value of the ratio of the isoperimetric inequality, which is    L g 2  ( ϕ )    A g  ( ϕ )   ≥ 4 π , for the λ parameter when the value of the computed λ is greater than 4 π during the curve evolution. Since, we are trying to find the minimum value of the applied energy functional (4.1), which means that all terms have their minimum value.    Fig. 8 illustrates the liver region surrounded with red color that is obtained by the proposed segmentation method. Also, it shows the liver region surrounded with yellow color that is provided by experts with manual segmentation as the ground truth data.    Table 1 presents computed gradient values of the applied energy functional, summation of differentiation of the length and area terms and also the isoperimetric ratio at each iteration for the image shown in Fig. 8. As can be seen from the quantitative analysis, the value of the isoperimetric ratio converges automatically to a constant value while the value of the energy functional converges to its minimum. Numerical values do not change after the algorithm finds the minimum energy level (62th iteration in Table 1). The proposed method stops the curve evolution efficiently at this energy level even the iteration process does not reach the final number of iterations.  Quantitative values in Table 1 have been plotted in Fig. 9 for isoperimetric ratios (Fig. 9a) and gradient values of the energy functional (Fig. 9b).   Fig. 9 shows that the evolution of the active contour stops efficiently even the maximum iteration number is bigger than the iteration number corresponding to the minimum energy value.  A fully automatic level set based liver segmentation approach from SPIR data sets is proposed in this study. Example initial contours that are automatically obtained by this method using original images ( Fig. 10a–g) are shown in Fig. 10ğ, h, ı, i, j, k, l and m. Final level set functions, which show liver boundaries, derived by evolution of these initial contours are presented in Fig. 10n, o, ö, p, q, r, s and ş while segmented liver images are given in Fig. 10t, u, ü, v, w, y, z1 and z2.  It is observed that when there is a cyst on the original slice (Fig. 10d), the automatic segmentation procedure with the iteratively generated initial contour (Fig. 10j) finds liver boundaries (Fig. 10q) successfully and results in correctly segmented liver image (Fig. 10w) after removing the cyst in the pre-processing step. Therefore, the proposed segmentation method is efficient in terms of accuracy not only for a slice that show healthy liver but also for a slice that show a cyst on the liver.  An experienced operator spends about 30–45min for manual segmentation from 50 images to segment liver. The total computational time and results can be different according to experience of operators both on the liver and the tool used for manual segmentation. The results of the proposed FLS approach and the SLS method with the most optimal user defined initial contours have been evaluated according to their required computational cost, sensitivity, specificity and accuracy values. These measures are generally used to evaluate methods [46–49] and defined as   Sensitivity =   TP   TP + FN         Specificty =   TP   TP + FN        (5.1)  Accuracy =   TN + TP   TP + TN + FP + FN     where TP (True Positive) is the number of pixels that are classified correctly as foreground in the foreground region, TN (True Negative) is the number of pixels that are classified correctly as background in the background region, FP (False Positive) is the number of pixels that are classified as foreground in the background and FN (False Negative) is the number of pixels that are classified as background in the foreground region. Table 2 presents quantitative results of these evaluation criteria for the images shown in Fig. 10a, b, c, ç, d, e, f and g. The computational costs in terms of time have been obtained by using 2GB RAM and Intel Core i7-3612QM CPU at 2.40GHz.  Sensitivity measures success of a method about identification of the TP and FP cases. Specificity indicates that how well the method can identify the TN and FN cases. Therefore, accuracy is low (high) when both specificity and sensitivity are low (high). However, only accuracy is not a good measure for performance evaluation. Because the value of accuracy is biased towards either specificity or sensitivity when any one of specificity or sensitivity has high value and the other has low value. Therefore, we have presented images whose sensitivity and specificity values are mostly close to each other.  Volumetric visualization of segmentation results presents more information to users for further analysis of images [50]. Therefore, an example volumetric visualization of segmented images that are obtained by the proposed approach is given in Fig. 11, which shows results in three-dimensional (3D) coronal view (Fig. 11a), axial view (Fig. 11b) and sagital view (Fig. 11c).  In this study, we proposed a novel fully automated liver segmentation method, which overcomes the major drawbacks of the previous approaches and does not have to rely on neither a distance regularization term nor the traditional edge stopping function. Additionally, it controls and stops the evolution of the active contour efficiently with the edge and region based adaptive SPF function. The major conclusions of this study are increased accuracy (96%) of the segmentation results and reduced processing time. These conclusions are based on the following experimental evidence: First, we applied a pre-processing step to suppress interference effects, which are caused by similar intensity values between liver and irrelevant organs (such as stomach and spleen), in the liver segmentation. We also removed the effects of cysts and other bright white regions on the skin in this stage. Next, we generated initial contours automatically for each slice instead of drawing them manually. Finally, we computed all weight values in the energy functional automatically by using intrinsic properties of the active contour. Another important feature should be noted here that these computed weight values are not constant in our implementation during curve evolution. Since, we updated (re-computed) them and assigned their new values in the energy functional at each iteration.  The computational cost in terms of time required to process a particular dataset depends on total number of slices in the dataset when the proposed FLS approach is used. It is clear that processing all slices iteratively without any user interaction requires less processing time than processing them with a user defined initial contour. Drawing an initial contour manually leads to longer computational time for segmentation of the liver. The SLS method needs a user-defined initial contour for each slice. If the liver seems as partitioned in an image then users have to define an initial contour on each partition. Initial contours can be defined at different size and location according to experience of users and shape of the liver. Longer processing time is required for detection of liver boundaries in case of the size of the user defined initial contour is small. Therefore, initialization of the active contour affects both accuracy of results and waiting time for segmentation and also processing time.  The FLS approach is successful not only for slices that show healthy liver but also for slices that contain a cyst or any superficial structures in the images. Results in Fig. 10v and w shows that removing the cyst and the brightest regions on the skin in the pre-processing step gives successfully segmented liver images. Existence of a cyst in the liver increases the required time for segmentation because of the cyst detection and extraction process in the FLS method.  As the future work, we will test the proposed FLS method with more data sets to address different cases and apply a vessel segmentation approach on segmented SPIR images. Also, an algorithm can be developed and integrated into the pre-processing stage to extract skin. Since, its gray level values may affect accuracy of results that are obtained from images in SPIR datasets.  None declared.   REFERENCES", "highlights": "Accurate liver segmentation is an important component of surgery planning for liver transplantation, which enables patients with liver disease a chance to survive. Spectral pre-saturation inversion recovery (SPIR) image sequences are useful for liver vessel segmentation because vascular structures in the liver are clearly visible in these sequences. Although level-set based segmentation techniques are frequently used in liver segmentation due to their flexibility to adapt to different problems by incorporating prior knowledge, the need to initialize the contours on each slice is a common drawback of such techniques. In this paper, we present a fully automated variational level set approach for liver segmentation from SPIR image sequences. Our approach is designed to be efficient while achieving high accuracy. The efficiency is achieved by (1) automatically defining an initial contour for each slice, and (2) automatically computing weight values of each term in the applied energy functional at each iteration during evolution. Automated detection and exclusion of spurious structures (e.g. cysts and other bright white regions on the skin) in the pre-processing stage increases the accuracy and robustness. We also present a novel approach to reduce computational cost by employing binary regularization of level set function. A signed pressure force function controls the evolution of the active contour. The method was applied to ten data sets. In each image, the performance of the algorithm was measured using the receiver operating characteristics method in terms of accuracy, sensitivity and specificity. The accuracy of the proposed method was 96%. Quantitative analyses of results indicate that the proposed method can accurately, efficiently and consistently segment liver images."}