{"id": "S001044851400027X", "article": "MAIN-TITLE Function-based morphing methodology for parameterizing patient-specific models of human proximal femurs   HIGHLIGHTS          Function-based morphing (FBM) method for patient-specific proximal femur was proposed.      FBM morphs the patient-specific model based on the biomechanical functions.      Detailed algorithms for a robust morphing are presented in this paper.      FBM provides a systematical way to analyze biomechanical responses of a specific bone.          KEYPHRASES   Parameterization  Function-based morphing  Biomechanical function  Proximal femur geometry  Patient-specific model   The morphology of a bone is closely associated with its biomechanical responses  [1], but this morphology can be changed due to aging or orthopedic surgery. Thus, much research efforts have been focused on evaluating the effects of morphometric variations of a bone. In these studies, the finite elemental analysis (FEA) approach has been employed to analyze the relationship between bone structures and their biomechanical responses  [2–4]. Traditionally, there have been two approaches to describe bone structures in FEA: statistical and patient-specific. Statistical models include the standardized geometry and generic properties representative of their population, and it has been proven that these models are suitable for parameterizing objects, such that aspects of the model geometry and mechanical properties are defined in a way that they can be varied by specifying a parameter value  [5,6]. With these statistical approaches, however, the models are limited in their sample population, meaning that a statistic model cannot represent the complex detail of a particular subject that is not included in its population  [2]. Unlike statistical models, patient-specific models incorporate the more detailed information of a patient, so that they have been widely used to more accurately analyze individual responses in biomechanics research  [1,7–11]. As the morphology of a proximal femur affects the biomechanical functions and responses, numerous studies have extensively experimented with how the morphology influences the responses of the specific femoral specimens. Kukla et al.  [12], for example, reported that the femoral neck diameter is the most crucial factor affecting its fracture among the femoral geometry parameters. Lenaerts et al.  [13] showed that femoral neck length mainly affects hip contact forces such as anterior–posterior, vertical, and medio-lateral components during gait. Hence, a reliable parametric morphing methodology for a patient-specific model has significance in its usability for various applications such as systematic morphological sensitivity analyses, pre-operative surgery plans, and other biomechanical simulations. However, the morphology of a patient-specific bone structure cannot easily be parameterized due to its geometric complexity. In other words, the complex geometry of a proximal femur structure comprises several partial regions such as femoral head, neck, and trochanteric regions. Each region, serving specific biomechanical and anatomical functions, is continuously connected to the other regions without explicit boundaries; therefore, it has proven challenging to independently parameterize the geometry of each partial region to obtain specific functional responses.  The main objective of this paper is to provide a function-based morphing (FBM) method to parameterize 3D proximal femur models, so that a series of morphed models can be obtained from a single patient-specific femur structure by simply altering functional parameters, in order to systematically analyze the biomechanical sensitivity of the target femoral structure. To achieve this purpose, three major requirements have to be satisfied:  • femoral morphology satisfying the required functional parameters has to be obtained in an intuitive way of simple parametric adjustments;  each functional region has to be morphed independently without unexpected parametric changes and geometric distortions; and  geometric quality as an FE model should be preserved during morphing.  The proximal femur structure comprises anatomically significant regions such as the femoral head, neck, lesser and greater trochanters, and so on. These regions have been described in related studies by specific parameters, as depicted in Fig. 1 . The parameters are not only closely associated with the proximal femur geometry, but also related to the biomechanical functions of the bone itself so that they have been considered as FUNCTIONAL parameters in previous studies in the biomechanical field  [10,13,14]. The femoral head diameter (FHD) and femoral head center (FHC), which determine the rotational center of hip joint, are related to the stability of the joint  [7]. The femoral neck diameter (FND) is associated with the stiffness of the femur itself, so this parameter has been extensively experimented in femoral fracture studies   [14,15]. The length of the neck (FNL) determines the length of the moment arm and the range of the hip joint motion during gait  [13]. The inclination angle of the femoral neck (FNA) plays a significant role as an evaluative indicator for hip dislocations. Also, an increase or decrease in this angle beyond normal limits causes improper movement of the muscles and interferes with walking  [10]. Thus, these functional parameters have to be interrelated with the morphology of the femoral structure in order to obtain morphed models satisfying the required parametric changes. In this section, we present how to translate such parametric changes into the terms of geometry using fitted 3D primitives and FBM fields.  The FBM method for a human proximal femur model is accomplished in the four steps shown in Fig. 2 . As the preprocessing of the work, we first convert the patient-specific 3D voxel models reconstructed from femoral CT images of the subject into 3D surface models. The models are then segmented into functional regions based on fitted primitives. The primitives are also used to measure the parameters and to define morphing criteria. The final step of FBM is morphing the surface of each segmented region using FBM fields. These morphing fields are designed to indicate where the points on each region have to be repositioned to meet the required parametric changes.  Let  U  ≔  {   u   H R   ,   u   N A   ,   u   N L   ,   u   N R   }  be the set of the functional parameters, where   u   H R   refers to the femoral head radius,   u   N A   is the neck angle between the femoral neck and the body shaft,   u   N L   is the length of the femoral neck, and   u   N R   is the neck radius. As shown in Fig. 1, the parameters can be estimated from primitives fitted to the original surfaces of the segmented regions  [5–7]. Thus, to accurately estimate the parameters, each region has to be first segmented and be fitted into the proper primitives, e.g., a sphere for the femoral head region. The least square optimization  [16] method is used here to find the fitted primitives for each region.  To segment the femoral head region, a pseudo head center was first measured according to anatomical property of the proximal femur. We selected the points within a specific range from the pseudo center position, and the true femoral head radius   u   H R   and the true head center    p    h   are then calculated from the fitted sphere to selected points (see Appendix A). There are three functional parameters in the femoral neck region: neck length  (   u   N L   )  , radius  (   u   N R   )  , and its angle  (   u   N A   )  . The length of the femoral neck is estimated from the distance between the femoral head center and the intersecting point of the neck shaft axis    L    N   and the femoral body shaft axis    L    A   , which are unit vectors. The neck angle also can be measured as the angle between these two axes. Several n circles with the radiuses   r   i   are fitted to the points located within specific ranges apart from    p     h    , so that the neck axis was found from the centers of the fitted circles. The femoral shaft axis can be obtained in a similar way as the neck axis (Appendix B). The intersecting point    p    c   of    L    A   and    L    N   is the point positioned at the closest distance between the two axes, since the axes rarely meet exactly in most cases. Finally, all the neck parameters are estimated from the equations:   u   N L   =  ‖    p    h   −    p    c   ‖  ,   u   N A   =   cos   − 1    (  ‖    L    A   ⋅    L    N   ‖  )  ,   u   N R   = min  [   r   i   ]  where i = 0 , 1 , … , n .  Each segmented region is independently morphed based on the FBM Fields, which are designed to convert the required parametric changes into morphing terms. For this purpose, we use the information of fitted primitives as morphing criteria. For instance, while the previous study changes the head diameter by simply offsetting the head surface, we change the head diameter by moving associated points along the radial vectors around the spherical center fitted to the head region. This approach has a significant advantage, which is that the other functional features are preserved even though the required parameter is changed (e.g. head center position, and neck length and angle are preserved while the head diameter is changed).  As described in Fig. 3 , each single morphing field contains three elements: a unit vector group    V   ¯  to determine the moving direction of the points, a points group    R   ¯  to define the range of the candidate points of the current field among the entire points of the model, and lastly the smooth function f  (  p  )  to avoid the resulting discontinuities around the boundaries of the morphed regions. For the FHD, since the original FNL has to be preserved in order to maintain the original length of the moment arm, every point    p     i    which belong to the head region has to be moved along the vectors starting from the true femoral center    p     h    . Hence the vector group      V   ¯    H R   and the candidate points group      R   ¯    H R   for the head radius parameter are given by        V   ¯    H R   =  {    v    i   |  (    p    i   −    p    h   )  /  ‖    p    i   −    p    h   ‖  , i = 0 , … , N }    where N is the point number in      R   ¯    H R   , and        R   ¯    H R   =  {    p    i   |  ‖    p    i   −    p    h   ‖  ≤   u   H R   +   l   S   }  .   Since the boundary of head and neck regions can be distorted due to the morphing, the smooth function   f   H R    (    p    i   )  is applied to the points within      R   ¯    H R   with a specific range, called smooth range   l   s   . The smooth function has the value 1 if the point    p    i   is definitely in the current region, but the value is smoothly reduced to the zero if the point is positioned in the smooth range (Fig. 3(a)). The mathematical definition of the   f   H R    (    p    i   )  is given by     f   H R    (    p    i   )  =  {    0.5 + 0.5 cos  {   π     l   s     ×  (  ‖    p    i   −    p    h   ‖  −   u   H R   )  }       ‖    p    i   −    p    h   ‖  >   u   H R       1   ‖    p    i   −    p    h   ‖  ≤   u   H R         where   l   s   is the smooth range.  In the same manner, the other FBM fields of the femoral neck region are defined using the criteria of neck axis    L    N   , femoral head center    p    h   , and intersecting point between the neck and shaft    p    c   . The mathematical definitions of these FBM fields are described as follows:  • Neck radius morphing field  (   u   N R   )     i.        V   ¯    N R   =  {    v    i   |  (    p    i   −      p    ˆ     i   )  /  ‖    p    i   −      p    ˆ     i   ‖  , i = 0 , … , N }  , where N is the point number in      R   ¯    N R   and        p    ˆ     i   =    p    h   −  (    p    c   −    p    h   )     (    p    h   −    p    i   )  ⋅  (    p    c   −    p    h   )       ‖    p    c   −    p    h   ‖    2                 R   ¯    N R   =  {    p    i   |  ‖    p    i   −    p    h   ‖  ≤   u   N L   +   l   s   }         f   N R    (    p    i   )  = 1 , except    {    0.5 + 0.5 cos  {   π     l   s     ×  (  ‖    p    i   −    p    h   ‖  −   u   N L   −   l   s   )  }       ‖    p    i   −    p    h   ‖  >   u   N L   −   l   s       0.5 + 0.5 cos  {   π     u   H R     ×  (   u   H R   −   d   i   )  }     d    i    <   u   H R         where   d   i   is the distance between    p    i   and the plane    P    H C   (Fig. 3(b)).  Neck length morphing field  (   u   N L   )     iv.        V   ¯    N L   =  {  v  |  (    p    h   −    p    c   )  /  ‖    p    h   −    p    c   ‖  }            R   ¯    N L   =  {    p    i   |  ‖    p    i   −    p    h   ‖  ≤   u   N L   }           f   N L    (    p    i   )  =  {    0.5 + 0.5 cos  {   π     u   N L     ×  (  ‖    p    i   −    p    h   ‖  −   u   H R   )  }       ‖    p    i   −    p    h   ‖  >   u   H R       1   ‖    p    i   −    p    h   ‖  ≤   u   H R   .          Neck angle morphing field  (   u   N A   )     vii.        V   ¯    N A   =  {  v  | θ    e    ˆ   }  where the θ    e    ˆ   rotational vector from Euler’s rotation theorem and its rotational axis is given by      e    ˆ   =      L    N   ×    L    A      ‖    L    N   ×    L    A   ‖                R   ¯    N A   =  {    p    i   |  ‖    p    i   −    p    h   ‖  ≤   u   N L   }           f   N A    (    p    i   )  =  {    0.5 + 0.5 cos  {   π     l   s     ×  (  ‖    p    i   −    p    h   ‖  −   u   N L   −   l   s   )  }       ‖    p    i   −    p    h   ‖  >   u   N L   −   l   s       1   ‖    p    i   −    p    h   ‖  ≤   u   N L   −   l   s   .          Consequently, the morphing vector    v     i    ∗   of a point    p    i   , which will be used for calculating the target point, can be obtained by multiplying the parametric change to the related FBM field, given by    v     i    ∗   = Δ u f  (    p    i   )     v    i   , where Δ u is the variation of a functional parameter and    v    i   is the corresponding vector of    p    i   . The final step of FBM method is to obtain the target points, determining the shape of the morphed model. These points are obtained by simply adding the morphing vectors to the original points as    p     i    ∗   =    p    i   +    v     i    ∗   .   RESULTS AND DISCUSSION   We first tested a total of 48 femur data of healthy individuals   [17] to validate the reliability of the proposed parameter estimation algorithm because the primitives and parameters estimated by the algorithm are crucial for the successful FBM process. The fitting primitives algorithm was successfully applied to all the data, except 3 data reconstructed with different coordinate systems. The average error, which is the average distance between the points of femur model and the closest points to the fitted primitives, was 1.048 mm, which is in a reasonable range to be used in real cases. As a result of the parameter estimation, the diameter of the femoral head was 48.0 ±46.33 mm, the inclination angle of the femoral neck was 124.98±8.73 mm, the length of the femoral neck was 48.83±10.88 mm, and the diameter of the neck isthmus was 32.86±6.78 mm. The changes in the functional parameters arranged by patient height are shown in Fig. 4 . When the estimated parameters were fitted linearly according to height, the correlation coefficients were 0.259 (Err. 0.058) for the femoral head diameter, 0.339 (Err. 0.156) for the neck length, 0.094 (Err. 0.065) for the neck diameter, and −0.115 (Err. 0.168) for the neck shaft angle. Consequently, it was observed that all the longitudinal parameters such as the femoral head diameter, neck diameter, and neck length increased significantly as the individual height increased, while the neck inclination angle slightly decreased. These trends are quite similar to the results reported in related in-vivo experiments  [18,19,15]. We expect that these automatic algorithms could provide a better rationale for the diagnosis of diseases such as femur dysplasia since the functional parameters can be estimated using the proposed algorithms objectively, rather than by the subjective diagnosis of an expert.  To evaluate whether FBM results meet the requirements stated in the Introduction section, both the geometric qualities and the satisfactions of parametric requirements of the morphed models were tested. Since the geometric quality significantly affects the FE analysis results, we first evaluated the qualities of the morphed models using the metric of a scaled Jacobian. A scaled Jacobian (SJ), which is widely used for evaluating the mesh quality of FE models, is the minimum Jacobian divided by the lengths of the edge vectors and is normalized so that a unit equilateral element equals 1  [20]. The SJ value q was calculated as given by  (1)  q =   2   3     3     J     L    max        where   L    max    is the product of the lengths of the two longest edges of the triangle, and J is the Jacobian of the triangle. The SJ values are generally within  [ −   2   3     3   ,   2   3     3   ]  , and it is known that the elements valued within the range  [ 0.5 ,   2   3     3   ]  are acceptable for FEA. As a consequence of applying our approach to the 45 femur models, the average SJ value of the morphed elements was 0.754, while the average value of the original elements was 0.756. The percentage of the acceptable elements among all of the morphed elements was 95.814% on average. Fig. 5 shows some of morphed examples with the contour plots of the SJ values.  To check whether the morphed model met the required parametric changes or not, we compared the required parameters with the reexamined ones after morphing. When we morphed the models with specific ranges (±8 mm for FHD, FND, FNL and ±10° for FNA), the averaged error between the required and measured parameters are 0.11 mm for FHC, 0.43 mm of FHD, 1.82° for FNA, 0.38 mm for FNL and 0.57 mm for FND. As shown in Fig. 6 , while the error tends to increase as the parametric changes increased, we observed that the errors were still in acceptable ranges if the required parameters do not exceed the reasonable ranges (48.0 ±7.3 for FHD, 124.9 ±12.4 for FNA, 48.83 ±10.8 for FNL and 32.8 ±6.7 for FND). We also compared some of our morphed results with the models morphed by the other previous method  [21] with the same parametric changes, and the results are depicted in Fig. 7 . From Fig. 7, it is observed that only the required region was morphed using FBM as well as the required parameters were satisfied, while some unexpected distortions occurred with the previous method, especially in the trochanteric region.  Previous studies have described morphing techniques for parameterizing patient-specific models. Sigal et al.  [2], for example, showed that models can be parameterized as well as statistical models using morphing techniques based on a model of the load-bearing tissues of the posterior pole of the eye. In a study by Arnold et al.  [21], musculoskeletal models were morphed in combination with patient-specific parameters to estimate the hamstring and psoas length during gait. While these previous studies were mainly based on graphical techniques, the FBM method proposed here parameterizes the femoral models by morphing each segmented region based on the biomechanical femoral functions. As a consequence, the FBM method allows for the production of a series of morphed models of a specific specimen by altering the functional parameters independently or in combination, and these models may provide more robust fundamentals to various sensitivity analyses in the biomechanical, medical, and further areas.  As an example application of this work, the morphologic sensitivity of the femoral stiffness was analyzed with a series of morphed models with a specific window of parameters. FEA was performed under the same analytic conditions as an in-vitro experimental study  [12]. Each target model was rotated about 12° around the anteroposterior axis and the isthmus part of the femoral shaft is fixed. When a specific force was loaded onto the head region, the trend in the reaction forces of the models were measured. As expected, we observed that the morphology of a bone structure is closely related to the biomechanical responses based on a finite elemental analysis. As shown in Fig. 8 , the results showed that the FNL is the most effective parameter representing the stiffness of the proximal femur, while the FHD is the most ineffective, which is consistent with the results in Kukla’s experiments  [12]. Consequently, these results indicate that our method is useful for developing a predictive model of biomechanical responses by carefully integrating the functional parametric changes reported in related studies  [18,19,22]. For instance, prosthesis deign for artificial hip joint surgery might be a good application for FBM. Since the gait simulation techniques have been extensively studied, the gait pattern can be predicted with the recorded muscle activations and hip joint model  [23,24].  There are a few limitations to using our proposed FBM method. As aforementioned in this section, our approach works robustly only for models reconstructed in a predefined orientation (the Z -axis along the body height). Also, in some cases, the segmentation algorithm cannot accurately segment a model according to the anatomical boundaries, such as the intertrochanteric line, due to the complexity of the femoral structure. This limitation may cause discontinuities or deformations of unexpected partial regions. We acknowledge that unexpected deformations randomly occurred in the greater trochanter, as shown in Fig. 5. As we mentioned, altering the smooth function and the smooth range of the corresponding FBM fields could be a solution to this limitation, and in future work we plan to enhance our approach to segment the model accurately by considering the curvature tensors  [25,14] of each region. Another limitation would be that, although this usage is not included in the main objectives of FBM, some people might want to use it to fit a specific femur structure to another target by assigning the same parameters. In this case while the overall proximal shape of morphed structure is similar, FBM cannot guarantee to predict the geometric details of a target structure. The users should aware that the disparity of geometric details may cause inappropriate analytic results.  We implemented our morphing tool as freeware, called ReformBones, based on our FBM scheme (http://cadlab.hanyang.ac.kr/reformbones). To the best of our knowledge, this is the very first FBM tool for modeling the proximal femur. We instituted and customized open libraries to meet our purpose: VTK (Visualization Toolkit, http://www.vtk.org) for visualizing the models, and ALGLIB (http://www.alglib.net) for optimizations.   CONCLUSION   A method for parameterizing a patient-specific model of the proximal femur has been demonstrated. This paper focused on a function-based morphing technique in order to parameterize the models. By using newly designed algorithms, the models were morphed without degrading the geometric qualities while altering the biomechanical functions. We implemented a Windows-based morphing tool, called ReformBones, based on our scheme. Further studies are underway to enhance the generality and accuracy of the morphing technique using curvature tensors.   ACKNOWLEDGMENT   This work was supported by the research fund of the Survivability Technology Defense Research Center of the Agency for Defense Development of Korea (No. UD090090GD).   Conflict of interest statement   None of the authors have any conflicts of interest to report.     (1) Sort all the points according to their   z   i   values and calculate the height of the model from the difference between the maximum and the minimum values of   z   i   .  Calculate   x   h   ′   and   y   h   ′   , which are the average values of   x   i   ,   y   i   of the points in the topmost 2% (if we assume the femoral head to be a true sphere, then  (   x   h   ′   ,   y   h   ′   )  is the center of the sphere in the view of the  XY  plane).  Among the points in the top 10%, group the points according to      P   ¯    H   ′   =  {  p   ( x , y , z )  ∣   x   h   ′   − 5   mm  <   x   i   <   x   h   ′   + 5   mm  ,   y   h   ′   − 5   mm  <   y   i   <   y   h   ′   + 5   mm  }  , and then calculate   z   h   ′   from the middle of the height of the selected points. Let the point    p    h   ′     (   x   h   ′   ,   y   h   ′   ,   z   h   ′   )  be the pseudo femoral head center.  Calculate the pseudo radius,   r   h   ′   , from the average value of the distances between    p    h   ′   and the points in      P   ¯    H   ′   .  Define a group of points      P   ¯    H   from the points within the distance   r   h   ′   + 2   mm  from the    p    h   ′   .  Approximate a sphere to the points in      P   ¯    H   by minimizing the squared values of the distances between the points and the sphere. We used the applied Levenberg–Marquardt (LM) to optimize this problem. The objective function was given by   J  (  p  , r )  =   ∑   i = 0   n      (  ‖    p    i   −  p  ‖  − r )    2   .      From the optimized sphere, let the center point and the radius be the true femoral head center    p    h   and the true head radius   u   H R   , respectively.     (1) Select the points within the distance between   u   H R   + 1   mm  and   u   H R   + 3   mm  from the    p    h   , and define these points as the pseudo neck point group      P   ¯    N   ′   .  Find the optimized 2D ellipse with the x , y values of the points in      P   ¯    N   ′   using the least squares method. At this step, the objective function of this problem is given by   J  (  p  ,   x   d   ,   y   d   , θ )  = ∑    (  ‖    p    i   −  p  ‖  −     x   d   2     y   d   2       x   d   2     sin   2   θ +   y   d   2     cos   2   θ   )    2   ,   where   x   d   and   y   d   are the maximum lengths of the ellipse in the x and y directions, respectively, and θ is the inclination angle of the ellipse.  From the center point of the ellipse and the median position of the z values of the points, define a point    p    n   ′    ( x , y , z )  . Let the vector across the    p    n   ′   and    p    h   be the pseudo neck axis.  Classify the points in      P   ¯    N   ′   into several groups according to the planes perpendicular to the pseudo axis, i.e., the ten groups of planes are defined with a distance interval of 2 mm along the axis.  Find the optimized 3D circles from the points around each plane. Let the radius values of the circles be   r   i … n   . Finally, the true femoral neck axis,    L    N   , can be obtained by approximating the centers of the circles as a line.   REFERENCES", "highlights": "Graphical abstract"}