{"id": "S001044851300119X", "article": "MAIN-TITLE Statistical tolerance analysis of over-constrained mechanisms with gaps using system reliability methods   HIGHLIGHTS          Gaps cannot be considered as random variables.      The tolerance analysis issue is formulated thanks to the quantifier notion.      Two defect probabilities are defined: functionality defect probability and assembly defect probability.      Defect probabilities are computed using a system reliability method: FORM system.          KEYPHRASES   Tolerance analysis  Over-constrained mechanisms  Gaps  FORM system  Monte Carlo  Reliability   In very competitive industrial fields such as the automotive industry, more and more interest is being paid to the quality level of manufactured mechanisms. It is very important to avoid warranty returns and manage the rate of out-of-tolerance products in production, which can lead to assembly line stoppages and/or wastage of out-of-tolerance mechanisms. The quality level of a mechanism can be evaluated by the number of faulty parts in production or by the number of warranty returns per year. However, these two methods of product quality evaluation remain a posteriori. Tolerance analysis is a more interesting way to evaluate a predicted quality level at the design stage. Scholtz  [1] proposes a detailed review of classical methods whose goal is to predict functional characteristic variations based on component tolerances. Moreover, statistical tolerance analysis enables the definition of the probability that the functional requirement will be respected or not, as does the well-known RSS (Root Sum of Squares) method.  Advanced statistical tolerance analysis methods allow the defect probability of an existing design to be computed, knowing the dimension tolerances and functional requirements. These are called probabilistic approaches and this paper focuses mainly on them. Various assumptions about the statistical distributions of component dimensions can be made, based on their tolerances and capability levels. For example, the APTA (Advanced Probability-based Tolerance Analysis of products) method proposed by Gayton et al.  [2] enables random mean deviations and standard deviations of components’ statistical distributions to be considered during the whole manufacturing phase. Defect probability, noted   P   D   in the following, is expressed in ppm (parts per million). It represents the probability that a functional requirement will not be satisfied in mass production. In a mechanism comprising several parts,   P   D   is usually computed based on a classic analytical chain of dimensions. Nigam and Turner  [3] list most of classic methods which enable   P   D   to be computed. In addition, several methods from the structural reliability field can be used  [4].  In some over-constrained mechanisms, gaps are present, allowing part displacements. Thus, depending on the gap situations, different dimension chains are required to control one functional characteristic. The formulation and computation of   P   D   for such mechanisms are not straightforward, and classic methods which deal with chains of dimensions cannot be used. Over-constrained mechanisms can be faulty because they cannot be assembled, or because they are not functional. Thus, two defect probabilities are defined: the assembly defect probability   P   D a   and the functionality defect probability   P   D f   .  The present paper focuses mainly on the functional requirement issue, because of its greater complexity compared to that of assembly. Nevertheless, the assembly issue is mentioned in the sections concerned. Section  2 is devoted to presenting existing methods capable of dealing with these issues and details one in particular. It has already been used  [5] and is based on an optimization algorithm and Monte Carlo (MC) simulations. Only MC simulations are required to compute   P   D a   . This methodology is very precise in general but requires a large number of runs (optimization runs for the functionality issue). The main contribution of this article is an innovative methodology detailed in Section  3 and inspired by the work of Ballu et al.  [6]. It greatly decreases the computational effort. Both assembly and functionality defects are expressed as dependent event intersections.   P   D f   and   P   D a   are then computed thanks to system reliability methods, using the n -dimensional multivariate normal cumulative distribution function   Φ   n   . Both approaches are compared for two industrial mechanisms: one inspired by a coaxial connector supplier (Fig. 1 ) and one prismatic joint (Fig. 2 ). The results are given and commented in Sections  4 and 5. The proposed method can be adapted to other over-constrained mechanisms featuring gaps.  In the literature, gaps are often neglected, mainly because only iso-constrained mechanisms are studied. In over-constrained mechanisms, they have to be taken into account  [6–8]. To study such mechanisms, all mobilities between parts, arising from the presence of gaps, have to be considered. For this purpose, a new formulation of the tolerance analysis issue based on the quantifier notion was developed by Dantan and Qureshi  [9] and Qureshi et al. [5]:  • The mathematical expression of tolerance analysis for the assembly requirement is: For all acceptable deviations (deviations which are inside tolerances), there exists a gap situation such that the assembly requirements are verified.  The mathematical expression of tolerance analysis for the functional requirement is: For all acceptable deviations (deviations which are within tolerances), and for all admissible gap situations, the functional requirements are verified.  In the manufacturing phase, several deviations appear due to manufacturing processes. These are called manufacturing deviations. Many imperfections types are identified in a geometrically toleranced mechanism. With a view to simplicity in this paper, only dimensional deviations are considered. As it is commonly agreed in the literature  [6,3,1], deviations  D   ( ω )  are modeled by random variables where ω is the hazard. Their means are the nominal values, while their standard deviations depend on the process characteristics. The authors are currently investigating applications involving positional (location and orientation) deviations. These new deviations are also modeled as random variables. The number of concerned variables increases but the whole resolution methodology is the same. Nevertheless, considering positional deviations in a 3-dimensional context could lead to highly non-linear functions which then have to be piecewise linearized. These developments will be covered in further publications. According to the literature  [10], form deviations are negligible compared to positional ones. Thus, they will be omitted in the presented study and the following ones. To take gaps into account, part positions are modeled by deterministic free variables  P  . These variables are not considered as random, since part displacements cannot be controlled, but only limited by part dimensions. In 3 dimensions, a part has 6 degrees of freedom (3 translations and 3 rotations) which involve 6 displacement variables  P  per mobile part.  As a preliminary step, it is useful to determine whether the mechanism, composed of several parts, can be assembled. As Dantan and Qureshi  [9] express it, one gap situation has to be found such that the assembly requirements are verified. Assembly is possible if all assembly constraints are respected:  (   ⋂   i = 1     N   m       m   i    (  D  ,  P  )  ≤ 0 )  , where   N   m   is the number of   m   i    (  D  ,  P  )  ≤ 0 assembly constraints. The general purpose of tolerance analysis is to compute the following assembly defect probability:  (1)    P   D a   = Prob  ( ∀  P  , ∃ i ,   m   i    (  D  ,  P  )  > 0 )  .   As gaps are involved, this defect probability computation is potentially complex. For practical purposes, it can often be simplified so that assembly constraints no longer depend on gaps:  (2)    P   D a   = Prob  (   ⋃   i = 1     N   m       m   i    (  D  )  > 0 )  = 1 − Prob  (   ⋂   i = 1     N   m       m   i    (  D  )  ≤ 0 )  .      Once the mechanism is assembled, its functionality is verified through at least one identified functional characteristic, dependent on deviation  D  and position  P  variables:  (3)    F   c   = f  (  D  ,  P  )  .   For functionality issues on mechanisms with gaps, where parts are mobile, the functional requirement must be respected for all admitted positions  P  of parts. Due to these displacements,   N   c   non-interference constraints   g   i    (  D  ,  P  )  ≤ 0 , corresponding to   N   c   potential contact points, are defined. These prevent parts from coming into collision with each other. They can be established thanks to different methods: small displacement torsor  [11], matrices  [12], T-Map  [8], or directly by considering each potential contact point. They constitute the non-interference domain Ω  (  D  )  representing the admitted positions  P  of parts such that they do not collide with each other. The system is functional if    ∀  P  ∈ Ω  (  D  )  ,    F   c    (  D  ,  P  )  ∈  [   F     c    min      ;   F     c    max      ]     (4)  Ω  (  D  )  :  P  /   ⋂   j = 1     N   c       g   j    (  D  ,  P  )  ≤ 0 .       Finally, the goal is to compute the   P   D f   probability that functional requirements are not respected. It is defined as  (5)    P   D f   = Prob  ( ∃  P  ∈ Ω  (  D  )  ,   F   c    (  D  ,  P  )  ∉  [   F     c    min      ,   F     c    max      ]  )  = Prob  ( ∃  P  ∈ Ω  (  D  )  ,   F   c    (  D  ,  P  )  <   F     c    min      )  + Prob  ( ∃  P  ∈ Ω  (  D  )  ,   F   c    (  D  ,  P  )  >   F     c    max      )  .      Remarks:  • In the next sections, as the two probability terms can be treated similarly, the lower bound   F     c    min      is not considered.  The functionality notion makes sense only if the mechanism can be assembled. Thus, the functionality defect probability   P   D f   is the probability that the mechanism can be assembled (thanks to the non-interference domain Ω  (  D  )  ) but being non-functional. It should be noted that non-interference equations   g   i    (  D  ,  P  )  can be close to assembly equations   m   i    (  D  ,  P  )  but are significantly different.  The defect probabilities defined above can be computed thanks to the well-known Monte Carlo (MC) simulation method  [5]. Due to the presence of gaps, the functionality formulation requires all the admitted part positions to be taken into consideration. To ensure this, an optimization algorithm is called for each sample of random variables  D  to find the worst functional characteristic value max  (   F   c   )  with respect to the associated functional requirement   F     c    max      . For a given value of  D  ,   F   c    (  D  ,  P  )  is maximized under   N   c   non-interference constraints:   g   j    (  D  ,  P  )  ≤ 0 , j = 1 to   N   c   . The functionality defect probability is written as follows:  (6)    P   D f   = Prob  (   max    P  ∈ Ω  (  D  )     [   F   c    (  D  ,  P  )  >   F     c    max      ]  )  .      The algorithm is composed of four steps. The first three steps are repeated   N   l   times: k = 1 to   N   l   , where   N   l   is the number of MC simulations.  1. A set of dimensions    D     ( k )    is randomly decided.  Once the non-interference domain Ω  (    D     ( k )    )  is constituted,   max    P  ∈ Ω  (    D     ( k )    )     [   F   c    (    D     ( k )    ,  P  )  ]  is computed using an optimization algorithm.  The indicator   I   D f    ( k )    is introduced:  (7)    I   D f    ( k )    =  {    1   if   max    P  ∈ Ω  (    D     ( k )    )     [   F   c    (    D     ( k )    ,  P  )  ]  >   F     c    max          0   else.          Finally,   P   D f   =  E   [    I    D f   ]     For the assembly issue, the solution is simpler: the second step is skipped and the indicator is defined as  (8)    I   D a    ( k )    =  {    1   if   max   i = 1     N   a      [   m   i    (  D  )  ]  > 0     0   else.       Finally,   P   D a   = E  [    I    D a   ]  .  MC defect probabilities are estimators. Thus, the 95% confidence interval of   P   D   can be computed to evaluate the accuracy of the result (see  [4] for more details):  (9)    P   D   − 1.96   σ     P   D     ≤   P   D   ≤   P   D   + 1.96   σ     P   D       where   σ     P   D     is the defect probability standard deviation, dependent on the number of MC simulations   N   l   , defined as  (10)    σ     P   D     =       P   D    ( 1 −   P   D   )      N   l       .      This methodology can be very precise but requires millions of runs to reach low   P   D   values (optimization runs for   P   D f   ), so an alternative methodology is proposed to reduce computation time. It will be presented in the next section.  The first presented methodology uses MC simulations, but it requires millions of optimization runs. The objective of this new approach is to reduce that computation time.  As previously stated, to deal with the functionality issue, all the part position situations have to be taken into consideration. The first methodology is global, since it considers all the contact points at once (i.e. the   N   c   non-interference constraints). In fact, it is possible to decompose the global defect event into several identified ones, each one relative to a contact point situation. This is the aim of the proposed methodology. This approach is called “system” since the problem is composed of a system of events. The advantage of this approach is that the position variables disappear in Eq. (12) for a given contact point situation.  P  variables are replaced by      P    ˆ     i   : the part coordinates in the i -th contact point situation. It is then much easier to verify that the functional requirements are respected. A contact point situation is defined such that all degrees of freedom are removed; thus 6 non-interference constraints are equal to 0:   g   i    (  D  ,  P  )  = 0 , i = 1 to 6. These constraints are linearized thanks to a Taylor expansion around a pertinent point in  P  space, depending on the application. Since part position variations are very small in the tolerance analysis problem, the linearized equations     g   ̃     i    (  D  ,  P  )  = 0 are very close to the original ones, which enables the problem to be addressed much more easily. The negligible impact of this linearization phase on the results will be demonstrated in the following applications (Sections  4 and 5). For each of the   N   s   =   C     N   c     6   contact point situations, it is possible to solve the i -th ( i = 1 to   N   s   ) linear problem:     g   ̃        s    j    ( i )       (  D  ,  P  )  = 0 , j = 1 to 6 whose solution is      P    ˆ     i   , where    s    j    ( i )    is the j -th term of the    s     ( i )    vector. This vector contains the identification number combinations (i.e. 6 numbers from 1 to   N   c   ) of the non-interference constraints concerned in the i -th contact point situation. If      P    ˆ     i   exists, it means that the first six non-interference constraints are respected. Then the other ones, making up the non-interference domain, have to be checked (i.e. the   N   c   − 6 others). As constraints are linear and therefore monotonous, the extreme   F   c   value is given by obtaining the maximum functional characteristic from among all the individual situations:  (11)    max    P  ∈ Ω  (  D  )     (   F   c    (  D  ,  P  )  )  =   max   i = 1     N   s      [   F   c    (  D  ,      P    ˆ     i   )  ,   ⋂   j = 1     N   c   − 6     g        s    ̄     j    ( i )       (  D  ,      P    ˆ     i   )  ≤ 0 ]    where      s    ̄     j    ( i )    is the vector containing the identification numbers of the non-interference constraints which are not involved in the i -th contact point situation. Thus, according to structural systems reliability theory  [13], the original defect probability is transformed as follows; hence Eq. (6) becomes  (12)    P   D f   = Prob  (   F     c    max      −   max   i = 1     N   s      [   F   c    (  D  ,      P    ˆ     i   )  ,   ⋂   j = 1     N   c   − 6     g        s    ̄     j    ( i )       (  D  ,      P    ˆ     i   )  ≤ 0 ]  < 0 )  = Prob  (   min   i = 1     N   s      [   L   i    (  D  )  ,   ⋂   j = 1     N   c   − 6     g        s    ̄     j    ( i )       (  D  ,      P    ˆ     i   )  ≤ 0 ]  < 0 )  = Prob  (   ⋃   i = 1     N   s      [  (   L   i    (  D  )  < 0 )    ⋂   j = 1     N   c   − 6    (   g        s    ̄     j    ( i )       (  D  ,      P    ˆ     i   )  ≤ 0 )  ]  )    where the performance functions are   L   i    (  D  )  =   F     c    max      −   F   c    (  D  ,      P    ˆ     i   )  . The problem is thus reduced to a system problem of   N   s   unions of   N   c   − 6 intersections of dependent events. However, the computation of   P   D f   is still not trivial. It can be simplified in two ways: firstly, the number   N   s   of considered situations can be reduced; secondly, unions of intersections can be transformed.  For practical reasons, only a few of the   N   s   contact point situations are realistic in the dimension variation domain. Some of them are mechanically unfeasible, extremely rare or redundant with others. For all these reasons, an identification phase is recommended to ascertain the dominant situations. Ballu et al.  [6] do this by knowledge and expertise, but it is not always possible. Another possibility is to run the optimization used in the first methodology a small number of times ( 1   0     N   r     ) in the dimension variation domain. For each set of dimensions, the optimization algorithm finds max  (   F   c   )  while saturating some constraints. These saturated constraints represent the identified contact point situations which cover defect probabilities. This method, which is not obligatory, enables a significant reduction in the number   N   s   of considered events for most mechanisms. Indeed, taking into consideration non-dominant situations would increase the mathematical complexity of the defect probability expression. The computing time would also increase slightly. 1   0     N   r     runs ensure that the appearance probability of non-identified situations is less than 1   0     N   r   − 6   ppm. The number of dominant contact point situations is noted   N   d s   .  The second simplification step consists of transforming the   P   D f   formulation thanks to the Poincaré formula:  (13)    P   D f   =   ∑   i = 1     N   d s     Prob  [  (   L   i    (  D  )  < 0 )    ⋂   j = 1     N   c   − 6    (   g        s    ̄     j    ( i )       (  D  ,      P    ˆ     i   )  ≤ 0 )  ]  −   ∑   i < k   Prob  [  (   L   i    (  D  )  < 0 )    ⋂   j = 1     N   c   − 6    (   g        s    ̄     j    ( i )       (  D  ,      P    ˆ     i   )  ≤ 0 )  ⋂  (   L   k    (  D  )  < 0 )    ⋂   j = 1     N   c   − 6    (   g        s    ̄     j    ( k )       (  D  ,      P    ˆ     k   )  ≤ 0 )  ]  + ⋯ +    ( − 1 )      N   d s   − 1   Prob  (   ⋂   i = 1     N   d s      [  (   L   i    (  D  )  < 0 )    ⋂   j = 1     N   c   − 6    (   g        s    ̄     j    ( i )       (  D  ,      P    ˆ     i   )  ≤ 0 )  ]  )  .      This formula transforms unions of event intersections into simple event intersections. It allows   P   D f   to be computed more easily.  Several methods, such as FORM (First Order Reliability Method), can deal with this kind of system problem very efficiently  [4]. Each event (   L   i    (  D  )  < 0 for example) is considered individually by the classic FORM method. The preliminary task is to transform physical variables  D  into standard ones  U  (i.e. Gaussian variables with means and variances respectively equal to 0 and 1). In the case of uncorrelated Gaussian variables, the transformation is direct:   U   i   =  (   D   i   −   μ   i   )  /   σ   i   where   μ   i   and   σ   i   are respectively the mean and standard deviation of the random variable   D   i   . In other cases (non-Gaussian distributions for example), it can be more complicated, but methods exist and are understood (see  [4] for details). In the new  U  space, a function   G   i    (  D  )  becomes   H   i    (  U  )  . Each function   H   i    (  U  )  , called performance function, is linearized at the most probable failure point    U     ( i )  ∗   . This gives rise to hyper-planes (straight lines in 2 dimensions) whose equation are     H   ̃     i    (  U  )  = 0 .    U     ( i )  ∗   is the closest point to the origin which respects the constraint   H   i    (  U  )  = 0 . Its distance from the origin is noted   β   i   and called the reliability index. The FORM method also provides direction cosines:    α    i   = ∇   H   i    (    U     ( i )  ∗   )  /  ‖ ∇   H   i    (    U     ( i )  ∗   )  ‖  . Once all performance functions ( n ) are treated separately, the second stage consists of considering unions or intersections of events, which is the system phase. Let F be the following defect domain:  (14)  F =  {  D  /   ⋂   i = 1   n     G   i    (  D  )  < 0 }  =  {  U  /   ⋂   i = 1   n     H   i    (  U  )  < 0 }  ≈  {  U  /   ⋂   i = 1   n       H   ̃     i    (  U  )  < 0 }  .       Fig. 3 illustrates the FORM concepts in a 2-dimensional standard  U  space. The F domain is grayed out. The dependency of different events, i.e. the orientation of hyper-planes, is taken into account through a covariance matrix defined using direction cosines. The  ( i , j )  -th term of  [  ρ  ]  is   ρ   i j   =  〈    α     ( i )    ,    α     ( j )    〉  , where  〈 • , • 〉  is the scalar product. Finally, the defect probability associated with the F domain is estimated using the n -dimensional multivariate normal cumulative distribution function   Φ   n   :  (15)    P   D   = Prob  (   ⋂   i = 1   n     G   i    (  D  )  < 0 )  ≈ Prob  (   ⋂   i = 1   n       H   ̃     i    (  U  )  < 0 )  =   Φ   n    ( −  β  ,  [  ρ  ]  )  .      In the case illustrated in Fig. 3, the defect probability is expressed as follows:  (16)    P   D   =   Φ   3    (  { −   β   1   , −   β   2   , −   β   3   }  ,  [  ρ  ]  )  .          Φ   n   is computed thanks to the Genz method  [14], which evaluates the n -dimensional multivariate normal cumulative distribution function almost instantaneously. As limit-state functions are replaced by hyper-planes, the method gives only an approximation of   P   D   , but it also provides its confidence interval. Again, due to low part dimension variations in a tolerance analysis context, this linearization is often very accurate. This method can easily be applied to compute both defect probabilities   P   D f   and   P   D a   given respectively by Eqs. (13) and (2), composed only of event intersections.  In this section, a case study is presented, based on an industrial problem. It is a 2D representation of an electric coaxial connector designed and manufactured by RADIALL SA, comprising 2 cylindrical parts (see Fig. 4 ). Due to the presence of gaps in the mechanism, part 1 is mobile while part 2 is fixed. The position of part 1 is located in 2D space thanks to the displacement variable vector:  P  =  { X , Y , α }  . Rotational symmetry is taken into account by constraining α positive. Dimensions  D  are modeled by Gaussian variables and their characteristics are noted in Table 1 .  This coaxial connector can be assembled if the dimensions of part 1 are lower than the corresponding dimensions of part 2, if the following assembly constraints are verified:      m   1    (  D  )  =   D   3   −   D   4   ≤ 0    (17)    m   2    (  D  )  =   D   1   −   D   2   ≤ 0       m   3    (  D  )  =   D   6   −   D   5   ≤ 0 .    The assembly defect probability can be computed thanks to the FORM system method described in Section  4:  (18)    P   D a   = 1 − Prob  (  (   m   1    (  D  )  ≤ 0 )  ⋂  (   m   2    (  D  )  ≤ 0 )  ⋂  (   m   3    (  D  )  ≤ 0 )  )  = 1 −   Φ   3    ( −   β   1   , −   β   2   , −   β   3   ,  [ ρ ]  )  .   As the functions are independent, the covariance matrix  [ ρ ]  is equal to the identity matrix. Thus,   Φ   3    ( −   β   1   , −   β   2   , −   β   3   ,  [ ρ ]  )  = Φ  ( −   β   1   )  Φ  ( −   β   2   )  Φ  ( −   β   3   )  , with      β   1   =     μ     D   3     −   μ     D   4           σ     D   4     2   +   σ     D   3     2       = − 2.357    (19)    β   2   =     μ     D   1     −   μ     D   2           σ     D   2     2   +   σ     D   1     2       = − 2.357       β   3   =     μ     D   6     −   μ     D   5           σ     D   5     2   +   σ     D   6     2       = − 2.357 .    Finally,  (20)    P   D a   = 1 − Φ  ( 2.357 )  Φ  ( 2.357 )  Φ  ( 2.357 )  = 27  380  ppm .    Table 2 shows   P   D a   results computed by MC simulations and by the FORM system. Both computation methods give comparable results in a very short time because this assembly issue is trivial. However, it is interesting to note that the FORM system methodology provides the exact probability result instantaneously while MC simulations provide a confidence interval on the result.  Concerning the functionality issue, the non-interference domain Ω  (  D  )  is determined by considering each potential contact point. This depends on the mechanism dimensions and defines the admitted positions and orientation  P  of part 1:      g   1    (  D  ,  P  )  =     D   6     2   sin  ( α )  +     D   3     2   cos  ( α )  −     D   4     2   + X ≤ 0       g   2    (  D  ,  P  )  =   D   7   tan  ( α )  +     D   1     2 cos  ( α )    +  (     D   5     2   − Y )  tan  ( α )  − X −     D   2     2   ≤ 0       g   3    (  D  ,  P  )  =     D   3     2   sin  ( α )  +     D   6     2   cos  ( α )  −     D   5     2   + Y ≤ 0    (21)    g   4    (  D  ,  P  )  =     D   6     2   sin  ( α )  +     D   3     2   cos  ( α )  −     D   4     2   − X ≤ 0       g   5    (  D  ,  P  )  =     D   1     2 cos  ( α )    +  (     D   5     2   − Y )  tan  ( α )  + X −     D   2     2   ≤ 0       g   6    (  D  ,  P  )  =     D   3     2   sin  ( α )  +     D   6     2   cos  ( α )  −     D   5     2   − Y ≤ 0     Ω  (  D  )  :  P  /   ⋂   i = 1   6     g   i    (  D  ,  P  )  ≤ 0 .       The functional characteristic is   F   c   =   α    max    . To achieve an adequate electrical connection,   α    max    , which represents the largest α angle admitted by the mechanism, must not exceed a given threshold   F     c    max      = 0.01  rad . The functional requirement is  (22)    α    max     (  D  )  =   max    P  ∈ Ω  (  D  )     ( α )  ≤   F     c    max      .      To compute   P   D f   with the proposed method, the preliminary task is to linearize the initial non-interference constraints g  (  D  ,  P  )  in Eq. (21) with respect to the displacement space  P  by using a Taylor expansion around a particular point:  ( X = 0 , Y = 0 , α =   F     c    max      )  (to not be confused with the most probable failure point). This point is very pertinent because   F     c    max      is the angle at which the functional characteristic value is critical. Then the important contact point situations are identified. In 2D space, such a situation has three contact points among the six potential ones (   N   c   = 6 ). As a consequence, there exist   N   s   =   C   6   3   = 20 potential contact point situations. Five of these are identified thanks to their contact point identification, defined in Fig. 4 in this particular case:    s     ( 1 )    =  { 1 , 2 , 3 }  ,    s     ( 2 )    =  { 1 , 3 , 4 }  ,    s     ( 3 )    =  { 2 , 3 , 6 }  ,    s     ( 4 )    =  { 1 , 3 , 6 }  and    s     ( 5 )    =  { 2 , 3 , 5 }  as dominant situations. They are obtained using 100 optimization runs. For each of them, a linear problem is solved in order to obtain the  P  -coordinates    P    ˆ   of these extreme situations. For example, the first one is defined as follows:  (23)       P    ˆ     1    (  D  )  =  P  /  {        g   ̃     1    (  D  ,  P  )  = 0         g   ̃     2    (  D  ,  P  )  = 0         g   ̃     3    (  D  ,  P  )  = 0 .          Based on these coordinates, 5 performance functions are defined:  (24)    L   i    (  D  )  =   F     c    max      −   F   c    (  D  ,      P    ˆ     i    (  D  )  )  ,  i = 1 – 5 .   These functions, although resulting from a linear system, are not linear with regard to  D  space. Thus, the FORM method transforms them into hyper-planes at the most probable failure point. The intersection of events is treated by the FORM system method and   P   D f   is computed thanks to the multi-dimensional Gaussian cumulative distributive function   Φ   n   . The following equation enables the computation of the defect probability presented Eq. (13):  (25)    P   D f   ≈   ∑   i = 1   5     Φ   4    ( −    β     ( i )    ,    [  ρ  ]     ( i )    )  −   ∑   i < j     Φ   8    ( −    β     ( i j )    ,    [  ρ  ]     ( i j )    )  + ⋯ +    ( − 1 )      N   d s   − 1     Φ   20    ( −    β     ( i j …   N   d s   )    ,    [  ρ  ]     ( i j …   N   d s   )    )    where    β     ( i )    ,    β     ( i j )    ,    β     ( i j …   N   d s   )    ,    [  ρ  ]     ( i )    ,    [  ρ  ]     ( i j )    and    [  ρ  ]     ( i j …   N   d s   )    are the reliability index vectors and the covariance matrices associated respectively with the i -th contact point situation, the i -th and j -th situations and the   N   d s   situations together. For example, the first term of Eq. (25) uses   Φ   4   because there is an intersection of   N   c   − 3 + 1 = 6 − 3 + 1 = 4 events in the first term of Eq. (13) (   N   c   − 6 + 1 in 3 dimensions but   N   c   − 3 + 1 in this particular plane model). Thus,    β     ( i )    and    [  ρ  ]     ( i )    are respectively a 4-dimensional vector and square matrix.  For a better comprehension, Fig. 5 shows the defect area as regards the first identified situation in  (   U   1   ,   U   2   )  space while  (   U   3   ,   U   4   ,   U   5   ,   U   6   ,   U   7   )  are fixed. Fig. 6 shows the whole defect area in the same space. The complete defect area is the union of individual defect areas relative to each contact point situation. Some lines cannot be displayed since they are outside the frame. Some lines are also merged with others. It is interesting to note that most defect areas have common limits and are disjoint. Nevertheless, the third and fourth ones have a common intersection. This figure helps to understand the necessity of using the Poincaré formula to compute   P   D f   (Eq. (13)).  The goal of this application is to show that tolerance analysis can be conducted at a very low computing cost using the FORM system methodology for simple over-constrained mechanisms with gaps. Different solution methods are proposed based on the two presented methodologies, using both linear and non-linear non-interference constraints. Results in ppm are listed in Table 3 with their 95% confidence intervals (C.I.).   N   l   =   10   7   runs were used for MC, so the 95% C.I. width of   P   D f   is approximately equal to 300 ppm. The FORM system results have also a 95% C.I. due to the Genz method. The low difference between the two MC results shows that non-interference constraint linearization has no measurable impact on   P   D f   . Also, as the FORM system results are very close to those of MC (Table 3), it shows that the FORM linearization phase has no measurable impact either. This argues that the FORM system methodology can deal with this kind of problem with a very low computing cost (10 min as opposed to 10 h).  To give an idea of the weight of each dominant contact point situation, the individual defect probabilities associated with each situation were computed as   (26)    P   D f    ( i )    = Prob  [  (   L   i    (  D  )  < 0 )    ⋂   j = 1   3    (     g   ̃     j    (  D  ,      P    ˆ     i   )  ≤ 0 )  ]        P   D f    ( 1 )    = 30  527  ( 65 )   ppm ,    P   D f    ( 2 )    = 1861  ( 12 )   ppm ,    P   D f    ( 3 )    = 13  770  ( 27 )   ppm    (27)    P   D f    ( 4 )    = 14  781  ( 32 )   ppm ,    P   D f    ( 5 )    = 1  ( 0.01 )   ppm .       This shows that different situations play a significant role in the defect scenario. Based on these individual situation results, it is possible to compute a   P   D f   upper bound, which is simpler and faster to obtain, but quite distant from the actual value in this case:  (28)    P   D f   ≤   ∑   i = 1     N   d s       P   D f    ( i )    = 60  940  ( 136 )   ppm .      Now let us consider a second industrial case study, already presented by Ballu et al.  [6] and Wu et al.  [15]. The new proposed methodology is applied to compute defect probabilities for this mechanism. It is a prismatic joint composed of 2 shafts {3, 4}, one bearing {1} and one other part {2} (see Fig. 7 ). The axles slide in part {1} and are attached to part {2} by hooping. Part {1} is fixed, while parts {2, 3, 4} are positioned in the vertical direction thanks to displacement variables  P  =  {   Y   K   , α }  (see Fig. 7). Parts {2, 3, 4} are designed to move mainly in the horizontal direction, but this study will investigate only vertical displacements, and horizontal movements are not considered here.   l   1   ,   l   2   and   l   3   define the horizontal positions of parts which are fixed. They are modeled by deterministic variables. Due to manufacturing defects, the shafts are not parallel, their borings are not coaxial with them and their dimensions are not at their nominal values. Thus, gaps are introduced between shafts and borings, allowing displacements. Dimensions  D  characterize relevant manufacturing deviations.   D   1   to   D   8   are the distances between the real axes of the borings and the shafts at part {1} plane level.   D   9   to   D   12   are the diameters of the shafts and borings (see Fig. 8 ). They are modeled by Gaussian variables.  D  and  l  characteristics are noted in Table 4 .  The assembly constraints of this mechanism, obtained geometrically, are as follows:      m   1    (  D  )  = 2   D   1   −   2  (   l   1   +   l   2   +   l   3   )      l   3       D   5   −  ( 2 −   2  (   l   1   +   l   2   +   l   3   )      l   3     )    D   6   +   D   9   −   D   11   − 2   D   3   +   2  (   l   1   +   l   2   +   l   3   )      l   3       D   7   +  ( 2 −   2  (   l   1   +   l   2   +   l   3   )      l   3     )    D   8   +   D   10   −   D   12   ≤ 0       m   2    (  D  )  = − 2   D   1   +   2  (   l   1   +   l   2   +   l   3   )      l   3       D   5   +  ( 2 −   2  (   l   1   +   l   2   +   l   3   )      l   3     )    D   6   +   D   9   −   D   11   + 2   D   3   −   2  (   l   1   +   l   2   +   l   3   )      l   3       D   7   −  ( 2 −   2  (   l   1   +   l   2   +   l   3   )      l   3     )    D   8   +   D   10   −   D   12   ≤ 0    (29)    m   3    (  D  )  = 2   D   2   −   2  (   l   2   +   l   3   )      l   3       D   5   −  ( 2 −   2  (   l   2   +   l   3   )      l   3     )    D   6   +   D   9   −   D   11   − 2   D   4   +   2  (   l   2   +   l   3   )      l   3       D   7   +  ( 2 −   2  (   l   2   +   l   3   )      l   3     )    D   8   +   D   10   −   D   12   ≤ 0       m   4    (  D  )  = − 2   D   2   +   2  (   l   2   +   l   3   )      l   3       D   5   +  ( 2 −   2  (   l   2   +   l   3   )      l   3     )    D   6   +   D   9   −   D   11   + 2   D   4   −   2  (   l   2   +   l   3   )      l   3       D   7   −  ( 2 −   2  (   l   2   +   l   3   )      l   3     )    D   8   +   D   10   −   D   12   ≤ 0       m   5    (  D  )  =   D   9   −   D   11   ≤ 0       m   6    (  D  )  =   D   10   −   D   12   ≤ 0 .    These constraints enable the shafts to penetrate part 1 without stress or deformation. To compute   P   D a   , once again both MC simulations and the FORM system can be used, since the defects do not depend on part positions. The reliability indexes of the FORM system method are computed analytically, since the constraints are linear. Table 5 shows the assembly defect results for this case study.  The mechanism’s functionality depends on the lower position min  (   Y   K   )  of point K , belonging to part {2}, in the vertical direction (see Fig. 7). The functional requirement is that this position be greater than 0.94 mm below its nominal position: min  (   Y   K   )  ≥   Y     K    min      = − 0.94 . To compute   P   D f   , the preliminary task is to establish non-interference constraints. There are 4 potential contact points represented in Fig. 7. Each one involves a linearized constraint:        g   ̃     1    (  D  ,  P  )  =   Y   K   +  (   l   1   +   l   2   +   l   3   )  α +   D   6   +     D   9     2   −     D   6   −   D   5       l   3      (   l   3   +   l   2   +   l   1   )  −   D   1   −     D   11     2   ≤ 0         g   ̃     2    (  D  ,  P  )  = −   Y   K   −  (   l   2   +   l   3   )  α −   D   6   +     D   9     2   +     D   6   −   D   5       l   3      (   l   3   +   l   2   )  +   D   2   −     D   11     2   ≤ 0    (30)      g   ̃     3    (  D  ,  P  )  =   Y   K   +  (   l   1   +   l   2   +   l   3   )  α +   D   8   +     D   10     2   −     D   8   −   D   7       l   3      (   l   3   +   l   2   +   l   1   )  −   D   3   −     D   12     2   ≤ 0         g   ̃     4    (  D  ,  P  )  = −   Y   K   −  (   l   2   +   l   3   )  α −   D   8   +     D   10     2   +     D   8   −   D   7       l   3      (   l   3   +   l   2   )  +   D   4   −     D   12     2   ≤ 0     Ω  (  D  )  :  P  /   ⋂   i = 1   4       g   ̃     i    (  D  ,  P  )  ≤ 0 .    As the displacements are very small, functions are linearized. The defect probability   P   D f   is defined as  (31)    P   D f   = Prob  (   min    P  ∈ Ω  (  D  )     (   Y   K    (  D  ,  P  )  )  −   Y     K    min      < 0 )  .   This probability can be computed by the first methodology, and by the second one if the contact point situations are well defined. As Ballu et al.  [6] did, it is simple to identify them using the identification numbers defined in Fig. 7:    s     ( 1 )    =  { 1 , 2 }  ,    s     ( 2 )    =  { 3 , 4 }  ,    s     ( 3 )    =  { 1 , 4 }  and    s     ( 4 )    =  { 2 , 3 }  . In this case,   N   d s   =   N   s   = 4 ,   N   c   = 4 . Thus, the second methodology   P   D f   formulation is as follows:  (32)    P   D f   = Prob  (   ⋃   i = 1   4    [  (   L   i    (  D  )  < 0 )    ⋂   j = 1   2    (   g        s    ̄     j    ( i )       (  D  ,      P    ˆ     i   )  ≤ 0 )  ]  )    where   L   i    (  D  )  =   Y   K    (  D  ,      P    ˆ     i    (  D  )  )  −   Y     K    min      . Functionality defect probability results are given in Table 6 . As in the previous application, both methodologies give comparable results, but the computation cost of the MC method is significantly higher than that of the FORM system. This application confirms the ability of the FORM system method to deal with functionality issues very efficiently. The defect probability of individual situations   P   D f    ( i )    , i = 1 to 4, can be computed, and their sum gives a   P   D   upper bound, which is very close to the actual result:      P   D f    ( 1 )    = 148  ( 1 )  ,    P   D f    ( 2 )    = 131  ( 1 )  ,    P   D f    ( 3 )    = 148  ( 1 )  ,    P   D f    ( 4 )    = 131  ( 1 )     (33)    P   D f   ≈   ∑   i = 1   4     P   D f    ( i )    = 558  ( 4 )   ppm .    This shows that individual defect events are independent in this case.   CONCLUSION   Statistical tolerance analysis is a key step in the design phase for industrial products. Probabilistic approaches provide very useful tools for tolerance analysis. The goal is to compute defect probabilities of over-constrained mechanisms containing gaps; the latter represent the main difficulty here, since they cannot be modeled as random variables. In fact they are free and have to be considered as deterministic variables. This point greatly complicates the solution process. In addition, these kinds of mechanisms are specific, because their non-conformance is caused either by assembly defects or by functionality defects. This paper shows that assembly issues are often trivial, whereas functionality issues are complex due to the presence of gaps.  Concerning functionality issues, the paper proposes an innovative methodology from the structural reliability domain. The authors propose to compute   P   D f   defect probability using the FORM system method. Several contact point situations are treated separately as dependent events. Their intersection is taken into consideration thanks to the multi-dimensional Gaussian cumulative distributive function   Φ   n   , computed by the Genz method. The proposed methodology is compared with another existing method based on MC simulations and optimizations. The two industrial applications show that both presented methodologies give equivalent results. The proposed method enables the computation of defect probabilities for mechanisms containing gaps at a very low computing cost (a few minutes compared to several hours). The FORM system methodology is remarkably accurate and can be applied to other mechanisms containing gaps on which several contact point situations can be identified to respect functional requirements. Its efficiency is also linked to the linearity of non-penetration constraints to ensure that extreme functional characteristic values are obtained at the contact points.  In the case of more complex mechanisms with gaps whose behavior is governed by highly non-linear functions, the constraint linearization phase could lead to errors in defect probabilities. In future work, it would be interesting to deal with this kind of system.   ACKNOWLEDGMENTS   The authors would like to thank RADIALL SA, and particularly Laurent Gauvrit, for their cooperation concerning the presented coaxial connector case study. The Auvergne regional council is also gratefully acknowledged for its financial contribution to this work.   REFERENCES", "highlights": "One of the aims of statistical tolerance analysis is to evaluate a predicted quality level at the design stage. One method consists of computing the defect probability   P   D   expressed in parts per million (ppm). It represents the probability that a functional requirement will not be satisfied in mass production. This paper focuses on the statistical tolerance analysis of over-constrained mechanisms containing gaps. In this case, the values of the functional characteristics depend on the gap situations and are not explicitly formulated with respect to part deviations. To compute   P   D   , an innovative methodology using system reliability methods is presented. This new approach is compared with an existing one based on an optimization algorithm and Monte Carlo simulations. The whole approach is illustrated using two industrial mechanisms: one inspired by a producer of coaxial connectors and one prismatic pair. Its major advantage is to considerably reduce computation time.   Defect probability of the mechanism  Assembly defect probability of the mechanism  Functionality defect probability of the mechanism    n -dimensional multivariate normal cumulative distribution function  Vector of part deviations    i -th part deviation  Vector of part positions    i -th part position    i -th assembly constraint  Number of assembly constraints    i -th non-interference constraint  Number of non-interference constraints  Non-interference domain  Linearized function  Number of contact point situations     P  coordinates relative to the i -th contact point situation  Performance function associated with the i -th contact point situation  Number of dominant contact point situations"}