{"id": "S001048251400256X", "article": "MAIN-TITLE Recurring patterns of atrial fibrillation in surface ECG predict restoration of sinus rhythm by catheter ablation   HIGHLIGHTS          Analysis of surface ECG in 62 consecutive patients with atrial fibrillation (AF).      Recurrence plot indices predict catheter ablation (CA) outcome at 6-month follow-up.      Higher recurrence indices associated with decreased risk of AF relapse at follow-up.      Recurrence indices could be used to select patients more likely to benefit from CA.          KEYPHRASES   Atrial fibrillation  TQ interval  Recurrence quantification analysis  Principal component analysis  Electrocardiogram segmentation   There is considerable interest in developing tools capable of identifying patients likely to benefit from catheter ablation (CA) of AF. Termination of AF during CA is associated with longer-term maintenance of sinus rhythm (SR) [1–3]. Pre-ablation factors, such as AF cycle length (AFCL), left atrial diameter or volume, and duration of AF have been shown to predict the likelihood of termination [2,4]. Motivated by the clinical interest in non-invasive predictors of outcome from CA and electrical cardioversion the surface electrocardiogram (ECG) has also been studied. The f-wave, namely the atrial electrical signal (mainly observable in the TQ interval) has drawn considerable attention. Its amplitude and cycle length in preprocedural baseline recordings have been associated with acute [5–7] and intermediate [5,7] ablation outcomes. Techniques in the frequency or joint time-frequency domain, based on the spectral analysis of the estimated f-wave have also been applied to predict AF relapse following electrical cardioversion [8–10].  Recurrence quantification analysis, by Eckmann and colleagues [11] for the identification of dynamic patterns in time-series, has also been deployed in AF studies [12–15]. The method is based on a graphical representation, termed recurrence plot, of recurring patterns of sub-intervals of a given time-series. Indices can be calculated to quantify percentage, duration, and distribution of recurring patterns. The strength of this analysis is that it does not require modelling of the time-series, nor the removal of outliers [16].  At present, a quantitative non-invasive assessment of f-wave temporal predictability based on recurring patterns in individual ECG signals (auto-recurrence) is lacking, and might make prediction of acute and longer-term outcome following AF-ablation possible. In a previous study [17] we have successfully explored the ability of recurrence plot indices (RPIs) to predict acute and 3-month ablation outcome from preprocedural recordings of invasive intracardiac electrograms of the coronary sinus and right atrial appendage.  The aim of this study was to investigate the ability of RPIs from surface ECG recordings to predict acute and postoperative (3-month and 6-month) ablation outcome.   METHODS   62 consecutive patients with AF (32 paroxysmal AF, 30 persistent AF; 45 men; age 57±10 years) undergoing catheter ablation for standard clinical indications at this hospital were enroled in the study. The characteristics of the patient cohort are summarised in Table 1; the sample partition with respect to AF classification (paroxysmal or persistent) and CA outcome are shown in Table 2.  Prior to any ablation, 12-lead ECG recordings of 1-minute duration were obtained (Labsystem Pro™ recording system (Bard EP, C. R. Bard, Inc.). The signal was digitised at a sample rate of 1000 samples/s and stored for offline processing.  The study was conducted in compliance with the ethical principles of the Declaration of Helsinki. Patients gave informed consent. Class I and III antiarrhythmic drugs were discontinued five half-lives prior to ablation.  Ablation comprised the following stages.  1. PVI  All patients underwent PVI. Pulmonary veins were isolated electrically using one of three ablation technologies: (I) PVAC® multi-electrode circumferential ablation catheter (Medtronic Ablation Frontiers); (II) Arctic Front® cryo-balloon (Medtronic Cryocath); and (III) wide-area circumferential ablation using ThermoCool® SmartTouch™ catheter and CARTO®3 electroanatomical mapping and navigation system (Biosense Webster). Electrical isolation was inferred by the absence of local electrograms distal to the sites of ablation or independent pulmonary vein activity and, in those patients in sinus rhythm, by demonstrating entrance and exit block between the pulmonary veins and left atrium using pacing manoeuvres.  LA substrate ablation  Patients who did not revert to sinus rhythm during pulmonary vein isolation received further left atrial ablation as follows:  a. CFAE ablation  A detailed analysis of the left atrium and inter-atrial septum was performed to identify CFAEs (focal sites exhibiting constant electrical activity, or multi-component electrograms with cycle length <120ms averaged over a 10-second period), which were then ablated. This process was completed when no residual CFAE sites could be identified in the body of the left atrium or inter-atrial septum or when sinus rhythm was restored by ablation.  Linear ablation  A combination of “roof line” (connecting right and left upper pulmonary vein ostia), “mitral line” (connecting left lower pulmonary vein ostium to mitral valve annulus) and “inferior line” (connecting right lower pulmonary vein to coronary sinus) was constructed depending on the degree of signal complexity at the various sites. Linear ablation was performed with the endpoint being the absence of electrograms and presence of double potentials along the length of each line. No differential pacing manoeuvres were performed.  Of 32 paroxysmal AF patients, 24 had PVI only; 7 had PVI and linear ablation; and one had PVI, CFAE and linear. Of 30 persistent AF patients, 5 had PVI only; 6 PVI and linear; 11 had PVI and CFAE; and 8 had PVI, CFAE and linear ablation. The mean procedure and fluoroscopy times for the 62 patients were 191±36 and 33±16min, respectively.  All patients in AF at the end of the ablation procedure were labelled as “non-terminated” AF (NT-AF), the others as “terminated” AF (T-AF) and this defined the acute outcome. Patients with non-terminated AF subsequently received electrical cardioversion. Clinical outcome was further assessed three and six months after ablation (or electrical cardioversion if performed) by symptom review, 12-lead ECG and 72-hour Holter recordings. AF recurrence was defined as the presence of arrhythmia symptoms with documented AF on a 12-lead ECG and/or AF episodes lasting at least 30s on Holter monitoring. Early relapse within the first 3 months of CA is known to occur in some patients who subsequently maintain SR in the longer term. In line with other studies we observed a 3-month blanking period, where recurrence in this period is discarded in terms of the longer follow-up period (6 months).  At 3-month and 6-month follow-up, AF was detected in 19 and 21 patients, respectively (Table 2).  As the body surface AF waveform is free of obscuring ventricular activity only during the TQ interval of the cardiac cycle, we conducted our analysis firstly on AF waveforms extracted from TQ intervals, and secondly on the continuous AF waveform (CAFW) derived by suppression of the QRS-T by principal component analysis (PCA).  The ECG signals were preliminarily filtered to remove baseline wander due to respiration (4th order Butterworth high-pass filter with 3dB cut-off frequency of 0.5Hz) and mains (notch filter at 50Hz).  The ECG lead II was segmented using an automated algorithm inspired by Di Marco and Chiari [18], based on discrete wavelet transforms, to identify the QRS-T intervals. Briefly, the algorithm consists of two stages. In the first, beat detection is performed to identify the QRS complex of each ventricular contraction, then the fiducial points (i.e. the sample indices in the digital ECG data) indicating the onset of the QRS and the end of the T wave are determined.  The collection of sample indices of all QRS-T intervals (W  QRST ) was retained for recurrence analysis of TQ intervals of lead V 1. An example of the algorithm׳s detected QRS-T window for consecutive ventricular contractions is illustrated in Fig. 1. The horizontal lines in the left panels indicate data samples pertaining to a QRS-T interval (calculated from lead II, also displayed).  PCA is a source separation technique capable of estimating the continuous AF waveform (CAFW) from the surface ECG [19,20] with performance comparable to alternative extraction algorithms such as QRST template subtraction [21]. PCA was performed on a set of three quasi-orthogonal leads (I, aV  F , V 1). In agreement with Raine and colleagues [20], it was visually verified that the 1st principal component (PC1) had a prominent ventricular component, which was less dominant in other components. In particular it was visually observed that atrial activity was dominant and ventricular contaminants were minimised in PC3.  The presence of repeating (recurring) patterns of the atrial waveform was assessed by auto-recurrence quantification analysis. The method is based on a graphical representation of the similarity of subintervals of fixed length m, known as embedding dimension. On a square matrix, each point at coordinates (i, j) represents the similarity between two subintervals x  i and x  j both of length m. If the two subintervals are similar (i.e. their modulus distance is within a fixed tolerance ε) the point (i, j) on the matrix will be set to 1, otherwise it will be set to 0. Mathematically:  (1)    R   i , j   = Θ ( ε −  ‖    x   i   −   x   j    ‖  )  i , j = 1 , 2 , .. . , M   where R  i,j is the (i, j)th element of the recurrence matrix, Θ(·) is the Heaviside function, M=N−(m-1), N is the number of points in the time-series. The norm ∥ ⋅ ∥ represents the Euclidean distance operator, x  i =(x  i … x  i+m-1 )T, and (∙)T is the transposed operator. This formulation assumes a delay constant τ=1 (1 sample). Here, x is the ECG atrial waveform. The recurrence matrix can be represented graphically by the recurrence plot as illustrated in Fig. 1. In the recurrence plot pixels corresponding to elements of R of value 1 are coloured black while those of value 0 are coloured white.  Eq. (1) was used for analysis of the CAFW. However, for analysis of TQ intervals, elements of R corresponding to QRS-T intervals were assigned to infinite, namely arbitrarily high distance from any other point in the time series. Mathematically this corresponds to a modification in Eq. (1), as follows:  (2)    R   i , j   =  {      ∞  i ∈    W   Q R S T       or     j ∈    W   Q R S T         Θ ( ε −  ‖    x   i   −   x   j    ‖  )     otherwise          where W  QRST is the collection of all QRS-T intervals in the entire recording. As a corollary of Eq. (2), points in QRS-T intervals were treated as non-recurring. Thus, the analysis of recurrence was limited to TQ intervals of the ECG in lead V 1. The fraction of data containing TQ intervals in our dataset was 47.7%±8.6% (mean±std, across 62 records).  Percentage recurrence (PR, percentage of recurring subintervals x   i ), percentage determinism (PD, percentage of recurring x   i forming prolonged (“deterministic”) recurrence lasting at least L  MIN (=15) consecutive x   i ), and entropy of recurrence (ER, entropy of recurring patterns lasting at least L  MIN consecutive x   i ) indices were calculated from the recurrence matrix [12,14]. The choice of the above indices was based on their ability to describe the recurring dynamics of a time series [22].  Mathematically  (3)  P R =  1    N  2     ∑  i , j = 1  N     R   i , j    100 P D =    ∑  l =   L   M I N    N   l    H   l       ∑  i , j = 1  N     R   i , j      100 E R = −  ∑  l =   L   M I N    N     p   l     log   2     p   l      p   l   =     H   l      ∑  l =   L   M I N    N     H   l        where H  l is the proportion of diagonals of length l in the recurrence matrix R, p  l is the probability that a diagonal has length l. The index l ranges from L  MIN to the length N of the time series being analysed.  The maximum length of recurrence (L  MAX ) was also calculated  (4)    L   M A X   =   max   k ∈  {  1 , .. . ,   N   D    }     {    l   k    }    where N  D is the number of diagonal lines in the recurrence plot, and l  k is the length (number of points) of the kth diagonal line.  Higher values of recurrence indices indicate greater determinism and more organised atrial waveform.  To reduce the computational burden, without loss of information, the ECG signal was down-sampled at 100 samples/s (using anti-alias low-pass filtering) prior to computation of RPIs.  A standard criterion to select the recurrence plot parameters (time delay (τ), similarity tolerance (ε), and minimum length (L  MIN )) is lacking. It is generally accepted that the choice depends on the data [12–14,16,22]. In this study, the time delay was set to 1, as suggested in [16]. A suitable value for m (=11) was determined using the false nearest neighbour criterion [23] with tolerance threshold of 10%. At a sample rate of 100Hz, the chosen value for m corresponds to 110ms. For the threshold ε, a similar method to the one proposed by Censi and colleagues [12] was used. The value for ε was empirically set to a fraction (K  ε =25%) of the 3rd quartile of the ( x   i , x   j ) distance distribution. The values of K  ε and L  MIN were chosen based on a sensitivity analysis illustrated in  Figs. 2 and 3. Fig. 2 shows the PR distribution over the study population (N=62) as a function of K  ε . Larger distribution (larger inter-quartile range, vertical bars in Fig. 2) of PR is visible in the linear region of the sigmoid compared to the saturation regions, consistently with previous observations [24]. Conversely, the saturation regions are characterised by either very small values of K  ε (too strict similarity criteria, hence very few x   i subintervals are detected as similar, leading to very low PR and PR variability) or very high values (too large similarity criteria, hence almost all x   i are detected as similar, leading to very high PR and low PR variability). Therefore, the best choice for K  ε appears to be in the linear region of the sigmoid (i.e. between 15% and 30%). Note that by construction, PR does not depend on L  MIN .   Fig. 3 shows PD and ER distributions as functions of K  ε and L  MIN . Both PD and ER increased monotonically with K  ε independently of L  MIN delineating a saturating curve, similar to the sigmoid pattern described above. For increasing values of L  MIN , PD increased with stable distribution over the study population, whereas ER was very marginally affected. We therefore adopted an intermediate value for L  MIN (150ms, central trace in Fig. 3).  Owing to space limitations, the results of our study are reported for the chosen values of K  ε (25%) and L  MIN (150ms); however, the robustness of the method (i.e. consistency of the results in magnitude and significance) was verified over a set values for K  ε in the linear region of the PR sigmoid (i.e. K  ε =15%, 20%, 25%, 30%) and for L  MIN =100ms, 150ms, 200ms.  The f-wave amplitude was calculated from lead V 1 as the peak-to-nadir voltage difference in the TQ intervals (ΔT  TQ ) satisfying the condition  (5)  Δ   T   T Q   ≥  1    F   M I N       where F  MIN (=3.5Hz) is the lowest frequency in the AF spectrum of interest [19]. By construction, TQ intervals satisfying the above condition contained at least one full AF cycle.  It was verified that the above condition was met by at least 8 TQ intervals in each recording. The median TQ amplitude obtained from such intervals in each recording was retained for statistical analysis.  To prevent bias due to residual baseline wander, the linear trend was subtracted from the TQ interval prior to calculation of f-wave amplitude.  The ability of individual RPIs to predict acute and postoperative outcome was assessed by calculating the area under the curve (AUC) of the receiver operating characteristic (ROC). Cox proportional hazards regression models were used to estimate the hazard ratios (HR) of postoperative AF relapse, with time to event calculated as follow-up period (3 and 6 month). Group comparisons were performed using Mann–Whitney test (2-tail), with significance level of 0.05. The statistical analysis was done using SPSS statistical software (IBM Corp., Armonk, NY) and MATLAB Statistical Toolbox (The Mathworks, Inc, Natick, MA).   RESULTS   The recurrence indices from TQ intervals did not show significant difference between the acute outcome groups (terminated vs. non-terminated AF) ( Table 3). ER was significantly different between outcome groups (arrhythmia-free vs. AF relapse) at 3-month follow-up (p<0.05) and had increased statistical significance at 6-month follow-up (p<0.005). PD was also significantly different between the groups at 6-month follow-up (p<0.05). Furthermore, patients who would be arrhythmia-free at follow-up had higher values for all recurrence indices, indicating higher degree of determinism of the f-wave in TQ intervals.  The maximum length of recurrence (L  MAX ) was not significantly different either with respect to acute or postoperative outcome groups, regardless of the original signal (TQ interval vs. CAFW). For the sake of space, the results referring to L  MAX are not shown in the tables.  To assess the consistency of the results with respect to the recurrence plot parameters (K  ε and L  MIN ), these parameters were changed over the rectangular grid defined by: K  ε =15%, 20%, 25%, 30%; and L  MIN =100ms, 150ms, and 200ms. For each point in the grid the analysis was repeated, and it was observed that the sign and significance (p<0.05) of group differences was preserved.  Since the majority of patients terminating AF during CA were paroxysmal cases (Table 2), a subgroup analysis for acute outcome was undertaken considering only patients with paroxysmal AF. Group differences (T-AF vs. NT-AF) were no longer significant for all indices.  Postoperative outcome was assessed separately for the paroxysmal and persistent AF groups ( Table 4). For the paroxysmal AF group significant differences in the postoperative outcome (both at 3-month and 6-month) were observed in all RPIs. Again, patients who would be arrhythmia-free at follow-up had higher values for all recurrence indices. A similar difference in median values was also observed for persistent AF patients, however none of the indices reached statistical significance (Table 4).  The f-wave amplitude was lower in the terminated compared to the non-terminated AF group, and in the arrhythmia-free at follow-up (3 and 6 month) compared to the AF relapse groups. However, the difference was not significant for the acute outcome, and was nearly significant for the 3-month (p=0.05) and 6-month (p=0.07) outcome (Table 3). This trend was also observed in the AF subgroup analysis of postoperative outcome, considering paroxysmal and persistent AF separately (Table 4). Since amplitude was not significantly different for either acute or postoperative outcome, it was not considered for further analysis.  For CAFW ( Table 5) median recurrence indices were greater in terminating and NSR groups in accord with the TQ analysis results, however the difference between groups did not reach a significant level for any of the indices.  PD and ER from TQ intervals were significant individual predictors of 6-month outcome ( Table 6). Three-month outcome was also predicted by ER (p<0.05), however, longer term outcome was predicted with stronger significance.  For the paroxysmal AF group, all RPIs were significant individual predictors of postoperative outcome, both at 3- and 6-month follow-up (Table 6). The overlapping confidence intervals, however, suggest similar predictive ability of the RPIs. On the other hand, in the persistent AF group, none of the indices could predict the clinical outcome.  The association between RPIs from TQ intervals and the risk of AF relapse was also assessed. For each RPI, arbitrary thresholds were set at 25th, 50th and 75th percentiles of the index distribution across the entire population (N=62). For each threshold value, the association between the index (categorised as above/below the threshold) and postoperative outcome was quantified ( Table 7). For first (25%) and second (50%) quartile cut-off, patients with any RPI higher than the cut-off value had significantly reduced risk of AF relapse. ER showed the strongest association, with 65% reduction of AF relapse risk (HR=0.35, p<0.001) in patients with ER greater than the 25th percentile.  CAFW indices were unable to predict postoperative outcome, regardless of the length of follow-up (data not shown).   DISCUSSION   RPIs from TQ intervals were significantly higher in patients who remained arrhythmia-free at 6-month follow-up (Table 3), and even more significantly for paroxysmal AF patients (Table 4). Higher RPIs values indicated that preprocedural ECG recordings had greater repetitiveness and increased determinism of atrial activity in these patients compared to those with AF-relapse. This suggests that RPIs are useful in predicting ablation success in the intermediate (6-month) term, in particular for the paroxysmal AF patients (Table 6), and agrees with the general observation that CA is more likely to be successful in patients with more organised AF.  The results from the present study are broadly consistent with those from our previous study [17] on intracardiac recordings in the same patients. However, in that study we found that RPIs of invasive recordings were also able to predict acute (T-AF vs. NT-AF) outcome while in the present study indices from non-invasive recordings could not. As the number of T-AF patients is small (N=12) compared to the overall sample (N=62), the difference between the two studies could be explained by the presence of noisy excerpts either in the intracardiac signals of the previous study or in the surface electrical signals of the present study. However, there is also the possibility that some characteristics of the atrial wavefront dynamics are lost at the surface, as neither TQ nor CAFW analysis were able to identify them, at least at the body sites investigated.  Our results suggest the presence of latent f-wave dynamics that manifest at a later stage after CA. This hypothesis is supported by the increasing predictivity (increasing number of significant predictors and increasing significance of AUC) observed with longer term follow-up (Table 6).  TQ amplitude was not sensitive to the acute outcome, whereas it was weakly sensitive to the 3-month (p=0.05) and the 6-month outcomes (p=0.07, Table 3), showing lower values for the patients who would be arrhythmia-free at follow-up. This result is in contrast with that of Nault and colleagues [7] who found higher f-wave amplitude at baseline to predict AF termination during ablation, and to be associated with a reduced rate of AF relapse. However, as noted in [6], methods based on manual estimation of the f-wave amplitude are inherently associated with inter-observer variability, which could explain the contrasting results. Many patients exhibit significant temporal variability of body surface AF amplitude, therefore its measurement is subject to sample variation. To avoid this bias we adopted an automated approach using the median of TQ intervals whose duration was sufficient to contain at least one full AF cycle at the lowest fibrillatory rate (Eq. 5).  When stratified by AF classification, the analysis of persistent AF patients did not show any significant difference in RPIs with respect to postoperative outcome (Table 4). This was also observed for acute outcome (data not shown).  For all RPIs obtained from TQ intervals, higher values at baseline (preprocedural) were associated with reduced risk of AF relapse (Table 7). It is worth noting that this analysis was based on a priori knowledge of the data. In other words, the threshold for categorising recurrence indices (‘low’, ‘high‘) was not calculated from ROC analysis (optimal threshold), it was calculated from the prior distribution (unconditional upon CA outcome) of the preprocedural data. This approach is less sensitive to the bias generated by ROC-optimal thresholding.  Furthermore, the significant and consistent results, both in orientation and magnitude of risk, for different thresholds (1st and 2nd quartile), suggest this approach is robust with respect to outliers in the data distribution. This offers a potential use in the clinical setting, in which a short (1-minute) preprocedural ECG recording could contribute to identifying patients at higher risk of AF relapse.  Although median values for RPIs from CAFW were higher for successful compared to unsuccessful outcome (Table 5) in accordance with TQ analysis (Tables 3 and 4), the difference between groups in CAFW indices did not reach significant levels in either outcome. This was also the case when the paroxysmal and persistent AF groups were analysed separately (data not shown).  This could be explained either by the presence of sporadic residual ventricular contamination in the f-waveform estimated by PCA [20] and other f-wave estimation techniques, or by the different length in the TQ and CAFW signals (in the former only TQ intervals are analysed, in the latter the whole recording). To test these hypotheses, the CAFW analysis was repeated, confined to intervals of PC3 which corresponded to the TQ intervals (data not shown). The results remained not significant, suggesting that CAFW-derived RPIs are not predictive of either acute or postoperative outcomes.  Our results are in contrast with another study on surface ECG [25], in which a weighted PCA-based method predicted postoperative CA outcome in a sample of 20 persistent-AF patients over a variable (on a patient basis) follow-up period between 4 and 19 months. Although the discordance could at least in part be explained by the different sample size and variable follow-up period in [25], the significant predictivity obtained in the above study suggests that more advanced multi-lead approaches could improve the predictivity of CA clinical outcome.  However, these results support the validity of recurrence plot analysis applied to TQ intervals only, avoiding the need for the laborious QRS-T cancellation.  The present study may be limited because the number of patients studied is relatively small (although comparable to other reported studies) and recruited from a single centre.  An automated ECG segmentation approach may be less accurate than a human expert, especially in the annotation of the T wave end in noisy signals. However, an automated approach is not biased by inter-observer variability.  The differences in the ablation approach to achieve the predefined endpoint could have played a role in the ablation outcome. However, the protocol described in this study is typical of clinical practice with persistent AF patients commonly having left atrial substrate ablation in addition to pulmonary vein isolation at a first procedure.  The successful acute outcome rate was 19.4%. Other studies have achieved higher AF termination rates using different ablation protocols with restoration of SR as the procedural endpoint [1,3]. Therefore further validation of our algorithms on datasets with a higher incidence of AF termination is required, as this might correlate with lower rates of AF relapse in the six month period following ablation.   CONCLUSIONS   Quantitative evidence of recurring patterns of atrial wavefront (f-wave) in TQ intervals of ECG lead V 1 was shown in preprocedural 1-minute recordings. PD and ER were significant individual predictors of 6-month CA outcome.  Higher values of either PR, PD, or ER (based on a priori thresholds calculated from the preoperative distribution of the given index) were associated with decreased risk of AF relapse at 3- and 6- month follow-up. TQ-RPIs, in particular ER, could be used to identify patients more likely to benefit from CA.  None declared.   ACKNOWLEDGEMENTS   This work was funded partly by the National Institute for Health Research Newcastle Biomedical Research Centre based at Newcastle Hospitals Foundation Trust and Newcastle University (PL) and by a British Heart Foundation Clinical Research Fellowship (DR). The authors declare there are no conflicts of interest related to this work.   REFERENCES", "highlights": "Background Non-invasive tools to help identify patients likely to benefit from catheter ablation (CA) of atrial fibrillation (AF) would facilitate personalised treatment planning.  Aim To investigate atrial waveform organisation through recurrence plot indices (RPI) and their ability to predict CA outcome.  Methods One minute 12-lead ECG was recorded before CA from 62 patients with AF (32 paroxysmal AF; 45 men; age 57±10 years). Organisation of atrial waveforms from i) TQ intervals in V 1 and ii) QRST suppressed continuous AF waveforms (CAFW), were quantified using RPI: percentage recurrence (PR), percentage determinism (PD), entropy of recurrence (ER). Ability to predict acute (terminating vs. non-terminating AF), 3-month and 6-month postoperative outcome (AF vs. AF free) were assessed.  Results RPI either by TQ or CAFW analysis did not change significantly with acute outcome. Patients arrhythmia-free at 6-month follow-up had higher organisation in TQ intervals by PD (p<0.05) and ER (p<0.005) and both were significant predictors of 6-month outcome (PD (AUC=0.67, p<0.05) and ER (AUC=0.72, p<0.005)). For paroxysmal AF cases, all RPI predicted 3-month (AUC(ER)=0.78, p<0.05; AUC(PD)=0.79, p<0.05; AUC(PR)=0.80, p<0.01) and 6-month (AUC(ER)=0.81, p<0.005; AUC(PD)=0.75, p<0.05; AUC(PR)=0.71, p<0.05) outcome. CAFW-derived RPIs did not predict acute or postoperative outcomes. Higher values of any RPI from TQ (values greater than 25th percentile of preoperative distribution) were associated with decreased risk of AF relapse at follow-up (hazard ratio ≤0.52, all p<0.05).  Conclusions Recurring patterns from preprocedural 1-minute recordings of ECG TQ intervals were significant predictors of CA 6-month outcome."}