{"id": "S001048251500164X", "article": "MAIN-TITLE Proposition, identification, and experimental evaluation of an inverse dynamic neuromusculoskeletal model for the human finger   HIGHLIGHTS          We propose an inverse dynamic neuromusculosketal model for the middle finger during motion.      The optimization problem for estimating the model unknowns is complex.      We propose a multistep robust estimation procedure to solve this problem.      We test it by simulation and propose an attempt to experimentally evaluate the proposed model.      The proposed model should be useful for rehabilitation applications.          KEYPHRASES   Neuromusculoskeletal model  Biomechanics  Neural activation  Muscle activation  Muscle force  sEMG  Optimization  Inverse estimation  Human middle finger   Physics-based models have proved their efficiency in modeling human motion and its interaction with the environment [1,2]. They have been usefully used in biomechanics, allowing clinical human motion analysis. Similar models are dominant in robotics and computer graphics [3], since they allow plausible animation and simulation of human-like motion. Furthermore, the importance of such dynamic physical models increases in the field of humanoid robotics, which has matured with faster, more accurate, and more mechanically complex robots. Henceforth, research has begun to expand beyond the usual robotics framework towards an examination of life sciences, for the purpose of better imitating natural motion [3]. The computational modeling approach gives us a systematic way to understand the working principles of the motion genesis. It is important to note that the major interest for generative modeling comes from the interactive relationship between modeling and understanding.  Many recent studies present the biomechanical model of the human hand, particularly in motion, with anisotonic and anisometric muscle contractions [4–6]. In fact, some of these recent works propose 3D inverse dynamic models of the human finger, such as the one developed by Sancho-Bru et al. [4] for estimating the muscle forces responsible for free index finger motions. In another recent study, the same mathematical dynamic model is used but for hand motion modeling [3,5–7]. This system is studied in a static condition by considering only the linear mechanical equations. Vigouroux [8] also worked on biomechanical modeling of the human hand; the objective of his model was to deduce the muscle forces from movement using a non-linear equations system. Buchanan et al. [9] proposed a neuromusculoskeletal dynamic modeling for the upper limb. The objective of his forward model was to estimate the muscle forces from neural activations (extracted from surface EMG signals) in order to pilot a virtual arm. Shao et al. [10] presented a musculoskeletal model to estimate muscle forces using the joint׳s kinematic and sEMG data. Paclet et al. [11] focused their research efforts on the study of the biomechanics of the upper limb tendon transfers; however, this work is limited to the deduction of muscle forces as force generators [12].  Identifying forces, activations and deformations in the hand muscles and joints when fingers move is an important theme in biomechanics due to the fact that finger motions representing 54% of all human motor capacities [6]. Estimating these variables has applications in many fields such as medicine, ergonomics, prevention, rehabilitation [13,14] and sports performance evaluation [15]. This functional knowledge can help to prevent the appearance of pathologies by improving the ergonomics of work tools and preventing the risk of injury associated with movements or sports techniques.  However, most of the proposed models focus on mechanistic concepts which do not consider the neural activation patterns and motion intents of the Central Nervous System (CNS). With the need to develop an artificial organ to replace the finger or a surgical rehabilitation in the case of partial impairment, the conception of an inverse dynamic model of the finger neuromusculoskeletal system becomes necessary to understanding the functional behavior of such complex physiological systems.  The main objective of this paper is to propose a dynamic inverse model linking middle finger kinematics to the estimation of muscle forces, muscle activations, and neural activations of six muscles: the three extrinsic muscles (EDP,EDC, and FDS) and three intrinsic muscles (LU, RI, and UI) involved in middle finger motion. For this purpose, a specific nonlinear multistep optimization procedure is applied using a specific energy minimization cost function. After, for illustration purposes, some simulations are launched and an attempt to experimentally evaluate these simulations is realized. Practically, the estimated neural activation curves, estimated using sEMG recording techniques, are compared to those estimated from the proposed model and tuned using motion capture data. Finally, the obtained results and both model and experimental protocol limitations are discussed.   METHODS   The proposed model consists of three sub-models as shown in Fig. 1. It extents a previous model that estimates muscle forces, muscle activations, and neural activations for the middle finger by dividing motion into quasi-static positions [16] to the isokinetic motion case. The first sub-model is the finger biomechanical model. It takes the finger anatomy and its kinematic data as input to estimate, by inverse optimization procedure, the muscle forces that are involved. The second sub-model is the biomechanical muscle model. This model simulates the muscle-tendon complex and links the provided muscle force to the muscle deformation (length modification), the muscle activation (correlated to the number of active Motor Units (MUs) in the muscle), and the muscle velocity contraction. Finally, the third sub-model, namely the neural/muscle activation, allows for the modeling of the relation linking neural intent, estimated from the sEMG data, to the muscle activation. It represents the neural part of the proposed neuromusculoskeletal model. The neural activation, defined by Buchanan et al. [9], describes the intermediate stage, representing a simplified neural intent decoding process from the recorded sEMG signal to muscle activation. In fact, the neural activation is the intent of muscle contraction tuned by the CNS. It can differ from the muscle activation which corresponds to the amount of recruited MUs normalized by the number of all available MUs. This difference is represented by a non-linear relationship function. The sEMG neural activation is the intent of muscle contraction estimated from the sEMG signal, after rectification and filtering, since a non-invasive and direct access to the real neural activation is unrealizable. Ideally, the two curves should be superimposed.  The proposed computational architecture permits one to deduce the neural intent from finger dynamic data as shown in Fig. 1. Evaluation of the proposed model is completed by comparing neural activations, estimated by the model fed by estimated finger kinematic data from motion capture, to neural activations deduced from sEMG recordings from the three extrinsic muscles (EDC, EDP, and FDS) involved in the finger motion, following a specific experimental opening-closing hand protocol.  The proposed study will be presented as follows. In Section 2.1, we present and detail the finger dynamic biomechanical model. Then, the mechanical muscle-tendon model is described in Section 2.2. After, in Section 2.3, we present the estimation procedure for calculating the model unknowns, and some simulated data obtained using the proposed model. Section 2.4 describes a preliminary experimental protocol for evaluating simulation results.  Consider the human middle finger modeled as four rigid segments (phalanx P1, P2, P3 and P4) linked by three joints (DIP, PIP and MCP) [16]. Each joint has one DOF.  The Lagrangian L of the system has the following form:  (1)  L  (   α ¯  ,   α ¯  ̇   )  =  1 2      α ¯  ̇   T  M  (  α ¯  )    α ¯  ̇  − V (  α ¯  )   where  α ¯  ∈   R  3  is the joint angle vector for the system, M (  α ¯  ) is the system inertia matrix and V (  α ¯  ) is the potential energy due to gravity respectively.  The motion equations are given by the following Lagrange׳s equations,  (2)   d  d t     ∂ L   ∂    α ̇    i     −   ∂ L   ∂   α   i     =   T   i    ( i = 1 … 3 )   where   T   i   represent the actuator torque and forces acting on the ith joint.  After developing Eq. (2) and rewriting it in a matrix form we obtained Eq. (3):  (3)  D  (  α ¯  )    α ¯  ¨  + C  (   α ¯  ,   α ¯  ̇   )    α ¯  ̇  + φ  (   α ¯  ,   α ¯  ̇   )  =  τ ¯      D  (  α ¯  )  is the matrix of the system representing kinetic energy. The vector C  (   α ¯  ,   α ¯  ̇   )    α ¯  ̇  represents the Coriolis and centrifugal forces.  τ ¯  is the vector of actuator torques and φ  (   α ¯  ,   α ¯  ̇   )  includes gravity terms and other forces acting at the joints [3]. Eq. (3) is a second-order differential equation of the joint torques applied on the system.  By applying Eq. (3) to the finger system we obtained Eq. (4):  (4)  D  (  α ¯  )   [         α ¨    1            α ¨    2            α ¨    3        ]  + C  (   α ¯  ,   α ¯  ̇   )   [         α ̇    1            α ̇    2            α ̇    3        ]  +  [        φ   1           φ   2           φ   3        ]  =  [        τ   e x t 1           τ   e x t 2           τ   e x t 3        ]  + A  [            F   F D P           F   F D S           F   L I               F   U I           F   R I           F   E D C        ]      D  (  α ¯  )  ∈   R  3  ×   R  3  is a symmetric positive matrix. Its elements are functions of the joint angles (   α   1   ,    α   2    and    α   3   ). Its values are calculated from Eq. (5).  (5)  D  (  α ¯  )  =  ∑  i = 1  3  (    m   i     J   v   c   i     T     J   v c i   +   J     w   i     T     R   i     I   i      R   i   T    J     w   i     )   where   J   v   c   i     ,   J     w   i     are Jacobians that account for translation and rotation respectively. The   R   i   is a 3-by-3 rotation matrix specifying the orientation of the local intrinsic coordinate frame with respect to the global reference frame and   I   i   is the inertia matrix of phalanx P  i .    C  (   α ¯  ,   α ¯  ̇   )    α ¯  ̇  ∈   R  3  ×   R  1  is the vector representing the Coriolis torques/forces and centrifugal forces applied on the system.  (6)  C =  (        C   11         C   12         C   13           C   21         C   22         C   23           C   31         C   32         C   33        )  ,    C   i j   =  ∑     c   i j k     α   k     where   c   i j k   is the coefficient of Christoffel defined as follows:  (7)    c   i j k   =  1 2    [    ∂   d   k j     ∂   α   i     +   ∂   d   k i     ∂   α   j     −   ∂   d   i j     ∂   α   k      ]  i ,  j  and  k = 1  …  3   The vector φ has the following form:  (8)   [        φ   1           φ   2           φ   3        ]  =  [        ∂ V   ∂   α   1             ∂ V   ∂   α   2             ∂ V   ∂   α   3          ]       The potential energy of the system V was calculated from the general form:  (9)  V = −   m   1      g →   T     r →    c 1   +   m   2      g →   T     r →    c 2   +   m   3      g →   T     r →    c 3     where the vector  g →  is the gravity vector,    r →    c 1   ,    r →    c 2   and    r →    c 3   are respectively the position vectors of the phalanx centers P1, P2, and P3.  The final part of Eq. (4) represents the biomechanical model of the finger system which depends on its anatomy and geometry.  (10)    τ   m u c l e s   = A  ( β )  × T  ( F )       (11)  A =  (        n   11      …      n   16        :   …   :        n   31      …      n   36           )    where the matrix AϵR3xR6 represents the finger biomechanical model already shown and detailed in our previous work [16].  In this section, the mechanical model linking muscle force to muscle deformation (length) and muscle activation related to the number of active motor units is described. The model is of a Hill type with no pennation angle hypothesis (the muscle fibers are aligned with the tendons). This last simplification has reduced effects in anisometric context, as in the proposed study [17,18].  The muscle-tendon complex was modeled as a contractile element in series with a passive element and in parallel with another passive element [19]. The total muscle force F  M is the sum of a passive force and an active force. The general form of the equation of the force produced by the muscle-tendon complex is given by Audu [20].  (12)    F  M  =   F   m a x    [  a  ( t )  f  ( ε )    f   c    (  ε ̇  )  +   f   p   ( ε )  ]    where a(t) is the activation at time t, ε =(l−l 0)/l 0 is the muscle deformation, l is the muscle fiber length at time t, l 0 is the optimal fiber length at which maximum muscle force could be obtained, the numerical value of l 0 can be found in [21,22]. The normalized force derived from muscle contraction velocity f(  ε ̇  ), the parallel passive elastic muscle force   f   p   ( ε ) , and the force–length relationship in the contractile element f  ( ε )  are given by Maurel [23].  In this section, we describe the optimization used to estimate the model unknowns. In fact, a new optimization function is proposed for estimating the muscle forces, muscle deformations, muscle activations, and the velocity muscle contraction using Eq. (4) and the muscle mechanical model defined in Section 2.2. The problem to optimize respects the following equations:  (13)  {      M i n  ∑   (   F   i   (   ε   i   ,   a   i   ,    ε ̇    i   ) /   F   m a x   2   +    a   i   2  +   ε   i   /   ε   m a x   2   +    ε ̇    i   /     ε ̇    m a x   2  )        [        a   11      …      a   16        :   …   :        a   31      …      a   36           ]  ×  [            F   F D P        :        F   i   (   ε   i   ,   a   i   ,    ε ̇    i   )          :        F   E D C        ]  +  [        M   e x t 1           M   e x t 2           M   e x t 3        ]  −  D  (  α ¯  )   [         α ¨    1            α ¨    2            α ¨    3        ]  − C  (   α ¯  ,   α ¯  ̇   )   [         α ̇    1            α ̇    2            α ̇    3        ]  −  [        φ   1           φ   2           φ   3        ]  = 0       l b <  [            ε   i           a   i               β   j            ε ̇    i        ]  < u b      }   where   F   i   represents the force value of each muscle finger,   F   m a x   is the corresponding max force value, and the function to be minimized is  ∑  (        F   i    (    ε   i   ,   a   i   ,    ε ̇    i    )      F   m a x      2  +    a   i   2  +       ε   i       ε   m a x      2  +        ε ̇    i        ε ̇    m a x      2   )  . In this optimization cost function, the forces   F   i   are not directly estimated since we put its expression, using the Hill model, in terms of deformation, activation and velocity muscle contraction    F   i   (   ε   i   ,   a   i   ,    ε ̇    i   ) =   F   m a   x   i     [   a   i    ( t )  f  (    ε   i    )    f   c    (  ε ̇  )  +   f   p   (   ε   i   ) ] . In this way, we obtain a system of 3 equations with 22 variables  (   ε   i   ,   a   i   ,   β   j   and    ε ̇    i   ). The form of the optimization cost function involves the identification of each variable based on the principle of energy minimization [16].  At first glance, solving such optimization problems involves several difficulties caused by the large number of variables to estimate and the complexity related to the dynamic equations and dynamic muscle force expression. The choice of the initial values is a very important step to ensure the convergence of the optimization process. To find initial values, we used the same procedure as in the static case [16], i.e. we started with a simplified problem where the biomechanical equations are linear (static problem). After, the solution to this problem is taken as an initial value for a second problem where the equations are taken without simplification (nonlinear and static problem). Finally, the solution of this last problem is taken to initializing the final optimization problem (nonlinear and dynamic problem) as depicted in  Fig. 3.  We simulated the finger motion (finger closing and opening) by normalizing it into 100 positions between the starting position and the final position of the finger motion, where position 0 and 100 correspond to the totally opened hand position and position 50 to the totally closed hand position.  We estimated muscle forces, muscle activations, muscle deformations, and neural activations, for each position corresponding to a specific joint angle triplet (α 1i , α 2i , α 3i ) and specific velocity values (    α ̇    1 i   ,     α ̇    2 i   ,    α ̇    3 i   ) with reduced external moments (no hand load). We considered the hand in closing and opening motion with two velocity values of the finger motion. Since the proposed finger system is in motion, our methodology consists of taking several successive positions of the finger during hand opening and closing.  To evaluate the results of the simulation, we conducted experiments to measure sEMG signals of accessible extrinsic muscles coupled with kinematic data obtained from motion capture. For this purpose, we compared neural activations estimated by simulation with those computed from experiment for the same finger motion (same positions and velocities) using a neural activation/sEMG model which allows for deducing neural activations from sEMG signal as in [16]. For this operation, we used the model presented by Buchanan et al. in 2004 [9], which is represented by the Eq. (14):  (14)  u  ( t )  = α e  (  t − d  )  −   β   1   u  (  t − 1  )  −   β   2   u ( t − 2 )   where d is the electromechanical delay and  α ,   β   1   and   β   2   are the coefficients that define second-order dynamics. These parameters (d, α ,   β   1   , and   β   2   ) map the sEMG values, e(t), to the neural activation values, u(t). In this study, these parameters are fixed according to the study presented by Barrett et al. [24].  To measure the middle finger dynamic data, we put markers on the finger as indicated in  Figs. 4 and 5. We used the motion analysis system (Vicon, Oxford Metrics Ltd., UK), at a frequency of 100Hz, to capture the coordinates of each marker, then calculated the angles of the three finger joints (DIP, PIP and MCP) at each time, and also calculated the corresponding joint velocities and accelerations.  To get the angles, velocities, and angular accelerations from the coordinates of the markers attached to the hand, we sought the coordinates of points A, B, C and D of Fig. 4 by calculating the respective middle of each segment [S11S13] [S21S23] [S31S33] and [S41S44]. The joint angles are the angles (   A   S   12     →   ,   B A   →   ), (   B A   →   ,   C B   →   ) and (   C B   →   ,   D C   →   ). After, we applied the standard Denavit–Hartenberg procedure to find transformations between frames using the coordinate system depicted in Fig. 2. To calculate velocities, we used the sampling frequency of the position data to calculate the instantaneous derivative at each acquired position of the finger system by the relationship Δα/2T where Δα is the angle difference before and after the position in question and the period T=1/frequency.  We made measurements on five persons aged 25±3 years, of height ~180cm, and of weight close to 80±3kg. The proposed protocol is in accordance with the Declaration of Helsinki and accepted by the local ethics committee. None of the volunteers were regular exercise practitioners. They did not present any symptoms of neuromuscular or ligament disorders, and were not using anti-inflammatory medication or muscle relaxants during the experimental sessions. Written informed consent had been given by all subjects prior to the sessions.  Each subject was asked to put his arm as indicated in Fig. 5 and demanded to keep his wrist articulation immobile during hand motion. This wrist immobility was continuously checked during the experiment using motion capture data. To record the sEMG signals of the accessible muscles (FDP, FDS and EDC) at two velocity values, we made measurements at three states (quasi-static, at around 2.5rad/s and around 3.9rad/s). In the first setting, where finger motion is quasi-static, we asked each subject to close his hand successively and keep it fixed for 5s at every position until he reaches total hand closure as depicted in Fig. 6. For each subject, we obtained 9 static positions. After, we recorded sEMG signals and positions for a faster motion where the subject is asked to open and close his hand quickly for a time approximately equal to 2.5s. The last measure was obtained at a higher speed where opening and closing of the hand was performed for approximately 1.5s. The measurements were repeated five times for each subject.  As presented in Fig. 4, the sEMG signals were recorded from the flexor digitorum profundus muscle (FDP) and flexor digitorum superficialis muscle (FDS) and Extensor digitorum communis muscle (EDC), using bipolar electrodes. Those muscles were carefully identified by palpating the skin during appropriate finger motions of the studied subjects.  To measure sEMG signals, bipolar electrodes (Disposable surface electrodes (Al/AgCl) with 10mm diameter) were placed on the skin overlying each muscle with a 2cm inter-electrode distance. Before the electrode application, the skin was cleaned to reducing skin impedance (<10kΩ). The sEMG signals were measured by portable transmitter system (TeleMyo 2400T G2 transmitter, Noraxon) combined with the receptor (TeleMyo 2400R G2 receiver, Noraxon). Signals were band-pass filtered (10–500Hz), digitized (1000samples/s), and saved on the hard disk of a personal computer.  The sEMG signals were then recorded for each subject, normalized and rectified. The averaged values thus obtained were used as inputs for the sEMG/neural activation model depicted in Eq. (14) to calculate the neural activation corresponding curves.   RESULTS     Fig. 7 presents simulated neural activations for the muscles FDP, FDS and EDC at three velocity levels (static, v=2.51rad/s, and v=3.92rad/s) at M  ext =(0.5, 0.5, 0.5)Nm.  The three speed values are derived from the previously described experiment to be able to compare simulation and experiment. The choice of these values should allow us to observe significant speed effects on the observed curves.  Observing the curve shapes (force, muscle and neural activation) of FDP and FDS muscle forces in Fig. 7, we notice that they have maximum values at the full flexion (concentric contractions) and extension (excentric contractions), and minimum values at positions where the hand is relaxing (from position 15 to 35). These results are convincing because the FDP and FDS muscles are those responsible for hand flexion. The obtained EDC muscle curves are ambiguous since the force, muscle, and neural activations have small values at the full flexion position which is in accordance with the physiology, but the obtained values at full extension are not maximal, which is in contradiction to experimental observation as depicted in Fig. 8. As we can see in Fig. 7, the obtained neuronal activation and muscle activation curves are relatively similar. This is due to the linearity between the two functions since the highest possible muscle activation is 0.04 and is inside the linear part (0<A<0.04) of the neural activation/muscle activation relationship function as in [16].  The dynamic effect (curve asymmetry) appears clearly in the second and third colons corresponds to each variables (F, a, ε and u) for the finger velocity v=2.51rad/s and v=3.92rad/s, respectively. In fact, in the second figure, where velocity is equal to 2.51rad/s the values of each variable are higher than the values in the case of static positions, and the same thing is observed when velocity is equal to 3.92rad/s.  By comparing the first figures column (representing the muscle forces, muscle activations, muscle deformations, and neural activations in static conditions) with the results presented in [16], we can observe a clear similarity between the results of the static model developed in [16] and the proposed dynamic model with joint speeds fixed to zero value.   EXPERIMENTAL RESULTS    Fig. 8 depicts the neural activations of the three muscles (FDP, FDS and EDC) calculated from the measured sEMG of those three extrinsic muscles of the hand. Each subfigure corresponds to the neural activation of the three muscles at a specific joint velocity. One clearly sees the influence of the increase of motion speed (closing then opening) on the amplitude of sEMG signals and, consequently, on the amplitudes of neural activations. When motion velocity increases, neuronal activation values decrease as a result of decreasing sEMG amplitude. For example, in Fig. 8b, at an PIP articulation angle of 72°, the neural activation values of the FDP and FDS muscles are 0.216 and 0.312, respectively. At a higher motion velocity, as depicted in Fig. 8c, those values decrease to 0.142 and 0.25, respectively at the same PIP angle. This agrees with the physiological relationship between the muscle force and the motion speed presented in [25]. Thus, with increasing speed motion, a decrease in the level of force and, consequently, a decrease in muscle activity and sEMG signal amplitude is observed. At this angle value, the FDP and FDS neural activations through experimentation (Fig. 8c) are maximal, which allows us to properly compare the neural activation values corresponding to the same finger position at different speed values. In fact, those points are the most relevant and the most resistant to experimental measurement uncertainty for comparison purposes with simulated data.  In the simulation curves in Fig. 7 as in the experimental curves in Fig. 8, we notice that in static hand positions we have symmetry before and after the full closing of the hand for the three studied muscle curves but, when we have a motion speed which is not equal to zero, an asymmetry in the curves (ex: neural activation) appears especially for the EDC muscle in both simulation and experimentation. This should be explained by the influence of the kinetic energy on the forces, muscle activation, and neural activation during hand closing and opening.  Another way to view the experimental measurements is presented in  Figs. 9 and 10. The objective of this representation is to show the shape of the neuronal activation curves with a superimposed DIP joint angle curve over the time at two successive speeds (2.51rad/s for Fig. 9 and 3.93rad/s for Fig. 10). We have chosen to present the variation of this joint angle because it is representative of the finger motion compared to the two other joint angles (PIP and MCP) which fluctuate more over time and especially at the hand closure. It is important to note that, to make a more rigorous comparison, we tried to plot neural activation curves according to angle (or finger position) by making a correspondence between time and angles using linearization procedure. Unfortunately, the obtained results contained oscillations caused by the presence of discontinuities with increasing angles and the vibration of the subject׳s finger during measurements.  Observing Figs. 9 and 10, we notice a decrease in the neural activation values with finger motion speed. For Example, in Fig. 9, the neuronal activation of FDP, FDS and EDC muscles reach respectively the maximum values which are 0.2648 at M point, 0.378 at N point and 0.3219 at P point. While in Fig. 10 we notice that the maximum values achieved for these three muscles are respectively 0.1414 at M׳ point, 0.2517 at N׳ point and 0.3042 at P׳ point.  We also notice a time shift between the maximal angle values and neural activation values, despite the data acquisition synchronization between the motion capture chain and the sEMG recording chain. This could be justified by the electromechanical delay.   DISCUSSIONS   Our choice of modeling the middle finger is based on the fact that this finger has the lowest abduction/adduction motion of all the fingers in the human hand [26], which allows us to simplify the model and present only flexion and extension motion of this finger. In addition, studies have shown that no statistically significant difference exists between the index finger and middle finger forces and that the maximal forces of the index finger and middle finger were greater than those of the ring and little fingers [27]. So we can consider that the force generated by this finger represents the hand force better than the forces of the other fingers.  The proposed model is innovative in several ways. The first is the coupling of biomechanical with neurophysiological modeling, by proposing an inverse neuromusculoskeletal model of the middle finger. The purpose of this coupling was to search the neural activations of the finger muscles active during its movement. The second is a dynamic study of the system, which complexifies the biomechanical equations as well as the muscle force expression that takes into account the muscle deformation velocity. The third point that distinguishes this study from others is the proposition of a new form of the optimization function used to estimate the many unknowns in the model. Using this optimization function has produced a convergence of the optimization problem to stable solutions. In addition, a multi-step optimization procedure was designed and used in this study. A final important point is the conception of a specific experimental protocol that deals with both multi-channel sEMG data and finger kinematic data obtained from efficient motion capture procedure.  The resolution of the mathematical system corresponds to optimizing deformation, activation and velocity muscle contraction of each muscle without finding the values of muscular forces. By minimizing the cost function with respect to lower l b and upper bounds u b of variables. Estimated forces are obtained by using the estimated   ε   i   ,    a   i    and     ε ̇    i   and the Hill model Eq. 12. This new optimization cost function better prevents numerical instability and aberrant estimating parameters compared to classical ones based on the minimization of the quadratic sum of normalized muscle forces [8,25].  In fact, by solving the optimization problem with the classical optimization function forms already present in literature [11–13], we obtained unstable solutions which are highly dependent on the variation of initial values. Using the proposed optimization function form, this instability, for the same problem and under the same conditions, disappeared.  After the resolution by optimization of the proposed complex problem, we studied, both in simulation and experimentation, the effect of changing finger motion velocity on the muscle force, muscle activation, and neural activation. In simulation, we noticed a no significant decrease in muscle force produced by the finger muscles when the motion speed increased. But this decrease is clearly observed on the experimental results. The kinetic effect is observed on both simulated curves and experimental results. This effect is illustrated by an increasing asymmetry in the estimated curves (force, neural activations), during the hand closing and opening states, with the increase of finger speed. According to the obtained results, the proposed model seems to qualitatively mimic the experimental finger behavior especially for the flexor studied muscles.  It is important to note that the proposed experimental evaluation, which is based on the comparison between simulation and experimental results, is qualitative and not quantitative. In the simulation, we modeled human middle finger, and simulated its motion independently from the motion of the hand. However, in the experiment, we could not control a natural motion of the middle finger independently of the motion of the other fingers. For this reason, experimentation was made with a motion of opening and closing of the entire hand. The experimental validation of such finger models still is a critical issue to be correctly managed in further works.  In addition, difficulties were found in the registration of the experimental estimated curves (neural activations), from time to angle position, in properly overlaying model predictions with experimental results. Further efforts should seek to resolve these difficulties for a more appropriate evaluation of the proposed model. For example, a new protocol should include the subject training to respect a constant velocity without vibration and also seek a robust way to represent the correspondence between angular position and neuronal activation.  According to the existing literature and our knowledge, no study yet deals with an inverse (backward) neuromusculoskeletal model for the finger in motion. Some studies deal with a complete limb, e.g. the upper limb, in a direct (forward) manner [9]. Even in static condition, we were the first to propose a neuromusculoskeletal model for the middle finger in quasi-static context [16]. We can consider the proposed model as an extension of this last model for the dynamic case (motion). Of course, we imposed, in a first step, strong hypotheses (constant angular joint velocities) to deal with the difficult obtained optimization problem. In fact, we proposed an original multistep methodology for the optimization problem using a nonlinear cost function that allowed us to converge to stable solutions. In addition, some studies [11–13,29] have modeled the mechanical behavior of the hand during motion but without any linking to the neural command as in the proposed study.   CONCLUSION   The objective of this study was to evaluate, using modeling and optimization, the forces, activations, muscle deformations, muscle deformation velocity and neural activations for muscles responsible for human middle finger motion. The estimation of these variables was obtained with the resolution of the under-determined system by minimizing a cost function representing the energy absorbed by an inverse (backwards) neuromusculoskeletal model during finger motion. This model is the result of a coupling of three sub-models, namely, the biomechanical finger model, the mechanical muscle model, and the muscle activation/neural activation model. A precedent model following the same architecture had been recently proposed for the same objective but in quasi-static conditions [16].  After the estimation of the model variables, we evaluated the proposed global dynamic model by comparing the effect of finger motion velocity variation on force and muscle activation tendencies estimated by the model and activation and forces derived from the measured sEMG signals from the three extrinsic muscles participating in finger motion. For this purpose, an experimental protocol was proposed that combines both multi-channel sEMG recording and motion capture techniques.  The biomechanical modeling of the finger taking the dynamic effect and the coupling of several models increases the complexity to an the obtained mathematical system composed of three equations with 22 unknowns to estimate. The resolution of such a system is done by optimization and searching for a solution minimizing a suited cost function. In all the precedent biomechanical studies in the literature, this cost function is selected from a class of preexistent cost functions. In our study, we have introduced a new form of cost function adapted to our system to improve convergence in the optimization algorithm.  The presented work offers promising perspectives. In fact, improving each sub-model can be a future work completing this study. For the biomechanical model, we can take into account the efforts of the ligaments and tendons in the muscle modeling system to improve reliability. The muscular model used is the nonlinear Hill Type model; it should be replaced by mechanical models with better physiological realism. For the neuromuscular model, we used a simple regression to model the relationship between muscle activation and neural activation estimated from sEMG data, but this model still has limitations. It does not include some important physiological processes such as MU recruitment or the real representativeness of the muscle activation estimated from several sEMG leads using HD-sEMG techniques as in [28]. Only one finger was here studied. In the future, one could also incorporate the modeling of the other fingers, modeling of the wrist articulation, and using patient-specific data. All these improvements may be considered as a global process applied to the entire chain to make the proposed neuromusculoskeletal model as realistic as possible.  However, at the current stage of development, the proposed model will be also helpful in estimating the degree of performance and disorder of the finger neuromusculoskeletal system, allowing for the improvement of surgical or rehabilitation responses to pathology e.g. post-stroke patient. In sports application, result of this model with ligament rupture could predict the corresponding force modifications and test compensation strategies. In ergonomic study, our model could estimate finger dynamics, forces, and muscle efforts necessary to perform repetitive and/or fatiguing gestures [29] and help to design devices (ex: touchscreen as in [30]) that reduce finger injury risk.  None declared.   REFERENCES", "highlights": "Purpose The purpose of this study is to develop an inverse dynamic model of the human middle finger in order to identify the muscle activation, muscle force, and neural activation of the muscles involved during motion. Its originality comes from the coupling of biomechanical and physiological models and the proposition of a dedicated optimization procedure and cost function for identifying the model unknowns.  Methods Three sub-models work in interaction: the first is the biomechanical model, primarily consisting of the dynamic equations of the middle finger system; the second is the muscle model, which helps to identify the muscle force from muscle activation and dynamic deformation for six involved muscles. The third model allows one to link muscle activation to neural intent from the Central Nervous System (CNS). This modeling procedure leads to a complex analytical nonlinear system identified using multi-step energy minimization procedure and a specific cost function.  Results Numerical simulations with different articulation velocities are presented and discussed. Then, experimental evaluation of the proposed model is performed following a protocol combining electromyography and motion capture during a hand opening–closing paradigm. After comparison, several results from the simulation and experiments were found to be in accordance. The difficulty in evaluating such complex dynamic models is also demonstrated.  Conclusions Despite the model simplifications, the obtained preliminary results are promising. Indeed, the proposed model, once correctly validated in future works, should be a relevant tool to simulate and predict deficiencies of the middle finger system for rehabilitation purposes.       α   1   ,   α   2   and   α   3   are the flexion angles of DIP joint, PIP joint; and MCP joint respectively (Fig. 2)  represents the angular velocities  represents the angular accelerations      M   e x t 1   ,   M   e x t 2   and   M   e x t 3   are the external moment applied on the system constituted by the phalanx P4; P4 and P3; and P4, P3 and P2 respectively (Fig. 2).  muscle activation of muscle i.  neural activation of muscle i   muscle deformation of muscle i.  muscle deformation velocity of muscle i.  muscle force of muscle i.  post-processed EMG.  distal interphalangeal joint.  proximal interphalangeal joint.  metacarpophalangeal joint.  flexor digitorum superficialis muscle.  flexor digitorum profundus muscle.  extensor digitorum communis muscle.  lumbricalis muscle.  dorsal interossei muscle located on the radial side of the finger.  dorsal interossei muscle.  force distribution coefficient of muscle i or muscular bound i.  weight of phalanx   p   i"}