{"id": "S001044851500038X", "article": "MAIN-TITLE Resource based process planning for additive manufacturing   HIGHLIGHTS          Resource based process planning model is proposed for Additive manufacturing.      Optimum build direction is determined for free-form object.      Deposition directions are optimized for generated slices.      Proposed methodology minimizes the resource consumption during part fabrication.      Better build time and length are found during implementation.          KEYPHRASES   Additive manufacturing  Process planning and optimization  Build direction  Material deposition direction   Additive Manufacturing (AM) processes are at the core of next generation manufacturing which focuses on accelerating the domestic manufacturing competitiveness and reviving the overall economy. Hailed as the “third industrial revolution”  [1], AM has inverted the ‘Design for Manufacturing’ concept into ‘Manufacture for Design’. The fundamental agility in AM processes comes with the layer based building technique from the digitized model. The digital object model is usually constructed using the CAD modeler or reverse engineering techniques. The validated model needs to be sliced with a set of intersecting parallel planes perpendicular to a predetermined build direction along which the layers are placed one upon another. Thus, the 3D model is discretized into a set of closed 2D slice contours generated from the intersection between the 3D geometric model of the object and the planes. Material is added within these sliced contours by following a specific tool path and the object is built by putting those consecutively.  Considering the desired attributes in the process and the object geometry, the process planning steps can be dramatically simplified in the layer-based manufacturing approach which can vary the resource requirements such as time and travel length. Such attributes include number of layers, shape and their size, single or multiple contour in a slice, support material, functionality, accuracy, and surface quality  [2]. Each of these attributes depends upon the execution of the process steps and is often related with multiple process steps. As a result, the effect of these attributes is carried out between steps towards the finished object. Each of the AM process steps is equally important and can have significant impact on the attributes of the manufactured part. But due to their hierarchical relationship, predecessor process steps have more influence on the finished product than their successors. Fig. 1 shows the hierarchical process planning steps to fabricate an object with additive manufacturing techniques. The hierarchical steps can be distinguished as virtual and physical strategy.  Build direction, which belongs to the virtual strategy, can be defined by the perpendicular vector on the imaginary plane for material deposition. Build direction attracted least attention from the AM research community and more or less considered as a user defined parameter  [3]. When developing the process plan for AM, the build direction is a crucial factor to be considered. The most common assumption about build direction is that it affects the build time and the volume of support structure required during fabrication  [4,5]. Often, build direction is also associated with the number of layers of the part  [6] to control the build time attribute. For the same part, any arbitrarily chosen build direction may result in a relatively larger build height, which would, in turn, definitely increase the number of layers and so the build time. Furthermore, surface quality of the part may also depend upon the build direction  [7,8]. Curved surfaces and the planer surfaces other than those which are either parallel or perpendicular to the selected build direction inherit poor surface quality due to the stepping effect of adding 2.5D layers one upon another in order to approximate the part surfaces  [2,9,10].  Alexander et al.  [7] determined build direction by maximizing the external surface accuracy through minimizing the average weighted cusp height. In bottom up AM technique, which requires support structure, the build direction is often confined with the planar (flat) surfaces of the object  [6,11,12] as base. Xu et al.  [4] proposed the selection of an optimum building direction considering the differences of building inaccuracy, surface finish, and manufacturing time and cost for multiple additive manufacturing processes. An empirical knowledge based expert system tool developed by Frank  [13] uses the expert questionnaire for decision matrix which helps establish the optimum or near optimal build direction.  The fabrication issue such as volumetric error  [8] during deposition is also considered to find out an appropriate build direction. A multi-objective optimization method  [14] is proposed to achieve good surface finish, accuracy and minimum build time. Byun and Lee  [2] and Pham et al.  [11] considered build time, surface quality, and cost of part to determine the optimum build direction from a set of pre-selected orientations. A proposition of a mathematical model to predict the layered process error considering the fabrication orientation is demonstrated by Lin et al.  [15]. In order to improve the productivity, part quality, and economy during part fabrication, optimum orientation of part is determined by minimizing build time, staircase error, and material used  [16] while maintaining the desired shell thickness. Tyagi et al.  [17] modeled the optimal build orientation by considering the staircase effect and required build time. Both surface roughness and built time were used to determine the optimal part orientation for fused deposition modeling (FDM) system  [18], selective laser sintering (SLS) and laminated object manufacturing (LOM) processes  [19]. Thus, most of time build directions are selected to improve factors such as surface finish, build time and volume of support structure required, shrinkage, curling and part cost, but often time build direction is not the sole parameter that affect those factors. However, choice of the build direction can create multiple contours for free form shape object in the same layer which can increase the build time during fabrication.  Once the build direction is defined, the model requires slicing. The 3D model is sliced by a set of parallel and intersecting planes perpendicular to the build direction. Closed 2D contours are generated by connecting the intersection points between the plane and the surface model. Material deposition path or tool-path is generated for individual slice with raster angle and hatch density to fill the internal space. The extruder or laser/light head need to be guided through the pre-defined contours or tool-path in order to create an internal meso-structure. Since each deposited layer is supported by its precedence layer, a 0°–90° raster angle pattern among successive layers is commonly used crisscrossing the meso-structure. However, other pre-determined layout patterns are tested for the structural integrity  [20] and the attributes (i.e. pore size and geometry)  [21] as well. Adaptive layout patterns  [22] have recently been proposed by Khoda et al. to achieve the desired attributes i.e. porosity. Besides, a multi-directional parametric deposition orientation  [23] is also proposed by considering the accessibility and porosity of the internal region. Tool-path generation is the final step of the virtual strategy for affecting the attributes of the manufactured part. Physical strategies need to be deployed for better attributes as 2.5D layers are accumulated/cured and stacked successively to generate the 3D part. Depending upon the AM technique and the process plan, the fabricated part may require post processing i.e. cleaning extra material, heat treatment to diffuse adjacent layer etc.  From the above discussion it is clear that, the build time, volume of support structure, surface quality, dimensional accuracy, number of slices and cost are often used as metrics to optimize both virtual and physical strategies in process planning steps. However, with rapid growth and diversity in the technology, the weightage and effect of these matrices become dynamic and cannot be measured in a same scale. For an example, slicing an object along a predefined build direction creates closed contour called layer. For free form shape object with concave surface, multiple closed contours may be generated for the same layer in a particular build direction. Such phenomenon can be defined as contour plurality. Continuous material deposition gets disrupted for layers with contour plurality and generates start–stop as well as higher non-deposition time within layers. Such deposition disruption requires machine/deposition system having very low response time, and high precision and resolution which in other word mean more resources. Moreover when the concave surface is sliced, the resulting contour may contain consecutive upward (minima) or downward (maxima) segment which can be defined as concavity. Continuous deposition will also be hampered because of start–stop along concavity.  A mathematical model of curve slicing for fiber continuity shows better meso-structure and mechanical characteristics of curved parts  [24]. Khoda et al.  [25] proposed computational model for continuous path planning for complex internal architecture. However, we have not found any attempt so far reported in literature to address the contour plurality as well as concavity issue while determining the build direction as well as tool path in AM process plan. The presence of contour plurality in layers and concavity in the contour may increase build time and the discontinuity in the filament and may lower the structural integrity  [26]. In this work, a systematic process plan frame work is presented for virtual strategies to minimize the resource consumption during part fabrication. We are specifically focusing on build direction and material deposition direction steps and identify the feature characteristics that are tied with them. By incorporating the resource requirements with the generated feature characteristics a sequentially optimized process plan is proposed. The road map of our modeling and optimization methodology is shown as in Fig. 2 .  The rest of the paper is organized as follows: Section  2 describes the effect of build direction on contour plurality, object feature’s shapes, and surface quality. The methodology to determine the optimal material deposition angle by analyzing the layer contour concavity and contour feature’s shapes is presented in Section  3. The proposed methodology is implemented and results are shown in Section  4. Finally, Section  5 wraps ups and highlights the findings of the paper.  Slicing an object with that has concaved surface, for instance, the object shown in Fig. 3 , results in some slices that will contain more than one disjoint closed contour within each layer. In this paper, this phenomenon is termed contour plurality. Contour plurality might also happen for objects with internal hollow features. The number of layers with contour plurality is fully dependent upon the build direction. For the same object, the overall contour plurality can be varied with different build directions as shown in Fig. 3.  If the object shown in Fig. 3 is sliced and then built layer by layer along the i th build direction, several layers will have disjoint closed contours. While depositing material on these particular layers, it is not possible to achieve continuous deposition, thereby causing increased ‘start–stops’. Besides, such disruption in deposition will impair the highly desired surface quality. If the machine is not responsive enough to start and stop depositing material precisely where it is needed, the exact shape of the object has to be sacrificed to some extent, causing volumetric error to increase. Overall, all these effects will increase the build time. Even though a machine might be highly responsive, it is necessary to avoid slice contour plurality to increase deposition continuity and in turn to achieve lower build time. On the other hand, there might be another build direction along which, if the same object is sliced and built layer by layer, there will be no, or a relatively less layers having disjoint closed contours. Thus, properly selected build direction for an object can significantly reduce the overall contour plurality throughout the layers and minimize the adverse effects of contour plurality. Conversely, choosing an arbitrary build direction could result in most of the layers being contour plurality layers. Hence, the build vector along which the total volume of the object’s regions having contour plurality layers is minimum can be considered favorable to resources.  The build height and object features’ sizes and shapes are other criteria which are also directly related to the resource requirement and may be affected by the build direction. Increased build height will increase the number of layers, thereby increasing the build time. The tiny or slender features of an object may result in contour plurality with tiny disjoint layer contours for a build direction. In this paper, we have considered contour plurality, build height, object features’ sizes and shapes, and surface quality while finding out the proper build direction. An optimization algorithm is proposed to determine a build direction favorable to resources considering contour plurality and build height.  To quantify the contour plurality in layers, first we generate a build direction through coordinate system transformation. Then the object volume is discretized considering the contour plurality along the build direction. This analysis is repeated for a number of build directions to quantify their effects on contour plurality as well as build height. In 3D Euclidean space   ℜ   3   , build direction can be represented as a 3D vector     D   i     ⃗   =  [   x   i   ,   y   i   ,   z   i   ]  ∈   ℜ   3   ,  ∀ i = 0 , … , n . To determine a set of build vectors      {   D   i   }    ⃗     i = 1 , … , n   , the global coordinate system is rotated through ψ and φ angles around Z and Y axes, respectively  [22], which can be represented by the following equation.  (1)   [   x   i   ′   ,   y   i   ′   ,   z   i   ′   ]  =  [      x   i       y   i       z   i      ]  ⋅   R   z    ( ψ )  ⋅   R   y    ( φ )  ∈   ℜ   3   ;  ψ =  [ − π / 2 ,  π / 2 ]  ;  φ =  [ 0 , 2 π ]  ;  ∀ i   where   R   z    ( ψ )  and   R   y    ( φ )  denote the rotation around Z and Y axis through ψ and φ angles, respectively.  [   x   i   ′   ,   y   i   ′   ,   z   i   ′   ]  represents the transformed coordinate system, and the unit vector     η   ˆ       z   i   ′     along   Z   i   ′   axis is considered as the corresponding build vector     D   i     ⃗   . Therefor, each build vector     D   ⃗     i   corresponds to an angle pair  ( ψ , φ )  .  At any build direction     D   i     ⃗   , the object is discretized by a set of parallel planes   P   k   i   =    { a   X   i , k   ′   + b   Y   i , k   ′   + c   Z   i , k   ′   = Constant }    k = 1 , … , K   , ∀ i that intersect the object surface. The parametric surface S  (   u   i   ′   ,   v   i   ′   )  ⊂   ℜ   3   of the object can be represented with parameter   u   i   ′   and   v   i   ′   where   u   i   ′   ,   v   i   ′   ∈  [   a   i   ,   b   i   ]  . A set of finite number ( L ) of points    P     i    =    {   p   l   i   =  (   x   l   i   ,   y   l   i   ,   z   l   i   )  }    l = 1 , … , L   ,  ∀ i associated with the corresponding parametric values    q     i    =    {  (   u   i , l   ′   ,   v   i , l   ′   )  }    l = 1 , … , L   ,  ∀ i is sampled on the surface S  (   u   i   ′   ,   v   i   ′   )  . At all these sampled points, the surface’s unit surface normal vectors     N  →    l   i   are determined which can be defined by Eq. (2).  (2)      N  →    l   i   =     S     u   i      (   u   i , l   ′   ,   v   i , l   ′   )  ×   S     v   i      (   u   i , l   ′   ,   v   i , l   ′   )     |   S     u   i      (   u   i , l   ′   ,   v   i , l   ′   )  ×   S     v   i      (   u   i , l   ′   ,   v   i , l   ′   )  |    ,  l = 1 , … , L ;  ∀ i   where   S     u   i      (   u   i , l   ′   ,   v   i , l   ′   )  =   ∂ S  (   u   i , l   ′   ,   v   i , l   ′   )    ∂   u   i , l     and   S     v   i      (   u   i , l   ′   ,   v   i , l   ′   )  =   ∂ S  (   u   i , l   ′   ,   v   i , l   ′   )    ∂   v   i , l     . A point is defined as a critical point  CP  if     N  →    l   i   ⋅     η   ˆ       z   i   ′     = 1 i.e.,   S     u   i      (   u   i , l   ′   ,   v   i , l   ′   )  = 0 , or   S     v   i      (   u   i , l   ′   ,   v   i , l   ′   )  = 0 , which means that the surface’s unit normal vectors at the critical points are parallel to the corresponding build vector. The critical points are, therefore, the extreme points on the surface with respect to the build direction. Let a point set    CP     i    =    { c   p   m   i   }    m = 1 , … , M   ⊂    P     i    contain only the critical points. A sorted critical point set    SCP    i   =    { s c   p   t   i   =  (   x      scp    t     ′   ,   y      scp    t     ′   ,   z      scp    t     ′   )  }    t = 1 , … , T   ⊂    CP     i    is formed through sorting the critical points along the build direction     D   i     ⃗   based on their perpendicular distance from the build plane and then discarding the redundant critical points. A rectilinear 3D bounding box  [22] for the object is constructed along the transformed coordinate system using the vertex point set    V     i    =  { p   t   1   i   , p   t   2   i   , p   t   3   i   , … , p   t   8   i   }  defined by the combination of the minimum and maximum extents of the object’s surface along the transformed   X   ′   ,   Y   ′   , and   Z   ′   axes.  The plane on which the bottom bounding face of the bounding box lies, which is also perpendicular to the build direction     D   i     ⃗   , is considered the base plane or build plane of the object with respect to the coordinate system, as shown in Fig. 4 .  In the i th transformed coordinate system, if a point   p   t   =  (   X   t   ′   ,   Y   t   ′   ,   Z   t   ′   )  lies on the t th cutting plane, a set of T number of cutting planes    CPL     i    =    {    cpl    t   i   }    t = 1 , … , T   is generated through the sorted critical point set    SCP    i   using Eq. (3), which are parallel to the base plane.  (3)   [    cos ψ ⋅ cos φ   sin ψ   − cos ψ ⋅ sin φ    ]  ⋅  [      X   t   ′   −   x      scp    t     ′         Y   t   ′   −   y      scp    t     ′         Z   t   ′   −   z      scp    t     ′      ]  = 0 ;  t = 1 , … , T .   After generating the cutting planes, the object volume between the consecutive planes needs to be evaluated for contour plurality. The object/part is split into  ( T − 1 )  strips with the generated parallel cutting planes forming the strip set    ST    i   =    {    st    r   i   }    r = 1 , … , T − 1   . The total object volume generated between two consecutive parallel cutting planes    cpl    t   i   and    cpl    t + 1   i   is termed as a part strip. If any strip contains more than one part split as shown in Fig. 4, that part strip will comprise the layers with contour plurality along the corresponding build direction. So all the generated stripes are analyzed for contour plurality and a weight is determined for the corresponding build direction. The index i for build direction will be dropped to simplify the notations of some parameters and variables from now on.  The part strips generated by the parallel cutting planes can be classified as mono-split strip (red strips shown in Fig. 5 ) and multi-split strip (middle strip in Fig. 5) depending on the number of split part-volumes generated in the corresponding strip. Assume that r th part strip contains a set    {    sp    f   r   }    f = 1 , … , F   of F number of split part-volumes. If F = 1 , the r th part strip is a mono-split strip and if F > 1 , the r th part strip is a multi-split strip. Multi-split strip may be generated if there is any concavity on the part surface or the part has one or more hollow features inside it. In a multi-split strip, the split part-volumes would yield multiple disjoint closed contours on the same layer. Thus, a build direction needs to be identified along which the total volume of the multi-split strips in regard to the total part volume would be minimum. Similarly, build height which usually changes with build direction directly affects the build time. A larger build height requires longer build time. When determining a desirable build direction taking contour plurality criterion into account, it is also necessary to ensure that the build direction does not lead to a considerably higher build height.  The build direction weight function corresponding to contour plurality for each part strip is, therefore, defined based on the number of split volumes existing in the strip and their volume values with respect to the total volume of the object. By summing up the volume of the split part-volumes, the total volume of each strip is calculated as,  (4)      vol_st    r   i   =  (   ∑   f = 1   F      vol_sp    f   r   )  ×   w   r   ,  ∀ r     where ,    w   r   =  {    1 ,   when F > 1     0 ,   when F = 1 .        Here,    vol_st    r   i   is the volume of r th strip determined for i th build direction,    vol_sp    f   r   is the volume of f th split part-volume of r th multi-split strip. Hence, the contour plurality volume fraction corresponding to i th build direction can be evaluated as,  (5)     VolF    i   =     ∑   r = 1   T − 1      vol_st    r   i      vol_part    ,  ∀ i   where,  vol_part  is the volume of the part and  VolF  is the volume fraction of split part-volumes evaluated for i th build direction. This volume fraction represents the total volume fraction of all the split part-volumes generated in multi-split strips of the object for the corresponding build direction, which is directly proportional to the total volume of the multi-split strips. The minimum possible value of the volume ratio is zero when there would be no multi-split strip i.e., no contour plurality in the layers throughout the whole part along a build direction.  Sometimes the part splits, i.e., split part-volumes, might be considerably tiny or thin which would lead to layers with fabrication complexity. For example, if the object is oriented and built along the build direction     D   ⃗     i   as shown in Fig. 6 , the thin feature of the object would result in thin layer contours which are susceptible to fabrication complexity. For some other build directions, there might be a lower number of layers or even no layers having tiny or thin contours. This fabrication issue is captured by analyzing the shape of the split part-volumes through using the bounding box technique to quantify the shape factor of the split part-volumes associated with the build direction. For each of the split part-volumes in a strip, a bounding box aligned with the build direction is generated and the shape factor is quantified, as discussed in Sections  2.2.1–2.2.3 for a single split part-volume and as shown in Fig. 6. The same procedure is applied for all the split part-volumes. Finally, the four elements are aggregated together to get the shape factor of the object for the corresponding build direction.  Height/Width ( H / W ) factor is used as one of the measures of fabrication complexity. A rectilinear bounding box aligned with the build direction is constructed for each split part-volume, as shown in Fig. 6, to determine each split part-volume’s H / W factor. The height component of the H / W factor is considered as the length of smaller side and the width component is considered as the length of larger side between two contiguous sides of the bounding box’s top or bottom face. For the f th split part-volume, if   L   f , 1   r   and   L   f , 2   r   are the lengths of the two sides of the bounding box’s bottom or top face and   L   f , 3   r   is the length of the bounding box’s other side which is parallel to the build direction, the H / W factor can be determined using Eq. (6)   (6)      H/W_Factor    i   = 1 −     ∑   r = 1   T − 1     ∑   f = 1   F    (     H   f   r       W   f   r     )  ×    vol_sp    f   r      vol_part    ,  ∀ i     where ,    H   f   r   = min  {   L   f , 1   r   ,   L   f , 2   r   }   and    W   f   r   = max  {   L   f , 1   r   ,   L   f , 2   r   }  .    Here   H   f   r   is the height and   W   f   r   is the width of the f th split part-volume in r th strip along i th build direction.  For each split part-volume, the build plane height and width are assumed as the height and width of the corresponding split part-volume, as shown in Fig. 6 and calculated in Section  2.2.1. For f th split part-volume shown in Fig. 6,   H   f   r   and   W   f   r   are the build plane height and width, respectively. To address the fabrication complexity, build plane height and build plane width factors are calculated by using the corresponding height and width and a given threshold value, assuming that fabrication complexity for the part splits will arise because of their tininess or slenderness when the build plane height, build plane width, or both values of the associated part splits are below the threshold value. The build plane height and width factors for i th build direction, which are the volume weighted fraction deviations with respect to the threshold values, can be quantified by Eqs. (7) and (8), respectively.       BPHeight_Factor    i   =     ∑   r = 1   T − 1     ∑   f = 1   F      BPHeightR    f   r   ×    vol_sp    f   r       ∑   r = 1   T − 1     ∑   f = 1   F      vol_sp    f   r     ,  ∀ i    (7)  where ,     BPHeightR    f   r   =  {        H    thr        H   f   r     ,   when   H   f   r   >   H    thr        1 −     H   f   r       H    thr      ,   when   H   f   r   ≤   H    thr    ,      ∀ f , r        BPWidth_Factor    i   =     ∑   r = 1   T − 1     ∑   f = 1   F      BPWidthR    f   r   ×    vol_sp    f   r       ∑   r = 1   T − 1     ∑   f = 1   F      vol_sp    f   r     ,  ∀ i    (8)  where ,     BPWidthR    f   r   =  {        W    thr        W   f   r     ,   when   W   f   r   >   W    thr        1 −     W   f   r       W    thr      ,   when   W   f   r   ≤   W    thr    ,      ∀ f , r .    Here,   H    thr    and   W    thr    are the given threshold values for build plane height and width, respectively, which are specified based on the machine capability and material type and composition.    BPHeightR    f   r   and    BPWidthR    f   r   are the fraction deviations of height and width, respectively, from the threshold values for the f th split part-volume in r th strip.    BPHeight_Factor    i   and    BPWidth_Factor    i   are the overall volume weighted build plane height and width factors, respectively, of the object for i th build direction.  In order to address how the material of a part split is distributed within its bounding box, fill factor takes into account the ratio of each part split’s volume to the volume of their corresponding bounding box. Hence this measure of shape factor captures how much the part splits fill their bounding box. If a part split fills its bounding box to a very low extent, fabrication complexity will again increase for that split. Eq. (9) symbolizes the fill factor.  (9)     Fill_Factor    i   = 1 −     ∑   r = 1   T − 1     ∑   f = 1   F    (      vol_sp    f   r        vol_BBox    f   r     )  ×    vol_sp    f   r      vol_part    ,  ∀ i .   Here,    vol_BBox    f   r   is the volume of the bounding box of f th split part-volume in r th strip aligned with i th build direction.  The four normalized components of shape factor discussed above are aggregated together by summing up their weighted values as denoted by Eq. (10).  (10)  S h a p e   F   i   =  ( H /   W _ F a c t o r   i   ×   w   H W F   )  +  ( B P H e i g h t _ F a c t o   r   i   ×   w   H F   )  +  ( B P W i d t h _ F a c t o   r   i   ×   w   W F   )  +  ( F i l l _ F a c t o   r   i   ×   w   F F   )    where S h a p e   F   i   is the aggregated shape factor of the object for i th build direction and   w   H W F   ,   w   H F   ,   w   W F   , and   w   F F   are the associated weights for the four components of shape factor and their sum is unity. These weights reflect the relative importance of the associated factors and can be user defined. In this paper, the Hypothetical Equivalents and Inequivalents Method (HEIM) [26] is utilized to determine the appropriate values of these weights analytically. In this method, user gives the preferences, both equality and inequality, among the hypothetical alternatives. Here, the hypothetical alternatives are the hypothetical build directions. A set of constraints are formed using the preference which is shown by Eq. (11). Each constraint represents the preference between any two build directions in terms of their corresponding weighted sum of factor values. The weights are the decision variables and the objective is to make the sum of the weights one. Finally, the weights are generated by solving the minimization model.  (11)   Min     [ 1 −   ∑   ρ     w   ρ   ]    2       s.t.       ∑   ρ     F   ρ   υ     w   ρ   −   ∑   ρ     F   ρ   τ     w   ρ   ⩽ − δ ;  υ , τ = 1 , 2 , … , ℓ and υ ≠ τ     0 ⩽   w   ρ   ⩽ 1 ;  ∀ ρ    Here, ρ is the index for factors and   w   ρ   is the weight assigned to ρ th factor.   F   ρ   υ   and   F   ρ   τ   are the values of the ρ th factor obtained for υ th and τ th hypothetical build directions, respectively. The constraints are formulated given that υ th hypothetical build direction is preferred to τ th hypothetical build direction. δ is a small positive number which is used to ensure the inequality between two alternative hypothetical build directions. The optimization problem given by Eq. (11) is solved by using the constrained nonlinear minimization routine provided in MATLAB package.  Surface quality of additively manufactured objects largely depends on the build direction which yields the object orientation during fabrication. The staircase effect between the consecutive layers impairs the surface quality of AM objects. There will be almost no staircase effect for an object oriented along a build direction when the build direction will be parallel or perpendicular to the surface of the object. In order to quantify the surface quality with respect to the build direction, the angles    {   θ   g   i   }    g = 1 , … , G   between the build direction and the facet normals    {     F   g     ⃗   }    g = 1 , … , G   of the triangulated mesh model of the object having total G number of triangular facets are identified, as shown in Fig. 7 . It is assumed that the staircase effect, due to a facet, exists over the whole area of the triangular facet. Therefore, when the facet normals are either parallel (   θ   g   i   = 0 ° ) or perpendicular (   θ   g   i   = 90 ° ) to the build direction, the staircase effect will be minimum giving good surface quality. Staircase effect will be maximum giving poor surface quality when the facet normal is aligned at 45° with the build direction. The surface quality index for each facet, e.g., g th facet shown in Fig. 7, can be determined using Eq. (12).  (12)     SQIndex    g   i   =  {    0 ,  when   θ   g   i   = 0 ° , 90 ° , or 180 °      | tan   θ   g   i   |  ,  when 0 ° <   θ   g   i   ≤ 45 ° , or 135 ° <   θ   g   i   < 180 °       1    | tan   θ   g   i   |    ,  when 45 ° <   θ   g   i   < 90 ° , or 90 ° <   θ   g   i   ≤ 135 °     ,  ∀ g .   The surface quality factor of the whole object for i th build direction is quantified by averaging the facet surface quality indices    {    SQIndex    g   i   }    g = 1 , … , G   with the corresponding facet areas as  (13)     SQF    i   =     ∑   g = 1   G      SQIndex    g   i   × F   A   g       ∑   g = 1   G   F   A   g     ,  ∀ i   where    SQF    i   denotes the surface quality factor of the object determined for i th build direction and F   A   g   is the area of g th facet of the object surface. Build height which usually changes with build direction directly affects the build time. The larger the build height, the longer the build time is. So while determining a good build direction considering the other phenomena discussed above, it is also necessary to ensure that the build direction does not lead to a considerably higher build height. For i th build direction, the build height (  BH  ) of the part is determined as the height of part’s bounding box along that build direction and then normalized to get the build height factor  (  BHF  )  .  The objective function to determine an optimal build direction, which will be the weighted sum of normalized contour plurality volume fraction, shape factor, surface quality factor, and build height, is expressed as  (14)  T o t a l W e i g h t _ B   D   i   =  ( V o l   F   i   ×   w   C P   )  +  ( S h a p e   F   i   ×   w   S F   )  +  ( S Q   F   i   ×   w   S Q   )  +  ( B H   F   i   ×   w   B H   )  ,  ∀ i   where T o t a l W e i g h t _ B   D   i   is the overall weight determined for the build direction     D   i     ⃗   .   w   C P   ,   w   S F   ,   w   S Q   , and   w   B H   are the weights for contour plurality volume fraction, shape factor, surface quality factor, and normalized build height, respectively. The optimal values of these weights are determined using HEIM [26] discussed in Section  2.2.4. Finally, the optimum build direction can be determined solving the following minimization problem.  (15)   Min    { T o t a l W e i g h t _ B   D   i   }    i = 1 , … , n       s.t.         D   i     ⃗   ≔     η   ˆ       z   i   ′         ψ =  [ − π / 2 , π / 2 ]      ϕ =  [ 0 , 2 π ]        w   C P   +   w   S F   +   w   S Q   +   w   B H   = 1    where    { T o t a l W e i g h t _ B   D   i   }    i = 1 , … , n   is a set of objective function values, which can also be termed as a set of overall weights of the build directions. The individual elements of this set can be calculated with Eqs. (4)–(10), (12), and (13). Each build direction     D   ⃗     i   and hence the transformed coordinate system  [   x   i   ′   ,   y   i   ′   ,   z   i   ′   ]  can be constructed by rotating the standard coordinate system around Z and Y axes with angle ψ ∈  [ − π / 2 , π / 2 ]  and ϕ ∈  [ 0 , 2 π ]  , respectively. The following greedy heuristic is applied to determine the optimum build direction using Eq. (15). First, a candidate set of finite number of build directions  {  ( ψ , ϕ )  }  is formed at a uniform interval γ on both ψ and ϕ . From this candidate set, the build directions with the lowest objective function value are chosen. Their neighborhoods are then explored with higher resolution λ , where λ ≪ γ . The transformed Z axis vector corresponding to the angle pair  (   ψ   ∗   ,   ϕ   ∗   )  that yields the minimum objective function value is selected as the optimal build direction.  The object is sliced along the resource favorable build direction (described in Section  2) by a set of intersecting planes parallel to each other. The non-self-intersecting, closed, and planar layer contours which will represent the object are generated by connecting the intersection points between each intersecting plane and the object surface. The distance between the consecutive intersecting planes is kept constant which is the diameter of the filament to be deposited. This uniform slicing results in a set of contours,  C  =    {   C   k   }    k = 1 , 2 … K   for depositing material layer-by-layer. The following analysis has been done for a specific contour. As all the contours are planar closed curves, they only intersect to their start and end points. These contours can be parametrically represented by Eq. (16)   (16)     C   k    (   u   k   )  =  ( x  (   u   k   )  , y  (   u   k   )  )  ,  where k = 1 , 2 , … , K       u   k   ∈  [   a   k   ,   b   k   ]        C   k    (   a   k   )  =   C   k    (   b   k   )     where,   C   k    (   u   k   )  represents the parametric equation for k th contour with respect to the parameter   u   k   ranging between  [   a   k   ,   b   k   ]  . The presence of contour plurality in the object will result a set of contour on the same layer and that can be represented as  L  =    {   L   y   }    y = 1 , 2 … Y   and    L     y    =  {   C   k   }  where k > 1 , L stands for a set of layers.  Concavity is the property of curving a graph of the function upward or downward. In 3D free-form shaped object, the layer contour may contain curving upward (minima) and downward (maxima). In between of two adjacent minima or maxima on a layer contour curve, there will be a maxima or minima, respectively as shown in Fig. 8 . During material deposition across these adjacent maxima or minima, the print head has to stop, pass through air and then start material deposition again as shown in Fig. 8(a). The deposition direction across the adjacent minima or maxima, therefore, introduces deposition discontinuity in layers as well as two cut-off parts.  Because of deposition discontinuity, the print head frequently starts and stops during deposition as shown in Fig. 8(a), and causes over-deposition. This costs resources such as time and material for over deposition as well as is not good for the surface integrity and dimensional accuracy of the finished part  [3]. Therefore, a suitable material deposition direction for each layer needs to be determined in order to minimize the resource requirements for the concave layer contours.  To analyze each layer contour, a 2D rectilinear bounding box of each 2D layer contour is constructed as shown in Fig. 8. To get a set of deposition directions the coordinate system is rotated around Z axis through β angle where β ∈  [ 0 , π ]  . Each time the transformed   X   β   ′   axis vector is considered as the deposition direction. In a transformed coordinate system, a set of tangent vectors,  T  =    {   t   j   }    j = 0 , 1 … N   is considered on the layer contour on an N number of equidistant points and the transformed   X   β   ′   axis vector is regarded as the base vector (   B  →  ). The points on the contour curve at which the first derivatives of the curve (tangent vectors) with respect to   X   β   ′   axis are zero, are the stationary or extreme points of the curve.  The set of extreme points can be represented as  E  =    {   e   n   }    n = 0 …   N   ′     . If more than two extreme points exist on a contour, there will be discontinuity for a number of deposition directions and the print head will pass through the air as shown in the Fig. 8(a). The straight lines passing through the extreme points (  E  ) and parallel to   X   β   ′   (the base vector) are defined as cutting lines which constitutes the cutting line set  CL  =    {   l   c   }    c = 0 … m   . Usually the number of cutting lines (   N   ′   ) is equal to the number of extreme points except when a cutting line passes through more than one extreme point. But this is generally an unusual case. The area of the contour curve between two adjacent cutting lines (   l   c   ,   l   c + 1   ) is denoted as a strip. The generated strips are classified as continued and discontinued strips. The strips    S     T    =    {   S   t   }    t = 0 …  ( n − 1 )    which contain the stop–start event or discontinuity or the cut off contour parts are considered as discontinued strip as shown in Fig. 9 . The continued strip containing no stop–start event or cut off part is more expected in layer manufacturing.  For the set of cut-off parts  P  =    {   p   x   }    x = 0 . . X   of a contour curve obtained for a deposition direction, the total area of the cut-off parts and discontinuous area factor can be calculated by Eq. (17).  (17)     DAF    k   =     ∑   x = o   X     C   x        Area    k     ,  ∀ k   where   C   x   is the area of x th cut-off part,    Area    k   is the total area, and    DAF    k   is the discontinuous area factor of the k th contour. The more value of discontinued area factor, the more resources will be consumed.  Once the contour contains cutoff parts, each part is analyzed for fabrication complexity. Shape of the contour plays a significant role to determine fabrication complexity. For example, contour with tiny feature or segment is difficult to produce. Even though, build direction methodology minimizes such slender feature generation, many times it would be difficult to eliminate it completely. Thus, some layer contour may still end up with tiny features after slicing and proper deposition direction may minimize their adverse effect. To quantify the layer-wise fabrication complexity for tiny features, the shape factor for each cut off part consisting of aspect ratio and fill factor of that cut-off part are calculated and finally, the overall contour shape factor is determined for a deposition direction.  An aspect ratio of a geometric shape normally reflects the ratio between its sizes in different dimensions. If each cut-off part of a layer contour is inscribed by a rectilinear 2D bounding box, the ratio of larger dimension to shorter dimension of this bounding box is considered as aspect ratio of this part as shown in Fig. 10 and the area weighted aspect ratio for the entire layer contour can be determined by Eq. (18).   (18)     AR    k   = 1 −     ∑   x = 1   X      AR    x   ×   C   x        Area    k      ∀ x     where ,     AR    x   =  {        H   b b   x       W   b b   x     ,   when   W   b b   x   >   H   b b   x           W   b b   x       H   b b   x     ,   when   H   b b   x   >   W   b b   x       ,  ∀ x .    Here,    AR    x   is aspect ratio of x th cut off part,    AR    k   is the total aspect ratio for k th contour, and   W   b b   x   and   H   b b   x   are the width and height of the bounding box, respectively, of x th cut off part.  Often time the aspect ratio may not reflect the actual shape of the cut off part as shown in the Fig. 10(b). Another factor namely contour fill factor is incorporated to have the better sense of shape. The ratio between the total area of cut off parts and area of its bounding box is considered as contour fill factor in this paper. The fill factor for a contour can be determined as  (19)     CFF    k   = 1 −     ∑   x = 1   X       C   x   2        BBArea    x          Area    k     ,  ∀ k .   Here,    BBArea    x   is the area of the bounding box of x th cut-off part, and    CFF    k   is the fill factor for k th contour. The less value of contour fill factor reflects ease of deposition of on the corresponding contour. Finally, the total contour shape factor is considered as the weighted sum of aspect ratio and contour fill factor and represented by Eq. (20).  (20)     CSF    k   =  (    AR    k   ×   w    AR    )  +  (    CFF    k   ×   w    CFF    )  ,  ∀ k   where,    CSF    k   is the contour shape factor for k th contour,   w    AR    is the weight for aspect ratio,   w    CFF    is the weight for area factor. The optimal values of these weights are determined using the same HEIM method  [27] discussed in Section  2.2.4.  To quantify the deposition direction, Eq. (1) in Section  2.1 is used for one axis rotation and rotates the coordinate system by β angle around the z -axis. One sample example of two deposition directions along with corresponding area of cut-off parts is shown in the Fig. 11 .  The resultant weight for a deposition direction is determined as the weighted sum of the discontinuous area factor and the contour shape factor–  (21)     weight_DD    k   β   =  (    DAF    k   ×   w    DAF    )  +  (    CSF    k   ×   w    CSF    )  ,  ∀ k   where,    weight_DD    k   β   is the resultant weight of β deposition angle for k th contour,   w    DAF    is the weight for discontinuous area factor,   w    CSF    is the weight for contour shape factor. The HEIM technique  [27] discussed in Section  2.2.4 is also used here to determine the optimal values of these weights. The model of finding optimal material deposition direction can be represented by Eq. (22)   (22)   Min  {    weight_DD    k   β   }      s.t.     β =  [ 0 , π ]        β   y   ≠  (   β   y − 1   ± ϕ )  ,  ∀ y       w    DAF    +   w    CSF    = 1 .    The optimal material deposition direction i.e., tool path orientation angle can be determined by solving the optimization problem presented by Eq. (22) using the same method explained in Section  2.4. While determining the optimal tool path orientation angles for consecutive layers, a tabooed range of angle defined by ± ϕ must be constrained for the consecutive layers to ensure the structural continuity and integrity of layers. Hence, the material deposition angle depends on the angle of the supporting layer. If the deposition angle of   L   y   th layer is   β   ∗   , the acceptable deposition angle of   L   y + 1   th layer cannot be   β   ∗   ± ϕ .  After getting the optimal build direction and deposition direction, the total build time is measured to validate the proposed methodology. In order to determine the total fabrication/build time of an object, it can be classified into two components: deposition time and air/non-deposition time  [28] as shown in Eq. (23). The total air time will be the summation of air time for contour plurality and contour concavity. During the calculation of deposition time, if the deposition length is greater than a threshold value,   T   h   for any segment then three stages of motion are considered namely acceleration stage, constant speed stage and deceleration stage  [29]. If the filament size is smaller than the threshold   T   h   , only acceleration stage and deceleration stage are considered.  (23)     BuildTime     ( ψ , φ )    =   ∑   y = 1   Y    (    LBT    y   β   + L A   T   y   β   )  .   Here,    BuildTime     ( ψ , φ )    is the total build time of an object oriented along  ( ψ , φ )  build direction,    LBT    y   β   and L A   T   y   β   are the build and air time of y th layer for β deposition angle.   IMPLEMENTATION   The proposed methodology is implemented on two example objects as shown in Figs. 12 and 18 with a Core i7 @ 3.4 GHz CPU with 4 GB RAM using Visual Basic scripting language. Total time needed to implement the methodology on the example 1 and example 2 is approximately 15 and 9 s per iteration respectively. However, required time can be reduced significantly by parallel processing or increasing the computational power.  Example 1 contains both contour plurality and layer contour concavity, is used to demonstrate the proposed methodology which is shown in Fig. 12(a). The object has a volume of 56130 cubic mm with a number of 16806 triangular facets. Following resolution γ = 10 ° and λ = 1 ° is used for Eq. (15) and weight values:   w    CP    = 0.5 ,   w    BH    = 0.2 ,   w    SF    = 0.1 ,   w    SQ    = 0.2 ,   w    HWF    = 0.15 ,   w    HF    = 0.38 ,   w    WF    = 0.28 ,   w    FF    = 0.19 during implementation. The optimum build direction generated from our algorithm is   ψ   ∗   = 11 ° ,   φ   ∗   = 304 ° as shown in Fig. 12(b). The objective function values for different build directions are mapped in 3D space and represented in Fig. 13 .   Table 1 summarizes the results for the optimal build angle pair and some other arbitrary build angle pairs. The result shows the independent nature of each factor as their values vary based on the build direction. The methodology discussed in Section  2 yields the minimum objective function value at (11°, 304°).  After getting the optimal build direction, the object is oriented and then sliced along that direction using uniform slice thickness given in Table 2 . The resulting layer contours are analyzed individually and consecutively following the methodology discussed in Section  3 in order to determine their optimal filament deposition direction. Thus, layer wise deposition directions for the entire 3D object are generated to address the resource consumption. During the implementation the resolution for Eq. (22) is used as β = 5 ° ; ϕ = 45 ° and the weights used are   w    AR    = 0.5 ,   w    CFF    = 0.5 ,   w    DAF    = 0.7 ,    w    CSF    = 0.3 . Five layer contours are taken at different arbitrary height locations along   ψ   ∗   = 11 ° ,   φ   ∗   = 304 ° as shown in Fig. 14 and the fabrication time is measured using Eq. (23). The fabrication parameters considered to measure the time is shown in Table 2 which are adopted from Catalyst®  Ex Version 4.1 from Stratasys.  To analyze the result further, contour cut-off parts (discontinuous area), deposition travel lengths of tool, non-deposition travel lengths of tool, and total layer deposition times are measured for the whole object which is shown in Table 3 . All of these measured matrices show minimum values for the optimum directions as shown in Table 3. Two arbitrarily selected layers  ( y + a )  th and  ( y + c )  th are analyzed and the result are shown in Figs. 15–17   .  A second example shown in Fig. 18 (a), is used to demonstrate the proposed methodology. This example 2 object has a volume of 15166 cubic mm with a number of 3372 triangular facets. The following weight values are used to apply the methodology   w    CP    = 0.40 ,   w    BH    = 0.21 ,   w    SF    = 0.19 ,   w    SQ    = 0.19 . The optimum build direction is generated from the algorithm is   ψ   ∗   = 0 ° ,   φ   ∗   = 356 ° as shown in Fig. 18(b).  The optimum build vector (   ψ   ∗   = 0 ° ,    φ   ∗   = 356 ° ) yields the minimum objective function value. If the part is built along this direction, there would be only 0.1% contour plurality volume of the total volume of the object. Compared to an arbitrary direction (−20°, 80°), contour plurality, build height, and fabrication complexity (shape factor) are decreased by 91.2%, 30%, and 65%, respectively. The total build time for the optimal build direction,   ψ   ∗   = 0 ° ,   φ   ∗   = 356 ° is also reduced by 7.8% compared to an arbitrarily selected build direction ( ψ = − 20 ° , φ = 80 ° ). The objective function values for this example at different build directions are mapped in 3D space and represented in Fig. 19 . The objective function value shown in the 3D map follows a pattern along one axis due to the axisymmetric attributes.  To analyze the result further, non-deposition time for five arbitrarily selected layers at different build directions and at different height locations are analyzed and the result are shown in Fig. 20 . Because of the nature of these arbitrary slices, non-deposition time remain low along 60°–120° angle range. However such time can increase significantly along some directions which is depicted in Fig. 20. The proposed methodology is also compared with two existing methodologies found in literature and shown in Table 4 . The proposed methodology provides optimum deposition direction which has smaller objective function value and requires lower build time. Example 1 has higher shape complexity than the second example and shows significant improvement in the matrices.   CONCLUSION   An AM process planning approach emphasizing on the build direction and deposition direction has been developed in this paper which allows the minimum usage of resources. The outlined methodology proposes an optimal build direction considering the lower contour plurality, build height, fabrication complexity, and better surface quality. The optimal build direction minimizes the total build time by reducing the contour plurality as well as improves the surface quality by reducing the stair-case effect. The effect of the optimal build direction is also carried in to the part fabrication with the material deposition direction. Both fabrication discontinuity and complexity is quantified in the objective function to measure the resource requirement. The two stage optimization methodology reduces the overall resource consumption during the value added part building processes. Build direction as well as material deposition direction considered in this paper may also have different relationship for additively manufactured heterogeneous parts, which could be the future direction of this research.   REFERENCES", "highlights": "Resource consumption in additive manufacturing (AM) is often tied with the physical attribute of the fabricated part. Thus, optimizing the processes plan for minimum part fabrication resource requirement is a matter of great interest. In this work, the hierarchical nature of the AM process plan steps are emphasized and both build direction and material deposition direction are optimized while considering the resource requirement. A novel combined two-step optimization methodology is presented to determine optimal build direction for the object and material deposition direction for layers while considering minimum contour plurality, surface quality, build height, fabrication factor, and layer contour concavity to compensate the fabrication and resource limitations. The proposed methodology is implemented for an example object and the results indicate that the total build time can be significantly reduced compared to the total build time associated with arbitrary build and deposition directions."}