{"id": "S001044851500158X", "article": "MAIN-TITLE Arc–surface intersection method to calculate cutter–workpiece engagements for generic cutter in five-axis milling   HIGHLIGHTS          Arc–surface intersection method to obtain cutter–workpiece engagements is proposed.      Feasible contact arc is extracted to calculate the engagement boundaries.      Analytical solution can be obtained for flat workpiece by using this method.      This method is compatible well with the force model without loss of precision.          KEYPHRASES   Cutter–workpiece engagements  Grazing points  Feasible contact arc  Swept volume  Generic cutter  Five-axis machining   Five-axis milling has been widely used in the production of complex parts found in aerospace, automotive, die-mold and biomedical industries  [1–5]. The machining process is usually costly and time-consuming especially for high accuracy required parts. Hence, the main focus of five-axis machining is to reduce cycle times while ensuring manufacturing precision. Generally, optimal cutting parameters are selected by the industry through simulating the physics of the cutting process, i.e. cutting force and chatter stability. As for the machining process simulation and optimization, one of the most important steps is to extract the cutter–workpiece engagements (CWEs) which are the portions of the cutter participating in machining at a given instant of time.  Due to the complex geometry of the workpiece and the varying tool motions, the accurate and efficient way to calculate CWEs of five-axis milling has been very limited. Some researchers tried to extract the CWEs in analytical ways. Gupta et al.  [6] presented an analytical method to determine the CWE functions with the half-spaces in the following cases: circular cut and linear half-space. Budak et al.  [7] proposed the bounding point coordinate method to calculate the depth of cut, lead, and tilt angles, which determine the CWE boundaries in five-axis milling. Kiswanto et al.  [8] calculated the CWEs during the semi-finish milling process by finding the lower engagement point and the upper engagement point. However, these methods are only applicable for milling of flat workpiece surfaces. Since the workpiece in five-axis milling usually consists of complex shapes, the usage of the analytical approaches is limited.  For the calculation of CWEs in five-axis milling, the most common approaches can be classified into two major categories: discrete modeling methods and solid modeling methods. Discrete modeling approaches can further be categorized into two groups: vector based methods and polygon based methods. Vector modeling divides the workpiece into finite units with regular interval methods well known as Z-map  [9], Z-buffer  [10,11], Dexel  [12] and Octree  [13]. The commonly used Z-map method represents the workpiece as a series of evenly distributed parallel vectors. The length of these vectors is reduced while the cutter moves through the workpiece which is similar to cutting blades of grass  [14]. Based on this method, several studies have been conducted to verify the correctness of tool paths and support the physical simulation for both three-axis and five-axis milling. Baek et al.  [15,16] used the Z-map method to perform tool path verification through calculating the intersection points between vectors and the tool swept surface in three-axis milling. Zhu et al.  [17], Fussell et al.  [10] and Zhang  [18] model the CWE geometry to predict cutting force for five-axis sculptured surface milling using vector based method. Polygon based methods have also received some attention  [19,20]. Aras et al.  [19] presented a methodology that maps a polyhedral representation of the removal volume from a Euclidean space into a parametric space to find CWEs for three-axis milling. Yao et al.  [20] developed a hybrid approach that utilizes an exact model of a cutter to intersect with a tessellated model of a workpiece. Though computationally efficient and mathematically tractable, these techniques suffer from the contradiction between the dispersed precision of workpiece decomposition and the computational efficiency. In other words, the high accuracy computation of CWEs requires the high discrete resolution of the workpiece which comes with the expense of large store memory and computational requirements.  Solid modeling offers a high level of accuracy for NC simulation. It is now widely used in CAD and CAM areas with the developing computer technology. The commonly used solid modeling representation schemes are constructive solid geometry (CSG) and boundary representation (B-Rep). Spence et al.  [21,22] identified CWEs using a CSG based process simulation system to predict cutting force. Recently, Lazoglu et al.  [23,24] proposed a novel B-Rep based method to determine the complex CWEs in supporting five-axis milling of free-form surfaces. Aras et al.  [25] obtained the closed boundaries of the CWEs by performing surface/surface intersections between in-process workpiece and feasible contact surfaces (FCS). Although solid modeling methods have been recognized as the most accurate approach to extract CWE geometry, it is far from being widely used in practical application due to its low computational efficiency and poor robustness. For instance, the computational complexity of the CSG approach is O  (   N   4   )  , where N denotes the number of tool movements  [26]. What is worse, as the data structure size grows quickly during simulation, topological errors due to numerical inaccuracy will be stacked  [27]. To overcome such problems, Ferry et al.  [28] proposed a semi-discrete solid modeling technique called parallel slicing method (PSM) for five-axis flank milling where the removal volume is sliced into a number of parallel planes along a common axis. Yang et al.  [27] developed a solid trimming method which reduces the abundant surface/surface intersection operations compared with the traditional Boolean operations. However, the improvements of these approaches in computational efficiency and robustness are limited.  In this paper, we present a new arc–surface intersection method (ASIM) to extract CWEs in five-axis milling process. First, the cutter rotary surface is sliced into a family of section circles by a set of planes perpendicular to the tool axis. Then, based on the envelope condition, the grazing points of the family of section circles are analytically computed. By connecting the two grazing points on each circle, a feasible contact arc (FCA) which locates at the front along the feed direction is obtained. Engagement arcs are extracted accurately and efficiently by intersecting the FCA with workpiece surfaces and determining whether the endpoint of the FCA is inside the workpiece volume based on distance fields. Finally, entry/exit angles of CWEs at each axis height are obtained to plot the CWE map which can be directly used for cutting force prediction. As the boundary of CWEs at each axis height is accurately determined by the arc/surface intersection rather than the abundant Boolean operation, this method well solves the problems of poor computational efficiency and robustness in solid modeling methods and low computational accuracy in discrete methods. Comparisons between our methodology and those commonly used in the literature are presented in Table 1 .  The remainder of this paper is organized as follows: Generation of the feasible contact arcs is described in Section  2, followed by the five-axis CWE extraction methodology in Section  3. Implementations are given in Section  4, and conclusion is summarized in Section  5.  For the convenience of study, the commonly used cutting force model in five-axis milling always divides the cutter into a set of axial cutting elements  [17,21,29], as illustrated in Fig. 1 . To judge whether or not the cutting element is in cut at any angular position, CWE regions should be first extracted and then mapped onto a parametric space defined by the entry/exit angles versus the depth of cut. To avoid the time consuming surface/surface intersection operation in the solid modeling method, in this paper, the cutter rotary surface is discretized into a family of section circles which are generated by slicing the cutter with planes perpendicular to the tool axis, as shown in Fig. 2 . Then, the section circle is further used as the primitive to extract the CWEs.  In five-axis milling, the grazing curve is the set of points on the cutter surface that remain on the envelope surface. As shown in Fig. 3 , it divides the cutter’s surface into two parts. The one in orange facing the cutting direction is defined as the front-facing part, which can be actually involved in machining. The other one in light gray is defined as the back-facing part, which is impossible to engage with the in-process workpiece.  For the section circle on the cutter surface, it is splitted into two partial arcs by the grazing points. The solid one shown in Fig. 3 is named as the feasible contact arc (FCA) since it locates at the tool front-facing part. Given that the CWEs are the subsets of the tool front-facing part rather than the back-facing part, determination of the FCA helps us to obtain CWEs in a more efficient way.  As illustrated in Fig. 4 , the tool motion is usually represented by two guiding curves  P   ( t )  and  Q   ( t )  [30]. To describe the instantaneous cutter position and orientation during NC machining, the moving tool coordinate frame    o    t   −   x   t     y   t     z   t   is set up at  P   ( t )  . Its axes are determined as follows  (1)      x    t   =      y    t   ×  A   ( t )     ‖    y    t   ×  A   ( t )  ‖           y    t   =    A   ( t )  ×    P    ′    ( t )     ‖  A   ( t )  ×    P    ′    ( t )  ‖           z    t   =  A   ( t )  ,    where  A   ( t )  represents the tool axis orientation at time t with  A   ( t )  =    Q   ( t )  −  P   ( t )     ‖  Q   ( t )  −  P   ( t )  ‖    .  When the cutter moves with respect to time t , the point on the cutter surface can be expressed as   (2)   p   ( θ , z , t )  =  o   ( z , t )  + r  ( z )   ω   ( θ )  ,   ( θ , z )  ∈  [ 0 , 2 π )  ×  [ 0 , H ]  ,     with  o   ( z , t )  =  P   ( t )  + z  A   ( t )  ,   ω   ( θ )  = sin θ    x    t   + cos θ    y    t   .       According to Ref.  [31], we have the expression of the intersection point between the normal vector of point  p  and tool axis  (3)   q   ( z , t )  =  P   ( t )  + l  ( z )   A   ( t )  ,  with l  ( z )  = r  ( z )    r   ′    ( z )  + z .   Then, the unit normal vector at the point  p  is  (4)     n    p    ( θ , z , t )  =    q   ( z , t )  −  p   ( θ , z , t )     ‖  q   ( z , t )  −  p   ( θ , z , t )  ‖    .   The moving speed of the point  q  on the tool axis is determined by the equation  (5)     v    q    ( z , t )  =    P    ′    ( t )  + l  ( z )     A    ′    ( t )  .   According to the envelope condition for the surface of revolution proposed by Gong et al.  [31], the grazing point should meet the following equation  (6)     v    q    ( z , t )  ⋅    n    p    ( θ , z , t )  = 0 .   By substituting Eqs. (4) and (5) into Eq. (6), we have  (7)  A sin θ + B cos θ = C ,           A = − r  ( z )   (  (    P    ′    ( t )  + l  ( z )     A    ′    ( t )  )  ⋅    x    t   )      with   B = − r  ( z )   (  (    P    ′    ( t )  + l  ( z )     A    ′    ( t )  )  ⋅    y    t   )       C = − r  ( z )    r   ′    ( z )     P    ′    ( t )  ⋅  A   ( t )  .      Eq. (7) can be written in the following form  (8)      A   2   +   B   2     sin  ( θ + β )  = C ,  with β =  atan  2  ( B , A )  .   If  | C /     A   2   +   B   2     |  ≤ 1 , θ can be resolved from Eq. (8) as follows:  (9)   {      θ   1   =   sin   − 1    (   C       A   2   +   B   2       )  − β       θ   2   = π −   sin   − 1    (   C       A   2   +   B   2       )  − β .       Substituting   θ   1   ,   θ   2   and a given height z back into Eq. (2), we can get closed-form solutions of two grazing points on the corresponding section circle.  Based on the fact that the FCA locates at the front along the moving direction, each point  p  on the FCA should satisfy the following condition:  (10)     v    q    ( z , t )  ⋅    n    p    ( θ , z , t )  ≤ 0 .   Substituting Eqs. (4) and (5) into Eq. (10) yields  (11)  A sin θ + B cos θ ≤ C .   If C ≥     A   2   +   B   2     , θ always satisfies Eq. (10), i.e. FCA is the whole section circle. If C < −     A   2   +   B   2     , Eq. (10) has no feasible solution, i.e. the corresponding section circle is impossible to engage with the in-process workpiece. If  | C /     A   2   +   B   2     |  ≤ 1 , according to Eqs. (2) and (9), the FCA of the cutter at any given axis height   z   0   and time   t   0   , shown in Fig. 5 , can be expressed as  (12)   F   ( θ ,   z   0   ,   t   0   )  =  o   (   z   0   ,   t   0   )  + r  (   z   0   )   ω   ( θ )  ,    θ   1   ≤ θ ≤   θ   2   ,   where   θ   1   and   θ   2   are determined by Eq. (9).  As shown in Fig. 6 , the arcs in red denote the engagement arcs, whose end points can be obtained by intersecting the FCA with workpiece surfaces and determining the inclusion relation between the grazing points and the workpiece volume. To draw the CWE map, the entry/exit angles with respect to each engagement arc should be extracted. Note that there may be more than one engagement arc on each FCA, i.e. there may exist more than one pair of entry/exit angles at each axis height. For the convenience of study, a vector   V    angles    is built to store the entry/exit angles of engagement arcs, which is then used to create the CWE map. Usually, the conventional methods  [10,23,24] to extract CWEs in five-axis milling need to update the workpiece at every CL, which costs quite high memory and computational time. In this paper, as the FCA is used as the primitive to extract engagement arcs, there is no need to update workpiece during the material removal process unless the cutter moves to the next tool path, which saves a lot of computational memory and time. Detailed descriptions of the key steps are as follows.  To extract CWEs, we first intersect the FCA with workpiece surfaces to obtain the part of boundary points of engagement arcs. As the workpiece is usually comprised of polygons, quadric surfaces and freeform surfaces, this section focuses on the intersection problem of arcs with these three types of surface. It is worth noting that the intersection of the arc with polygon or quadric surface can be analytically computed.  In geometry, a polygon is a plane bounded by a finite sequence of line segments. The plane can be defined as:  (13)   (  X  −    P    0   )  ⋅  n  = 0 ,   where    P    0   is an arbitrary point on the plane,  n  is a normal vector of the plane.  Substituting Eq. (12) into Eq. (13) yields  (14)   (  F   ( θ )  −    P    0   )  ⋅  n  = 0 ,    θ   1   ≤ θ ≤   θ   2   .   Similar to the solving method of Eq. (6), we can analytically obtain at most two intersection points. An even–odd rule algorithm is adopted to determine whether the intersection point is within the boundaries of the polygon  [32]. If any intersection point lies inside the polygon, add the corresponding circumferential angle θ into   V    angles    .  The general implicit form for a quadric surface can be compactly represented as  (15)     X    T    AX  +    B    T    X  + c = 0 ,   where  A  is a 3×3 nonzero symmetric matrix,  B  is a 3×1 vector, and c is a scalar.  Substituting Eq. (12) into Eq. (15) yields  (16)   F     ( θ )    T    AF   ( θ )  +    B    T    F   ( θ )  + c = 0 ,    θ   1   ≤ θ ≤   θ   2   .   Set t = cos θ ∈  [ − 1 , 1 ]  , Eq. (16) can be transformed to a quartic equation with respect to t , which can be analytically solved  [33]. There are at most four solutions of θ , which are then added into   V    angles    .  Freeform surface is widely used in CAD and other computer graphics software to describe the skin of a 3D geometric element. It is commonly described by the non-uniform rational B-spline (NURBS) mathematics which offers great flexibility and precision for handling both analytic and modeled shapes. A NURBS surface is formulated as a bivariate vector-valued piecewise rational function of the form  (17)   S   ( u , v )  =     ∑   i = 0   n     ∑   j = 0   m     B   i , p   n    ( u )    B   j , q   m    ( v )    ω   i j      P    i j       ∑   i = 0   n     ∑   j = 0   m     B   i , p   n    ( u )    B   j , q   m    ( v )    ω   i j      0 ≤ u , v ≤ 1 ,   where  {    P    i j   }  denote a bidirectional control set,  {   ω   i j   }  are the weights,  {   B   i , p   n    ( u )  }  and  {   B   j , q   m    ( u )  }  are the non-rational B-spline basis functions.  Then, the intersection of the arc with a NURBS surface can be computed by simultaneously solving Eqs. (12) and (17) using Newton iteration  [32]. To improve the computational efficiency, a hierarchy of axis-aligned bounding boxes (AABB) is used which allows for quick rejection and thus can help avoid many expensive intersection computations  [34]. If any intersection point is obtained, add the corresponding circumferential angle θ into   V    angles    .  Though the intersection points between the FCA and the workpiece surfaces separate the FCA into multiple parts, it is still difficult to determine which part of the FCA engages with the workpiece. As illustrated in Fig. 7 , cases (a) and (b) have the identical intersection points but different engagement arcs. The only difference between the FCAs in cases (a) and (b) is the position relation of their endpoints relative to the workpiece volume. The endpoints   g   1   and   g   2   locate outside the workpiece in case (a) while inside in case (b). Hence, to extract the engagement arcs, it is necessary to determine the inclusion relation between the endpoints of the FCA and the workpiece volume.  For an arbitrary endpoint  g  , a signed Euclidean distance field  [35]    d     W   k      (  g  )  , which defines the minimum distance from  g  to the boundary of workpiece   W   k   , is calculated to determine whether  g  lies inside   W   k   . It can be represented as follows  (18)    d     W   k      (  g  )  =  {      inf   ∀ q ∈ ∂   W   k        ‖  g  −  q  ‖    2   ,    g  ∈   W   k       −   inf   ∀ q ∈ ∂   W   k        ‖  g  −  q  ‖    2   ,    g  ∉   W   k   ,       where    ‖ ⋯ ‖    2   is the Euclidean norm, ∂   W   k   denotes the boundary of   W   k   . To improve the computational efficiency, an octree bounding volume hierarchy is used to obtain spatial localization of geometric operations  [36]. If the endpoint  g  lies inside the workpiece   W   k   , add the corresponding circumferential angle θ into   V    angles    .  The CWE map gives the entry and exit immersion angle pairs of the cutting edges with the workpiece as a function of distance from the tool tip. As all the position angles of endpoints of the engagement arcs at each axis height have been obtained, the next step is to extract all the pairs of the entry/exit angles. From Fig. 6, it is noted that the entry/exit angles occur in pairs in ascending order. Since the vector   V    angles    obtained above is not in order, firstly, we sort it from small to large. Then the entry/exit angles can be obtained by taking elements out of   V    angles    sequentially in pairs. Plotting these angles corresponding to each axis height in the two-dimensional space and connecting these angles using linear interpolation, the CWE map is generated as shown in Fig. 8 .  Although the CWE map is obtained discretely along the tool axis, the boundary of CWEs at each discrete location can be accurately determined using the ASIM method. Hence, when the user-specified resolution of axial dispersion is set as the same with that of the cutting force model, the entry/exit angles used to judge whether the cutting edge is engaged with the workpiece can be calculated without loss of precision.  In order to extract the CWEs at every CL, the conventional methods need to successively subtract the cutter swept volume (SV) from the in-process workpiece geometry, which is another heavy computational burden. Fortunately, the proposed method can directly obtain the CWEs without the subtraction operation in one tool path because of the use of the FCA. While for the next tool path, in order to let the FCA intersect with the actual workpiece surface rather than the one has already been removed, the workpiece needs to be updated at the ending of the current tool path.  The SV is defined as the totality of all points that belong to the trace of a cutter entity moving along an arbitrary path. It can be modeled as the volume generated by an envelope surface, an initial cutter portion and a final cutter portion along the cutter configurations  [37]. It should be pointed out that the tool path has been properly pre-segmented by using the methods in Refs.  [38,39] for checking and avoiding the self-intersection of each resulting SV.  According to Eq. (9), note that θ is a function of the parameters z and t . Then, by substituting Eq. (9) into Eq. (2), the parametric expression of the envelope surface is obtained as follows:  (19)   X   ( z , t )  =  p   ( θ  ( z , t )  , z , t )  =  o   ( z , t )  + r  ( z )   ω   ( θ  ( z , t )  )  .   By stitching the envelope surface with the ingress surface at starting CL and the egress surface at ending CL, the SV is formed as follows:  (20)    E    SV    =   E   −    ( z , t )  ∪   E   0    ( z , t )  ∪   E   +    ( z , t )  ,   where   E   −    ( z , t )  denotes the ingress surface with    v    q   ⋅    n    p   < 0 ;   E   0    ( z , t )  denotes the envelope surface with    v    q   ⋅    n    p   = 0 ;   E   +    ( z , t )  denotes the egress surface with    v    q   ⋅    n    p   > 0 .  After the current tool path ends, the workpiece needs to be updated for the CWE calculation of the next tool path. The updated workpiece,   W   k + 1   , is obtained through performing Boolean subtraction of the SV from the workpiece   W   k   , as shown in Fig. 9 .  The whole algorithm of extracting CWE maps in five-axis milling is summarized as follows.           IMPLEMENTATION   In order to demonstrate the validity of the ASIM, two example cases are introduced and tested here. The first example shows a finishing machining in five-axis milling of a staircase workpiece with a conical cutter. The second one is a roughing machining of an integral impeller which is one of the most complex milling process. For comparison, the resolution of axial dispersion for all cases is set to 0.1 mm. The tests are performed using C++ programming and the commercial 3D module ACIS (the Spatial Company) on a PC with a 3.0 GHz AMD Athlon (TM) X4 640 processor and 6.0 GB RAM.  To verify the effectiveness of the ASIM, a test system has been assembled using an OptiPath application programming interface (API) of the commercial NC simulation software Vericut®  which is designed to enable an interface between Vericut and customized plug-in tool path optimization programs. Vericut uses a discrete workpiece model (Z-buffer) to obtain the in-process geometry of the workpiece. The CWE map is extracted as a raster bitmap by intersecting the rays cast from a grid of points on the plane perpendicular to the feed direction with the cutter surface and the workpiece volume, as shown in Fig. 10 . Moreover, the output raster bitmap needs to be further processed into the CWE map that can be used in the force prediction model. The CWE calculation method of the test system is the same as that in the Manufacturing Automation Laboratory’ Virtual Machining Interface (MAL-VMI). Since Ref.  [28] validates its proposed parallel slicing method by comparing with the MAL-VMI, it is reasonable to choose this Vericut based system as a good benchmark. For the following case tests, the grid resolution is set to 0.1 mm.    Example 1 A staircase workpiece corresponding to a designed part, as shown in Fig. 11 (a), is chosen to be tested. The workpiece model which results from three axis rough milling only comprises of flat faces. We generate the finishing tool paths with a conical cutter of bottom diameter D = 10   mm  , half taper angle γ = 3 ° and height H = 30   mm  by using the commercial software Siemens-NX8.5®. For the first tool path which comprises of 54 CLs, the CWE map calculated by the ASIM at CL#7 is compared with that obtained from the Vericut based system, as shown in Fig. 11(b). The computing time of both methods versus number of CL is illustrated in Fig. 12 . The computation time of the proposed method for all CLs is about 21.86 s, while the Vericut based system takes only about 7.45 s. However, it is worth mentioning that our method generates more smooth and accurate boundary of CWEs.    Example 2 A rough machining for five-axis milling of an integral impeller is used as a case study shown in Fig. 13 . The tool used for roughing is a taper ball-end mill of ball radius R = 2.5   mm  , half taper angle γ = 3 ° and height H = 20   mm  . For the first tool path, CWE maps calculated by the ASIM at CL#27 and CL#453 are compared with these obtained from the Vericut based system, as shown in Fig. 14 (a). Before implementation of the second tool path, the workpiece is updated through subtraction Boolean operation of the initial workpiece and the swept volume of the first tool path. Then, comparisons have been made at CL#190 and CL#556, as depicted in Fig. 14(b). Fig. 15 illustrates the computing time of both methods versus number of CL. For the first rough tool path, it can be seen that the computational efficiency of both methods is equivalent. However, for the second rough tool path, the Vericut based system takes about 5 min to calculate all of the CWE maps, while the ASIM takes as much as 29 min. The decrease in efficiency is caused by the increased intersections between the FCA and the updated workpiece, the boundary surfaces of which is freeform surfaces.  In the comparison of the computational accuracy, Figs. 11 and 14 show that the proposed ASIM captures the boundaries of CWEs more accurately. The main calculating errors of the Vericut based method are caused by the projecting process illustrated in Fig. 10. First, the serrated boundaries on the borders of CWE maps result from the digitization effect when projecting the Z-buffer engagement grid into cylindrical coordinates. Second, the engagement angles out of the range of  [ 0 , π ]  ​cannot be captured since this method assumes the feed direction staying fixed along the tool axis during five-axis milling. But in fact, the feed varies along the axis of the cutter when the cutter undergoes a five-axis motion which consists of both translation and rotation motions. Since the above errors may lead to misjudgment on whether the cutting edge is in cut, the process mechanics and dynamics cannot be accurately simulated.  To predict the cutting forces in five-axis milling, the cutter is generally divided into a set of axial cutting elements. To judge whether or not the cutting element is in cut at any angular position, the entry/exit angles should be calculated firstly. As the boundary of CWEs at each discrete location along the tool axis can be accurately determined using the proposed method, these entry/exit angles with respect to each cutting element can be calculated without loss of precision when the user-specified resolution of axial dispersion is set as the same with that of the cutting force model. As a result, the proposed ASIM is well fit for the force model. Nevertheless, the Vericut based method as well as other discrete modeling methods need some mapping transformations to extract the CWE map because their discrete representations of the process model are inconsistent with that of the cutting force model.  As for the comparison of the computational efficiency, Figs. 11 and 15 show that the computing time of the proposed ASIM is at most 6 times than that of the Vericut based system. It can also be found from Fig. 15 that the ASIM will gain a much better computational efficiency for the workpiece merely comprising of flat and quadric surfaces. A further reduction in computing time could be realized by optimization of C++ programs and implementation of parallel processing of the intersection computation with each FCA. Although the ASIM is less efficient than the Vericut based method, it performs much better than the parallel slicing method proposed in Ref.  [28], whose computing time is 19 times than that of the Vericut based system.  In conclusion, the proposed method over performs the Vericut based method in terms of the computational accuracy and the compatibility with the cutting force model.   CONCLUSION   In this work, a new arc–surface intersection method (ASIM) to extract CWE maps for supporting five-axis cutting force prediction is presented. First, the cutter rotary surface is discretized into a family of cross-sectional circles along the tool axis. Then, the feasible contact arc (FCA), which is the forward part of the circle at each axis height, is analytically determined. By intersecting the FCA with workpiece surfaces and determining the inclusion relation between the endpoint of the FCA and the workpiece volume, the boundaries of engagement arcs are obtained. Finally, entry/exit angles of CWEs at each axis height are extracted to plot a CWE map. To demonstrate the validity of the proposed method, comparisons have been made with a Vericut based system by implementing several case tests. Several distinct features of the present approach are summarized as follows.  (1) As the FCA is analytically obtained as the primitive to accurately extract engagement arcs at each tool axis height, the CWE maps can be extracted only using arc/surface intersections rather than the abundant Boolean operations. Hence, this method well solves the problems of low efficiency and poor robustness in solid modeling methods and low precision in discrete methods.  With the use of the FCA, the proposed method can directly obtain the CWEs without updating workpiece volume at every CL in one tool path which is, however, the inevitable step in the conventional methods. It should be noted that this saves a lot of computational time and memory usage.  For five-axis milling of the workpiece merely comprising of flat and quadric surfaces, usually existing in rough milling process and semi-finishing process, the CWE maps can be analytically obtained with the proposed method.  The ASIM gives the user a degree of flexibility by setting the resolution of axial dispersion to achieve the required computational efficiency or accuracy.  As the boundary of CWEs at each discrete location can be accurately determined using this method, these entry/exit angles with respect to each cutting element can be calculated without loss of precision when the user-specified resolution of axial dispersion is set as the same with that of the cutting force model, which means this method is compatible well with the force model.  In order to integrate this method into a virtual machining system for five-axis milling of arbitrary workpieces, additional work should be done to speed up the computational time by optimizing the C++ program and further implementing the parallel processing of the intersection computation with each FCA.   ACKNOWLEDGMENTS   This work was partially supported by the National Natural Science Foundation of China under Grant No. 51325502, and the Science & Technology Commission of Shanghai Municipality under Grant Nos. 13JC1408400 and 14111104802.   REFERENCES", "highlights": "Calculating cutter–workpiece engagements (CWEs) is essential to the physical simulation of milling process that starts with the prediction of cutting forces. As for five-axis milling of free form surfaces, the calculation of CWEs remains a challenge due to the complicated and varying engagement geometries that occur between the cutter and the in-process workpiece. In this paper, a new arc–surface intersection method (ASIM) is proposed to obtain CWEs for generic cutter in five-axis milling. The cutter rotary surface is first represented by the family of section circles which are generated by slicing the cutter with planes perpendicular to the tool axis. Based on the envelope condition, two grazing points on each section circle are analytically derived, which divide the circle into two arcs. The feasible contact arc (FCA) is then extracted to intersect with workpiece surfaces. Using arc/surface intersection and distance fields based approach, the boundary of the closed CWEs is accurately and efficiently calculated. Compared with the solid modeler based method and the discrete method, the ASIM has higher computational efficiency and accuracy. Moreover, an analytical solution for calculating CWEs can be obtained with this method in five-axis milling of the workpiece merely comprising of flat and quadric surfaces. Finally, two case tests are implemented to confirm the validity of the ASIM and comparisons have been made with a Vericut based system which utilizes the Z-buffer method. The results indicate that the ASIM is computationally efficient, accurate and robust."}