{"id": "S001048251400153X", "article": "MAIN-TITLE Ventricular fibrillation mechanisms and cardiac restitutions: An investigation by simulation study on whole-heart model   HIGHLIGHTS          Effects of restitutions on ventricular fibrillation (VF) were examined in silico.      Action potential duration restitution (APDR) heterogeneity causes mother-rotor VF.      The effect of conduction velocity restitution on VF depends on the APDR      Conversion of two types of VF was successfully simulated.          KEYPHRASES   Ventricular fibrillation  Action potential duration restitution  Conduction velocity restitution  Computer simulation  Whole-heart model   Sudden cardiac death (SCD) is a major clinical and public health problem in many countries. SCD claims over 300,000 lives annually in the United States alone [1]. Ventricular fibrillation (VF) is notorious as one of the most common causes of SCD [2], but knowledge about VF׳s underlying mechanisms remains incomplete [3]. It is generally considered that there are two major but contradictory hypotheses on the mechanisms of VF [3–4]: the multiple-wavelet [5] and mother-rotor [6] hypotheses. In addition, the mechanism(s) responsible for the degeneration from reentrant ventricular tachycardia (VT) to VF, conventionally believed to be due to a different mechanism, is not fully understood, either [7].  Weiss et al. [8] in 1999 hypothesized that both the action potential duration (APD) restitution and the conduction velocity (CV) restitution characteristics may be related to the wavelength oscillation that led to wave break, a phenomenon that may convert VT to VF. Clinical studies have either demonstrated [9] or implied [10] that the APD restitution (APDR) is also tightly related to the risk of VF induction. Based on Weiss et al.׳s hypothesis, Wu et al. [11] further postulated that both APDR and CV restitution (CVR) were important in VF maintenance, and tested this supposition in experiments using rabbit hearts infused with methoxyverapamil (D600). They found that there were two distinct types of VF during the perfusion of D600 with increasing concentrations: starting from Type 1 VF, then to VT, and finally to Type 2 VF. The Type 1 VF is associated with a steep APDR and a flat CVR, comparable with multiple-wavelet VF. The VT was associated with a flat APDR and a flat CVR. The Type 2 VF was associated with a flat APDR and a steep CVR with a broader CV span, comparable with a mother-rotor VF. Each restitution configuration was associated with a perfusion of D600 at a given concentration. Wu et al. also simulated the transitions from Type 1 VF to VT, to Type 2 VF in a three-dimensional cardiac tissue slab [12].  Since the shape of the real heart is not a slab, the hypothesis tested by simulations in a cardiac tissue slab [12], that the space-time dependent APDR and CVR can significantly influence VF organization and conversion, needs further validation using whole-heart model with a realistic heart shape, because anatomical features can significantly influence wave instability [13]. If both APDR and CVR are indeed important determinants of VF behavior, the manifestations of VF induced in models with some APDR and CVR could reflect these restitution properties. Moreover, the multiple-wavelet VF and the mother-rotor VF and VT would be simulated in models with the corresponding restitution configurations. Furthermore, the transitions from multiple-wavelet VF to VT, to mother-rotor VF from restitution alterations could also be simulated.  Several studies based on whole-heart models investigated the relationship between cardiac restitutions and VF organization. Xie et al. [13] investigated the influence of the APDR slope on VF patterns in a canine ventricular model (by varying the parameter that controls the Ca2+ current amplitude, G si), but didn׳t investigate the effect of the CVR on VF. ten Tusscher et al. [14] tested several factors, including excitability and APDR that determine the number of rotors during VF. Nevertheless, the effects of these factors were only studied individually without investigating the combined action of APDR and CVR in influencing the VF organization. Keldermann et al. [15] have successfully reproduced both multiple-wavelet and mother-rotor VF in a detailed human ventricular model. However, they only investigated the effects of APDR heterogeneity and VF-induction sites on the VF dynamics. To the best of our knowledge, few simulation studies based on a human whole-heart model have been implemented so far to verify the deduction that multiple-wavelet VF, VT, and mother-rotor VF are probably just the different appearances of corresponding APDR and CVR properties, and their mutual conversions are due to changes in restitution. The purpose of this study was to check the role of APDR and CVR in exploring the mechanism of VF [8].   METHOD   We used a “rule-based” model, the Wei–Harumi whole-heart model that contains a detailed description of cellular electrophysiology and cardiac anatomy [16–17] in this study. Its effectiveness is proved by many recognized publications based on this model [18–19]. We enhanced this model׳s spatial resolution to a finer level 0.5mm×0.5mm×0.5mm. Unlike the models reviewed in the previous session, our model included the His–Purkinje system, which is considered to play an important role in the initiation and maintenance of VF [20–21]. Details and features of this model are provided in the Appendix.  We used the APDR and CVR curves in previous publications as an “input” into the Wei–Harumi model. During the simulations, the model cells are assigned time-varying APD and CV according to their APDR, CVR, locations in the model, and the diastolic intervals (DI). The validation of these restitution settings was carefully performed by simulating cardiac processes consistent with clinical reports [22]. The APDR and CVR inputted are described below.  The APDR curves were derived by fitting the clinical discrete data published by Selvaraj et al. [9] to a mono-exponential function [23], as shown below in Eq. (1):  (1)    APD = APD   s s   − A  exp ( − D I / B )   where   APD   s s   is the steady-state APD, A and B are the fitting parameters, and DI is the preceding diastolic interval defined as the amount of time spent recovering prior to an applied stimulus.  Selvaraj et al. defined two data sets recorded from two patients designated as “High-Risk” and “Low-Risk” [9], with each set containing APDR at the apex, middle, and base of the right ventricular (RV) endocardium. Hereinafter, the APDR fitted from the High-Risk and Low-Risk patient data sets will be referred to as “steep” or “shallow” APDR, respectively (see Fig. 1; only the APDR curves at the apex are shown, whose maximum slopes are 1.85 and 0.55, respectively). During the simulation, the effective refractory period (ERP) was part of the APD as introduced in the ERP part of the Appendix, and a ventricular model cell could not be excited by its neighboring model cells if it was in its ERP.  The CVR curves were also depicted using a mono-exponential function similar to Eq. (1). The sources for the CVR were data from the results of ten Tusscher et al. [24] obtained from simulations using a strain of human myocyte model. There were three curves provided in Ref. [24], and two of them were adopted in this study: the standard I Na and the LR I Na CVR curves (obtained from simulations using models with standard and Luo–Rudy (LR) fast I Na dynamics [24], respectively). Both curves were left-shifted by about 56ms in the abscissa so that the minimum DI value in the later simulations was aligned with the minimum DI value of the steep APDR curve (–33ms). In addition, the LR I Na restitution curve was scaled up by a factor of 30% to make its steady-state value become 90cm/s. The transformed LR INa or standard I Na CVR data (resembling a steep CVR with a broader span or a flat CVR in Ref. [11]) represent physiologically normal excitability or decreased excitability of the cells. Hereinafter, these two CVR will be referred to as “normal” and “decreased” CVR, respectively. During the simulation, the CVR determines the myocyte longitudinal CV dynamically, and the value of CV of an excited cell determined the extent that it could influence (See the “The Propagation Strategy” part in the Appendix). The two solid lines in Fig. 1 show both transformed CVR curves used in the simulation. Note that these two curves are comparable to the CVR acquired from clinical trials [25].    Table 1 lists the cardiac restitution settings of six different models used in our simulations. It is known that there are different types of electrophysiological heterogeneities in human ventricles, such as the apicobasal gradient, the transmural gradient, and the left–right ventricular heterogeneity [23,25]. These heterogeneities have been proven to play an important role in developing ventricular tachyarrhythmia [15]. The settings of the apicobasal gradient and the transmural gradient have been discussed in the Appendix, and the left–right ventricular heterogeneity was modeled in a simplified manner by assigning different sets of APDR to the LV and RV (Models 5 and 6 in Table 1, respectively), according to clinical findings that the mean slope of the APDR of the LV can be significantly steeper [25] or shallower [23] than that of the RV. For simplicity, the electrophysiological properties of other cells were unchanged [16], and other pathological heterogeneities (e.g. necrosis and fibrosis) were omitted. The VF was induced by successive extra-stimuli applied to the left lateral epicardium.  Furthermore, to model the effect of the admission of D600 in increasing concentrations as reported by Wu et al. [11], Model 2 was duplicated (referred to as the “first stage” in Fig. 5), and its APDR was shallow for a period of ten seconds after removal of any ectopy (referred to as the “second stage” in Fig. 5), and then eight seconds later the CVR was changed to the decreased CVR (modeling a reduced excitability, referred to as the “third stage” in Fig. 5). Hereinafter, this model will be referred to as a “time-variant model”, while the other models will be referred to as “time-invariant models”.  The fast Fourier transform (FFT) of a VF episode from the twelfth second to the end of the simulation in the time-invariant models was calculated to assess the overall spectrum. The frequency of interest (FOI) was set to 1–9Hz (a trade-off of 3–9Hz in Ref. [26] and 1.5–8Hz in Ref. [27]), the dominant frequency (DF) was defined as the frequency with the highest peak in the power spectrum [26,28–29], the median frequency (MF) was defined as the frequency that cut the spectrum into two regions with equal total power, and the spectral width (SpW) was defined as the band centered at the MF that covered 67% of the power in the FOI [28]. The upper right-hand image in Fig. 3 shows the locations of the DF, MF (black dotted line), and SpW (the span between the two red lines). These three parameters could describe the metrics of the VF dynamics well [28].  A time–frequency analysis was performed to check the temporal frequency variation during VF in the time-variant model. A short-time FFT was performed with a Gaussian window of 1024 points (3.072s) shifting stepwise (Δt=192ms) throughout the VF episode [30]. The DF, MF, and SpW values defined above were also determined for each short-time spectrum obtained, and hereinafter are designated as ST-DF, ST-MF, and ST-SpW, respectively. The time–frequency distribution figure was then constructed by plotting the three parameters on the ordinate vs. time on the abscissa.  An autocorrelation function for individual VF episodes was generated to evaluate its periodicity, and the r-value of the first peak after zero (FPAZ, dimensionless) was used for quantitative comparison [31]. All the objects of our analyses were ECG Lead II traces.   RESULTS   Panel A in Fig. 2 shows the VF organization reproduced using a model with a steep APDR (Model 2). After observing the continuous snapshots of the three-dimension wave-front display, we may intuitively recognize the activation turbulence. The densely scattered dark-blue pixels in the activation map indicate a high incidence of wave breaks where an abrupt dispersion of refractoriness [30] occurred. Furthermore, a chaotic spatiotemporal pattern is highlighted by the random ECG trace in Fig. 2.  In the contrast, the tachyarrhythmia in the model with a shallow APDR (Model 4) showed a significantly higher degree of regularity and periodicity, and is technically regarded as a pleomorphic VT. The snapshots of the wave fronts in Panel B show an example of the VT. The wave fronts originated from the lateral endo-LV near the base, and gradually expanded into the vicinity of, and later swept over, the entire cardiac volume. This organized activity might be also manifested by the uniformly distributed activation time. The ECG trace cycle length was stable, around 260ms, each spike was almost identical, and their amplitude was much larger than that of the ECG in Panel A.  Under a steep APDR environment, the VF ECG of models with different CVR were almost the same at first glimpse, but the temporal regularity of the VF in models with decreased CVR (Model 1) was lower than that of the VF in models with normal CVR (Model 2), as evidenced by a comparison between their spectra and the autocorrelations. The spectrum of Model 1 contained multiple frequency peaks over the entire FOI domain, resulting in a broad value of SpW=4.25Hz, and a notable deviation of the dominant frequency (2.50Hz) from the median frequency (4.63Hz). The VF ECG of Model 2 was more organized in the way that the DF value coincided with the MF value (both were 5.38Hz), and the value of the SpW decreased markedly (2.13Hz) on comparing it with the value of SpW for Model 1.  However, under a shallow APDR environment, the influence of CVR on VF organization was opposite to that of the steep APDR situation. The VF induced in Model 3 (with decreased excitability) showed a slightly more compact spectrum than the VF in Model 4, indicating an increased degree of regularity ( Fig. 3 Spectrum column, Models 3 and 4).  The autocorrelation plot shown in Fig. 3 summarizes the degree of periodicity of the VF induced in models with different restitution properties, whose FPAZ values were 0.12, 0.42, 0.95, and 0.80 for Models 1, 2, 3 and 4, respectively.  There was a relatively stable spiral activation movement in the right ventricular epicardium of Model 5, where the APDR was shallow during VF, as shown in the upper panel of Fig. 4. The spiral wave rotated clockwise around the core (the black asterisk). A single rotation took approximately 240ms. The wave fronts emitted by this reentrant source managed to propagate coherently through the RV epicardium, but broke up because of intermittent fibrillatory conduction blocks in the LV (as evidenced by the complex distribution of the activation time) where APDR was steep. Its spectrum was characterized by a single peak (4.25Hz) and a narrow SpW (0.38Hz).  The VF of Model 6 showed considerable enantiomorphy with the VF discussed above, which is consistent with the restitution distribution. The region where the APDR was shallow also allowed regular propagation, featured by a steady breakthrough (denoted by the black dot in the lower left-hand image of Fig. 4) sending out centrifugal depolarization waves. Its cycle length was about 230ms. Simultaneously, a continuous formation of wave breaks occurred on the other side of the heart where the APDR was steep. The spectral distribution was more concentrated compared with the VF of Model 5 (SpW=0.13Hz vs. 0.38Hz).  Virtual ablations were performed to check whether the VF in Models 5 and 6 was indeed driven by the electrical activity in the shallow APDR regions (RV in Model 5 and LV in Model 6). The removal of mother rotors in the shallow APDR regions did not eliminate the VF. We found that decreasing the mass of ventricles with a steep APDR was a more effective way to eliminate the VF than reducing ventricular tissue with a shallow APDR. For Model 5, the minimum mass with a steep APDR required to sustain VF was approximately 4% of the original ventricular tissue, while the portion for a shallow APDR required to sustain VF was nearly 48%.    Fig. 5 shows the evolution of VF in the time-variant model. The first stage (denoted by the black line) was the same as the VF induced in Model 2. The VF complexity (i.e., the characteristics of the ECG and activation map) in the time-variant model was reemphasized by its intensive temporal frequency variation. The ST-DF and ST-MF of the first stage fluctuated frequently within a wide band of 2.3–5.9Hz. The ST-SpW changed widely over a broad range from about 0.98 to 5.9Hz. This stage matches the description of Type 1 VF [11], or multiple-wavelet VF.  After the APDR flattened (the second stage indicated by the red arrow), the degree of regularity abruptly increased, manifested by the overtly compact spectral distribution, the neat and stable ECG spikes with occasionally varying amplitudes, and the organized activation map, although scattered wave breaks were present. The second stage reproduced the VT well.  Finally, after the excitability was decreased, there was a reduction in organization that cannot be regarded as a return to the initial VF pattern. This reduction was characterized by the temporally varying and changeable frequency content as well as the irregular ECG. It seems that this stage resembles Type 2 VF. Nevertheless, the activation map showed a comparable mode with the second stage, except for the lagged activation time of the distal regions (in green) from the breakthrough (red region) because of the slow conduction velocity. Thus, the model with restitution properties that varied following the sequence suggested by Wu et al. [11] did not reproduce the transition from VT to Type 2 VF [11] exactly (i.e., the mother-rotor VF).  We found that if the APDR was changed to a heterogeneous process accompanied by a decreased excitability in the third stage, then the VF transition would follow the pattern observed by Wu et al. [11].    Fig. 6 shows the resimulated VF of the third stage after an abrupt transition from VT. There is an obvious decline in regularity on comparison with the VF in the second stage, evidenced by the changeable frequency content in the time–frequency analysis and the ECG. The activation maps were taken at intervals of 60ms, and depicted VF similar to the VF induced in Model 5, reminiscent of mother-rotor VF.   DISCUSSION   The major new findings of this study are as follows. First, to the best of our knowledge, the present study first simulated the important and well-recognized experimental study by Wu et al. [11] where the conversion from VT to mother-rotor VF was due to the heterogeneity of APD restitution instead of CV restitution flattening. Second, we clarified the effects of the interplay between APD and CV restitution on VF dynamics. Third, the conversion from wavelet VF to VT, and the degeneration from the VT to mother-rotor VF were successfully simulated in a “non-ionic rule-based” whole-heart model.  Our simulation data suggest that the slope of the APDR plays a significant role in determining the VF dynamics. In general, a steep APDR corresponds to highly disorganized VF dynamics, and a shallow APDR corresponds to regular VF dynamics.  Idiopathic VF is an uncommon disease of an unknown etiology that occurs in the absence of perceptible organic heart disease or identifiable channelopathy [39], or simply stated, “A healthy heart”. It is safe to assume that this type of heart has a shallow APDR and a normal excitability. The tachyarrhythmia induced in the model with this type of restitution (Model 4, Fig. 2B) reproduces the idiopathic VF [40] well. Meanwhile, it is known that structural heart diseases (SHD), such as the old myocardial infarction and hypertrophic cardiomyopathy, may significantly steepen the APDR slope [41]. Simulations show that the VF induced in the models with a steep APDR (Models 1 and 2) also reproduce the multiple-wavelet VF that commonly occurs in patients with SHD, e.g., the DF of the VF induced in Model 2 was 5.38Hz, slightly exceeding the clinical DF reported by Nash et al. [29] and Masse et al. [27]. Recently, a clinical study by Latcu et al. [42] has shown that the average DF of “fast VF” (DF>5Hz) and “slow VF” (DF<5Hz) was 5.84Hz and 4.66Hz, respectively, which are slightly above the DF values of the VF induced in Model 2 (5.38Hz) and 4 (4.50Hz), implying, to a certain extent, that our simulation may explain the VF occurring in these patients. The different APDR configurations may contribute to the different behaviors between VF correlated with SHD and the idiopathic VF.  The effect of CVR modulating VF dynamics lies with the APDR. When the APDR slope is steep, CVR can markedly influence the VF organization. However, under other APDR settings, the impact of CVR is not so prominent.  The autocorrelation plot in Fig. 3 shows the effect of restitution well. The autocorrelations of the steep APDR are lower than those of the shallow APDR; however, the autocorrelations of a decreased CVR are not always lower than those of a normal CVR, depending on the related APDR. Thus, the synergy between the APDR and CVR determines the VF dynamics, with the APDR taking the leading role.  Apart from the slope of the APDR, the heterogeneity of the APDR may also influence the VF behavior. This confirms the clinical findings of Bueno-Orovio et al. [43]. In the heterogeneous models, the electrical activity was organized in the regions with a shallow APDR and became unstable and broke up in the regions with a steep APDR. The DF values of the VF induced in the heterogeneous models were similar to those of clinical VF obtained during ischemia (3.60±0.04Hz) [27], which induces heterogeneity because cardiac tissue in different areas has a different tolerance to acute ischemia.  Although it seems that the VF induced in the heterogeneous models (Models 5 and 6) is driven by a breakthrough or spiral wave located in the shallow APDR region, virtual ablation reveals that this could be a false impression. According to the mother-rotor hypothesis, clearing the mother rotor should be a sufficient condition to cease the VF [15], in contrast with our simulations. However, although mother-rotor VF is well observed and documented [44], evidence of terminating VF via ablation is rare, and thus, the causality between the ablation of the mother rotor and VF defibrillation remains to be established [45]. Hence, failing to stop VF with ablation does not necessarily mean that the simulated mother-rotor VF is false, and it is still possible that heterogeneity of the APDR is responsible for the mother-rotor VF. Virtual ablation also suggests that decreasing the amount of tissue with a steep APDR outweighs ablating the shallow APDR regions. Since it is impossible clinically to locate precisely a steep APDR region, admission of a drug that flattens the global slope of the APDR would be a practical way to prevent or convert VF [46].  The restitution changes in the time-variant model followed the sequence reported by Wu et al. [11]. However, only the former two stages reproduced the expected VF well, showing a comparable time course of DF with clinical observation [47]. Although the ECG of the third stage was more irregular than the ECG of the second stage, it did not faithfully reproduce the characteristics of Type 2 VF as predicted by Wu et al. [11]. However, if the restitution changes, that occurred in the third stage, were composed of a decreasing excitability and a heterogenizing APDR, the VT could be converted into Type 2 VF (mother-rotor VF), as shown in Fig. 6. This implies that a decreased CV might only partly contribute to the VF conversion, while the heterogeneity of the APDR may be one of the true causes of the transition from VT to Type 2 VF.  Consequently, our simulation results suggest that Type 1 VF indeed arises from a steep APDR and a normal excitability. The flattening of the APDR slope can convert Type 1 VF into VT, and Type 2 VF is most likely from the heterogeneity of the APDR instead of decreased excitability, or at least the decreased excitability is not the major reason for the conversion from VT to Type 2 VF. Although Wu et al. [11] found that the heterogeneity of the APDR among four recording sites was insignificant after D600 infusion, the heterogeneity might be masked, because four recording sites may not have fully reflected the overall heterogeneity of the APDR. It is likely that the decreased excitability played an auxiliary role to the heterogeneity and other unknown causes in abruptly converting VT into Type 2 VF. This suggested modification to the deduction of Wu et al. [11] needs further validation. It is worthwhile to note that these factors are in line with the cardiac attributes determining the wave break suggested by Weiss et al. [8].  As far as VF is concerned, publications showed that the behaviors of spiral waves and reentry circuits were simulated with both reaction–diffusion models (ionic rule-based models) and cellular automaton models (non-ionic rule-based models) [32–34]. Several studies even could construct a cellular automaton model from “reaction–diffusion” rules to reproduce the simulation of “reaction–diffusion” models [35–38]. So we consider that these two types of heart model should be complementary to each other. On the other hand, in the “rule-based” model, the clinically measured restitutions can be faithfully and quantitatively translated into the simulation rules that govern the cellular dynamics, but it is difficult to do so in the “reaction–diffusion” model. In order to directly examine the relationship between cardiac restitutions and VF dynamics, it is more suitable to use the “rule-based” method for the current study.  Since the heart model is a finite element model and lacks intercellular current, computational noise may occur. For example, the excitation moment map in Fig. 2A looks noisy at the first glimpse. Nevertheless, we do not think the noise affecting reasonability of the simulation as a whole, because the simulated ECG has comparable waveforms and similar frequency band with the clinical observations, indicating that the simulated cardiac electrical activities well reproduced the behaviors of the VF in vivo, the overall simulation results are still reliable and trustworthy. The APDR and CVR curves were acquired from different studies, so arbitrary combinations of these properties may be unrealistic. Only the heterogeneity of the APDR was considered in our simulations, but a novel technique has revealed considerable heterogeneity in both restitutions [23,25]. It is worth stressing that restitution is not the unique determinant of VF dynamics, and other factors may also play an important role [48]. Some omitted alterations, e.g. the increased gap-junction resistance and fibrotic/necrotic tissues may also affect the VF organizations. The effect of these limitations remains unclear, and shall be investigated in future work.   CONCLUSIONS   In this study, different types of VF in models with different APDR and CVR setups were simulated using the Wei–Harumi model. Our simulation results suggest that the mechanism of VF has a tight relationship with the cardiac restitution properties. It is likely that the conventional mechanisms of VF can all be explained by the restitution mechanism. In addition, our work supports the hypothesis that the synergy between the APDR (its slope and heterogeneity) and CVR contributes to transitions between multiple-wavelet and mother-rotor mechanisms in the VF. We believe that the results from our simulation study based on a whole-heart model may be significant in understanding the mechanisms of VF, and complement “reaction–diffusion” model-based and experimental studies.  None declared.   ACKNOWLEDGMENTS   We would like to thank Dr. Osamu Okazaki from the National Center for Global Health and Medicine (Japan) for his precious advice. We also thank Dr. Xiaomei Wu, Dr. Cuiwei Yang, and Dr. Weijia Lu for their valuable assistances to the simulation study. This work is supported in part by the Grant-in-aid for Scientific Research, No. 24500369 Japan Society for the Promotion of Science (JSPS).  Supplementary data associated with this article can be found in the online version at doi:10.1016/j.compbiomed.2014.06.014.      Supplementary data        REFERENCES", "highlights": "Background The action potential duration (APD) and the conduction velocity (CV) restitution have been reported to be important in the maintenance and conversion of ventricular fibrillation (VF), whose mechanisms remain poorly understood. Multiple-wavelet and/or mother-rotor have been regarded as the main VF mechanisms, and APD restitution (APDR) and CV restitution (CVR) properties are involved in the mutual conversion or transition between VF and ventricular tachycardia (VT).  Methods and results The effects of APDR (both its slope and heterogeneity) and CVR on VF organization and conversion were examined using a “rule-based” whole-heart model. The results showed that different organizations of simulated VF were manifestations of different restitution configurations. Multiple-wavelet and mother-rotor VF mechanisms could recur in models with steep and heterogeneous APDR, respectively. Suppressing the excitability either decreased or increased the VF complexity under the steep or shallow APDR, respectively. The multiple-wavelet VF changed into a VT in response to a flattening of the APDR, and the VT degenerated into a mother-rotor VF due to the APDR heterogeneity.  Conclusions Our results suggest that the mechanisms of VF are tightly related to cardiac restitution properties. From a viewpoint of the “rule-based” whole-heart model, our work supports the hypothesis that the synergy between APDR and CVR contributes to transitions between multiple-wavelet and mother-rotor mechanisms in the VF."}