{"id": "S0142694X15000423", "article": "MAIN-TITLE Co-ideation of disaster preparedness strategies through a participatory design approach: Challenges and opportunities experienced at Turrialba volcano, Costa Rica   HIGHLIGHTS          First application of participatory design to volcanic disaster risk management.      Two participatory ideation workshops with communities at Turrialba volcano.      Uptake self-protective measures influenced by transfer of risk and responsibility.      Workshop challenges resulted from human, cultural and resource factors.          KEYPHRASES   case study  collaborative design  interdisciplinarity  participatory design  reflective practice   While talking to local residents to promote attendance, the idea of a workshop to elicit community perspectives on disaster preparedness and communication was generally welcomed, with one participant responding ‘Magnífico [magnificent]’. Less positive responses were received from two other local residents. The first replied that local residents are not listened to and do not make decisions. All (scientific) agencies involved in research, monitoring and management of the area were referred to as ‘burócratas [bureaucrats]’, and a complaint was made that scientists took advantage of local people's hospitality: deploying and removing equipment without acknowledgement or information. The second individual stated that local people know the volcano: if official reports do not concur with their observations they are regarded as false. Furthermore, extreme dissatisfaction with the perceived unprofessional and alarmist attitude of scientists and authorities portrayed in the media was expressed. Neither of these individuals attended the workshops.  A total of 28 individuals attended the workshop in Santa Cruz, and 8 participants took part in La Central. This difference in participant numbers was expected as the community of La Central is much smaller and more remote. In both workshops the majority of participants were male (68% in Santa Cruz, 75% at La Central; Figure 4 ) and the females present were frequently spouses, as such ‘married’ was the most common marital status reported (46% Santa Cruz, 50% La Central). Participants represented a wide range of age groups and professions, but the majority (50% in both Santa Cruz and La Central) indicated to have received no formal education. The largest percentage of participants was from the local area, but a few travelled approximately 30 km to the workshops.  Almost all participants believe it is important to prepare (96% Santa Cruz, 100% La Central; Figure 5 ), and almost a third (29%) of participants in Santa Cruz and almost two-thirds of those (62.5%) in La Central stated they know how to prepare, having gained this information predominantly through TV, radio and public meetings (Figure 5). Most people claimed to have prepared at least a little after receiving the information. Those who did not primarily cite that they were already prepared (32% in Santa Cruz, 25% in La Central), or the time and expense of preparing as reasons for failing to act on the recommendations (Figure 5).  The initial brainstorm session revealed key associations, concerns and priorities for people (Figure 6 ). In Santa Cruz the main category of associations are those that are related to the various steps of disaster preparedness: stocking supplies, keeping informed and emergency plans. The second largest category comprised concern regarding family members and animals, both pets and livestock (livelihood). Third came the response to the activity, with evacuation the dominant factor. At La Central people and animals were the primary concern, with preparedness factors second and communication third. This difference is likely due to the varying composition of the participants (Figure 4): 50% of those at La Central work in the agricultural sector versus only 7% of those who attended in Santa Cruz.  During the subsequent brainstorm phase, participants generated ideas on what would motivate and help them to prepare. The majority of these ideas centered on education, training, communication and committee formation. These themes are also reflected in Table 2  , which lists the top ideas generated in each workshop. These results also concur with the answers provided to the survey question ‘What would help you to prepare?’ (Figure 5). Some key observations from the workshops and results are listed in Table 3 . These can be used to inform constraints or guide concepts during design development.    ‘The basis of design with users is taking the situation, the complaints and the criticisms made by the user seriously.’ (Scariot et al., 2012)    Unsurprisingly, it was also much easier for people to come up with a list of problems regarding preparing or capability for preparedness, rather than potential solutions. However, the issues identified can be used as starting points for the development of design outcomes. Key problems in the area as identified by participants are (unranked):  ■ The state of the roads. The main road to La Central is not asphalted all the way and in a bad state of repair where it isn't, which will impede evacuation efforts in case of an emergency. Also, those in the La Central area, close to the summit of the volcano, perceive this to be the only plausible evacuation road, as the secondary evacuation route is completely unpaved. In addition, evacuation routes, including a third unpaved route that starts in the National Park and is predominantly aimed at those within the park (staff, a few inhabitants and tourists), are poorly signposted and known, and impassible by car.  During the 2010 evacuation order no vehicles were allowed into the area. This meant that people report they had to leave on foot and there was no way of transporting livestock out of the area. This is a concern for people in case of future evacuations.  Poor and inconsistent communication. This is a very prominent and broad category with the following key sub-topics:  ○ Lack of communication of factual information.  Inconsistency in the information communicated, depending on the source.  Frustration with perceived alarmist attitude of some official sources and the media.  Lack of transparency with regards to reasoning behind decisions that have been made.  Lack of consultation with, and consideration of, those most affected.   DISCUSSION   This work presents the results of the initial step in a much longer term participatory project, in which the next steps include development and design of some of the concepts put forward by the communities. To optimize participation in these subsequent stages, and thereby enhance the outcome, we reflect here on the process and outcomes to date.  As people's perceptions, experiences and perspectives will influence their thinking, it is possible to elucidate some of the socio-cultural dimensions that play an important role at Turrialba from the workshop results. These can subsequently be used to inform and guide the outcomes designed, developed and implemented in future stages of the project. However, it should be noted that the perspective offered by the participants is not statistically representative of the entire population: only a small percentage of the total number of residents in the area attended, and these are likely to be a self-selected subset of those with already heightened hazard awareness and concern.  Almost all (96% in Santa Cruz and 100% in La Central) participants agreed that it is important to prepare, however, based on the questionnaire the large percentage of people who claim to have prepared, either because they already were or after receiving information on what steps to take, is surprising (71% in Santa Cruz, 75% in La Central). It stands in contrast to previous research conducted in the area (van Manen, 2014) and personal communications during the workshops, which both suggested larger levels of un- or under-preparedness. This finding may have resulted from cultural factors, leading people to fill out the anticipated desired response, rather than their true level of preparedness. Alternatively it could be the result of misinterpretation of the question or uncertainty or unfamiliarity with what preparedness comprises. However, 29% of participants in Santa Cruz and 62.5% state they know how to prepare on the questionnaire, with a further 60% and 25% respectively answering they know a little. Furthermore, the results of the initial brainstorm session during these workshops suggest that, particularly at Santa Cruz, people have a reasonable grasp of the various components (Figure 6). Another factor that could be contributing to this finding is ‘(unrealistic) optimism bias’ (Johnston, Bebbington, Lai, Houghton, & Paton, 1999; Weinstein, 1989; Weinstein, Lyon, Rothman, & Cuite, 2000), which occurs when people consider themselves better prepared compared to others. A concern with this is that it transfers the responsibility to take action to others in the community, thereby decreasing the perceived need to personally prepare.  Those who didn't prepare, or prepared only a little, state they did so due to lack of time, the associated costs, thinking it will make little difference, or perceived lack of clarity and/or guidelines on what to do. Responses to the question ‘What would help you to prepare?’ overwhelmingly indicated a perceived lack of information. These results are in line with findings from other countries and in relation to other hazards (e.g. earthquakes, hurricanes, flooding), where a wide range of factors have been identified as reasons for lack of personal preparation: a perceived feeling of safety; a focus on short-term feedback (only implementing personal preparedness measures after experiencing losses); denial; passiveness and lack of interest due to limited awareness and understanding of the hazards, consequences and impact of decisions (projection biases, empathy gaps); and difficulty making trade-offs between short term costs and long-term benefits (e.g. Grothmann & Reusswig, 2006; Krasovskaia, Gottschalk, Ibrekk, & Berg, 2007; Meyer, 2006; Tekeli-Yeşil, Dedeoğlu, Braun-Fahrlaender, & Tanner, 2010).  Another key variable influencing lack of preparedness as identified in other areas is a reliance on authorities and public protection measures (e.g. Grothmann & Reusswig, 2006). This risk transfer through dependence on external measures and support is a form of ‘risk compensation’ (Adams, 1995), an interpretive bias, where the ability of existing mitigation strategies to eliminate the risk is overestimated. This subsequently results in decreased impetus to take personal protective measures. This transfer of responsibility was substantively present in workshop participants: firstly, a significant number of the ideas generated at Santa Cruz (24%) and La Central (23%), including 2 of the 3 preferred ones at Santa Cruz, call for the creation of organizations and committees that would be in charge of community preparedness. Secondly, and contrary to empirical findings in the literature, it was mentioned that if the authorities were seen to prepare this would serve as a motivational factor for the adoption of personal preparedness measures.  Elements that contribute to the cognitive process that leads to taking concrete actions to prepare include hazard awareness, perceived level of risk, anxiety levels, outcome expectancy, the degree of action coping, self efficacy and response efficacy (Kievik & Gutteling, 2011; Paton, 2005). Education level, location and potential extent of exposure to the hazard, previous experience, home ownership and age can be important influences on these elements (e.g. Paton, Millar, & Johnston, 2001; Tekeli-Yeşil et al., 2010). A study by van Manen (2014) found that hazard awareness around Turrialba is high, owing to its current and recent activity and its perceptible impacts. The perceived level of risk is based on the collective memory of the 1963–1965 eruption of neighbouring Irazú volcano, which is an appropriate reference for the type of activity likely to occur at Turrialba. Our results indicate that key concerns revolve around potential impacts of activity (e.g. on livelihood), infrastructure (evacuation routes) and the availability and accessibility of information, which concurs with earlier findings (van Manen, 2014). An additional important consideration for people, as evident from the affinity diagrams, is the well-being of family, friends, neighbours, employees, pets and livestock. These concerns reflect elevated levels of anxiety that, when combined with a perceived insufficient level of resources relative to the threat, are likely to inhibit the motivation to prepare (Duval & Mulilis, 1999). With regards to outcome expectancy, which refers to the personal confidence whether the consequences of a hazard can be mitigated through individual actions, participants exhibited the full spectrum of outcome expectancies: from fatalistic to positive outlooks. However, based on the level of risk transfer exhibited in the ideas generated during the workshops (almost 25%) and perceived lack of information expressed by participants it is inferred here that self efficacy (the perceived personal competence to act effectively) and action coping (the disposition to confront problems) levels are relatively low. We are unable to comment on the perceived degree of response efficacy from the workshop results. Taken together with the socio-demographics of the workshop participants, specifically their level of education, these factors suggest low impetus for the adoption of self-protective measures. This highlights that in the response to these results, outcomes should be targeted towards reducing anxiety levels, increasing positive outcome expectancies, raising levels of perceived self efficacy and action coping and possibly demonstration of response efficacy. However, it should be noted that these factors, which contribute to vulnerability (Table 1), co-exist with ones such as a strong sense of community, which facilitates adaptive capacity (Table 1). Although this does not reduce the vulnerability, it can result in better than anticipated outcomes in case of a disaster (Buckle, 2001; Paton et al., 2001; Saegert, 1989).  The majority of comments regarding what would help people to prepare were ‘more information’. The type of desired information can be divided into two categories: 1) updates about the state of the volcano and 2) information on how to prepare, specifically regarding the development of family emergency and evacuation plans. The source of information was an important point, with the credibility and integrity of the messenger being key. This has been shown to be a fundamental variable in the improvement of risk communication (Haynes, Barclay, & Pidgeon, 2008; Wachinger, Renn, Begg, & Kuhlicke, 2013). In addition, it became clear that structured, regular updates were preferred. Unsurprisingly there is no single preferred platform, and the use of popular mass media such as TV and radio as main sources of information is consistent with earlier findings, but at the same time the media are not always regarded as reliable (van Manen, 2014). Furthermore, use of fear appeals or media coverage that overemphasizes devastation or distress can have an adverse effect on people's outcome expectancy (Lopes, 1992; Witte & Allen, 2000). Instead, empowerment, through providing context and meaningful rationale (Ryan & Deci, 2000; Thomas & Velthouse, 1990), is more likely to result in the adoption of self-protective measures. As good communication is essential to effective disaster risk management, the strong desire for more information as expressed by the community, should be acknowledged and responded to. However, this gives rise to the challenge of how to change the delivery and/or content of the message for greater effectiveness. Paton (2005) and Paton and Johnston (2006) suggest using a range of strategies that facilitate personalization of information regarding hazards and their consequences, direct discussion enabling people to discover the relevance and implications of the information for and to themselves, and demonstrating response efficacy. Most importantly however, they suggest that the content of communications should be determined through consultation with community members to establish relevant issues and appropriate responses, which is a process we have commenced here.   White (1996) emphasizes the importance of conscious decisions regarding who participates, as the public is not homogeneous, and appropriate representation of relatively disadvantaged groups may require additional effort. In this work however, we opened up the workshops to anyone interested in participating: although natural disasters disproportionally affect poorer communities (Basher, 2006), all local residents are at risk of (volcanic) hazards. However, locations of the workshops were carefully chosen as La Central is the village most heavily impacted by the activity to date, while Santa Cruz is only occasionally affected by the current activity but is at-risk in case of increasing levels of activity. Yet the low number of people who attended compared to the available population in the area, raises questions regarding the reason for the absence of the majority and how this relates to their current level of awareness, preparedness and/or intention to prepare. If the assumption is made that those who attended are most aware, affected and/or concerned, as well as willing to donate their time, this implies that the majority of local residents are not ready to cope with the potential consequences of a volcanic eruption as even this self-selected subset of engaged individuals do not feel prepared.  To facilitate participation, workshops commenced in the late afternoon, in an attempt to provide a reasonable fit with people's general daily schedules. In preparation for the workshops tables and chairs were configured into distinct groups, around which participants self-organized, mostly working with family, friends or colleagues. As the workshops progressed it was found that in Santa Cruz this had worked well: those with strong personalities and outspoken opinions sat together on their own initiative and therefore did not dominate conversation in other groups. Some re-organisation of groups occurred towards the end of the workshop as a number of people had to leave early due to personal commitments. At La Central there were two groups, but as the workshop progressed it was clear that one of the women ‘lost her voice’ while working next to her husband in a group of all men. In response she was asked to form a third group with the other woman present, after which she became much more animated and engaged with the workshop. At both workshops some of the participants were illiterate, these people generally received help completing the questionnaire and during the brainstorm and idea development phases most groups had a single person they had designated to record ideas. Despite being told they could represent their ideas through drawing and/or writing, all ideas were written out, with only occasional drawings to illustrate concepts. Workshops started during daylight hours, but nightfall in La Central meant that the temperature in the school dropped below comfortable levels. The venue was also plagued by the smell of volcanic gases and the venue was poorly lit. All of these factors may have adversely impacted participants' levels of engagement.  There are various levels of participation (Arnstein, 1969; Harder, Burford, & Hoover, 2013; Tritter & McCallum, 2006): ranging from non-participation to learning as one. To evaluate the level of participation in the workshops (Figure 7 ), we follow the descriptions as set out in Harder et al. (2013) (Table 4 ): the ‘depth’ of involvement is the stakeholder extent of control in decision making (ranging from denigration to full partnership), the ‘breadth’ denotes stakeholder diversity (e.g. general public, managers, leaders etc.) and ‘scope’ to stages in the design process (e.g. initiation, design, implementation, reflection and communication). This framework can be used both to evaluate projects and to set benchmarks. The original idea for this participatory approach to increasing disaster preparedness was rooted in the low levels of preparedness identified by previous work (van Manen, 2014), which used semi-structured interviews that can best be described as ‘learning about’ (level 1). The participation level during the workshops in terms of processes, attitudes, assumptions and actions was assessed between levels 2 ‘learning from’ and 3 ‘learning together’ (for a more detailed explanation of these levels please refer to Table 1 in Harder et al., 2013). At first glance, this may appear as though the project falls short of the optimal level 4 ‘learning as one’. However, participation throughout a project can be fluid and variable depending on the facilitators, participants and context, and have beneficial, contradictory or detrimental effects on the design process. Therefore higher levels of participation may not be desirable or appropriate in all contexts (Hayward, Simpson, & Wood, 2004). According to Scariot et al. (2012) ‘applying all these considerations [the situation, the complaints and the criticisms made by users] to a project may culminate in unnecessarily complex results. For this reason, the design team should follow a well-defined design process model, in order to be able to incorporate users' complaints or criticisms positively, or discard them in situations where these comments happen to be redundant. Having a broader vision and non-discriminatory interpretation of the results prevents the user from being either ignored or taken too seriously’, essentially advocating a middle-ground in participation levels.  The motivation behind scoring the workshops' participation depth between levels 2 and 3 is that despite the recognition of the added value of participation at an equal level and co-creation, it was found that it was difficult to get people to think creatively. Participants reported that this was the first time they had taken part in a workshop like this, and as the workshops deviated from people's initial expectation of passively receiving information through talks, it took some time for them to warm up to the idea of actively contributing. However, afterwards participants expressed genuine appreciation for the ability to provide their perspective and contribute their ideas. Contrary to the experiences of Hussain et al. (2012), few of the resulting ideas presented were unrealistic. Similarly however, there was little development of initial ideas, despite the prompts posing specific questions to be answered. Therefore, despite the valuable ideas and insights into the communities' needs provided by the workshops, the fact that a large number of the ideas put forward revert to ‘known quantities’ such as existing or previously implemented initiatives that had no or limited success, means that to a certain extent this feedback may need to be discarded to achieve the desired outcome, which are decisions made by the authors rather than participants. This echoes findings by Luck (2003), who noted that ‘Users suggesting “solutions” can limit a design solution’. Regardless, the user needs, issues identified and proposed solutions all provide design directions, as well as realistic constraints to take into the next phase of design development.  Our experience of participation during the workshops highlights the need to develop the capacity to participate, similar to findings from other participatory design projects (Byrne & Sahay, 2007; Cahill, 2007; Hussain et al., 2012; Puri, Byrne, Nhampossa, & Quraishi, 2004). Furthermore ‘participation and how to participate has to be negotiated and adapted to the local setting’ (Elovaara, Igira, & Mörtberg, 2006), which results from the fact that participatory design is based on a Western developed-nation perspective: assuming democratic community participation, high literacy rates and reasonable technological infrastructure (Hussain et al., 2012; Puri et al., 2004). These principles are not necessarily transferable to the less-developed non-Western nation context provided by this Costa Rican case study.  Participatory design in general is resulting in a shift from the traditional role of a designer to a facilitator who should ‘[…] create the necessary tools and infrastructure to accommodate and facilitate’ (Scariot et al., 2012). However, this work highlights that to successfully include project beneficiaries' skills and insights into the project, the methods, tools and techniques developed will need to be flexible and audience-, location- and context-specific. In our case, key considerations for future workshops include (1) finding ways, platforms and exercises to stimulate creativity (i.e. developing the quality of facilitation (Luck, 2007)) and (2) developing tools and resources that help people to better understand the design process, which has a focus on potential solutions, rather than reiterating and re-expressing recognized problems.  Participatory processes can be viewed as a means (e.g. Mikkelsen, 1995) or an end (e.g. Oakley, 1991), resulting in tangible and intangible outcomes respectively, but these perspectives are not mutually exclusive (Boyce, 2001; Hayward et al., 2004; Karl, 2014). One of the virtues frequently attributed to participatory processes, both as a means and an end, is empowerment (Björgvinsson, Ehn, & Hillgren, 2012; Hussain et al., 2012; Steen, 2013). Empowerment can occur on personal, close relationship and collective scales (Rowlands, 1996), and can be concisely defined as the development of capacity. Although we encountered some hurdles in applying the participatory process as a means, as described above and reflected in the outcome evaluation, we found that the workshops offered a process of self-reflection within a structured framework: in the process of working through the various exercises, participants were found to evaluate their priorities and the available and required resources. We consider this resource inventorying an initial step in the capacity building process, and therefore believe that the workshops were to a partial extent successful in empowering participants.   CONCLUSIONS   This project aims to take a collaborative participatory design approach to the development of local-level disaster risk management strategies. As part of this we facilitated two workshops at Turrialba volcano (Costa Rica) focused on idea generation surrounding the theme of disaster preparedness. The 36 workshop participants included end-users, decision makers and relevant government employees.  The workshops revealed that participants' key priorities centre on the well being of family members, friends and others, as well as impacts (livelihood), infrastructure (evacuation routes) and the availability and accessibility of information. This contributes to a relatively high level of anxiety, as well as fair levels of hazard salience. Some socio-cognitive dimensions that influence the uptake of self-protective measures at Turrialba include transfer of responsibility and risk through mechanisms such as risk compensation and optimism bias. Furthermore, variable outcome expectancy and low self efficacy and action coping levels suggest that the design outcomes of this project should aim to redress these perceptions.  Challenges encountered during the workshop were of a human, cultural and resource nature and highlight the importance of developing people's capacity to participate. However, in line with the one of the key attributes of participatory processes, empowerment, participants started taking stock of their resources, which is an important step towards disaster preparedness.  The ideas provided at the workshops will be used as input for design development through further collaborative participation with communities. However, to provide focus and direction for these future workshops, the ideas presented by the communities will first be developed into a number of rough concepts that incorporate the design constraints identified.  Increasing capacity to adapt at individual, household and community levels is only a small component of a comprehensive resilience strategy. However, as disasters are mostly felt at these levels, increasing resilience through community engagement is crucial. Although the implementation of final outcomes will be dependent on civic reciprocity, the fact that they were developed through a participatory process is likely to result in more sustainable disaster risk management in the area, which have a higher return on investment.  For participatory approaches to disaster risk management to become more mainstream, closing the gap between action at national and local levels, the real-world challenges and opportunities of conducting this type of work must be discussed. Despite the surmountable challenges experienced, this work has also identified a number of pressing design opportunities, if designers, scientists and policy makers are willing to deal with the challenges of participatory design in non-Western less-developed settings, demonstrating flexibility and willingness to compromise.   ACKNOWLEDGEMENTS   Firstly, the authors would like to acknowledge all the workshop participants for their attendance and contributions. We'd also like to thank the employees of SINAC and some of Turrialba's neighbours for their help in promoting the workshops and their valuable perspectives. This work was funded by Society in Science, The Branco Weiss Fellowship, administered by the ETH Zürich and a SEG GWB grant. While this work was conducted van Manen was also part-funded by the European Social Fund (ESF) through the European Union's Convergence programme administered by the Welsh Government. We are also thankful to an anonymous reviewer whose feedback contributed to improvements to the text and figures.   REFERENCES", "highlights": "Disaster preparedness is key to coping and adaptation during the immediate aftermath of a natural hazard, but the majority of those at risk do not feel prepared. In this participatory action research we investigate the use of a participatory design approach to increase disaster preparedness around Turrialba volcano, Costa Rica. We present a case study of two ideation workshops and explore the process, outcomes, challenges and opportunities during ideation. Socio-cognitive dimensions, specifically risk and responsibility transfer, appear to be important factors influencing the uptake of self-protective measures. Challenges in workshop facilitation were of a human, cultural and resource nature. However, the overall process was successful with participants showing indications of empowerment and a number of pressing design opportunities identified.   Volcanic activity results in tremendous human, social, environmental and economic costs (Auker, Sparks, Siebert, Crosweller, & Ewert, 2013): between 1900 and 2012 volcanic eruptions have been identified as the cause of more than 4.5 million fatalities worldwide (Center for Research on the Epidemiology of Disasters, 2012); they inhibited development and poverty reduction efforts (DFID, 2006); devastated complete ecosystems (de Bock, 2013; DeGange, Byrd, Walker, & Waythomas, 2010); and the economic cost of volcanic activity from 1900 to 2014 has been estimated as at least US$3 billion (Center for Research on the Epidemiology of Disasters, 2012). These costs are only set to increase in future natural disasters as an increasing number of people are living in high risk (Table 1) areas, resulting in additional economic and infrastructure development, thereby increasing the relative risk in these areas (Basher, 2006; Gencer, 2013).  A multi-strand approach to minimize losses as the results of disasters has been implemented globally by the UN since the 1960s (UNISDR, 2013). The current 10-year plan is outlined by the Hyogo Framework for Action (UNISDR, 2005). Established in 2005 it seeks to establish resilience (Table 1) at all levels of society through the systematic integration of risk reduction into policy. It aims to achieve this by addressing the following strategic goals and priorities: (1) governance, (2) assessment and monitoring, (3) knowledge and education, (4) risk factors and (5) disaster preparedness and response.  Disaster preparedness at individual, household and community levels is a fundamental component of resilience (Paton, 2003), and can be defined as the process of encouraging availability of resources to facilitate coping and the systems and competencies to coordinate and utilize these resources (Paton, Smith, & Johnston, 2005). It plays a particularly important role in coping and adaptation during the immediate aftermath of a natural hazard, when individuals and communities are expected to be self-reliant (e.g. isolated from external/government assistance) for a minimum of 72 h (e.g. FEMA, 2014; New Zealand Civil Defence, 2014).  To encourage disaster preparedness at local levels, efforts have traditionally focused on education regarding natural hazards and associated risks. This is predominantly accomplished through one-way communication that takes the form of distribution of printed material aimed at a homogeneous audience (O'Neill, 2004). The material commonly emphasizes actions individuals can perform to protect themselves (O'Neill, 2004). Implicit in this approach is the fallacious belief that imparting scholarly information automatically leads to awareness, which converts to (appropriate) actions (Boura, 1998; Lindell & Whitney, 2000; Paton et al., 2005). However, people's actions in the face of risk are not just determined by objective scientific information but also by how this information is perceived in light of people's expectations, previous experiences and beliefs, which arise from their social, cultural, economic and political context (Paton, Smith, Daly, & Johnston, 2008). Key socio-cognitive factors that lead to adaptation of self-protective measures include high salience of the hazard; a belief that the hazard will negatively affect oneself; a low level of anxiety; an action coping ability; sense of self efficacy; and a sense of response efficacy (Kievik & Gutteling, 2011; Linley & Joseph, 2004; Paton, Smith, & Johnston, 2000).  Despite existing outreach and educational initiatives many people fail to take basic precautions, such as developing a family evacuation plan or keeping a kit with emergency supplies (Al-rousan, Rubenstein, & Wallace, 2014; Karanci, Aksit, & Dirik, 2005; Kievik & Gutteling, 2011; Paton et al., 2000). Consequently, the questions ‘How can people be better motivated to prepare for natural hazards?’ and ‘How can the intention to prepare be facilitated into tangible actions?’ become important. An increasing number of academic studies and organizations advocate community engagement in disaster risk management (FEMA, 2012; Paton et al., 2005), yet few studies address the real-life process and challenges of these approaches. Therefore, in this study we present and reflect on a case study of the use of a participatory design approach to increase levels of individual, household and community disaster preparedness.  The overall aim of this participatory action research was to involve participants in collaborative ideation of concepts that can be developed to increase levels of self-reliance in the immediate aftermath of a potential (volcanic) disaster, through enhancing and promoting the adoption of self-protective behaviours. Self-protective behaviours are preventative actions undertaken by residents to reduce their risk (personal and economic) when faced with a natural hazard (Kievik & Gutteling, 2011). This work does not cover the complete design development process, but details the early phase of the project during which ideas for possible outcomes were generated. Here we present the process, outcomes, challenges and opportunities experienced during the facilitation of two participatory ideation workshops focused around disaster preparedness in a volcanic context. Specific objectives were to: (1) gain insight into why people fail to engage in self-protective behaviour in response to existing information, (2) develop a better understanding of what may motivate people to engage in self-protective behaviour, (3) identify what information to support engagement in self-protective behaviour is relevant to communities and (4) collaboratively assess how this information can best be delivered.  In this work we focus on the volcanic hazards at Turrialba volcano (Figure 1 ), one of the six historically active 1   1 We adhere here to the Smithsonian's Global Volcanism Program definition of historically active as ‘documented during or shortly after observation’ volcanoes of Costa Rica. As the result of its geographic setting, Costa Rica is exposed to a wide range of natural hazards, which include tropical storms, landslides, droughts, earthquakes and volcanoes. Costa Rica ranks second in the world on a list of countries most exposed to three or more natural hazards based on land area, and with 77.9% of its population and 80.1% of its GDP (Gross Domestic Product) in areas of risk it ranks 8th with respect to economic risk from multiple hazards as based on GDP (The World Bank, 2005).  After a period of quiescence following its 1864–1866 eruption, Turrialba reawakened in 1996 (Martini et al., 2010). The volcano has a radius of approximately 20 km but only its summit is a National Park: the upper and lower slopes are used for agriculture, the area is famous for the ‘Turrialba cheese’ produced there, and is home to the major archaeological site of Guayabo. This pre-Columbian city experienced at least three eruptions during its occupation from 770 B.C. – 1300 A.D., and its features suggest the inhabitants had a direct connection with the environment and possibly practiced natural religious beliefs (Hurtado de Mendoza, 2004). Unfortunately there are no surviving pre-Columbian oral traditions about these eruptions. Tourism is another main source of income in the area, but it has suffered from the closure of the National Park since 2010 (with the exception of 6 months of temporary reopening in 2011) after increases in activity at Turrialba (van Manen, 2014).  With at least 20 eruptions recorded in the geological record (Reagan, Duarte, Soto, & Fernandez, 2006; Soto, 1988), Turrialba presents a significant threat to Costa Rica's Central Valley, the hub of the nation's economic activity, containing the capital, other large population centres and the international airport. The potential hazards at Turrialba are wide-ranging: from large Plinian explosions, pyroclastic flows, lateral blasts and landslides that have the potential for widespread destruction (Reagan et al., 2006), to smaller, more localized and higher probability Strombolian to Vulcanian explosions, lava flows and the persistent release of toxic volcanic gases such as sulfur dioxide, hydrogen sulfide and hydrogen chloride. The latter have already resulted in environmental, health and socio-economic impacts (e.g. de Bock, 2013; D'Alessandro, 2006; Delmelle, Stix, Baxter, Garcia-Alvarez, & Barquero, 2002; Hansell & Oppenheimer, 2004; Rymer et al., 2009).  The most recent activity has been characterized by small-scale events, which included minor to moderate phreatic eruptions in 2010 and 2012–2014 (OVSICORI-UNA, 2010, 2012, 2013, 2014) and persistent gas release since 2007 (Martini et al., 2010). Minor volcanic ash fall up to 35 km downwind from the volcano was reported intermittently throughout those years (OVSICORI-UNA, 2010, 2012, 2013; 2014; Smithsonian Institution, 2011). The gas release has resulted in the devastation of local ecosystems (de Bock, 2013) and the damage is clearly visible in the environment (Figure 1).  Costa Rica has a comprehensive legal, financial and institutional framework for disaster risk reduction (DRR). This is overseen by the Comisión Nacional de Prevención de Riesgos y Atención de Emergencias (CNE; www.cne.go.cr). The CNE and its two main scientific advisors in the domain of volcanic and tectonic hazards, OVSICORI-UNA (Observatorio Vulcanológico y Sismológico de Costa Rica, Universidad Nacional) and RSN-ICE (Red Sísmica Nacional-Instituto Costarricense de Electricidad), disseminate information to the general public through a range of formal oral and written communication methods that include an online and social media presence, public meetings and printed posters and leaflets (e.g. http://www.cne.go.cr/index.php/educacienuprincipal-92/planes-de-emergencia-menuprincipal-110). Furthermore, DRR has been part of the Costa Rican curriculum since the 1980s. In response to the Hyogo Framework for action, Costa Rica's PLANERRYD (Plan Nacional de Educación para la Reducción del Riesgo y los Desastres) strategy has revised the objective of risk reduction curriculum to the development of a culture of disaster risk prevention (UNICEF, 2012) and DRR is included in a number of subjects, which include science, Spanish and social studies.  However, previous work in communities surrounding Turrialba volcano has shown that there is a lack of disaster preparedness at individual, household and community levels, despite high levels of hazard awareness and the education and local preparation initiatives that have occurred (van Manen, 2014). This lack of preparedness exacerbates the risk posed by Turrialba. This observation is not unique: worldwide there is insufficient action and progress on DRR at local levels (GNDR, 2009). Yet efforts directed at the local level can have the biggest impact during and after an event (IFRC, 2011). In light of Turrialba's continued activity and the relatively low probability but high impact occurrence of the acute hazards such as ashfall, engaging local communities with disaster risk management is key.     ‘Recognition of the fact that the choices that can be made are […] more about how communities and their members experience them in the context of their social, psychological, cultural and institutional characteristics means that the process of making these choices should no longer be viewed as the preserve of emergency managers. It should be regarded as an intrinsically community-based process.’ (Paton, 2005)    Participant engagement in the development of ideas that can be developed to enhance and promote the adoption of self-protective behaviours was at the crux of this work: by providing the opportunity to be involved to those most affected by and concerned about the volcanic activity, who therefore have the greatest need for disaster preparedness, they are given (co-) ownership of the results (Hussain, Sanders, & Steinert, 2012). This is the core principle of participatory design, which originated during the 1960s and 70s (e.g. Cross, 1972; Ehn, 1993; Sanders & Stappers, 2008). Robertson and Simenson (2012) define participatory design as ‘to investigate, reflect upon, understand, establish, develop and support mutual learning processes as they unfold between participants in collective “reflection-in-action” during the design process’. Participatory design generally results in outcomes that are more accessible and flexible to changing contexts, bringing about greater levels of satisfaction and suitability (Robertson & Simonsen, 2012; Scariot, Heemann, & Padovani, 2012).  Participatory design is frequently facilitated through workshops that bring together designers, users and other stakeholders to assess user needs, problems with existing products or systems and co-create new solutions (Hussain et al., 2012). Therefore, to design more effective solutions to promote self-protective behaviours, it was decided to hold two participatory workshops. These focused on disaster preparedness and were predominantly geared towards co-ideation.  All the data originating from the workshops were digitally recorded and coded, so they could be used as reference materials in the development of concepts. Questionnaire data were coded and analyzed using Microsoft Excel. The qualitative data from the workshops were explored using content analysis. Reflective analysis through individual and group-based evaluation with co-facilitators and others was also used.  Two workshops were conducted around Turrialba: the first on 12 February 2014 in a community centre in Santa Cruz de Turrialba (from here forth referred to as ‘Santa Cruz’; Figure 1) and the second on 13 February 2014 in the school at Hacienda La Central Volcán Turrialba (from here forth referred to as ‘La Central’; Figure 1). Each of these lasted around two hours. Workshop venues and timings were decided in consultation with members of the local population and employees of the Sistema Nacional de Áreas de Conservación (SINAC; Costa Rica National Park Service), who are responsible for administration of the National Park that comprises Turrialba volcano and have a good rapport with local communities. The workshop in Santa Cruz followed a SINAC‐hosted meeting regarding the current emergency management plan.  Participation in the workshops was on a voluntary basis and was open to all residents in communities surrounding Turrialba volcano. The workshops were advertised using posters and word-of-mouth starting 8–9 days prior to the dates. Posters were placed in public places such as shops and bars in surrounding communities and handed to individuals while promoting the workshop verbally. Employees of SINAC also encouraged participation in the 12 February workshop.  Prior to commencing the workshops, participants were given a letter explaining the reason for and nature of the workshop, including the researchers' contact details. Informed consent was obtained through a registration form on which name, address and a signature were recorded. Participants were not provided with compensation for attending but refreshments were provided free of charge.  After registration participants were given a short questionnaire aimed at evaluating participant demographics and level of preparedness. It also provided some insight into initial thoughts people had regarding what would help them to prepare for a volcanic crisis. While sitting down to complete the questionnaires participants naturally split into a number of groups due to the way the venues had been arranged (Figure 2 ).  Once questionnaires had been completed, participants were given a general welcome and introduction. During all following activities, printed prompts were provided to each table to remind participants of the activity or question (Figure 3 ). Subsequently they were asked to brainstorm around ‘eruption preparedness’, listing all words or thoughts that came to mind on individual post-it notes. Groups were then asked to collate all post-it notes on a single wall, and arrange them to identify common themes (Figure 2A).  Next, participants were introduced to or reminded of the three key steps to disaster preparedness that are common in disaster risk management strategies across the globe: (1) Be informed, (2) Have a plan and (3) Keep an emergency kit (American Red Cross, 2014; CNE, 2014; FEMA, 2014; New Zealand Civil Defence, 2014; Rijksoverheid, 2014).  The second exercise again asked participants to brainstorm in groups, this time about ‘How would you motivate people to prepare?’ and ‘What would help you to prepare for an eruption?’ They were requested to use large sheets of A1-size paper and markers to write down or illustrate their ideas. In addition, some of the researchers' ideas were presented to each group as inspiration.  After presenting a number of concepts the third phase of the workshops then asked groups to select their favourite idea and develop this further by answering the questions ‘Who is it for?’, ‘What is it?’, ‘When can will it be used?’, ‘Where can it be used?’ and ‘How does it work?’. Participants were encouraged to develop ideas on large sheets of paper, through writing and/or drawing (Figure 2B).  A single representative of each group was then asked to present their idea to all participants and researchers, and a single ‘display’ board of their idea was mounted on a wall. Once all ideas had been presented participants were given 3 stickers to prioritize ideas by voting for their favourite (Figure 2C). The three stickers enabled people to give a certain idea more weight if they felt strongly about it. Workshops concluded by thanking participants for attending and the contributions they made and providing them with an informal certificate of participation."}