{"id": "S0168874X14001577", "article": "MAIN-TITLE On numerical solution of elastic–plastic problems by using configurational force driven adaptive methods   HIGHLIGHTS          Configurational force based adaptive method is proposed for elastoplastic problems.      Three different approaches are examined.      Three test problems are investigated to validate the method.      These methods are improve the accuracy of the FE computation.      Results are compared to each other in terms of efficiency.          KEYPHRASES   Configurational force  Plasticity  Adaptivity   Configurational mechanics, presented by Eshelby in the early fifties, is widely used in several areas of theoretical continuum mechanics and computational mechanics (see [8,10]). The configurational force (or often called material force) describes the change in energy of a given system with respect to the configuration. This means that the energy change caused by the reposition of an inhomogeneity inside the material could be considered as a force on it. The configurational force method is widely used in context with finite elements. One of these applications is the configurational force driven finite element mesh refinement. The so-called r-adaptive FE mesh refinement strategy was introduced by Braun [2] followed by several papers using the concept of configurational forces to drive h- and rh-adaptive procedures for purely elastic problems [13,15,23]. Braun׳s method is based on the property that the configurational force [10] must be zero in the interior of the homogeneous material [13]. However, finite element computations do not fulfill this requirement and nodal configurational forces appear on interior nodes too. These vectors are the gradient of the total potential of the system indicating the dependence of the solution on the initial nodal configuration. When an optimal mesh is used, internal configurational forces vanish and the total potential of the structure is minimal. Since these error configurational force vectors point in the direction of increasing total potential, moving the nodes in the opposite direction yields the optimal mesh structure. These methods were demonstrated in several articles for the elastic case, e.g. [2,9,13,14]. Some numerical shape and structural optimization techniques are also based on this theory. Furthermore, as the configurational force indicates the error on finite element meshes, computation of this quantity is also suitable to drive h-adaptive mesh refinement [13] and there are a few examples in the literature for the application of hp-refinement strategy [23]. Most of these papers are dealing with elastic deformation but configurational forces can also be computed in elastic–plastic case for small strains [20] or even in the case of a large strain formulation [17,18,21]. Examples for elastic–plastic problems can also be found in [24]. Remarkable practical applications of configurational forces appear in the field of non-linear fracture mechanics by the numerical computation of the J-integral, as can be seen in papers of Nguyen et al. [22] and Simha et al.[24].  This paper shows that configurational force based adaptive mesh refinement strategies are also applicable in the case of elastic–ideally plastic deformation. The material equilibrium equation that must be fulfilled to reach optimal mesh configuration is different from the elastic case. The plastic part of configurational forces becomes zero in the purely elastic domain. In the following, small strain is considered. For validation of the finite element results a few examples, which have analytical solution, are also presented. These kind of solutions are very limited in case of elastic–plastic problems. The first test problem is a thick-walled cylinder subjected to internal pressure. A closed-form solution to this problem has been derived by Hill [6], and it can also be found in the literature, e.g., Chakrabarty [3], Lubliner [12]. In this example, we derive an analytical expression for the volume configurational force to validate the proposed algorithm. The second example analyses an infinite plate with a circular hole loaded by biaxial tension. The material is modelled as elastic–perfectly plastic with the Tresca yield criterion. This problem has an analytical solution with certain limitation presented by Galin [5]. The third example is an infinite elastic–plastic wedge, loaded by a uniformly distributed shear on its edge. The wedge problem was investigated by Naghdi et al. [19] subjected to different loading conditions and yield criteria.  In this contribution, a novel solution is proposed that is new to the best of our knowledge. In the wedge problem, the stress state depends on a single variable in cylindrical coordinate system. However, the presence of a singular point at the corner of the wedge makes this example excellent to demonstrate adaptive methods. The solution for the stress field is given in the Appendix. This paper is organized as follows. The theoretical background of computing the configurational forces is presented in the second section. The third section briefly summarizes the finite element computation technique of nodal error configurational forces. In the fourth chapter analytical volume configurational forces are presented through the test problems mentioned above. On these examples the configurational force driven r-, h- and rh-adaptive methods are demonstrated.   Notations: Σ , σ — second order tensors, G , g —vector quantities, div ( ⁎ ) —the divergence of ⁎, δ —second order identity tensor, grad ( ⁎ ) —gradient operator, a , b , c , α , β , γ —scalar quantities ,   •   ¯   —complex conjugate of a given quantity. The superscripts T and −1 denote transpose and inverse, and the following symbolic operations apply: a · b =   a   i     b   i   ,   ( A · b )   i   =   A   ij     b   j   , A : B =   A   ij     B   ij   .  In this section, the governing equations of the configurational force are recapitulated for linear elastic and elastic–perfectly plastic material models at small deformation. This outline follows the treatments of Gross et al. [7], Müller et al. [16], and Simha et al. [24].   Elastic domain: The concept of the configurational force can be described as an energy change in the system considered with respect to its configuration (e.g. Kienzler and Herrmann [10]). Therefore, the gradient of strain energy density function for linear elastic, isotropic and inhomogeneous material can be expressed as  (1)    ∂ W   ∂ x   =   ∂ W   ∂ ϵ   :   ∂ ϵ   ∂ x   +      ∂ W   ∂ x    |   explicit   ,   where ϵ is the linear strain tensor, and the subscript explicit denotes the explicit derivative of W with respect to the position vector x .  The elastic constitutive law is defined by  (2)  σ =   ∂ W   ∂ ϵ   ,   where σ is the symmetric stress tensor.  By using this relationship, the Eq. (1) takes the form  (3)    ∂ W   ∂ x   = σ : grad  ϵ +      ∂ W   ∂ x    |   explicit   ≡ σ : (  grad  grad  u  ) +      ∂ W   ∂ x    |   explicit   ,   where u is the displacement field.  The equilibrium equation can be written as  (4)  div  σ + f = 0 ,   where f denotes the physical body (or volume) force.  Then, combining (3) and (4), and using the following two relationships  (5)  div (   grad   T    u · σ ) = σ : ( grad  grad  u ) +   grad   T    u · div  σ ,   and  (6)    ∂ W   ∂ x   ≡ grad  W = div ( W δ ) ,   we obtain  (7)  div   (   W δ −   grad   T   u · σ   ︸   )   Σ   + (      −   grad   T   u · f −      ∂ W   ∂ x    |   explicit     ︸     g    ) = 0 ,   where Σ is the Eshelby stress tensor and g is the configurational body force. If the physical body force, f is zero, and a homogeneous body is considered, the vector g becomes zero [24].  Finally, we assume that g = 0 , and the function W is defined by  (8)  W =    1   2    σ : ϵ .   Then, the configurational force can be obtained by integrating the first term given in Eq. (7) over the elastic   Ω   e   domain  (9)  G =    ∫      Ω   e     div [    1   2   ( σ : ϵ ) δ −   grad   T   u · σ  ] dV = 0 .       Elastic–plastic domain: In the classical theory of plasticity, the total strain is assumed to be the sum of the elastic and plastic strain  (10)  ϵ =   ϵ   e   +   ϵ   p   ,   and, in the case of elastic–perfect plastic materials without hardening, the strain energy density function, W depends only on the elastic strain (see e.g. [16,24]), namely  (11)  W =   W   e   (   ϵ   e   ) .   Recall the elastic constitutive relation given by the expression  (12)  σ =    ∂ W   ∂   ϵ   e      .   Then, the gradient of W, using (10) is given by  (13)    ∂ W   ∂ x   =   ∂ W   ∂   ϵ   e     :   ∂   ϵ   e     ∂ x   = σ : grad    ϵ   e   = σ : grad  ϵ − σ : grad    ϵ   p   = σ : ( grad  grad  u ) − σ : grad    ϵ   p   .   Note that the quantity associated with the explicite derivative of W with respect to the position vector x is also omitted (homogeneous material).  Eq. (13), using (4)–(6), can be rewritten in the following form  (14)  div [    1   2    ( σ :   ϵ   e   ) δ −   grad   T   u · σ ] + σ : grad    ϵ   p   = 0 .   It is noted here that the strain energy density function is defined by W =    1   2    σ :   ϵ   e   , and the body force f = 0 as before.  By integrating (14) over the plastic domain   Ω   p   , we derive the formula  (15)     ∫      Ω   p     div [    1   2   ( σ :   ϵ   e   ) δ −   grad   T   u · σ  ] dV +    ∫      Ω   p     σ : grad    ϵ   p    dV = 0 .   We introduce the following notations:  (16)    G   Σ   =    ∫      Ω   p     div [    1   2   ( σ :   ϵ   e   ) δ −   grad   T   u · σ  ] dV ≡    ∫      Ω   p     div  Σ  dV   and  (17)    G   p   =    ∫      Ω   p     σ : grad    ϵ   p    dV ≡    ∫      Ω   p       g   p    dV .   Then, the equation  (18)    G   Σ   +   G   p   = 0   is not fulfilled exactly due to the numerical errors in the finite element approximation. Therefore, the configurational force induced by this error is defined as  (19)    G   error   =   G   Σ   +   G   p   ≠ 0 .      The numerical implementation and the computational application of this expression is illustrated in more detail in the following sections.  In this section, the concept of the configurational force driven mesh refinement is presented. Based on the expressions shown in Section 2, the numerical computation is straightforward. The evaluation of the configurational forces is entirely a post-processing procedure. The main issues are provided in detail in the followings.  The first step to compute nodal configurational forces is to evaluate first and second part of the expression (14). The sum of them gives the error configurational volume force. Discrete nodal configurational forces are obtained by numerical integration using Gaussian quadrature. The nodal values of the plastic strain are projected from the integration points by the interpolation functions   N   j   ( ξ , η ) . Gauss point quantities   ϵ   gp   can be obtained from nodal quantities   ϵ   nodal   when 4 noded quadrilaterals and 4 point integration rule are used as  (20)    ϵ   nodal   =   T   − 1     ϵ   gp   ,   where  (21)    T   ij   =   N   j   (   ξ   i   ,   η   i   ) ,   and   ξ   i   ,   η   i   are the local coordinates of the i-th integration point. When the 8 noded quadratic element is used, only the corner nodes are considered. The nodal results obtained from adjacent elements are averaged. The basic finite element computations are performed by the HYPLAS software [4]. The Eshelby tensor in (16) can be expressed by  (22)    [       Σ   x         Σ   y         Σ   xy         Σ   yx       ]   I   =   [       1   2   (   σ   x     ε   x   e   +   σ   y     ε   y   e   +   τ   xy     γ   xy   e   ) −   σ   x     ∂ u   ∂ x   −   τ   xy     ∂ v   ∂ y         1   2   (   σ   x     ε   x   e   +   σ   y     ε   y   e   +   τ   xy     γ   xy   e   ) −   σ   y     ∂ v   ∂ y   −   τ   xy     ∂ v   ∂ x       −   σ   y     ∂ v   ∂ y   −   τ   xy     ∂ u   ∂ x       −   τ   xy     ∂ v   ∂ y   −   σ   x     ∂ v   ∂ x       ]   I   .   The elastic term of configurational force, which is the integral of the divergence of the Eshelby tensor over volume can be written as  (23)    G   Σ   I   =   ∫   V   [       ∂   N   I     ∂ x     Σ   x   I   +   ∂   N   I     ∂ y     Σ   xy   I         ∂   N   I     ∂ x     Σ   yx   I   +   ∂   N   I     ∂ y     Σ   y   I       ] dV .   The gradient of the plastic part of the strain tensor in (17) for a given node can be obtained in the following form:  (24)    ( grad    ϵ   p   )   I   =   D   I   ·   ϵ   pI    where   D   I   = [       ∂   N   I     ∂ x     0   0     0     ∂   N   I     ∂ x     0     0   0     ∂   N   I     ∂ x         ∂   N   I     ∂ y     0   0     0     ∂   N   I     ∂ y     0     0   0     ∂   N   I     ∂ y       ]  and    ϵ   pI   = [       ε   x   pI         ε   y   pI         γ   xy   pI       ] .   The plastic part of the volumetric configurational force is  (25)    g   p   I   = [       σ   x       σ   y       τ   xy     0   0   0     0   0   0     σ   x       σ   y       τ   xy       ] ·   ( grad    ϵ   p   )   I     and, thus, the nodal configurational force via numerical integration over the element is expressed as  (26)    G   p   I   =   ∫     V   element       g   p   I    dV .   The global nodal error configurational force can be assembled from the adjacent elements as  (27)    G   err   N   =   ∑   elements   (   G   Σ   I   +   G   p   I   ) .   Using the nodal configurational forces the r-adaptive refinement is driven according to expression  (28)    X   new   =   X   old   − c   G   err   free   ,   where c is an appropriately selected parameter, which drives the changes in nodal positions and X contains the nodal coordinates. The value of ccan be a small fraction of the quotient of the maximal configurational force norm and the minimal element size. This expression is only applicable on free degrees of freedom; which means that the boundaries of the model have to remain intact during the mesh reconfiguration. In the case of h-adaptive method, the local mesh refinement is also driven by the norm of nodal configurational forces. When the value of this norm exceeds a required limit, than it is necessary to refine the mesh around the nodes in question. Using notation according to [13] the new element size around the vicinity of a given node is  (29)    h   new   →   h   old   r ,   where r is a mesh refinement factor, which can be constant or proportional to the error measure. This two approaches can be combined when local mesh refinement is followed by the nodal reconfiguration or vice versa.  Here three numerical problems are presented to demonstrate the adaptive schemes described earlier. At first, a thick walled tube is examined to validate the finite element computation. The second one is Galin׳s solution on an infinite rectangular plate with a circular hole subjected to biaxial tension under plane strain condition [5]. In the third test problem, an infinite wedge subjected to shear loading along one of its edges is examined, plane stress state and von Mises yield criterion are assumed. Expressions of the stress field are given in the Appendix.  The analytical solution for elastic–plastic deformation of a thick walled tube loaded by internal pressure is well known [12]. This is a very simple problem that only depends on the radial component of the polar coordinate system. This allows the analytical computation of configurational volume forces that validates the finite element procedure. The model and the material parameters are the following: the inner and outer diameters are a=50mm and b=100mm. The internal pressure, Young׳s modulus, and the Poisson׳s ratio are p=100MPa, E=200GPa and ν = 0.3 , respectively. The finite element solution is carried out by using a single row of quadratic and axisymmetric quadrilateral elements. In the following equation c is the radius of the elastic–plastic boundary. Elastic–ideally plastic material, plane strain and the Tresca yield criterion is considered when k=150MPa. Stress and strain distributions [3] in the plastic zone in polar coordinate system are  (30)    σ   r   = − k (  1 −     c   2       b   2     + ln [      c   2       r   2      ]  ) ,    σ   θ   = k (  1 +     c   2       b   2     + ln [      c   2       r   2      ]  ) ,   σ   z   = 2 · ν · k (      c   2       b   2     − ln [      c   2       r   2      ]  ) ,   and  (31)    ε   r   =   ∂   u   p     ∂ r   ,    ε   θ   =     u   p     r   ,    ε   z   = 0 ,   where the displacement function relating to the plastic domain is  (32)    u   p   = r ( 1 − ν )   k ·   c   2     G ·   r   2     + r ( 1 − 2 ν )     σ   r     2 G   .   According to these solutions the configurational volume force by analytical evaluation of the two parts of (12) is given by  (33)    g   r   p   =   8   c   2     k   2   (   ν   2   − 1 )     r   3   E   .   The other components are zero due to the symmetry conditions except the radial component. The graph of this function compared to the numerical solution is shown in Fig. 1 . The difference between the two quantities indicates the error of the mesh.  Discrete error configurational forces are shown in Fig. 2 . After 35 iteration steps with 10 elements along radial direction of the wall, the error decreased significantly in the plastic zone as double element density was used.  The solution of this problem is originated from the work of Galin [5]. Recent papers also deal with Galin׳s solution [25], typically as a benchmark problem [26]. Attempts towards the generalization of the problem also occurred [11]. However, Galin׳s technique appears to be unique. These results are related to an infinite plate with a circular hole subjected to unequal biaxial loading at infinity and pressure on the hole boundary. Plane strain condition and Tresca׳s yield criterion were assumed. The model used for the finite element analysis is shown in Fig. 3 (a). Due to the symmetry, only a quarter of the plate is modelled. The analytic solution for stress components is given by the solution of two complex equations, in the elastic zone according to [3] expressed by  (34a)    σ   y   −   σ   x   + 2 i   τ   xy   = 2 k [      z   ¯     z   −   ζ     ζ   ¯     (        ζ   ¯     2   + m     ζ   2   − m    ) +   1 + m   ζ   2       ζ   2   − m    ] ,      (34b)    σ   x   +   σ   y   = − 2 p + 2 k [  1 + ln (    1     R   2       z   z   ¯     ζ   ζ   ¯      )  ]   and in the plastic domain  (35a)    σ   y   −   σ   x   + 2 i   τ   xy   = 2 k     z   ¯     z   ,      (35b)    σ   x   +   σ   y   = − 2 p + 2 k (  1 + ln   z   z   ¯       R   2      ) .      In the given equations  (36)  m =     σ   y   ∞   −   σ   x   ∞     2 k   ,  c = R  exp (      σ   x   ∞   +   σ   y   ∞     4 k   −   1   2   −   p   2 k    ) , ζ =   z   2 c   +     (    z   2 c    )   2   − m   ,     z = x + iy is the complex variable and   z   ¯   = x − iy is its conjugate. The solution can be achieved in the following way. The real part of (34a) is equal to the difference of σ  y and σ  x , and (34b) is the sum of them. These two equations yield the two normal stress components. The imaginary part of (34a) yields the shear stress. The solution is similar in the plastic zone. The z component of the stress tensor is obtained using the equation  (37)    σ   z   = ν (   σ   x   +   σ   y   )   in the elastic and plastic domains. Analytical solution exists under special loading conditions (see Fig. 3b) [3] when the shape of the elastic–plastic boundary is an ellipse. Additionally, the plastic zone must surround the hole completely when the plastic domain emerges. The internal pressure is zero in our case. This means that the inequality  (38)    A + B   2 k   + 2  ln [  1 − |    B − A   2    |  ] ≥ 1   must be fulfilled. In case of admissible loading the semi-axes of the elliptic boundary of the plastic zone is  (39)  a = c ( 1 + β ) ,  b = c ( 1 − β ) .   In this example, the components of the stress field prescribed at infinity are   σ   x   ∞   = 350  MPa and   σ   y   ∞   = 322  MPa . These values yield a proper elliptical plastic zone around the hole. The material parameters are E=200GPa, ν = 0.3 , and the yield stress is   σ   Y   = 300  MPa . In the equations k =   σ   Y   / 2 . The dimensions are a=10mm and r = 0.2  mm . The stress distribution in cylindrical coordinates along the edge of the model in the vicinity of the hole is shown in Fig. 4 . In the finite element analysis, linear, four noded quadrilateral elements are used. In order to avoid significant inaccuracies, restrictions were made not to exceed an allowed element distortion. Further distortion by r-refinement is banned if the angle and the ratio of the element diagonals are 68 ≤ β ≤ 112 and 0.796 ≤   d   1   /   d   2   ≤ 1.3 , respectively. The error in stress defined by the formula  (40)  error = [      (   σ   a   −   σ   num   ) : (   σ   a   −   σ   num   )       σ   Y      ] .   This quantity shows the difference between the analytically and numerically evaluated stress tensors directly.  At first, the r-adaptive strategy is examined according to Eq. (28) with almost uniform element distribution. This method can be applied as long as the element distortion does not reach a critical value. The nodes are moved in opposite direction of error configurational forces with the same displacement in each step, which is 0.02   h   min   , where h  min is the minimal element length of the initial mesh. The change in the error of the stress tensor is shown in Fig. 5 for different mesh densities. The graph shows the maximal error along the boundary of the hole. The nodal repositioning significantly decreases the error even for linear elements. The disadvantage of this method is that the model needs to be solved several times to establish the optimal nodal configuration. This could demand a notable computational effort for elastic–plastic analysis where the solution is path dependent and it goes through several load increments to get the results.  The second strategy examined here is the h-adaptive method given by Eq. (29). The indicator of the refinement is the norm of nodal configurational error forces. If the value of this error on a given node exceeds a critical value the mesh will be refined around that location. In this example the norm of the critical error force is | G   |   crit   = 0.004 N . The mesh refinement factor is r = 1 / 3 . The error of the stress tensor along a given path with uniform and h-adaptive mesh refinement is shown in Fig. 6 .  The result clearly shows that by using h-adaptivity the accuracy of the solution significantly increased, while the degrees of freedom notably decreased. The advantage of this method is that the final result can be achieved after a few steps while using r-adaptivity it could take hundreds of steps depending on the value of the control parameter.  The combination of the two methods described earlier is the so-called rh-adaptive procedure. This means that the meshes obtained by h-adaptive strategy can be refined further by moving nodes according to the r-adaptive method. This requires more computational effort but the results are better in accuracy with relatively low element number. The results of this method are shown in Fig. 7 . The global measure of error is shown in Fig. 8 . The error computed on nodes is the norm of the difference of stress tensors integrated over the elements. The sum of these element errors gives the global error measure. During the evaluation of error only those elements are taken into account, which are located less than r=1.2mm from the origin. This restriction is necessary to emphasize the critical domain where most of the error occurs (i.e. the vicinity of the central hole). Most part of the FE mesh is only necessary to model the condition of the infinite plate. It is important to mention that the transition between mesh segments with different densities could contain highly distorted elements locally decreasing the accuracy. By using higher order elements this phenomenon can be reduced.  Different mesh configurations used by different adaptive techniques are shown in Fig. 9 .  This problem was examined by Naghdi et al. [19] during the 1950s. He and his co-workers elaborated analytical solutions for different geometric and loading conditions during elastic–plastic deformation. In this contribution, an infinite quarter plate (the angle of the wedge is 90°) is subjected to distributed shear loading along its vertical edge (see Fig. 10 ). Plane stress condition and von Mises yield criterion are assumed. The expressions calculating the stress field used in this test problem are placed in the Appendix.  According to Fig. 10 the loading is S=108MPa, the Young׳s modulus is E=200GPa, the Poisson׳s ratio is ν = 0.3 , the yield stress is   σ   F   = 200  MPa and the boundary in r=50mm is fixed. The analytical solution is related to an infinite plate; therefore, the numerical solution is only valid in the vicinity of the corner, far enough from the constraints. In the following section, only a small square is considered with an area of a × a = 1    mm   2   . At the given load level two different plastic zones appear. The angles are the root of the  (41)  3  sin (   θ   p 1   −   θ   p 2   )  sin (   θ   p 1   +   θ   p 2   ) + 4 (   θ   p 1   −   θ   p 2   ) cot (   θ   p 1   +   θ   p 2   ) = 0   transcendental equation. The numerical solution yields   θ   p 1   = 0.844275 and   θ   p 2   = 0.187353 . The corner of this wedge is a special point. Along the vertical edge of the corner element a shear stress is given while the neighboring horizontal edge is stress free. This indicates that the duality of the shear stress seems to be compromised. For the finite element analysis, eight noded quadrilateral serendipity elements are used. Fig. 11 shows h-refined meshes. It can be seen that maximal error configurational forces arise on the elastic–plastic boundaries and in the vicinity of the corner. After a few refinement steps, the elastic–plastic phase boundary is clearly visible.  This can be emphasized further by a higher initial mesh density (see Fig. 12 ) that is more suitable for the given problem. In this case the mesh refinement only occurs along the elastic–plastic boundary allowing a more precise stress–strain evaluation. The element distortion between regions with different mesh densities is also an issue with higher order elements, but the discussion of this problem is not in the focus of this investigation.  Results for the error are shown in Table 1 . The computation of the errors is done according to expression (40).   CONCLUSION   This work demonstrates r-, h and rh-adaptive finite element mesh refinement methods based on numerical configurational force computation. A brief concept of these methods are introduced and discussed by three different elastic–plastic plane problems that have analytical solution for stress and strain distribution. The so-called r-adaptive scheme, first proposed by Braun [2], is also applicable for elastic–plastic analysis. The computation of nodal error configurational forces is slightly different from the purely elastic case. However, application of this method requires more computation time since the optimal nodal configuration can only be achieved through iteration and it is necessary to solve the original problem in each step. For elastic–plastic analysis, this is done through several increments. A more promising approach is to use configurational forces as error indicator for h-adaptive scheme. In case of h-adaptivity the size of the problem is larger than in r-adaptivity, but only a few (or only one) iteration step could be enough to achieve the required precision. The rh-adaptive strategy combines the benefits of the two methods.  The yield condition is given by  (A.1)    σ   r   2   +   σ   θ   2   −   σ   r     σ   θ   + 3   τ   r θ   2   −   σ   F   2   = 0 ,   and the equilibrium equations in cylindrical coordinate system are defined as  (A.2a)    ∂   τ   r θ     ∂ θ   +   σ   r   −   σ   θ   = 0 ,      (A.2b)    ∂   σ   θ     ∂ θ   + 2   τ   r θ   = 0 .   Expressing   τ   r θ   by (A.2b) and σ  r by (A.2a) then substituting into (A.1) yields  (A.3)    (      ∂   2     σ   θ     ∂   θ   2      )   2   + 2   σ   θ       ∂   2     σ   θ     ∂   θ   2     + 3   (    ∂   σ   θ     ∂ θ    )   2   + 4   σ   θ   2   − 4   σ   F   2   = 0 ,   whose solution is  (A.4)    σ   θ   ( θ ) =   3   σ   F     2   2       C   1   −     σ   F     2   6      sin  2 ( θ +   C   2   )   8 − 9   C   1   2     .   This expression is valid in the two plastic domains, only the integration constants are different. Constants can be obtained from boundary conditions which are     C   1   =     2       σ   F   2   − 3   S   2       3   σ   F     ,    C   2   =   1   2   [  arccos (  −   2 S       σ   F   2   +   S   2        ) − π  ]   in the first, and     C   1   = −     2     3   ,    C   2   = −   π   4     in the second plastic zone, respectively. The stresses in the elastic zone are computed according to [1]. Constants are calculated from the boundary conditions written for the elastic–plastic boundaries. When the expressions for stresses are briefly summarized for elastic and plastic zones, they have the following form:  (A.5)    σ   r   e   = 2 ( B + A θ − C  cos  2 θ − D  sin  2 θ ) ,      (A.6)    σ   θ   e   = 2 ( B + A θ + C  cos  2 θ + D  sin  2 θ ) ,      (A.7)    τ   r θ   e   = − A − 2 D  cos  2 θ + 2 C  sin  2 θ ,      (A.8)    σ   r     p   1     =   σ   F   (   1 − 3   ξ   2        sin   2   θ + ξ  sin  2 θ ) ,      (A.9)    σ   θ     p   1     =   σ   F   (   1 − 3   ξ   2        cos   2    θ − ξ  sin  2 θ ) ,      (A.10)    τ   r θ     p   1     =    1   2      σ   F   ( 2 ξ  cos  2 θ +   1 − 3   ξ   2     sin 2 θ ) ,      (A.11)    σ   r     p   2     = −   σ   F      cos   2    θ ,      (A.12)    σ   θ     p   2     = −   σ   F      sin   2   θ ,      (A.13)    τ   r θ     p   2     =    1   2      σ   F    sin  2 θ ,   where  (A.14)  ξ =   S     σ   F     ,  A =   1 − 3   ξ   2       a   1   + ξ   a   2   +   a   3   ,  B =   1 − 3   ξ   2       b   1   + ξ   b   2   +   b   3   , C =   1 − 3   ξ   2       c   1   + ξ   c   2   +   c   3   ,  D =   1 − 3   ξ   2       d   1   + ξ   d   2   +   d   3   .   and   Δ θ =   θ     p   1     −   θ     p   2     ,  q =     csc   2   ( Δ θ )   σ   F     16 − 16 Δ θ  cot  Δ θ   ,   a   1   = − 8 q  sin  Δ θ  cos    θ     p   1      cos    θ     p   2     ,   a   2   = −   a   1   ( tan    θ     p   1     + tan    θ     p   2     ) ,    a   3   =   a   1    tan    θ     p   1      tan    θ     p   2     ,         b   1   = 2 q  cos    θ     p   1     ( 2   θ     p   1      sin    θ     p   1     + 2   θ     p   2      sin  (   θ     p   1     − 2   θ     p   2     ) + cos    θ     p   1     − cos  (   θ     p   1     − 2   θ     p   2     ) ) ,      (A.15)    b   2   = 2 q ( − sin  2   θ     p   1     + sin  2   θ     p   2     + 2   θ     p   1      cos  2   θ     p   1     − 2   θ     p   2      cos  2   θ     p   2     ) ,   b   3   = 4 q  sin    θ     ep   2     ( sin  Δ θ  cos    θ     p   1     −   θ     p   1      cos ( 2   θ     p   1     −   θ     p   2     ) +   θ     p   2      cos    θ     p   2     ) ,   c   1   = 2 q  cos    θ     p   1     ( − 2 Δ θ  sin    θ     p   1      cos  2   θ     p   2     + cos    θ     p   1     − cos  (   θ     p   1     − 2   θ     p   2     ) ) ,   c   2   = 2 q ( sin  2 Δ θ − 2 Δ θ  cos  2   θ     p   1      cos  2   θ     p   2     ) ,   c   3   = 4 q  sin    θ     p   2     ( Δ θ  cos  2   θ     p   1      cos    θ     p   2     −  sin  Δ θ  cos    θ     p   1     ) ,   d   1   = − 4 q  cos    θ     p   1      cos    θ     p   2     ( sin    θ     p   2     ( 2 Δ θ  sin    θ     p   1     + cos    θ     p   1     ) − sin    θ     p   1      cos    θ     p   2     ) ,   d   2   = 2 q ( − 2 Δ θ  sin  2   θ     p   2      cos  2   θ     p   1     + cos  ( 2 Δ θ ) − 1 ) ,   d   3   = 4 q  sin    θ     p   1      sin    θ     p   2     ( cos    θ     p   1     ( 2 Δ θ  cos    θ     p   2     +  sin    θ     p   2     ) − sin    θ     p   1      cos    θ     p   2     ) .       REFERENCES", "highlights": "In this paper, the concept of configurational forces is introduced in the context of finite element mesh refinement for elastic–ideally plastic problems. This paper also includes the numerical computation of configurational forces in the elastic and plastic domains. Methods are demonstrated on three plane problems where the analytical solution is available. The first example is a thick-walled tube loaded by internal pressure. This simple, one dimensional problem allows computation of configurational volume forces analytically to validate the finite element (FE) results. The second example is Galin׳s problem that involves an infinite plate with a circular hole loaded by biaxial tension at the infinity. This is a two dimensional problem for which the analytical solution is known with some restrictions for elastic–ideally plastic case when Tresca yield criterion is considered. The last example introduces another plane problem that follows Naghdi׳s solution on infinite wedges. For this, a new analytical solution is presented for plane stress state using von Mises yield criterion with a uniform shear loading along the boundary. R-, h-, and combined adaptive procedures are demonstrated on the above examples. Since exact stress fields are known, the norm of the difference between numerical and analytical solutions is used as the measure of error."}