{"id": "S0168874X14002224", "article": "MAIN-TITLE Calibration of the continuous surface cap model for concrete   HIGHLIGHTS          MAT145 in LS-Dyna is calibrated for a wide range of concretes.      Only uniaxial compression strength and the maximum aggregate size are required.      Other parameters are automatically generated.      The prediction agrees well with the results of material test and impact test of RC beam.      A comparison between the MAT 145 and MAT 159 for concrete is provided.          KEYPHRASES   Concrete  Constitutive model  Numerical simulation  LS-DYNA  MAT 145  MAT 159   Arguably one of the most widely used man-made materials, concrete underpins the performance and safety for key structures relevant to civil engineering, onshore and offshore engineering, nuclear facility protection and many others. The dynamic responses of concrete when subjected to impact or blast loads are of particular importance in many of these engineering fields, and relevant research has hence attached much interest. Computer modeling has now been widely adopted as a cheap and effective way in assisting the design of (reinforced) concrete structures under those extreme loads. Among many key ingredients that affect reliable and accurate predictions by a numerical tool, an appropriately developed and calibrated constitutive model to describe the dynamic behavior of concrete subjected to dynamic loads plays a core role.  There have been a good number of constitutive models developed in the literature for concrete, with forms ranging from relatively simple to more sophisticated (see a recent review in [1,2]). They have also been implemented in commercial software such as LS-DYNA [3], AUTODYN [4] and ABAQUS/explicit [5]. These models can be generally divided into three categories according to how the plastic deformation is calculated. Category one normally adopts an associated flow to calculate the plastic strain increment, and may capture the plastic volume expansion (dilatancy) [6] caused by shear loading at low confining pressure. It considers coupled volumetric and shear behavior (i.e. shear enhanced compaction and pressure dependence of shear strain) of concrete. Typical examples of this category include the geologic cap (MAT 25), Schwer Murray Cap, also called continuous surface cap (MAT 145), CSCM Concrete (MAT 159), Mohr Coulomb (MAT 173), and Druker Prager (MAT 193) [3]. Category two generally employs the Prandtl–Reuss flow theory (where the Von Mises criterion is used as the plastic potential) to calculate the plastic strain increment. The plastic volume strain is obtained from the equations of state (EOS), and the plastic volume strain increment is independent of the incremental flow rule (the Prandtl–Reuss flow theory). Since shear and volumetric behaviors are decoupled, the phenomenon of shear dilation cannot be captured. Typical models belong to this category are the soil and form (MAT 5/14) [3], pseudo tensor (MAT 16) [3], concrete damage (MAT 72) [3,7], Winfrith concrete (MAT 84/85) [3,8], Johnson Holmquist concrete (MAT 111) [3,9], RHT (MAT 272) [3,10] and so on. Those models have been widely used to model concrete under high impact loads. The third category commonly assumes a non-associated flow in calculating the plastic strain increment. With a different plastic potential surface than the yield surface, the shear dilatancy can be well controlled. A typical example of this category is the plastic-damage model [5,11].  When concrete is subject to low velocity impact, there are typical features needing to be captured by a model, such as shear enhanced compaction, dilatency before and after peak strength, pre-peak hardening, post-peak softening, modulus reduction/stiffness degradation under cyclic loading, irreversible deformation, and localized damage accumulation [12,13]. With a sound theoretical basis, the MAT 145 available in LS-DYNA can well capture those behaviors together [3]. However, it has not been as popular as simple ones such as the MAT 72, MAT 84/85 and the MAT 111 in engineering application, due primarily to the complexity of the model with many material parameters involved. For example, a total of 17 material parameters is required to be provided by the user in this model to define the shear and cap surface, which demands exceedingly complicated experiments ranging from uniaxial compression, uniaxial tension, triaxial compression (TXC), torsion (TOR), triaxial extension (TXE) and hydrostatic test to be conducted for their calibration, which greatly limits the practical applicability of the model. On the other hand, a “sister” model-MAT 159 [3,14,15], with internal material parameters generation based upon the unconfined compression strength   f ′   c   of concrete, aggregate size and the units has been included in LS-DYNA since version 971. This model uses the same methodology as the MAT 145 to predict the behavior of concrete before peak strength, and is different from the latter in terms of strain (post peak) softening portion for example the evolution of the both brittle damage and ductile damage norm. A comparison between the MAT 159 and MAT 145 will be provided in this research.  Indeed, similar issue exists for the MAT 72 which has a total of 49 user defined parameters. Karagozian & Case [16,17], Markovich et al. [18] managed to offer an approach of automatically generating these parameters based on the unconfined compressive strength of concrete, which considerably facilitates the easy use of the MAT 72 model.  The present study aims to develop a calibration procedure to facilitate the MAT 145 to be effective used for occasional users of LS-DYNA, in attempting to achieve the same goals as mentioned above of various studies for the MAT 72. A systematic approach will be proposed to determine the material parameters of the MAT 145 based on   f ′   c   of a concrete, and the maximum aggregate size according to the formulas provided in the CEB–FIP code [19] as well as other empirical formulas in the literature [20,21] which will be entailed in the sequel.  To facilitate the calibration of the MAT 145, a brief overview of the model is presented in this section. The MAT 145, proposed originally by Schwer and Murry [22–26], is also called the Schwer Murry Cap or continuous surface cap model in LS-DYNA material library. It is indeed a three-invariant extension of the MAT 25 [3]. This model includes a smooth failure surface and employs damage mechanics to model the strain softening and modulus degradation in both tensile and compression regimes as well as viscoplasticity for strain rate effects. It treats plastic flow and damage accumulations as separate processes based on effective stress concept and the hypothesis of strain equivalence in continuum damage mechanics (CDM). It is assumed that plastic flow, controlled by the shear stresses, may result in permanent deformation without causing degradation of elastic moduli. Meanwhile, damage is assumed to result in progressive degradation of the moduli and strength observed on the macroscale due to the propagation and coalescence of microcracks, microvoids and similar defects in the microstructural level of the material. An elliptical cap surface is added to model the plastic volume change related to pore collapse in concrete material. Besides concrete, it is capable of modeling geomaterials including soils and rock [3] and hence is indeed robust and versatile. The paper highlights its use for concrete only.  The model is featured by a combined yield surface of a shear failure surface   F   f    (    I   1    )  and a cap surface   F   c    (    I   1   ,  κ  )  , with a continuous and smooth connection between the two as shown in Fig. 1a. The influence of the third deviatoric stress invariant on the shear failure of a material, as suggested by Rubin [27], has also been taken into account.  The yield surface shown in Fig. 1a can be mathematically described by a combination of two functions as follows:  (1)  f  (    I   1   ,   J   2   ,   J   3   , κ  )  =   J   2   −   R   2    (    I   1   ,   J   3    )    F   f   2    (    I   1    )    F   c    (    I   1   , κ  )    where   I   1   denotes the first invariant of stress tensor defined as   I   1   =   σ   i i   ,   J   2   is the second invariant of deviator stress tensor defined as   J   2   =   S   i j     S   i j   / 2 and the deviator stress tensor   S   i j   can be linked to the stress tensor   σ   i j   by   S   i j   =   σ   i j   −   σ   i i     δ   i j   / 3 , and   J   3   =   S   i j     S   j k     S   k i   / 3 is the third invariant of deviator stress tensor; κ is cap hardening parameter, R  (    I   1   ,   J   3    )  is the Rubin scaling function, the detailed documentation can be found in Ref. [27].  In the model, shear failure along the compression meridian is defined in terms of   I   1   as an exponential function  (2a)    F   f   (   I   1   ) = α − γ exp  (  − β   I   1    )  + θ   I   1     where the material parameters α ,  β ,  γ and θ are evaluated by fitting experimental peak stress     J   2     versus   I   1   from TXC test.  The shear curve for the stress states other than TXC is scaled by the Rubin scaling function R  (    I   1   ,   J   3    )  (a general Lode dependence in the deviatoric plane) [28], e.g., via R  (    I   1   ,   J   3    )    F   f    (    I   1    )  . Then the strength in TOR and TXE can be expressed by the product   Q   1     F   f    (    I   1    )  and   Q   2     F   f    (    I   1    )  respectively.  (2b)    Q   1   =   α   1   −   γ   1   exp  (  −   β   1     I   1    )  +   θ   1     I   1        (2c)    Q   2   =   α   2   −   γ   2   exp  (  −   β   2     I   1    )  +   θ   2     I   1     where the eight material parameters   α   1   ,    β   1   ,    γ   1   ,    θ   1   and   α   2   ,    β   2   ,    γ   2   ,    θ   2   are evaluated by fitting the   Q   1     F   f    (    I   1    )  and   Q   2     F   f    (    I   1    )  from TOR and TXE test, and 1 /  3  ≤   Q   1   ≤ 1 , 0.5 ≤   Q   2   ≤ 1 is required to render the deviatoric plane shape of yield surface changes from triangular in brittle regime to circle in ductile regime as the confining pressure changes from tensile to high compressive.  The cap surface [29,30] is a two-part function that is either unity or ellipse (see Fig. 1b):  (3)    F   c    (    I   1   , κ  )  =  {      1 −   [    I   1   − L  ( κ )   ]  2  /   [  X  ( κ )  − L  ( κ )   ]  2  ,       I   1   > κ       1 ,     otherwise         where κ is an internal state variable denoting for hardening of the cap, by which the intersection of the cap with the   I   1   axis X  ( κ )  and the transitional point L  ( κ )  (see Fig. 1b) is determined; X  ( κ )  − L  ( κ )  is the length of major axe of cap, which is proportional to   F   f    ( κ )  with the material constant S (the ratio of its major to minor axes)  (4)  X  ( κ )  = L  ( κ )  + S   F   f    ( κ )       The transitional point L  ( κ )  is defined by  (5)  L  ( κ )  =  {      κ ,     if  κ >   κ   0           κ   0   ,     otherwise         where   κ   0   is the value of   I   1   at the initial intersection of the cap and shear failure surface.  The evolution of the cap’s motion (the cap is only permit to expand for concrete) is defined by the isotropic hardening rule as follows, while without cap motion the pressure–volumetric strain curve is perfect plastic  (6)    ε   v   p   = W  {  1 −   e   −   D   1    [  X  ( κ )  −   X   0    ]  −   D   2     [  X  ( κ )  −   X   0    ]  2     }    where   ε   v   p   = t r   ε   i j   p   = ∫  3 λ ∂ f / ∂   I   1   d t  is the plastic volumetric strain due to its porosity reduction under compaction, W is the maximum plastic volumetric strain,   X   0   = X  (    κ   0    )  is the initial abscissa intercept of the cap surface,   D   1   and   D   2   are material parameters determining the shape of pressure volume curve.  Strain softening and modulus reduction of concrete are modeled via an isotropic damage formulation in the model. Strain softening corresponds to a post-peak decrease in strength and modulus reduction denotes a reduction of elastic modulus in cyclic loading case. The damage criterion is based on the damage energy release rate-based approach, proposed by Simo and Ju [31], which was considered more reasonable than the equivalent strain-based and the stress-based ones [32]. The damaged stress tensor σ (nominal stress tensor, defined as force divided by the total area) is linked to effective stress tensor  σ ¯  (undamaged stress tensor or true stress tensor, defined as force divided by the total area) according to the effective stress concept in CDM by  (7)  σ  =  (  1 − d  )   σ ¯    where the scalar damage variable d  (  0 ≤ d ≤ 1  )  grows from zero (virgin undamaged material) to unity (completely damaged material with effective area reduced to zero). 1 − d is a reduction factor associated with the amount of damage at a material point. To account for different damage responses and to capture the unilateral effect for concrete material, two distinct expressions   d   +   and   d   −   are used for brittle damage and ductile damage, where brittle damage corresponds to tensile mean stress (  P < 0  ) , and the ductile corresponds to compressive mean stress (  P > 0  ) .  The two damage variables are defined as [3,24]   (8)    d   ±   = G  (     τ ¯   ±   )  = 1 −     r   0   ±        τ ¯   ±     (  1 −   A  ±   )  −   A  ±    exp     B  ±   (    r   0   ±   −    τ ¯   ±   )     0 ≤   r   0   ±   ≤    τ ¯   ±    where symbol “±” denoting “+” or “ −  ”, as appropriate, G  ( • )   (  0 ≤ G  ( • )  ≤ 1  )  is a monotonically increasing scalar functions of variable    τ ¯   ±  , a undamaged energy norm, defined as    τ ¯   ±  =      σ ¯    i j   :   ε   i j     in the effective stress space, and   r   0   ±   is the damage threshold, and the initial damage threshold is coincident with the shear plasticity surface; damage   d  ±  = 0 if    τ ¯   ±  <    r   0   ±   , and   d  ±  = G  (     τ ¯   ±   )  > 0 if    τ ¯   +  >    r   0   +   ; two pairs of parameters   A  ±  ,   B  ±  determine the shape of softening curve. It is worth nothing that parameters   A  ±  are non-dimensional, and the units for parameters   B  ±  are 1 /   F /   L  2    because   d  ±  in Eq.(8) are non-dimensional.  In summary, there are 12 model parameters   α   i   ,    β   i   ,    γ   i   and   θ   i    (  i = , 1 , 2  )  used for shear failure surface, 5 parameters W, D 1, D 2, X 0 and S for cap surface, and 4 parameters   A  ±  ,   B  ±  to describe damage. A detailed description how to calibrate and determine these parameters for different grades of concrete together with a summarization of all those calibration equations will be provided in the following sections. The calibration work in this research is based on the units (mm, ton, s, N), the application can be extended to other units when the proposed material parameters are converted to other units according to the dimensional analysis results provided in Table 1, or FE models in other units are converted into ones in current unit through Precessor software i.e. ETA femb.  In view of the shear failure functions in Eq. (2a), these expressions can be regarded as a linear combination of a liner function   F   f 1   (   I   1   ) = α + θ   I   1   and an exponential function   F   f 2   (   I   1   ) = − exp  (  − β   I   1    )  with a combination coefficient γ . Parameters α and θ are the intercept value in   F   f 1   axis and the slope of linear function, respectively. Parameter β is the coefficient of exponential function as shown in Fig. 2.  In order to satisfy the smooth and convex requirements for the failure surface, the following constraints are imposed on allowable values for theses shear parameters:  (1) The convexity requirement of the failure surface in both meridian plane and deviatoric plane. In compressive meridian plane it is required that      F  ″   f   (   I   1   ) = −   β  2  γ exp  (  − β   I   1    )  ≤ 0      In consideration of exp  (  − β   I   1    )  ≥ 0 ,    β  2  > 0 , the following constraint is obtained   γ ≥ 0      Positive slope at low pressures regimes     F ′   f   (   I   1   ) = β γ exp  (  − β   I   1    )  + θ > 0      When   I   1    =  0 , it is readily seen that   β γ + θ > 0      Positive slope at a high pressures or the asymptotic slope of compression line has a positive value. When   I   1   → ∞ , we have   θ > 0      The apex of the meridian has a negative value     F   f 1   = α − γ exp  (  − β   I   1    )  + θ   I   1          I   1   = 0   > 0      Thus   α > γ ≥ 0      Positive requirement of shear stress in meridian plane except on apex     F   f 1   = α − γ exp  (  − β   I   1    )  + θ   I   1   > 0      Hence   0 ≤ exp  (  − β   I   1    )  ≤ 1  and  β > 0      In summarizing above constraints, the requirements for compressive meridian line parameters are non-negative values   α > 0 ,  β > 0 ,  γ ≥ 0 ,  θ > 0      Following the same method, the constraints on allowable values for the tensile and shear meridian parameters in Eqs. (2b) and (2c) can be also obtained.  As shown in Fig. 3a, the strength data in four stress states, including uniaxial compression (Point C), biaxial tension (Point B), triaxial tension (equal tension in three directions, see Point A) and triaxial compression (Point D), are used to determine four parameters α ,  β ,  γ and θ . According to CEB-FIP code [19], the following relationship holds among the biaxial tensile strength   f ′   b t   , the uniaxial tensile strength   f ′   t   and the uniaxial compressive strength   f ′   c      (9)    f   b t   ′   =   f   t   ′   = 1 . 4   (    f   c   ′   / 10  )   2 / 3    MPa      The triaxial compressive strength is obtained from test results reported by Mills and Zimmerman [20], wherein 107 tests including uniaxial, biaxial and true triaxial with concrete grade varying from C21 to C40 were made. The proposed compressive strength for concrete under multiaxial loading condition is  (10)      τ   0       f ′   c     =   0.199 + 0.843   σ   0       f ′   c       where shear strength defined by   τ   0   =     (    σ   x   −   σ   y    )  2  +   (    σ   x   −   σ   z    )  2  +   (    σ   y   −   σ   z    )  2    / 3 =   2   J   2   / 3   , normal strength defined by   σ   0   =   I   1   / 3    The four parameters α ,  β ,  λ ,  θ in Eq. (2a) can then be obtained by solving four equations corresponding to the four stress states since   f ′   c   is known. The results for different concrete grades are summarized in Table 1.  To determine the parameters for concrete grades other than the six listed in the table, the best fitting method is adopted to obtain their values as functions of   f ′   c   according to the existing results in Table 1. Reasonably good fitting is observed as shown in Fig. 4, and the fitting formulas are given by  (11a)  α = 13.9846 exp  (      f ′   c     68.8756    )  − 13.8981      (11b)  θ = 0.3533 − 3.4105 ×   10   − 4     f ′   c   − 3.7150 ×   10   − 6     f ′   c   2        (11c)  γ = 3.6855 exp  (      f ′   c     40.0239    )  − 4.7345      (11d)  β = 18.2146   f′  c  − 1.7171        Typical stress sates in TXE are uniaxial tension (Point B), biaxial compression (Point D), triaxial tension (Point A) and triaxial extension (Point E) as seen in Fig. 3b. According to experimental results in Ref. [6], the biaxial compressive strength   f ′   b c   is related to   f ′   c   by  (12)    f ′   b c   = 1 . 15   f ′   c        The triaxial extension strength is also taken from test results reported by Mills and Zimmerman [20]   (13)      τ   0       f ′   c     =   0.147 + 0.550   σ   0       f   c   ׳          Using the same method for the TXC state, the parameters in TXE for different concrete grades are shown in Table 1 and demonstrated good fits for parameter   β   2   as function of   f ′   c   in Fig. 5a. The four parameters   α   2   ,    β   2   ,    γ   2   ,    θ   2   are respectively expressed as  (14a)    α   2   = 0.76      (14b)    θ   2   = 0      (14c)    γ   2   = 0.26      (14d)    β   2   = 0.285   f′   c   − 0.94843        Relatively few experimental results have been reported for concrete under pure TOR states. The four parameters   α   1   ,    β   1   ,    γ   1   ,    θ   1   are obtained here according to the Rankine criterion with   Q   1   = 1 /  3  , as well as Willans–Warnke Lode dependence with   Q   1   corresponding to biaxial compression and triaxial extension states. The parameters in TOR for different concrete grades are listed in Table 1. The fitting results for parameter   β   1   are plotted in Fig. 5b, with the following fitting formulas for   α   2   ,    β   2   ,    γ   2   ,    θ   2      (15a)    α   1   = 0.82      (15b)    θ   1   = 0      (15c)    γ   1   = 0.2407      (15d)    β   1   = 0.33565   f′   c   − 0.95383        There are five parameters W, D 1, D 2, X 0 and S used on defining the cap surface in the model, among which the first four can be obtained from pressure–density (p–ρ) curves measured in hydrostatic compression test. The p–ρ curve can be further adapted to the pressure–volumetric strain p−   ε   v   curves through the following relationship   ε   v   = ρ /   ρ   0   − 1 , where ρ 0 denotes the initial density. As shown in Fig. 6, the p–ρ and p−   ε   v   relationships are separated into three regions with three turning points A  (    ρ   A   ,   P   HTL    )  , B  (    ρ   B   ,   P   HEL    )  and C  (    ρ   C   ,   p   C    )  . The first region is marked by AB denoting the elastic deformation part with an elastic limit   P   HEL   =   X   0   / 3 . The second one is marked by BC for the compaction part where the pore is being crushed out. The last one defines the relationship for fully dense material in solidification case.  The elastic limit X 0 is set according to the pure hydrostatic compression test for concrete,   X   0   = 123.9  MPa is reported for concrete with   f ′   c   = 48.4  MPa in [21],   X   0   = 70  MPa for   f ′   c   = 35  MPa and   X   0   = 280  MPa for   f ′   c   = 140  MPa according to Ref. [4]. A linear fitting curve is followed to fit the relationship between   X   0   and   f ′   c   .   W, D 1 and D 2 are set using the best fitting method according to the p−   ε   v   curves reported by Green and Swanson [21] for concrete with   f ′   c   = 48.5  MPa (see Fig. 7). The fitting formula is  (16)  −  ln  (      ε   v   0    W   )  =   D   1   ξ +   D   2     ξ  2    where ξ = X ( κ ) −   X   0   and volumetric strain occupied by void is defined by   ε   v   0   = W −   ε   v   p   = W   e   − ξ  (    D   1   +   D   2   ξ  )    according to Eq. (6).   ε   v   0   decreases from W to 0 as the hydrostatic pressure increases (Fig. 6c).  Derivative of   ε   v   0   with respect to ξ leads to  (17)    d   ε   v   0     d   ξ   ξ = 0     = − W   D   1        Parameters D 1 can be considered proportional to the initial slope of the   ε   v   0   − ξ curve.  The last parameter S for the shape of the cap can be determined from triaxial compression test. The process is summarized as follows:  • A hydrostatic load is applied to the specimen leading the stress state to position A first (see Fig. 8), which results in a plastic volumetric strain   ε   v   p A   according to Eq. (6), and X 0 is the elastic limit subject to the hydrostatic load. The hardening of cap surface with the increase of the hydrostatic load can be observed.  • Holding the confining pressure   σ   2   =   σ   3   = const , applying the axial compression load Δ   σ   1   until the specimen fails in shear indicated as position B and with the plastic volumetric strain Δ   ε   v   p   = Δ   ε   v   − Δ   σ   1   / 3  K . The total plastic volumetric strain can be expressed by   ε   v   p B   =   ε   v   p A   + Δ   ε   v   p   .  Then   I   1 c   , the intersection of the cap with the   I   1   at position C, can be estimated from the bellow quadratic equitation according to Eq. (16) if parameters   D   1   ,    D   2   ,  W are known  (18a)    D   1    (    I   1 c   −   X   0    )  +   D   2     (    I   1 c   −   X   0    )  2  = − In  (    1 −   ε   v   p B    W   )       Further, parameter S can be expressed by  (18b)  S =   (    I   1 c   −   I   1 B    )       J   2 B            In the absence of triaxial compression test data, S can be also estimated from uniaxial compression test. It is known that the plastic volumetric strain expansion occurs in the shear failure surface according to an associated flow rule, while the plastic volumetric strain compaction occurs in the cap surface. Position E (initial cap intersection point) can then be regarded as the critical point separating plastic volumetric expansion from plastic volumetric compaction. Because the plastic volumetric strain expansion is found in uniaxial compression of concrete [6], so the intersection point of cap curve with the shear failure curve lies before point E is reached, and the minimum value of S can be estimated by  (    X   0   −   f ′   c    )  /  (    f ′   c   /  3   )  .   Table 1 summarizes the model parameters related to the cap for different grades of concretes, the following fitting formulae presents the cap parameters for different grade of concrete  (19a)    X   0   = 17 . 087 + 1.892   f   c   ′        (19b)    D   1   = 6.11 ×   10   − 4        (19c)    D   2   = 2.225 ×   10   − 6        (19d)  W = 0 . 065      (19e)  S = 4 .45994exp  (  −   f ′   c   / 11.51679  )  + 1.95358      The linear fitting results for parameter X 0 is shown in Fig. 9a, and the fitting result for parameter S are shown in Fig. 9b, which appears to be rather consistent with the existing results listed in Table 1.  Damage is defined within the framework of CDM. In CDM, the damage and damage energy release rate (DERR) are commonly considered as the thermodynamic conjugates [33–35]. A damage surface is defined to determine whether damage loading occurs or not, and damage initiates and accumulates when the energy norm (a scalar measurement of strain energy), a function of DERR, exceeds the current damage threshold It is called the damage criterion here [31,32]. The evolution of the damage variables is specified in accordance with the normality rule.  The choice of free energy function is critical to the damage modeling of a material. In isothermal conditions, an equilibrium state can be described by a scalar thermodynamic potential-the Gibbs free energy density (per unit volume) g  (     σ ¯    i j    )  by the following expression  (20)  g  (     σ ¯    i j    )  =  1 2     σ ¯    i j   :   ε   i j   =  1 2     σ ¯    i j   :   D   i j k l   − 1   :    σ ¯    k l   =   1 + γ   2 E    σ ¯  :  σ ¯  −  γ  2 E   t   r  2   σ ¯    where E and γ are the Yong’s modulus and Poisson’s ratio, respectively.   D   i j k l   − 1   is the fourth-order linear-elastic compliance matrix tensor of the intact (undamaged) material, defined as  (21)    D   i j k l   − 1   =  1 E   [    1 + γ  2   (    δ   i k     δ   j l   +   δ   i l     δ   j k    )  − γ   δ   i j     δ   k l    ]  =  1  2 G    (    I   4   −   I ⊗ I  3   )  +  1 K  I ⊗ I =     I   i j k l   d     2 G   +     I   i j k l    K    where   δ   i j   is “Kronecker delta”, the Bulk modulus K and Shear modulus G can be expressed in terms of E ,  γ as K = E / 3  (  1 − 2 γ  )  , G = E / 2  (  1 + γ  )  ,   I   i j k l   and   I   i j k l   d   are the fourth-order identity tensor and deviatoric tensor, respectively.   I   i j   is the second-order identity tensor. Eq. (20) represents an ellipsoidal damage shape in principal undamaged stress space centered at the origin, as demonstrated in Fig. 10a for γ =  0 .2 (a typical value for concrete). It also represents a circular shape for γ =  0 .  By further decomposing the stress tensor into hydrostatic and deviatoric parts as  σ ¯  =    I ¯    1   I  / 3 +  S ¯  , the Gibbs free energy density g  (     σ ¯    i j    )  in Eq. (20) can be recast into a deviatoric part   g   1    (     J ¯    2    )  and a volumetric part   g   2    (     I ¯    1    )  as  (22)  g  (     σ ¯    i j    )  = g  (     I ¯    1   ,    J ¯    2    )  =   1 + γ  E     J ¯    2   +   1 − 2 γ   6 E      I ¯    1   2   =      J ¯    2     2 G   +      I ¯    1   2     18 K   =   g   1    (     J ¯    2    )  +   g   2    (     I ¯    1    )    where   g   1    (     J ¯    2    )  also presents an ellipsoidal shape in the principal stress space shown in Fig. 10b for γ =  0 .2 .  The brittle damage energy norm    τ ¯   +  is defined as  (23)     τ ¯   +  =   E   ε   max   2       where   ε   max   is the maximum principal strain. Substituting   ε   max   =   f ′   t   / E in uniaxial tension into Eq. (23), the initial damage threshold   r   0   +   can be estimated as   f ′   t   /  E  .  The ductile damage energy norm    τ ¯   −  is defined as  (24)     τ ¯   −  =      σ ¯    i j   :   ε   i j     =   2 g  (     σ ¯    i j    )    =        J ¯    2    G  +      I ¯    1   2     9 K          Then, ductile damage threshold   r   0   −   can be estimated from uniaxial compression from Eq. (24) as   r   0   −   =     f ′   c    (    f ′   c   / E  )    =   f ′   c   /  E  .  If substituting Eq. (8) into Eq. (7) and applying the result to a uniaxial tension case, another expression of the stress can be written as  (25)  σ =  E ¯   [    ε   0   +    (  1 −   A  +   )  +   A  +    ε  +    exp     B  +   E   (    ε   0   +   −   ε  +   )     ]  =  E ¯   ε ¯    where  ε ¯  is the effective strain (as shown in Fig. 11),   ε   0   +   is the strain corresponds to peak tension strength and   ε  +   (    ε  +  ≥   ε   0   +    )  is the strain in strain softening section. Two parameters   A  +  and   B  +  help to regulate the curve shape after peak strength.    Fig. 12 shows the effect of the brittle damage parameter   B  +  on the strain softening response. It is found that the curve becomes increasingly softening with the increase of   B  +  while   A  +  = 1 is kept unchanged, and the curve becomes a horizontal line corresponding to an undamaged case when   B  +  = 0 .  It is known to all that the strain softening response will not be objective upon mesh refinement, and will be mesh-dependent [36]. Objective can be achieved by modifying the constitutive law and making it depend on mesh size by introducing a parameter called “crack band width” [37,38] or “characteristic length”[39]. Damage parameter   A  ±  ,    B  ±  , considering the characteristic length [40,41], can be determined as follow:  The definition of the tension fracture energy   G   F   (per unit area) is written according to the fictitious crack model [40], which is also used in the Mat 159 model to regulate mesh size dependence [14]   (26)    G   F   =  ∫   ω 0   ∞   σ  ( ω )   d ω =  ∫   ω 0   ∞   (  1 −   d  +   )   f ′   t  d ω   where σ   ( ω )  and w are respectively the stress and displacement, w 0 is the displacement at peak tension strength   f ′    t  .  Substituting brittle damage definition in Eq. (8) into Eq. (26), gives  (27)    G   F   =  f ′   t   ∫   ω 0   ∞   [      r   0   +        τ ¯   +     (  1 −   A  +   )  +   A  +    exp   −   B  +  (    τ ¯   +  −   r   0   +   )    ]  d ω      The integration on the first term  (28)   f ′   t   ∫   ω 0   ∞       r   0   +        τ ¯   +     (  1 −   A  +   )   d ω = f ′ t  (  1 −   A  +   )    ω   0   ∞      In order to obtain a reasonable value,   A  +  = 1 is required in Eq. (28), which means that elastic-brittle behavior with no residual strength in tension will appear because   lim      τ ¯   +  → ∞     d  +  → 1 is obtained from Eq. (8).  When   A  +  = 1 , we can obtain  (29)    G   F   =     l  ⁎    r   0   +       B  +    =     l  ⁎    f   t   ′       B  +   E      where   l  ⁎  is a characteristic length of the finite element, and typically set equal to the cube root of the element volume in three-dimensional (3D) [7,40].  In the absence of experimental data for a particular concrete,   G   F   can be estimated from CEB–FIP code [19]   (30)    G   F   =   G   F 0     [    (    f   c k   + 8  )   10    ]   0.7     where   f   c k   is the characteristic compressive strength of concrete, and   G   F 0   is base value of fracture energy (see Table 2), depends on the maximum aggregate size, d max.  Note: a linear fit is used for other size of aggregate, the fit equitation is G  F0 =0.021+5.357×10−4 d max.   From Eq. (29),   B  +  can be obtained by  (31)    B  +  =     l  ⁎    f ′   t       G   F    E         The compression fracture energy   G   c   (per unit area) is written by  (32)    G   c   =  ∫   ω 0   ∞   σ  ( w )   d w =  ∫   ω 0   ∞   (  1 −   d   −    )   f ′   c  d ω      Substituting ductile damage definition in Eq. (8) into Eq. (29), gives  (33)    G   c   =  f ′   c   ∫   ω 0   ∞   [      r   0   −        τ ¯   −     (  1 −   A  −   )  +   A  −    exp   −   B  −  (    τ ¯   −  −   r   0   −   )    ]  d ω      The integration on the first term  (34)   f ′   c   ∫   ω 0   ∞       r   0   −        τ ¯   −     (  1 −   A  −   )   d ω = 2  (  1 −   A  −   )   f ′   c      x   0      (  ∞ −     x   0      )        A  −  = 1 is required in Eq. (34) to obtain a reasonable value.  When   A  +  = 1 , we obtain the following expression of   G   c      (35)    G   c   =   2   l  ⁎      B   − 2     +  2    B  −       f ′   c    l  ⁎        ω   0          Solving quadratic equation, we finally derive the expression of   B  −     (36)    B  −  =     f ′   c   /  E  +   2   G   c   /   l  ⁎  +   f ′   c   2   / E       G   c   /   l  ⁎      where   G   C   Unfortunately, only limited research works on   G   C   can be found [42,43], and there is no   G   C   provided in CEB–FIP code [19].  In the absence of   G   C   ,   B  −  can be determined by comparing the predicted uniaxial compression curve with the test data. Besides, considering that several constitutive models (i.e. the MAT 14, MAT 84 in LS-DYNA) with elastoplatic response for uniaxial compression [44–46] perform well for predicting reinforced concrete (RC) structures subject to impact loading,   B  −  = 0 can be simply adopted for the MAT 145, which recovers elasto-plastic behavior for concrete under uniaxial compression. For convenience, the suggested range of   B  −  can be 0 ≤   B  −  ≤   B  +  /  (    f ′   c   /   f ′   t    )  , where the upper limit   B  +  /  (    f ′   c   /   f ′   t    )  is an empirical parameter.  Existing experimental data shows that the peak strength attained during the direct pull and unconfined compression test is sensitive to the strain rate, which is also specified by the CEB–FIP code [19]. To account for the effect, a viscoplastic formulation with a fluidity coefficient parameter, denoted by η , was employed. It is indeed a three-dimensional generalization of the Duvaut–Lions viscoplastic strain rate formulation [23].  (37)     σ ¯    i j   −    σ ˜    i j   = η   C   i j k l      ε ̇    k l   v p     where    σ ¯    i j   and    σ ˜    i j   are the viscid and inviscid stress tensor,   C   i j k l   is the fourth-order linear elastic tensor and    ε ̇    k l   v p   is the viscoplastic strain rate tensor.  Using an implicit backward Euler algorithm for the viscoplastic strain rate, the update for the stress tensor can be written as  (38)     σ ¯    n + 1   −    σ ˜    n + 1   =  η  Δ t   C Δ   ε   v p   =  η  Δ t   C  (  Δ ε − Δ   ε  e   )  =  η  Δ t    (     σ ¯    n + 1   t r i a l   −    σ ¯    n + 1    )    where the elastic trial stress    σ ¯    n + 1   t r i a l   =    σ ¯    n   + C Δ ε , and stress tensor    σ ¯    n + 1   =    σ ¯    n   + C Δ   ε  e  . Readily it is seen that the viscid stress tensor can be expressed as  (39)     σ ¯    n + 1   =      σ ¯    n + 1   t r i a l   +    σ ˜    n + 1   Δ t / η   1 + Δ t / η          σ ¯    n + 1   =    σ ˜    n + 1   is obtained from the above equation by seeting η = 0 , which corresponds to the rate-independent situation.    σ ¯    n + 1   =    σ ¯    n + 1   t r i a l   is obtained by setting η = ∞ , which corresponds to the elastic situation.  Regarding the strain rate effect for concrete, it has been argued that the 3D FE model is capable of calculating the strength increase due to the confining stresses generated by the inertia of the structure, and there is a risk of overestimating the strength if FE calculates the failure of concrete by using both strain rate dependent strength increase factors and confining stresses due to the inertia [47–50]. In consideration of this, η = 0 is suggested in this study.  To validate the applicability of the proposed material parameters for the MAT 145 to concrete in tension and compression under different confining pressures, experimental strain–stress data from existing literatures for the quasi-static case is used. Furthermore, falling weight impact test on RC beams is used to check the dynamic performance of the MAT 145 with the proposed parameters. The parameters of the MAT 145 are generated based on the calibration equations summarized in Appendix. In order to compare with a similar model-MAT 159, validations of the MAT 159 with default parameters (internal generation parameter based on uniaxial compression strength, the maximum aggregate size and units) is also carried out.  In the numerical simulation, the compression or tension are applied to the top surface of the element via ⁎Boundary Prescribed Motion keywords with a constant velocity of compression or tension, while the bottom surface is constrained on the motion direction. For triaxial compression, the confining pressure is applied to the side and ends of the element via ⁎Load Segment keywords [3].    Fig. 13 shows a comparison of the predicted stress–strain relation curves by the MAT 145 and MAT 159 against data of uniaxial tension tests on concrete reported by Geopalaeratnam and Shah [51]. The test material parameters included 28 days compression strength   f ′   c   = 43.88  MPa = 6364  psi , tension strength   f ′   t   = 3.62  MPa = 525  psi , fracture energy   G   F   = 0.00564  N / mm = 0.322  lb / in . and stress–strain curve measured in 83mm length. In the following simulations, a single cubic element model with three different size (25mm, 50mm and 83mm) was used to show the element size dependent of the stress–strain curve, where C44 concrete with a maximum aggregate size of 10mm was used to generate material parameters for the MAT 145 and MAT 159.  Tables 3 and 4 show the input material parameters of the MAT 145 and MAT 159 for the element size of 83mm.  Evidently, the model predictions by the MAT 145 based on mesh size of 83mm (the same as the test length) match well with the pre-peak test data and show generally acceptable agreements for the post-peak response, whilst the predictions using the MAT 159 show appreciable discrepancies for both pre-peak and post-peak responses no matter what mesh size is used.    Fig. 14 further shows a comparison of the peak tensile strength for different grades of concrete predicted by the MAT 145 and MAT 159. The predictions by the MAT 145 are apparently higher than those by the MAT 159. Not presented here, a further prediction of the peak tensile strength by the MAT 72 show nearly identical values with those by the MAT 145 for different grade of concrete. Besides, the predicted peak tensile strength by the MAT 159 shows very small value when   f ′   c   ≤ 20  MPa , and gives decreasing value when   f ′   c   ≥ 50  MPa because the default material parameters generated by the MAT 159 is for concrete about 20  MPa ≤   f ′   c   ≤ 58  MPa , with emphasis on the midrange between 28 and 48MPa [14]. Hence the MAT 159 may be not suitable for high strength concrete with   f ′   c   ≥ 48  MPa . In comparison, the predicted peak tensile strength by the MAT 145 based on the proposed material parameter performs well for all grades of concrete.    Fig. 15 presents a comparison of the model predictions with uniaxial and triaxial compression test data reported by Green and Swanson [21], where the compression tests for C48.4 (   f ′   c   = 48 . 4  MPa  =  7 .02  ksi ) concrete were conducted on 68.6mm (2.7in.) diameter by 152.4mm(6.0in.) long cylinders at three confining pressure of 0, 6.8959MPa (1ksi) and 13.79MPa (2ksi), respectively. The maximum aggregate size was 76.2mm (3/8in.), and the elastic modulus E was about 41368.6MPa (6000ksi). The simulations adopted a multi-element structural model with the same size of the test specimens, which include 2139 hexahedral elements with a mesh size of 8mm (Fig. 15a). C48.4 concrete was used to generate the material parameters for the MAT 145 and MAT 159. Ductile damage parameters A −=1.0, B −=0.0 was used in the MAT 145 ( Table 5), and the suggested range of B − is 0 ≤   B  −  ≤ 0.09 . The predicted stress is the average value in the mid-section of the specimen shown in Fig. 15a, and the strain is calculated from the total displacement in top section of the specimen. It is evident that the predicted results by the MAT 145 compare well with test data in the case of high confining pressure, whilst the predictions by the MAT 159 shows large difference from the test data in all three cases.    Fig. 16 shows a comparison of peak compressive strength for different concrete (C10 to C70) produced by the MAT 145 and MAT 159. The results given by the MAT 145 agree well with the theoretical value for all those concrete, whilst the results predicted by the MAT 159 are slightly smaller than the theoretical value for most concrete types though C20 concrete lies in its application range.    Fig. 17 presents the comparisons of experimental and analytical results of hydrostatic load–unload tests. In the hydrostatic compression test, conducted by Green and Swanson [21], the size of specimen and concrete mix are the same as those introduced in Section 4.2, and the measurable permanent compaction began about 41.4MPa (6ksi) pressure. The simulated diagrams of the MAT 145 compares well with the experimental data especially in loading test, whilst the predictions by the MAT 159 differs a lot from the experimental data in both loading and unloading tests.  Fujikake [52,53] conducted tests on RC beams subject to the failing weight impact which will be used in this study to validate the performance of the Mat 145 for concrete under impact loads. In the test, a rigid hammer with a mass of 400kg was dropped freely onto the top surface of RC beams at mid-span from four different heights (0.15m, 0.30m, 0.60m, and 1.20m). The uniaxial compressive strength of concrete was 42MPa in the test, and the estimated tensile strength of concrete according to Japan Society of Civil Engineers code was 2.8MPa [52].  In the FE model, the concrete was meshed with 57852 eight-noded solid elements with size of 12.5mm. C42 concrete with the maximum aggregate size of 10mm was used to generate material parameters for the MAT 145 and MAT 159. The material input card of the MAT 145 is shown in Table 6, where ductile damage parameter   B  −  = 0.1 with the estimated range 0 ≤   B  −  ≤ 0.164 is used.    Fig. 18 shows comparisons of predicted and testing impact force and mid-span displacement for the four impact cases. For impact force history, the numerical results predicted by the MAT 145 agree rather well with the test data in terms of peak force in all impact cases, while those predicted by the MAT 159 tend to overestimate the peak force and have short impact duration. Focusing on mid-span displacement, the results predicted by both models agree well with the test curve before peak displacement, and the residual displacements from both models are slightly larger than the test value.    Fig. 19 presents the comparisons of the predicted damage by two models and experimental results, wherein the contours of the damage range from 0 (blue) to 1 (red). In the numerical simulation, both vertical cracks and diagonal shear cracks caused by overall failure of RC beams are predicted reasonably well by both models, and the damage predicted by the MAT 145 appears to be slightly larger than that by the MAT 159.  The above comparisons indicate that the MAT 145 performs better in predicting the impact force, while the MAT 159 may be better in predicting mid-span displacement and damage distribution of the RC beam with moderate damage.   CONCLUSIONS   The MAT 145 in LS-DYNA is an advanced constitutive model for geomaterials with sounded theoretical background, but contains too many parameters which limit its wide applicability. To facilitate this model for convenient use by more users, a detailed procedure of calibration of this model for concrete was presented in this study. The material parameters other than those related to the damage were obtained as functions of the uniaxial compression strength of concrete based on the CEB–FIP code and empirical formulas reported in the literature. The damage parameters are determined with consideration of a characteristic length of the finite element. The proposed formulae and relationships greatly expedite the engineering application of the model.  The proposed method was further verified by a single element and a multi-element simulation by the MAT 145 which offered reasonably good predictions for the stress–strain relationship as compared to experimental results. Compared with the MAT 159, the MAT 145 with proposed material parameters shows nearly identical peak tensile strength   f ′   t   as the MAT 72, and can be used for different grade of concrete including high strength concrete (    f ′   c   ≥ 48  MPa  ) . Furthermore, numerical simulations of RC beams subjected to the failing weight impact using the MAT 145 and MAT 159 were carried out. The results show that the MAT 145 with proposed parameters performs better than the MAT 159 for predicting the impact force, and the difference between two predicted mid-span displacements in each case is negligible.   ACKNOWLEDGEMENTS   The first author is grateful for the support from the National Science Foundation of China (Grant 51308054). The opinions, findings, and conclusions do not reflect the views of the funding institutions or other individuals.        Note: Parameters marked in rectangle are important parameters calibrated in this paper. Parameters marked in ellipse are ignored parameters with default value. The remaining parameters are the output opinions for users.           RO (mass density) [19]       RO = 2.4 ×   10   − 9     (Card 1-2)   SHEAR (shear modulus) [19]       G =  E  2  (  1 + γ  )    =   9137.5   1 + γ     (      f ′   c     10    )   1 / 3    MP a   (Card 1-3)   BULK (bulk modulus) [19]       K =  E  3  (  1 − 2 γ  )    =   6092   1 − 2 γ     (      f ′   c     10    )   1 / 3    MPa   (Card 1-4)   GRUN (Gruneisen ratio) [3]     GRUN=0 (Card 1-5)   SHOCK (Shock velocity) [3]     GRUN=0 (Card 1-6)   PORE (flag for pore collapse for constant bulk modulus)    PORE=1 (Card 1-7)   ALPHA (shear failure parameter)      α = 13.9316 exp  (    f ′   c   / 68.7383  )  − 13.8380   (Card 2-1)   THETA (shear failure parameter)      θ = 0.3533 − 3.3294 ×   10   − 4     f ′   c   − 3.8182 ×   10   − 6     f ′   c   2     (Card 2-2)   GAMMA (shear failure parameter)      γ = 3.6657 exp  (    f ′   c   / 39.9363  )  − 4.7092   (Card 2-3)   BETA (shear failure parameter)      β = 18.17791  f′ c  − 1.7163     (Card 2-4)   EFIT (dilitation damage mechanics parameter) [3]     EFIT=1 (no dilatation damage) (Card 2-5)   FFIT (dilitation damage mechanics parameter) [3]     FFIT=0 (no dilatation damage) (Card 2-6)   ALPHAN (kinematic strain hardening parameter)    ALPHAN=0 (no hardening) (Card 2-7)   CALPHAN (kinematic strain hardening parameter)    CALPHAN=0 (no hardening) (Card 2-8)    R0 (initial cap surface ellipticity)      S = 4 .45994exp  (  −   f ′   c   / 11.51679  )  + 1.95358   (Card 3-1)    X0 (initial cap surface J1 axis intercept)        X   0   = 17 . 087 + 1.892   f ′   c     (Card 3-2)   IROCK [3]     IROCK=0 (soils-cap can contract) (Card 3-3)    IROCK=1(rock/concrete-cap cannot contract) (Card 3-3)   SECP (shear enhanced compaction)    SECP =0 (no consideration of shear enhanced compaction) (Card 3-4)   AFIT (ductile damage mechanics parameter)        A  −  = 1   (Card 3-5)   BFIT (ductile damage mechanics parameter)        B  −  =     f ′   c   /  E  +   2   G   c   /   l  ⁎  +   f ′   c   2   / E       G   c   /   l  ⁎      (Card 3-6)   Or   0 ≤   B  −  ≤   B  +  /  (    f ′   c   /   f ′   t    )    (Card 3-6)   RDAM0 (ductile damage mechanics parameter)        r   0   −   =     f ′   c      E    =     f ′   c       18275   (    f ′   c   / 10  )   1 / 3         (Card 3-7)    W (plastic volume strain parameter)      W = 0 . 065   (Card 4-1)    D1 (plastic volume strain parameter)        D   1   = 6.11 ×   10   − 4     (Card 4-2)    D2 (plastic volume strain parameter)        D   2   = 2.225 ×   10   − 6     (Card 4-3)   CFIT (brittle damage mechanics parameter)        A  +  = 1   (Card 4-6)   DFIT (brittle damage mechanics parameter)        B  +  =     l  ⁎    f ′   t       G   F    E      (Card 4-7)   TFAIL (tensile failure stress)      f =   f ′   t   = 1 . 4   (    f ′   c   / 10  )   2 / 3    MPa   (Card 4-8)   DBETA(rounded vertices parameter)    DBETA=0 (Card 5-2)   DDELTA (rounded vertices parameter)    DDELTA=0 (Card 5-3)   VPTAU (viscoplasticity relaxation time parameter, η )      η =0 (Card 5-4)   ALPHA1 (torsion scaling parameter)        α   1   = 0.82   (Card 6-1)   THETA1 (torsion scaling parameter)        θ   1   = 0   (Card 6-2)   GAMMA1 (torsion scaling parameter)          γ   1   = 0.2407   (Card 6-3)   BETA1 (torsion scaling parameter)        β   1   = 0.33565  f′ c  − 0.95383     (Card 6-4)   ALPHA2 (tri-axial extension scaling parameter)        α   2   = 0.76   (Card 6-5)   THETA2 (tri-axial extension scaling parameter)        θ   2   = 0   (Card 6-6)        γ   2   = 0.26   (Card 6-7)   BETA2 (tri-axial extension scaling parameter)        β   2   = 0.285  f′ c  − 0.94843     (Card 6-8)         REFERENCES", "highlights": "The continuous surface cap (MAT 145) model in LS-DYNA is known by its elegant and robust theoretical basis and can well capture many important mechanical behaviors of concrete. However, it appears to be less popular than many other constitutive models in engineering application due to many material parameters involved in the model formulation which are difficult to calibrate. This study presents an effective calibration method to determine the material parameters for this model as functions of uniaxial compression strength and the maximum aggregate size of concrete according to formulas from CEB-FIP code and concrete test data from other published literatures. The obtained parameters can be conveniently used for occasional users with little or no information on concrete in hand. We further compare the predictions of stress–strain relationship in tension and compression under different confining pressures as well as hydrostatic compression by the model, and validate the model based on impact test of RC beams. Besides, the model is further compared against a similar model-MAT 159 in terms of model performance. The results demonstrate that the model based on the calibrated parameters is capable of offering reasonable and robust predictions.   continuous surface (Schwer Murray) cap  CSCM concrete  concrete damage  concrete damage REL3 (K&C concrete)  geologic cap  Johnson Holmquist concrete  Pseudo tensor  RHT  Winfrith concrete  equations of state  triaixal compression  torsion  triaxial extension  continuum damage mechanics  damage energy release rate used by Simo and Ju [31]   reinforced concrete  three invariants of stress tensor  Rubin scaling function in Eq. (1), used by Rubin [27]   cap hardening parameter in Eqs. (3) and (5)   strength in triaxial compression in Eqs. (1) and (2a)   strength in torsion and triaxial extension in Eqs. (2b) and (2c)   the cap surface in Eqs. (1) and (3)   the cap surface parameters in Fig. 1.  ratio of the major to minor axes of the cap surface in Eqs. (4), (18a), (18b) and (19e)   plastic volumetric strain and the maximum value in Eq. (6)   parameters determining the shape of pressure–volume in Eq. (6)   stress tensor and effective stress tensor in Eq. (7)   scalar damage variable in Eqs. (7) and (8)   damage threshold and undamaged energy norm in Eq. (8)   uniaxial and biaxial compression strength of concrete  uniaxial and biaxial tension strength of concrete  shear strength and normal strength in Eq. (10), used by Mills and Zimmerman [20]   Gibbs free energy density (per unit volume) in Eqs. (22) and (24)   deviatoric and volumetric part of Gibbs free energy density in Eq. (22)   Yong’s modulus and Poisson’s ratio  bulk modulus and shear modulus  fourth-order linear-elastic compliance matrix tensor of the intact material in Eq. (21)   fourth-order identity tensor and deviatoric tensor in Eq. (21)   the mode I fracture energy and base value of fracture energy per unit area in Eqs. (36)–(31)   the stress and displacement in Eqs. (26)–(32)   the compression fracture energy in Eqs. (32)–(36)   the maximum aggregate size in Table 2   a characteristic length of the finite element in Eqs. (29), (31), (35), (36)   damage parameters determining the strain softening curve in Eqs. (8) and (31), (36)   the viscid and inviscid stress tensor in Eqs. (37)–(39)   a fluidity coefficient parameter in Eqs. (37)–(39)"}