{"id": "S0168874X14000699", "article": "MAIN-TITLE Weak form quadrature element analysis of spatial geometrically exact shear-rigid beams   HIGHLIGHTS          A quadrature element formulation for nonlinear analysis of spatial beams is presented.      A shear-rigid geometrically exact beam model is adopted.      The demand of strain-objectivity is satisfied in the formulation.      Computational feasibility is shown.          KEYPHRASES   Geometrically exact beam theory  Shear-rigid beam  Weak form quadrature element method  Strain-objectivity  Total Lagrangian formulation   Geometrically nonlinear analysis of beams allowing for large displacements and rotations has been of concern in various engineering disciplines. Since Simo and Vu-Quoc [1,2] extended the pioneering work of Reissner [3] and developed the geometrically exact Reissner–Simo beam model, a great deal of research work in regard to static and dynamic analyses of beams undergoing large displacements and rotations has been done over the past few decades. In the Reissner–Simo beam model, extension, flexure, torsion and shearing are considered, being pertinent to the linear Timoshenko beam model. Corresponding to the linear Euler–Bernoulli beam model, a geometrically exact beam model excluding shearing can also be established. This shear-rigid beam model can be seen as a kinematical simplification of Reissner–Simo (shear-deformable) beam model. In spite of kinematical complexity, the shear-deformable beam model enjoys mathematical simplicity and elegance, as has been shown in the work of Reissner and Simo [1–3]. In contrast, the shear-rigid beam model is kinematically simple but it may run into mathematical complexity due to the zero shear deformation constraints. Nonetheless, it possesses significant advantages in nonlinear analysis of beams. First, it is well-known that the transverse shear deformation is trivial for slender beams despite large displacements and rotations. It is therefore possible to develop a numerical system with less number of degrees-of-freedom for the shear-rigid beam model. Second, precautions have to be taken to eliminate locking phenomenon for displacement-based formulations of the shear-deformable beam model while this is unnecessary for the shear-rigid beam model. Besides, the account of shear deformation may impose strong time stepsize restrictions in dynamic analysis of beams [4].  Although the majority of research work over the past three decades is about the shear-deformable beam model, the shear-rigid beam model still receives attention of researchers in nonlinear analysis of beams. By adopting modified Hu-Washizu variational principle, Saje proposed a finite element formulation for planar slender straight beams [5]. Gerstmayr and Shabana analyzed thin beams and cables using absolute nodal coordinates [6]. Zhao and Ren proposed a quaternion-based singularity-free slender beam element, using a sequential interpolating method to ignore transverse shear deformation [7]. A recent investigation of planar slender beams [8] indicates that nonlinear analysis of slender geometrically exact beams based on the shear-rigid beam model offers satisfactory results. The present paper is an endeavor to deal with spatial beams with large displacements and rotations based on the shear-rigid beam model.  Differing from planar beams considerably, spatial rotations of three-dimensional beams falls within multiplicative special orthogonal group and the configuration space of the beam is a nonlinear manifold. As a result, the accuracy, robustness and efficiency of numerical formulations are strongly dependent upon the parameterization and approximation of spatial rotations. Many representations for spatial rotations, including the nine-parameter orthogonal tensor, the three-parameter rotation vector, Rodrigues׳ parameters, quaternions, have been proposed. Detailed accounts of these parameterizations may be found in [9,10]. For constrained rotations, Ibrahimbegović et al. used the incremental rotation vector to handle geometrically exact shell model with no drilling rotations [11]. Among these parameters, the qurternion-based rotation has been shown to be a convenient representation of spatial rotations. A recent study further highlights the advantages of the quaternion-based representation of spatial rotations [12]. In this paper, quaternions are used to express cross-section rotations and corresponding strain measures to avoid singularity problems that may be encountered when rotation vectors are used in a total-Lagrangian formulation.  Over the years, numerical methods adopting displacement-based formulations have been dominant in nonlinear analysis of geometrically exact beams despite the development of other formulations such as hybrid-mixed finite element formulation [13] and stress-based formulation [14]. In most finite element formulations wherein low order displacement-based finite elements are used for shear-deformable beams, appropriate procedures have to be taken to eliminate locking phenomenon [15]. Among various approaches to elimination of locking, high-order approximation is a natural choice but it has been seldom seen in finite element formulations. The weak form quadrature element method (QEM) is an efficient numerical method wherein numerical integration is carried out before derivatives are approximated using differential quadrature analogs. Because of the feasibility of high-order approximation and the coincidence of integration points and nodes within an element, the QEM can use much fewer degrees-of-freedom, even a single element for a beam member, to tackle many problems with high accuracy. So far the QEM has shown remarkable superiority in beam-like structural analysis [16–20]. The successful application of the QEM to nonlinear analysis of geometrically exact shear-deformable beams demonstrates its effectiveness with no compromise in strain-objectivity [16,20].  In this paper, the QEM is applied to a total Lagrangian formulation of the shear-rigid beam model. The total Lagrangian formulation is favored over either the updated Lagrangian formulation or the Eulerian formulation in quadrature element analysis. This is mainly attributable to fact that the advantages of the unaltered reference configuration in the total Lagrangian formulation can be exploited to the maximum.  One of the aims of the present paper is to weigh the pros against the cons of the weak form quadrature element analysis of shear-rigid geometrically exact beams. For spatial shear-rigid beams, two rotation variables of a certain cross-section are expressed by translations on the centroidal axis for the shear-rigid condition to enforce the zero shear deformation constraint, while the drilling rotation variable remains independent. The major merits of the present approach include: (a) satisfaction of strain-objectivity without extra effort; (b) reduction of the number of degrees-of-freedom compared with shear-deformable beams; (c) circumvention of the so-called interdependent perplexity of translations and rotations of spatial shear-deformable beams [21].  The remaining portion of the present paper is organized as follows. Section 2 sums up spatial geometrically exact shear-rigid beam theory, followed by the weak form quadrature element formulation in Section 3. Section 4 presents three benchmark examples to demonstrate the effectiveness of the formulation. Conclusions are drawn in Section 5. Relatively lengthy explicit expression of the tangent stiffness matrix for the beam element is given in Appendix A. In addition, a proof of the strain-objectivity of the present formulation is furnished in Appendix B.  The beam model in the present paper allows for flexure, torsion and extension but neglects transverse shear deformation. Since no restriction is imposed on the magnitude of the displacements or rotations in the model, it is geometrically exact. In general, a reference configuration and a current configuration are needed for description of a spatial beam. As shown in Fig. 1, the reference configuration of the beam is assumed to have straight centroidal axis and a right-handed orthonormal frame {   E   1   ,    E   2   ,    E   3   } serving as the three base vectors for the Cartesian coordinate system is introduced. The origin of the frame is located on the centroidal axis of the reference beam. The frame is attached to the beam cross-section and its axes oriented along the principal axes of inertia. The cross-section of the beam is assumed to be rigid and therefore the shape remains unchanged during deformation.  In the current configuration, a cross-section of the beam is determined by the position vector of its centroid, denoted by r, and an orthonormal frame {   e   1   ,    e   2   ,    e   3   } where   e   3   points to the normal direction of the cross-section and   e   1   and   e   2   are aligned with two principal axes of the cross-section inertia. In the case of initially curved beam, an initial configuration is usually needed. Similar to the description of the current configuration, position vector   r   0   and orthonormal frame {   e   01   ,    e   02   ,    e   03   } are used correspondingly to locate a cross-section in the initial configuration. Define s as the arc length parameter of the beam. The following vectors are introduced in the current and the initial configurations:  (1)  a =   ∂ r   ∂ s   ;  b ×   e   i   =   ∂   e   i     ∂ s     a   0   =   ∂   r  0    ∂ s   ;    b   0   ×   e   0 i   =   ∂   e   0 i     ∂ s     which are related to the strain measures of the beam by  (2)  a =   γ   z 1     e   1   +   γ   z 2     e   2   + (   ε   z   + 1 )   e   3   ; b =   κ   z 1     e   1   +   κ   z 2     e   2   +   γ   z 3     e   3   ;   a   0   =   γ   01     e   01   +   γ   02     e   02   + (   ε   0   + 1 )   e   03   ;   b   0   =   κ   01     e   01   +   κ   02     e   02   +   γ   03     e   03   .   The strain measures are then extracted from Eq. (2), leading to transverse shear strains of the cross section (   γ   z 1   −   γ   01   ) and (   γ   z 2   −   γ   02   ) , bending strains (   κ   z 1   −   κ   01   ) and (   κ   z 2   −   κ   02   ) , and axial and torsion strain (   ε   z   −   ε   0   ) and (   γ   z 3   −   γ   03   ) , respectively. The strain vectors for a spatial beam are defined as  (3)  γ =   γ   z   −   γ   0   =   (        γ   z 1   −   γ   01         γ   z 2   −   γ   02         ε   z   −   ε   0        )  T  ; κ =   κ   z   −   κ   0   =   (        κ   z 1   −   κ   01         κ   z 2   −   κ   02         γ   z 3   −   γ   03        )  T    In the shear-rigid hypothesis of a beam, the tangent of the centroidal axis of the beam is perpendicular to the cross-section, i.e.  (4)    r ′   ‖  r ′  ‖   =   e   3     where the prime denotes the first-order derivative with respect to the arc-length parameter s.  The orthonormal frame   e   i   can be related to the reference frame   E   i   by a rotation tensor Λ , i.e.  (5)    e   i   = Λ   E   i   ,  i = 1 , 2 , 3 .   Define  θ ⌢  as the quaternion expression of the rotation vector θ corresponding to Λ . The rotation quaternion  q ⌢  can be expressed as  (6)   q ⌢  = exp (  θ ⌢  / 2 ) =  cos    ‖  θ  ‖  2  +  θ  ‖  θ  ‖    sin    ‖  θ  ‖  2  =  ∑  n = 0   + ∞     1  n !     (    θ ⌢  2   )  n     where the exponential expression is obtained using quaternion multiplication; ‖ ‖ represents the Euclidian norm of the vector. The quaternion expression of Eq. (5) is  (7)     e ⌢    i   =  q ⌢  ∘    E ⌢    i   ∘    q ⌢   ⁎  ,  i = 1 , 2 , 3 .   where  ⁎ ⌢  denotes quaternion expression and ∘ represents quaternion multiplication;    q ⌢   ⁎  is the conjugated quaternion of  q ⌢  . It is noted that the relation between the quaternion and the rotation tensor is not unique:  q ⌢  and −  q ⌢  correspond to the same rotation tensor Λ  [22].  Because of the orthogonality of Λ , a skew-symmetric tensor δ  φ ^  can be derived from its variation:  (8)  δ  φ ^  = δ Λ   Λ  T    where the corresponding vector of δ  φ ^  is denoted as δ φ which is related to the variation of rotation vector θ through  (9)  δ θ = T ( θ ) δ φ      with  (10)  T ( θ ) = e ⊗ e +    ‖  θ  ‖  / 2   tan (  ‖  θ  ‖  / 2 )   ( I − e ⊗ e ) −   θ ^  2       and e = θ /  ‖  θ  ‖  .  The quaternion expression of Eq. (8) is  (11)  δ  φ ⌢  = 2 δ  q ⌢  ∘    q ⌢   ⁎       To maintain the orthogonality of the rotation tensor, the following scheme  (12)     q ⌢    n   = exp ( δ  φ ⌢  / 2 ) ∘    q ⌢    o     is used to update    q ⌢    o   to the new quaternion    q ⌢    n   . Strain measures can then be given in terms of quaternions as  (13)   γ ⌢  =    γ ⌢    z   −    γ ⌢    0   =    q ⌢   ⁎  ∘  r ⌢  ′ ∘  q ⌢  −     q ⌢    0   ⁎  ∘    r ⌢    0   ′   ∘    q ⌢    0   ;  κ ⌢  =    κ ⌢    z   −    κ ⌢    0   = 2    q ⌢   ⁎  ∘  q ⌢  ′ − 2     q ⌢    0   ⁎  ∘    q ⌢    0   ′        which can also be written in tensor form as  (14)  γ =   γ   z   −   γ   0   =   Λ  T   r ′  −   Λ   0   T     r   0   ′   ;  κ ^  =    κ ^    z   −    κ ^    0   =   Λ  T  Λ ′ −   Λ   0   T     Λ   0   ′     where   Λ   0   is the rotation tensor corresponding to the initial configuration.  From Eqs. (4) and (5), it is obvious that  (15)   r ′  • Λ   E   i   = 0 ,  i = 1 , 2 .   In other words, the transverse shear strains corresponding to the first two entries of γ in Eq. (14) vanish. By taking variation of Eq. (15), it is easy to deduce that  (16)   {      δ    φ ¯    1         δ    φ ¯    2        }  =  1  ‖   r ′   ‖    [      −   e   2   T           e   1   T        ]  { δ  r ′  } = ϒ { δ  r ′  } , ϒ =  1  ‖   r ′   ‖    [      −   e   2   T           e   1   T        ]    where δ    φ ¯    i   is the ith entry of vector δ  φ ¯  defined by  (17)  δ  φ ¯  =   Λ  T  δ φ .   It can be seen that δ  φ ¯  is the expression of δ φ in the orthonormal coordinate system {   e   i   } . Eq. (16) indicates that the first two entries of the infinitesimal rotation δ  φ ¯  can be expressed by displacement vectors under the shear-rigid hypothesis, and only the drilling rotation δ    φ ¯    3   is independent.  Denote the internal axial force and moment vector as   n   t   and   m   t   , respectively, and assume the Young׳s modulus and the shear modulus of the beam material to be E and G , respectively. The constitutive relationship can be written as  (18)            with  (19)         and  (20)  χ =   [     ε   κ     ]  T  .   Here A is the area of the cross-section while   I   1   and   I   2   are the cross-sectional moments of inertia about two principal axes;   J   s   denotes the torsional constant of the cross-section.  For performing numerical integration in a quadrature element formulation, elements are transformed onto a normalized coordinate system with the dimensionless coordinate ξ varying within [−1, 1]. Assume that the element has n integration points. Then the nodal variable vector is given as  (21)  δ   d   ( e )   =   [      δ    ζ   1   T     ⋯    δ    ζ   i   T     ⋯    δ    ζ   n   T       ]  T    with  (22)  δ   ζ   i   =   [      δ   r   i       δ    φ ¯    i 3        ]  T    being the displacements at the ith integration point.  Define the distributed forces and moments as p and m, while the concentrated forces and moments as P and M, respectively. Analogous to Eq. (17), moments in orthonormal frames are defined by  (23)   m ¯  =   Λ  T  m ;  M ¯  =   Λ  T  M   Denote the external and internal virtual work by δ   W   e x t   and δ   W   int   , respectively. With a proper integration scheme such as Lobatto quadrature, the virtual work equation for a quadrature element can be written as  (24)  δ   W   int   ( e )   − δ   W   ext   ( e )   =  ∫  − 1  1   δ   χ  T    N   t    μ d ξ −  ∫  − 1  1   ( δ   r  T  p + δ    φ ¯   T   m ¯  )  μ d ξ  − δ   r   0   T     P   0   − δ   r   L   T     P   L   − δ   φ   0   T     M   0   − δ   φ   L   T     M   L   =  ∑  i = 1  n     w   i     ( δ   χ  T    N   t   μ )   i    −  ∑  i = 1  n     w   i     [ ( δ   r  T  p + δ    φ ¯   T   m ¯  ) μ ]   i     − δ   r   0   T     P   0   − δ   r   L   T     P   L   − δ   φ   0   T      M ¯    0   − δ   φ   L   T      M ¯    L   = 0   where μ = d s / d ξ is an initial configuration parameter defined by the initial arc length per unit normalized coordinate of the element;   w   i   are the weights of the numerical integration scheme. For Lobatto quadrature:  (25)    w   1   =   w   n   =  2  n ( n − 1 )   ,   w   j   =  2  n ( n − 1 )   [   P   n − 1   (   ξ   j   ) ]  2    ,  j = 2 , … , n − 1   where integration points are the (i−1)th zeros of the first order derivative of the (n−1)th order Legendre polynomial   P   n − 1   ( ξ ) in addition to the two end points −1 and 1.  The differential quadrature analog proposed by Bellman and Casti [23] is used to approximate derivatives in the virtual work equation. For instance, derivatives of a function f ( ξ ) at a certain node can be expressed in terms of a weighted linear summation of the function values at all nodes within the element, i.e.  (26)         d  k  f   d   ξ  k     |   ξ =   ξ   i     =  ∑  j = 1  n     C   i j   ( k )    f (   ξ   j   )   where   C   i j   ( k )   are the weighting coefficients for the kth order derivatives. In this paper, weighting coefficients for the first and second order derivatives are used and therefore given as follows:  (27)    C   i j   ( 1 )   =  {         Θ ′  (   ξ   i   )   (   ξ   i   −   ξ   j   )  Θ ′  (   ξ   j   )       ( i ≠ j ) ;       −  ∑  k = 1 , k ≠ i  n     C   i k   ( 1 )        ( i = j ) ;            (28)    C   i j   ( 2 )   =  {      2  [    C   i i   ( 1 )     C   i j   ( 1 )   −  1    ξ   i   −   ξ   j       C   i j   ( 1 )    ]  ,     i ≠ j ;       −  ∑      k = 1       k ≠ i      n     C   i k   ( 2 )        i = j ;         where  (29)   Θ ′  (   ξ   i   ) =  ∏  j = 1 , j ≠ i  n  (   ξ   i   −   ξ   j   ) .   Differentiation of Eq. (16) yields  (30)   {      δ    φ ¯    1   ′         δ    φ ¯    2   ′        }  =  1    ‖  r ′  ‖  3     [      ( r ′ • r ″ )   e   2   T   +   ‖  r ′  ‖  2    e   2   T    ω ^      −   ‖  r ′  ‖  2    e   2   T         −   ‖  r ′  ‖  2    e   1   T    ω ^  − ( r ′ • r ″ )   e   1   T         ‖  r ′  ‖  2    e   1   T        ]   {      δ r ′       δ r ″      }  = X  {      δ r ′       δ r ″      }  =  [        Χ   1         Χ   2        ]   {      δ r ′       δ r ″      }    where the skew-symmetric tensor  ω ^  is defined as  (31)   ω ^  = Λ ′   Λ  T  .      For strain variations at the kth node, the following equation  (32)  δ   χ   k   = δ  {        ε   k           κ   k        }  =  [        r   k   ′ T   /  ‖    r   k   ′    ‖        0   1 × 3         0   1 × 3           0   3 × 3         I   3 × 3          κ ^    z k        ]   {      δ   r   k   ′         δ    φ ¯    k   ′         δ    φ ¯    k        }  =   Γ   k    {      δ   r   k   ′         δ    φ ¯    k   ′         δ    φ ¯    k        }  =   Γ   k     B   k   δ   d   ( e )   =  [         B ¯    k            B ˜    k        ]  δ   d   ( e )     can be obtained after introduction of differential quadrature analogs alone with Eqs. (14), (15) and (30). The strain matrix   B   k   in Eq. (32) can be written as  (33)    B   k   =  [        b   k 1      ⋯      b   k i      ⋯      b   k n        ]    with  (34)    b   k i   T   =  [          C   k i   ( 1 )       μ   k       I   3 × 3           C   k i   ( 1 )     Χ   1 k   T       μ   k     +     C   k i   ( 2 )     Χ   2 k   T       μ   k   2           0   3 × 1           C   k i   ( 1 )       μ   k       ϒ   k   T         0   3 × 1           0   1 × 3         0   1 × 2           C   k i   ( 1 )       μ   k           0   1 × 2         δ   k i        ]    and   δ   k i   being the Kronecker delta. To extract nodal variable vector from the external virtual work, define  (35)    A   k   =  [        δ   k 1     I   3 × 3         0   3 × 1      ⋯      δ   k i     I   3 × 3         0   3 × 1      ⋯      δ   k n     I   3 × 3         0   3 × 1        ]    and  (36)    C   k   =  [          C   k 1   ( 1 )     ϒ   k       μ   k           0   2 × 1      ⋯        C   k i   ( 1 )     ϒ   k       μ   k           0   2 × 1      ⋯        C   k n   ( 1 )     ϒ   k       μ   k           0   2 × 1           0   1 × 3         δ   k 1      ⋯      0   1 × 3         δ   k i      ⋯      0   1 × 3         δ   k i        ]  .   Then, the virtual work Eq. (24) can be written as  (37)  δ   W   int   ( e )   − δ   W   ext   ( e )   = δ   d   ( e ) T   (   G   int   ( e )   −   G   e x t   ( e )   ) = 0   where  (38)    G   int   ( e )   =  ∑  i = 1  n     w   i     μ   i     B   i   T     Γ   i   T     N   t i    ;   G   e x t   ( e )   =  ∑  i = 1  n     w   i     μ   i   (   A   i   T     p   i   +   C   i   T      m ¯    i   )  +   A   1   T     P   0   +   A   n   T     P   L   +   C   1   T      M ¯    0   +   C   n   T      M ¯    L   .   To ensure rotation continuity, an infinitesimal rotation vector δ    φ ¯    c   and three Lagrangian multipliers are utilized at each end of an element, thus turning the nodal variable vector into  (39)  δ    d ¯    ( e )   =   [      δ    φ ¯    c 1       δ   d   ( e )       δ    φ ¯    c n       δ   λ   1       δ   λ   2      ⋯    δ   λ   6        ]  T  .   The perpendicularity between the cross-section and the tangent of the centroid of the beam determines δ    φ ¯    c   at the ends of the element with the aid of Lagrangian multipliers. As a result, the virtual work principle is rewritten as  (40)  δ   Π   ( e )   = δ   W   int   ( e )   − δ   W   ext   ( e )    + δ  (      λ   1     r   1   ′     ‖    r   1   ′    ‖   •   e   c 1   1   +     λ   2     r   1   ′     ‖    r   1   ′    ‖   •   e   c 2   1   +   λ   3     e   1   1   •   e   c 2   1   +     λ   4     r   n   ′     ‖    r   n   ′    ‖   •   e   c 1   n   +     λ   5     r   n   ′     ‖    r   n   ′    ‖   •   e   c 2   n   +   λ   6     e   1   n   •   e   c 2   n    )  = 0   where the Cartesian frame corresponding to δ    φ ¯    c   is defined as {   e   c i   } . Here subscript 1 or n denotes the first or the last integration point in an element.  Eq. (40) leads to the residual force vector of the element:  (41)    R   ( e )   =    G ¯    int   ( e )   −    G ¯    e x t   ( e )   +    G ¯    c   ( e )   = 0   where  (42)     G ¯    int   ( e )   =   [        0   1 × 3         G   int   ( e ) T         0   1 × 9        ]  T  ;    G ¯    e x t   ( e )   =   [        0   1 × 3         G   e x t   ( e ) T         0   1 × 9        ]  T  .   The virtual work-conjugate vector resulting from the introduction of the additional perpendicularity at element ends can be written as  (43)     G ¯    c   ( e )   =   [        z   1   T         h   1   T      ⋯      h   i   T      ⋯      h   n   T         z   2   T         t  T       ]  T    in which the following symbols are introduced:  (44)    z   1   =   (   λ   1     Z   c 1   1 T   +   λ   2     Z   c 2   1 T   )   r   1   ′     ‖    r   1   ′    ‖   +   λ   3     Z   c 2   1 T     e   1   1   ,   z   2   =   (   λ   4     Z   c 1   n T   +   λ   5     Z   c 2   n T   )   r   n   ′     ‖    r   n   ′    ‖   +   λ   6     Z   c 2   n T     e   1   n   ,      (45)    h   i   =  [         h ¯    i        0     ]  ,      (46)  t =   [          r   1   ′   •   e   c 1   1     ‖    r   1   ′    ‖           r   1   ′   •   e   c 2   1     ‖    r   1   ′    ‖         e   1   1   •   e   c 2   1           r   n   ′   •   e   c 1   n     ‖    r   n   ′    ‖           r   n   ′   •   e   c 2   n     ‖    r   n   ′    ‖         e   1   n   •   e   c 2   n        ]  T  ,   with  (47)    Z   c k   i   = −    e ^    c k   i     Λ   c i   ,    Z   k   i   = −    e ^    k   i     Λ   i   ,  i = 1 , n ;      (48)     h ¯    i   =      H ¯    1   (   λ   1     e   c 1   1   +   λ   2     e   c 2   1   )   C   1 i   ( 1 )       μ   1     +      H ¯    n   (   λ   4     e   c 1   n   +   λ   5     e   c 2   n   )   C   n i   ( 1 )       μ   n     +   λ   3      H ˜    1 i   T     Z   1   1 T     e   c 2   1   +   λ   6      H ˜    n i   T     Z   1   n T     e   c 2   n   ,      (49)     H ¯    i   =     ‖    r   i   ′    ‖  2    I   3 × 3   −   r   i   ′   ⊗   r   i   ′       ‖    r   i   ′    ‖  3    ,  i = 1 , n   and  (50)     H ˜    k i   =  [            −   e   2   k T       μ   k    ‖    r   k   ′    ‖      C   k i   ( 1 )           −   e   1   k T       μ   k    ‖    r   k   ′    ‖      C   k i   ( 1 )               0   1 × 3        ]  ,  i = 1 , n .   In order to solve Eq. (41) by use of numerical iterations, an incremental form of Eq. (41) is desired, i.e.  (51)  Δ   R   ( e )   =    K ¯    T   ( e )   Δ    d ¯    ( e )   = (    K ¯    F   ( e )   +    K ¯    C   ( e )   ) Δ    d ¯    ( e )     where    K ¯    T   ( e )   is the element tangent stiffness matrix, which can be partitioned into the stiffness matrix    K ¯    F   ( e )   resulting from virtual work and the stiffness matrix    K ¯    C   ( e )   resulting from the use of Lagrangian multipliers. The derivation of    K ¯    T   ( e )   is given in detail in Appendix A.  After assembly, the global equilibrium equations, the residual force vector Δ R and the corresponding global tangent stiffness matrix   K   T   are obtained as  (52)  R =   G   i n t   −   G   e x t   +   G   c   = 0 , Δ R =   K   T   Δ d .   Usually, the Newton–Raphson iteration scheme is utilized to find the solution of (52) within an incremental load step. Define Δ   d   ( i )   as the incremental displacement vector in the ith iteration during a certain load step, the solution is considered to be convergent if  (53)   ‖  Δ   d   ( i )    ‖  ≤ τ  ‖    d   ( i )    ‖    is satisfied, ‖    d   ( i )    ‖ being the Euclidian norm of the total displacement vector of the load step. The tolerance τ is limited to a small quantity, such as 1 ×   10   − 6   in this paper.  To obtain the rotation quaternion ensuring orthogonality in Eq. (15) at integration points during iteration, an inner iteration is adopted. Define  (54)    ν   i   =  r ′  • Λ   E   i   ,  i = 1 , 2 .   The orthogonality is guaranteed if the absolute values of   ν   i   are smaller than a given small quantity, says, 1 ×   10   − 9   . The incremental forms of Eq. (54)   (55)  Δ   ν   i   = −    r ′   T     e ^    i   Λ  Δ  φ ¯  ,  i = 1 , 2   are used in combination with Eq. (10) to obtain the incremental rotation vector, updating the rotation quaternion. Since the third entry of Δ  φ ¯  has been obtained as a nodal variable, only the first two entries are needed. For convenience, Eq. (16) is chosen as the initial value of Δ  φ ¯  . Experience indicates that the orthogonality is ensured with satisfactory rigor after only a few iterations. Thus, the additional computational effort incurred by the inner iteration is trivial.  Strain objectivity demands that strain measures keep uniform in different reference coordinate systems; that is to say, strain measures do not vary with rigid-body motion. It is of paramount importance in judging the strain objectivity of formulations dealing with large displacements and rotations. Researchers have proposed different methods for assurance of strain objectivity after discretization [24–28]. It can be proved that because of the coincidence of integration points and nodes for differential quadrature analogs, strain objectivity is guaranteed without additional efforts in the present formulation. Details of the proof are presented in Appendix B.  If n integration points are prescribed within a quadrature element, the total degrees-of-freedom of the element is ( 4 × n + 12 ) in the shear-rigid beam formulation in contrast to ( 6 × n ) total degrees-of-freedom in the shear-deformable beam element formulation. For most nonlinear analysis of geometrically exact beam problems, more than eight integration points in a quadrature element is required to gain satisfactory accuracy of results. The present formulation can evidently reduce the number of degrees-of-freedom in large-scale problems accordingly.  To demonstrate the effectiveness of the present formulation, three examples are studied. The first example shows that the quaternion-based rotation parameterization is singularity-free under large rotations. The second example studies an initially curved beam while strain objectivity is verified in the third example.  This example was first proposed by Ibrahimbegović [29] and studied by many researchers since then [12,27,30] to examine the feasibility of rotation parameterizations for large and oscillating rotations. As shown in Fig. 2, a couple M = 200 π and a lateral force F = 50 are applied simultaneously and incrementally at the tip of a cantilever beam, with the scale factor λ ranging from λ = 0 to λ = 1 in 400 steps. Because of the extremely large rotations in this problem, 6 quadrature elements each with 18 integration points are chosen during discretization and utilized to depict the deformed configuration. Denote the displacement component along   E   2   direction at the tip as u . The relationship between λ and u is given in Fig. 3.  It is seen that the displacement component at the cantilever tip oscillates as the load increases. The curve given by Zupan and Saje [30] is displayed as a reference. They used 1000 incremental steps and a mesh of 25 finite elements each with 8 interpolation points. The two curves coincide well in the first half of the loading process ( 0 ≤ λ ≤ 0.5 ), indicating that the shear-deformation is trivial at this stage. As the beam curls up, a disparity between the two curves becomes visible. This is ascribed to the increasingly significant influence of the shear deformation in the beam which is not negligible over the second half of loading process ( 0.5 ≤ λ ≤ 1 ), especially at the end of loading. Therefore, caution has to be exercised when the shear-rigid beam model is applied to beams undergoing great change of curvature as well as stubby beams in the presence of shear force.    Fig. 4 shows the deformed shape of the beam at the final load step. The beam rolls up to a helical curve with 10 circles. It is seen that that the present formulation shows brilliant performance for rotation angles exceeding 2 π .  As shown in Fig. 5, the initial configuration of the cantilever beam is a 45° arc of a circle with radius R = 100 . A vertical concentrated force F = 600 is applied at the tip of the beam. This classical problem including all possible modes of deformation has been considered by many researchers to check path-independence of their formulations [24–27], i.e. the configuration is uniquely determined once the conservative load is prescribed regardless of its loading path. The beam is now modeled with one quadrature element. Table 1 lists the free-end displacement components   u  A  for different numbers of integration points with 4 equal load increments.  It is observed that the end displacement components converge to seven significant digits by only one quadrature element with 10 integration points. Because of the slenderness of the beam, the present result is in excellent agreement with those wherein transverse shear deformations were included [20,24,27].  As pointed out by Jelenić and Crisfield [24], the demand of path-independence is not guaranteed in some formulations because of the inappropriate updated formulation or rotation interpolation scheme. Here the beam is loaded in 5 equal increments and then unloaded in 2 equal decrements to check the residual displacements. A residual displacement norm:  (56)    R   d   =  ‖    d   t r a    ‖  /   3 n     is defined, where ‖    d   t r a    ‖ is the Euclidean norm of the translational displacements after the beam is fully unloaded. The result for one quadrature element with different numbers of integration points is displayed in Table 2.  It is seen that   R   d   diminishes with the increase of the number of integration points. This reflects the defect of the present formulation in preservation of path-independence for low order integrations since the residual norm should stay negligibly small irrespective of the order of integration for a path-independence formulation. Normally, the path-independence property is preserved in a quaternion-consistent formulation as reported in analysis of shear-deformable geometrically exact beams [31]. In present formulation, however, the variation in the derivatives of quaternion rotations is approximated by an expression involving infinitesimal rotation vectors (see δ    φ ¯    k   ′   in Eq. (32)) rather than a quaternion-consistent expression. This achieves a compact formulation and avoids the immense mathematical complexity for the quaternion-consistent formulation but spoils the path-independence slightly. Further research work is clearly needed to develop a simple effective quaternion-consistent formulation for shear-rigid geometrically exact beams.  This benchmark example is usually used to verify strain-objectivity [24,27]. A vertical concentrated load F = 5 is applied at the free end (see Fig. 6). Two quadrature elements are used, one element per member. The final free end displacement components obtained for five load increments are listed in Table 3. It is seen that convergent results with five significant digits are acquired with only six integration points per element. The problem is also dealt with using an h-type finite element in compliance with shear-rigid hypothesis for comparison. Each member is divided into 200 two-node BEAM4 elements in commercial code ANSYS [32] and the load is applied in 15 increments to ensure accuracy of the results. Table 3 displays the excellent agreement reached between the present results and the predictions wherein shear deformations were considered [20,24,27] as well as those from ANSYS.  To verify strain objectivity of the present formulation, a rotation ψ = ( π / 2 ) about the axis   E   2   at the fixed end is applied along with the prescribed load. Two loading schemes are adopted: (i) load F = 5 is applied in a single increment followed by the prescribed rotation ψ = ( π / 2 ) that is applied in 5 equal increments; (ii) the load and the rotation are applied simultaneously in 5 equal increments. Obviously, the final deformed configurations corresponding to the two schemes should be exactly the same and the free-end displacement component   u   3   B   is expected to be −10. As did in [24] where each leg was modeled with one beam element, two quadrature elements (one element per member) are used here. The end displacements for 2, 3 and 4 integration points in one quadrature element are given in Table 4. Evidently, the results for the two schemes are identical.  To further test the formulation׳s robustness to preserve objectivity, a rotation of 200 full revolutions is applied at the fixed end while the load is kept invariant, and six integration points are used for each leg. For a strain-objective formulation, the deformed configuration and the strain measures should be invariant at the end of each revolution. The free-end displacements are monitored while the rotations about   E   1   ,   E   2   and   E   3   are applied respectively. The results which are not listed here for brevity show no difference with the precision of eight significant digits. The fluctuations of strain energy between the end of each revolution and the initial deformed shape when the rotation is applied about the three axes are displayed in Fig. 7. As anticipated, the strain energy remains virtually unaltered during the rotation.   CONCLUSIONS   The geometrically exact beam theory has an unparallel advantage in nonlinear analysis of frames for its exact representation of finite rotations. This paper presents a weak form quadrature element formulation of spatial shear-rigid geometrically exact beams. The weak form quadrature element method is a high-order method that has exhibited superiority in structure analysis. The present shear-rigid beam formulation reduces the number of degrees of freedom and remains strain-objective after discretization. Lagrangian multipliers are introduced to ensure the rotation continuity at the ends of the element. Three benchmark examples have been studied and discussed to validate the effectiveness of the present formulation and satisfactory results have been obtained. Analogous to the parallel between Bernoulli–Euler beam model and Timoshenko beam model, the present formulation for geometrically exact shear-rigid beam model is believed to be a useful alternative to Reissner–Simo beam model in analysis of spatial slender beams undergoing large displacements and rotations.   ACKNOWLEDGMENTS   The present investigation was performed under the support of the National Natural Science Foundation of China (No. 51178247, No 51378294).  For convenience, Eq. (51) is rewritten as follows:  (A.1)  Δ   R   ( e )   =   K   F   ( e )   Δ   d   ( e )   +    K ¯    C   ( e )   Δ    d ¯    ( e )     After lengthy but straightforward manipulation, one can obtain  (A.2)    K   F   ( e )   =  ∑  i = 1  n     w   i     μ   i   [   B   i   T     Γ   i   T     E   i     Γ   i     B   i   +   Ξ   i   −   Ψ   i   ]  −    Ψ ¯    1   −    Ψ ¯    n     where  (A.3)    Ξ   i   =   [         Ξ ˜    k 1   T      ⋯       Ξ ˜    k i   T      ⋯       Ξ ˜    k n   T        ]  T    and  (A.4)    Ψ   i   =   [         Ψ ˜    k 1   T      ⋯       Ψ ˜    k i   T      ⋯       Ψ ˜    k n   T        ]  T    in addition to  (A.5)     Ψ ¯    i   =   [         Ψ ˘    k 1   T      ⋯       Ψ ˘    k i   T      ⋯       Ψ ˘    k n   T        ]  T  .   Prior to presenting the detail expressions of (A.3)–(A.5), the following notations are introduced:  (A.6)     R ¯    k   =  1    μ   k      [        C   k 1   ( 1 )     I   3 × 3         0   3 × 1      ⋯      C   k i   ( 1 )     I   3 × 3         0   3 × 1      ⋯      C   k n   ( 1 )     I   3 × 3         0   3 × 1        ]       (A.7)     R ˜    k   =  1    μ   k   2      [        C   k 1   ( 2 )     I   3 × 3         0   3 × 1      ⋯      C   k i   ( 2 )     I   3 × 3         0   3 × 1      ⋯      C   k n   ( 2 )     I   3 × 3         0   3 × 1        ]       (A.8)     F ¯    k   =  1    μ   k      [        0   1 × 3         C   k 1   ( 1 )      ⋯      0   1 × 3         C   k i   ( 1 )      ⋯      0   1 × 3         C   k n   ( 1 )        ]       (A.9)     F ˜    k   =  [        X   k         0   2 × 1           0   1 × 6      1     ]   [         R ¯    k            R ˜    k            F ¯    k        ]       (A.10)     F ˜    k   =  [        C   k 1   ( 1 )     I   3 × 3         0   3 × 1      ⋯      C   k i   ( 1 )     I   3 × 3         0   3 × 1      ⋯      C   k n   ( 1 )     I   3 × 3         0   3 × 1           0   1 × 3         δ   k 1      ⋯      0   1 × 3         δ   k i      ⋯      0   1 × 3         δ   k n        ]       (A.11)     F ˘    k   =  [        ϒ   k         0   2 × 1           0   1 × 3      1     ]     F ˜    k        (A.12)     S ¯    k   =  [        m   t 3 k     e   1   k         m   t 3 k     e   2   k       −   m   t 1 k     e   1   k   −   m   t 1 k     e   2   k        ]       (A.13)     J ¯    k   =  [        e   2   k       −   e   1   k         0   3 × 1        ]       (A.14)  J =  [     0   0   1     ]       (A.15)     J ˘    k   =  [      −   m   t 2 k         m   t 1 k      0     ]    Now one has  (A.16)     Ξ ˜    k i   =  [         Ξ ˜    k i           δ   k i      J ˘    k      B ˜    k        ]    with  (A.17)     Ξ ˜    k i   =     C   k i   ( 1 )       μ   k     [   n   t k      H ¯    k   + (   m   t 1 k     e   2   k   −   m   t 2 k     e   1   k   ) ⊗   r   k   ″   + (   m   t 2 k      ω ^    k     e   1   k   −   m   t 1 k      ω ^    k     e   2   k   ) ⊗   r   k   ′   ]    R ¯    k   +     C   k i   ( 1 )       μ   k     { [ (   m   t 1 k     e   2   k   −   m   t 2 k     e   1   k   ) ⊗   r   k   ′   ]    R ˜    k   +  ‖    r   k   ′    ‖  (   m   t 1 k      e ^    2   k     Λ   k   −   m   t 2 k      e ^    1   k     Λ   k   )    F ˜    k   +    S ¯    k      B ˜    k   } +     C   k i   ( 1 )       μ   k     { (   r   k   ′        r   k   ″   −   ‖    r   k   ′    ‖  2     ω ^    k   ) (   m   t 1 k     Z   k   2   −   m   t 2 k     Z   k   1   ) + [ (   κ   1 k     m   t 3 k   −   κ   3 k     m   t 1 k   )   Z   k   1   + (   κ   2 k     m   t 3 k   −   κ   3 k     m   t 2 k   )   Z   k   2   ] }    F ˘    k   +     C   k i   ( 2 )       μ   k   2     {   ‖    r   k   ′    ‖  2  (   m   t 2 k     Z   k   1   −   m   t 1 k     Z   k   2   )    F ˘    k   + [ (   m   t 2 k     e   1   k   −   m   t 1 k     e   2   k   ) ⊗   r   k   ′   ]    R ¯    k   }   while  (A.18)     Ψ ˜    k i   =  [          C   k i   ( 1 )       μ   k     ‖    r   k   ′    ‖  3    { [ (    m ¯    1 k     e   2   k   −    m ¯    2 k     e   1   k   ) ⊗  r ′  ]     R   ¯     k   + (   ‖    r   k   ′    ‖  2     J ¯    k       m ¯  ^    k   +    m ¯    2 k     Z   1   k   −    m ¯    1 k     Z   2   k   )    F ˘    k   }         δ   k i   J     m ¯  ^    k      F ˘    k        ]    and  (A.19)     Ψ ˘    k i   =  [          C   k i   ( 1 )       μ   k     ‖    r   k   ′    ‖  3    { [ (    M ¯    1 k     e   2   k   −    M ¯    2 k     e   1   k   ) ⊗  r ′  ]    R ¯    k   + (   ‖    r   k   ′    ‖  2     J ¯    k       M ¯  ^    k   +    M ¯    2 k     Z   1   k   −    M ¯    1 k     Z   2   k   )    F ˘    k   }         δ   k i   J     M ¯  ^    k      F ˘    k        ]         K ¯    C   ( e )   is expressed as follows:  (A.20)     K ¯    C   ( e )   =   [         C ˜    1   T          C ¯    1   T          C ¯    2   T      ⋯       C ¯    i   T      ⋯       C ¯    n − 1   T          C ¯    n   T          C ˜    2   T          C ˘   T       ]  T         C ˜    1   and    C ˜    2   are written as  (A.21)     C ˜    1   =  [         C ˜    1   1       (   λ   1     Z   c 1   1 T   +   λ   2     Z   c 2   1 T   )    H ¯    1      R ¯    1   +   λ   3     Z   c 2   1 T     Z   1   1      F ˘    1         0   3 × 3          C ˜    1   λ        ]       (A.22)     C ˜    2   =  [        0   3 × 3       (   λ   4     Z   c 1   n T   +   λ   5     Z   c 2   n T   )    H ¯    n      R ¯    n   +   λ   6     Z   c 2   n T     Z   1   n      F ˘    n          C ˜    2   2          C ˜    2   λ        ]    where  (A.23)     C ˜    1   1   =     λ   1     ‖    r   1   ′    ‖   (   Λ   c 1   T     Λ   c 1   T     e   c 1   1   ⊗   r   1   ′   −   Λ   c 1   T     Λ   c 1   T     r   1   ′   ⊗   e   c 1   1   −   Λ   c 1   T      r ^    1   ′     Z   c 1   1   ) +     λ   2     ‖    r   1   ′    ‖   (   Λ   c 1   T     Λ   c 1   T     e   c 2   1   ⊗  r ′  −   Λ   c 1   T     Λ   c 1   T      r ′    1   ⊗   e   c 2   1   −   Λ   c 1   T      r ^    1   ′     Z   c 2   1   ) +   λ   3   (   Λ   c 1   T     Λ   c 1   T     e   c 2   1   ⊗   e   1   1   −   Λ   c 1   T     Λ   c 1   T     e   1   1   ⊗   e   c 2   1   −   Λ   c 1   T      e ^    1   1     Z   c 2   1   )      (A.24)     C ˜    1   λ   =  [          Z   c 1   1 T     r   1   ′     ‖    r   1   ′    ‖           Z   c 2   1 T     r   1   ′     ‖    r   1   ′    ‖         Z   c 2   1 T     e   1   1         0   3 × 1         0   3 × 1         0   3 × 1        ]       (A.25)     C ˜    2   2   =     λ   4     ‖    r   n   ′    ‖   (   Λ   c n   T     Λ   c n   T     e   c 1   n   ⊗   r   n   ′   −   Λ   c n   T     Λ   c n   T     r   n   ′   ⊗   e   c 1   n   −   Λ   c n   T      r ^    n   ′     Z   c 1   n   ) +     λ   5     ‖    r   n   ′    ‖   (   Λ   c n   T     Λ   c n   T     e   c 2   n   ⊗   r   n   ′   −   Λ   c n   T     Λ   c n   T     r   n   ′   ⊗   e   c 2   n   −   Λ   c n   T      r ^    n   ′     Z   c 2   n   ) +   λ   6   (   Λ   c n   T     Λ   c n   T     e   c 2   n   ⊗   e   1   n   −   Λ   c n   T     Λ   c n   T     e   1   n   ⊗   e   c 2   n   −   Λ   c n   T      e ^    1   n     Z   c 2   n   )      (A.26)     C ˜    2   λ   =  [        0   3 × 1         0   3 × 1         0   3 × 1           Z   c 1   n T      r ′    n     ‖     r ′    n    ‖           Z   c 2   n T      r ′    n     ‖     r ′    n    ‖         Z   c 2   n T     e   1   n        ]    Prior to presenting the expression of    C ¯    i   , the following expressions are given  (A.27)     H ˘    k   i   =     e   c k   i   ⊗    r ′    i   −    r ′    i   ⊗   e   c k   i   − (    r ′    i   •   e   c k   i   )   I   3 × 3       ‖     r ′    i    ‖  3    − 2 (    H ¯    i     e   c k   i   ) ⊗    r ′    i        (A.28)     e ˜    1   =   Z   1   1 T     e   c 2   1   =   [         e ˜    11          e ˜    12          e ˜    13        ]  T  ;    e ˜    2   =   Z   1   n T     e   c 2   n   =   [         e ˜    21          e ˜    22          e ˜    23        ]  T    For    C ¯    i   , one has  (A.29)     C ¯    i   =  [         C ˜    i   1          C ˜    i   m          C ˜    i   2          C ˜    i   λ           0   1 × 3         0   1 × ( 4 n )         0   1 × 3         0   1 × 6        ]    where  (A.30)     C ˜    i   1   =      H ¯    1   (   λ   1     Z   c 1   1   +   λ   2     Z   c 2   1   )   C   1 i   ( 1 )       μ   1     +   λ   3      H ˜    1 i   T     Z   1   1 T     Z   c 2   1   ;    C ˜    i   2   =      H ¯    n   (   λ   4     Z   c 1   n   +   λ   5     Z   c 2   n   )   C   n i   ( 1 )       μ   n     +   λ   6      H ˜    n i   T     Z   1   n T     Z   c 2   n        (A.31)     C ˜    i   m   =     C   1 i   ( 1 )       μ   1     (   λ   1      H ˘    1   1   +   λ   2      H ˘    2   1   )    R ¯    1   +     C   n i   ( 1 )       μ   n     (   λ   4      H ˘    1   n   +   λ   5      H ˘    2   n   )    R ¯    n   +     λ   3     C   1 i   ( 1 )       μ   1       (    e ˜    11     e   2   n   +    e ˜    12     e   1   n   ) ⊗   r   1   ′       ‖     r ′    1    ‖  3       R ¯    1   +     λ   6     C   n i   ( 1 )       μ   n       (    e ˜    21     e   2   n   +    e ˜    22     e   1   n   ) ⊗    r ′    n       ‖     r ′    n    ‖  3       R ¯    n   −     λ   3     C   1 i   ( 1 )       μ   1          e ˜    11     Z   2   1   +    e ˜    12     Z   1   1     ‖     r ′    1    ‖      F ˘    1   −     λ   6     C   n i   ( 1 )       μ   n          e ˜    n 1     Z   2   1   +    e ˜    12     Z   1   1     ‖     r ′    n    ‖      F ˘    n   +   λ   3      H ˜    1 i   T   (   Λ   1   T     Λ   1   T     e   1   1   ⊗   e   c 2   1   −   Λ   1   T     Λ   1   T     e   c 2   1   ⊗   e   1   1   −   Λ   1   T      e ^    c 2   1     Z   1   1   )    F ˘    1   +   λ   6      H ˜    n i   T   (   Λ   n   T     Λ   n   T     e   1   n   ⊗   e   c 2   n   −   Λ   n   T     Λ   n   T     e   c 2   n   ⊗   e   1   n   −   Λ   n   T      e ^    c 2   n     Z   1   n   )    F ˘    n        (A.32)     C ˜    i   λ   =  [          C   1 i   ( 1 )      H ¯    1     e   c 1   1       μ   1             C   1 i   ( 1 )      H ¯    1     e   c 2   1       μ   1            H ˜    1 i   T     Z   1   1 T     e   c 2   1           C   n i   ( 1 )      H ¯    n     e   c 1   n       μ   n             C   n i   ( 1 )      H ¯    n     e   c 2   n       μ   n            H ˜    n i   T     Z   1   n T     e   c 2   n        ]       C ˘  is expressed as  (A.33)   C ˘  =   [         C ˘    1   T          C ˘    2   T          C ˘    3   T          C ˘    4   T          C ˘    5   T          C ˘    6   T        ]  T    with  (A.34)     C ˘    1   =  [           r ′    1   T     Z   c 1   1     ‖    r   1   ′    ‖         e   c 1   1 T      H ¯    1      R ¯    1         0   1 × 3         0   1 × 6        ]  ;    C ˘    2   =  [           r ′    1   T     Z   c 2   1     ‖    r   1   ′    ‖         e   c 2   1 T      H ¯    1      R ¯    1         0   1 × 3         0   1 × 6        ]  ;    C ˘    4   =  [        0   1 × 3         e   c 1   n T      H ¯    n      R ¯    n            r ′    n   T     Z   c 1   n     ‖     r ′    n    ‖         0   1 × 6        ]  ;    C ˘    5   =  [        0   1 × 3         e   c 2   n T      H ¯    n      R ¯    n            r ′    n   T     Z   c 2   n     ‖     r ′    n    ‖         0   1 × 6        ]  ;   and  (A.35)     C ˘    3   =  [        e   1   1 T     Z   c 2   1         e   c 2   1 T     Z   2   1      F ˘    1         0   1 × 3         0   1 × 6        ]  ;    C ˘    6   =  [        0   1 × 3         e   c 2   n T     Z   2   n      F ˘    n         e   1   n T     Z   c 2   n         0   1 × 6        ]       Assume that the initial configuration of the ith integration point in the element is characterized by (   r   n i   ,    q ⌢    n i   ) . An arbitrary rigid-body motion (   r   r   ,    q ⌢    r   ) is superposed onto the element, resulting in the new configuration at point (   r   m i   ,    q ⌢    m i   ) as  (B.1)     r ⌢    m i   =    q ⌢    r   ∘ (    r ⌢    n i   +    r ⌢    r   ) ∘     q ⌢    r   ⁎       (B.2)     q ⌢    m i   =    q ⌢    r   ∘    q ⌢    n i   .      The strain measures are  (B.3)    χ   i   =  {        ε   i           κ   i        }  =   [       ‖    r   i   ′    ‖  −   ε   0 i         −   r   i   ″   •   e   2   i     ‖    r   i   ′    ‖   −   (   κ   01   )   i           r   i   ″   •   e   1   i     ‖    r   i   ′    ‖   −   (   κ   02   )   i         ( 2    q ⌢    i   ⁎   ∘    q ⌢    i   ′   )   4   −   (   κ   03   )   i        ]  T    where the subscript ‘4’ in the 4th item of the matrix denotes the 4th item of the quaternion in the parenthesis. Denote the strains in the initial and present states by   χ   n i   and   χ   m i   , respectively. Clearly, the sufficient condition of strain objectivity is stated as  (B.4)    χ   n i   =   χ   m i   .   It can be known from Eqs. (27) and (28) that  (B.5)   ∑  j = 1  n     C   i j   ( 1 )    = 0 ,      (B.6)   ∑  j = 1  n     C   i j   ( 2 )    = 0 .   With the differential quadrature analog, one has  (B.7)     r ⌢    m i   ′   =    q ⌢    r   ∘  (   1    μ   i      ∑  j = 1  n     C   i j   ( 1 )      r ⌢    n j     )  ∘    q ⌢    r   ⁎   +    q ⌢    r   ∘  (   1    μ   i      ∑  j = 1  n     C   i j   ( 1 )     )     r ⌢    r   ∘    q ⌢    r   ⁎   =    q ⌢    r   ∘    r ⌢    n i   ′   ∘    q ⌢    r   ⁎     and  (B.8)      r ⌢   ″   m i   =    q ⌢    r   ∘  (   1    μ   i      ∑  j = 1  n     C   i j   ( 2 )      r ⌢    n j     )  ∘    q ⌢    r   ⁎   +    q ⌢    r   ∘  (   1    μ   i      ∑  j = 1  n     C   i j   ( 2 )     )     r ⌢    r   ∘    q ⌢    r   ⁎   =    q ⌢    r   ∘    r ⌢    n i   ′   ∘    q ⌢    r   ⁎     Thus,  (B.9)   ‖    r   m i   ′    ‖  =      q ⌢    r   ∘    r ⌢    n i   ′   ∘    r ⌢  ′   n i  ⁎  ∘    q ⌢    r   ⁎     =      q ⌢    r   ∘ (   ‖    r   n i   ′    ‖  2  ) ∘    q ⌢    r   ⁎     =  ‖    r   n i   ′    ‖       q ⌢    r   ∘    q ⌢    r   ⁎     =  ‖    r   n i   ′    ‖    resulting in  (B.10)    ε   m i   =   ε   n i   .   It can be deduced from Eq. (B.9) that  (B.11)    κ   m 1 i   −   κ   n 1 i   =     [     r ⌢    m i   ″   ∘ (    q ⌢    r   ∘    e ⌢    n 2   i   ∘    q ⌢    r   ⁎   ) ]   1     ‖    r   m i   ′    ‖   −     (    r ⌢    n i   ″   ∘    e ⌢    n 2   i   )   1     ‖    r   n i   ′    ‖   =     [    q ⌢    r   ∘    r ⌢    n i   ″   ∘    e ⌢    n 2   i   ∘    q ⌢    r   ⁎   ]   1     ‖    r   n i   ′    ‖   −     (    r ⌢    n i   ″   ∘    e ⌢    n 2   i   )   1     ‖    r   n i   ′    ‖   = 0   and  (B.12)    κ   m 2 i   −   κ   n 2 i   =     (    r ⌢    n i   ″   ∘    e ⌢    n 1   i   )   1     ‖    r   n i   ′    ‖   −     [    r ⌢    m i   ″   ∘ (    q ⌢    r   ∘    e ⌢    n 1   i   ∘    q ⌢    r   ⁎   ) ]   1     ‖    r   m i   ′    ‖   =     (    r ⌢    n i   ″   ∘    e ⌢    n 1   i   )   1     ‖    r   n i   ′    ‖   −     [    q ⌢    r   ∘    r ⌢    n i   ″   ∘    e ⌢    n 1   i   ∘    q ⌢    r   ⁎   ]   1     ‖    r   n i   ′    ‖   = 0   where subscript ‘1’ denotes the first item of the corresponding quaternion.  The rotation quaternion is given as  (B.13)     q ⌢    m i   ′   =  1    μ   i      ∑  j = 1  n     C   i j   ( 1 )      q ⌢    m j    =    q ⌢    r   ∘  (   1    μ   i      ∑  j = 1  n     C   i j   ( 1 )      q ⌢    n j     )  =    q ⌢    r   ∘    q ⌢    n i   ′     Therefore,  (B.14)  2    q ⌢    m i   ⁎   ∘    q ⌢    m i   ′   = 2    q ⌢    n i   ⁎   ∘    q ⌢    r   ⁎   ∘    q ⌢    r   ∘    q ⌢    n i   ′   = 2    q ⌢    n i   ⁎   ∘    q ⌢    n i   ′     One then has  (B.15)    κ   m 3 i   −   κ   n 3 i   =   ( 2    q ⌢    m i   ⁎   ∘    q ⌢    m i   ′   )   4   −   ( 2    q ⌢    n i   ⁎   ∘    q ⌢    n i   ′   )   4   = 0      Eq. (B.4) is obtained from combination of (B.10)–(B.12) and (B.15).   REFERENCES", "highlights": "In this paper a total Lagrangian weak form quadrature element formulation of spatial shear-rigid beams undergoing large displacements and rotations is presented. A geometrically exact beam model with zero transverse shear deformation is adopted. Quaternion representation of finite rotations of spatial beams is used to avoid possible singularity in parameterization of rotation. The formulation reduces the number of degrees of freedom within the element as well as satisfies the demand of strain-objectivity. Several numerical examples are presented to illustrate the feasibility of the formulation."}