{"id": "S0168874X15001407", "article": "MAIN-TITLE An integrated finite element-based simulation framework: From hole piercing to hole expansion   HIGHLIGHTS          Developed an integrated FE framework from hole piercing to hole expansion.      Accurately captured the shear edge burr formation trend in the hole-piercing models.      Carried Shear edge information after hole-piercing into hole-expansion model.      The calculated HER in the hole-expansion model correspond well with experiments.          KEYPHRASES   Hole piercing  Hole expansion ratio  Finite element simulations  Aluminum alloys   In stamping operations of automotive body panels, steel and aluminum sheet metal workpieces are subject to blanking, trimming and piercing processes, including edge trimming, hole piercing, and window blanking, etc. In addition to geometric imperfections such as burrs, mechanically sheared or trimmed edges also contain excessive plastic deformation and local damage along the perimeter of the workpiece subjected to shearing operations. These shear-induced edge imperfections can lead to edge cracking in the subsequent stamping and forming operations, hence considerably compromise the formability of the materials.  Cracks stemming from previously sheared edges is a well-known problem for forming, and there are abundant experimental studies for steels [1–4] studying hole expansion of pierced holes. Still, predictive analyses on the influences of shearing processes/parameters on the subsequent formability are scarce due to the following difficulties: (1) accurately predicting the sheared edge geometry and damage and (2) effectively and accurately incorporating the above-predicted shearing-induced edge geometry and damage into the subsequent formability simulations.  Due to various global initiatives for improved fuel efficiency, aluminum sheets have received increasing attention in recent years as a practical replacement for steel sheets targeting vehicle weight reduction. Although there are numerous studies about shearing-induced defects in aluminum sheets, systematic and quantitative studies detailing the influences of the various shearing process parameters on the edge cracking during subsequent forming processes are quite limited.  Golovashchenko et al. studied edge cracking during tensile stretching of both aluminum [5] and steel [6,7] sheets trimmed along a straight line. Experimental observations after fracture of the trimmed part showed that tensile stretchability can decrease in excess of 50% depending primarily on the cutting clearances. It was reported that the planar failure mode varies from shear-type failure typical for small clearances to splitting-type failure where the cracking starts from the edge and propagates normal to the edge across the width of samples, usually observed in case of large cutting clearances. Hu et al. [8] developed an integrated finite element-based framework to study the tensile stretchability of previously trimmed AA6111-T4 aluminum sheets. The integrated framework includes a two-step finite element modeling analyses. First, a two-dimensional (2D) plane strain trimming model simulation is performed considering various trimming parameters such as clearance, punch radius and scrap support, etc. Next, the predicted edge geometry, plastic deformation and damage are carried over to the subsequent three-dimensional (3D) half dog-bone tensile model for stretchability predictions. The linkage between the two models is established with an ABAQUS/Python post- and pre-processing script, ABAQUS CAE and a user material subroutine (VUMAT). It has been demonstrated that the predicted stretchability results quantitatively compare well with experimental observations, including variation of tensile elongation, planar failure modes, and multiple edge cracking behaviors with varying cutting clearances.  Sartkulvanich et al. [9] used 2D axis-symmetric finite element models to simulate both the hole piercing and the subsequent hole expansion processes in DP590 steel. The burr geometry and strain and damage information from the blanking simulations are carried into the hole expansion process, and the calculated critical hole expansion ratios (HERs) defined by formula (1) were compared with experimental measurements for different blanking clearances.  (1)   H E R =     D   f   −   D   0       D   0     × 100 %    where HER is the percentage change in the diameter (D  f ) of the expanded hole before a through-thickness edge crack can be detected in reference to the originally pierced hole (D 0).  Using the 2D axis-symmetric model to represent the hole blanking process is a well justified assumption. However, the 2D model is not sufficient to capture the edge cracking behavior during hole expansion test because the experimentally observed radial cracks along the edge cannot be represented in the 2D model where cracks may propagate in the direction deviating from the radial direction. Therefore, there is a lack of clear explanation on edge cracking in the finite element model, and the calculated HER for different hole piercing clearances may not be reliable. In the current work, the integrated framework developed by Hu et al. [8] is employed, and the 2D axis-symmetric hole piercing model with a rather fine mesh is selected to accurately account for the highly nonlinear contact geometry between the sharp-corner of the piercing tool and the sheet being processed. The 3D model is used for the subsequent hole expansion process with consideration of the sheared edge information predicted from the previous hole piercing model. The HER is calculated and examined for different cutting clearances and compared with experimental measurements.   METHODOLOGY   For accurate predictions of edge stretchability during hole expansion, i. e., the critical HER, of previously hole-pierced sheets, an accurate calculation of edge conditions resulted from piercing, such as damage and plastic deformation, is essential. Fig. 1 show the 3D models of both the hole piercing and hole expansion tools. Fig. 2 shows the finite element model setup for the hole piercing process of a 0.9-mm-thick (t) sheet to produce a ⌀10mm hole. The model uses 2D axis-symmetric elements with reduced integration and hourglass control (CAX4R) to model the sheet material. The clamp, punch dies are assumed to be rigid bodies. Typically in industry, tool corners are very sharp, although they can evolve with time due to tool wear. Here, the die corner radii are assumed be 20μm to represent fresh die conditions. In the model, the sheet material being pierced is an AA6111-T4 aluminum alloy and assumed to be an elasto-plastic deformable body. Because damage and fracture near the cutting edge will be emphasized, commercial finite element package ABAQUS/Explicit [10] is used. For accurate modeling of tool/sheet contact, a rather fine mesh size (6×10μm2) is used in the shear zone. To reduce the problem of mesh distortion at large deformation and prevent tool/sheet penetration, arbitrary Lagrangian–Eulerian (ALE) adaptive meshing and adaptive contact algorithms are used [11]. The tool/sheet contacts are assumed to obey a simple Coulomb’s law with a constant friction coefficient of 0.1.  The sheet material is assumed to be isotropic, while the elastic constants, i. e., Young’s modulus and Poisson’s ratio, are assumed to be 70GPa and 0.33, respectively, which is typical of aluminum alloys. An isotropic J2 flow rule is used for plasticity. In our previous work, the work-hardening behavior was represented by a three-section Ludwik power law fitting [11] for the experimental uniaxial tension test:  (2)   σ =   σ   0   i   +   k   i     ϵ     n   i     ,  i = 1 − N       It must be noted that the plastic flow curve obtained from the tensile test for AA6111-T4 is valid only for the portion up to the limit strain of uniform deformation before the ensuing diffuse and localized necking behaviors. This limit strain is about 0.18, quite low compared with the local strain at necking and deformation in the shear zone during trimming of AA6111-T4 sheets. Detailed fracture surface observation of the grain shape at or near the sheared surface indicates that deformation strain can reach as much as 2, sometime even higher. The flow curve at large strains used in the finite element model essentially is an extrapolation of the last section of the Ludwik power law fitting.  Recently, Golovashchenko et al. [12] performed accumulated rolling and subsequent tensile tests to determine the flow stress at large strains of the AA6111-T4 sheet used in the current studies. The data are shown as two different symbols: the blue ones stands for the results when the accumulated rolling and tension direction (ARTD) parallel to the rolling direction (RD) of the as-received sample and the red circular one parallel to the transverse direction (TD). The two sets of data are almost identical, indicating that the current assumption of isotopic plasticity is quite reasonable for the current AA6111 T4 alloy studied. The previously determined three-section Ludwik parameters appear to be rather close to the new data obtained through accumulated rolling and tensile test results. A better fit for the accumulated rolling and tension test data is shown in Table 1 and Fig. 3. Since    σ   0   i   = 0  for i=2, the last sections actually follow the Holloman power law. In the current study, the new Ludwik parameters are used for both the hole piercing and hole expansion simulations.  The material damage is assumed to follow a strain-based accumulated damage model,  (3)   D =  ∫ 0    ε   p        d   ε   p        ε ¯    f         where   ε   p   and    ε ¯    f   are plastic and critical fracture strain, respectively. The accumulated damage model assumes that material failure will occur when the value of the accumulated damage (D) reaches unity. The critical fracture strain is assumed be to a function of stress triaxiality (η) [11], and the Rice–Tracey model [13] is used for the relations between critical fracture strain and triaxiality,  (4)      ε ¯    f   = A   e   − B η         Since identical mesh size is used in the shearing zone as those in sheet trimming models [11] based on the observation of grain shape near the fracture surface, the damage parameters A and B in the 2D hole piercing model are chosen to be the same as those reported in the trimming simulations [11]: A=2 and B=1.609. The same is true for the 3D hole expansion simulations with respect to the 3D tensile stretchability studies [8], where the Rice–Tracey parameters are A=1 and B=0.83. The reduced Rice–Tracey strains result from the much coarser meshes used in the 3D simulations, the reason of which has been discussed in detail by Hu et al. [8].  For simulating processes involving axis-symmetric drawing, such as hole expansion, 2D models representing the sheet surface can be used along with shell elements to save computational time. Such a model, however, cannot predict through-thickness information including cutting edge geometry, damage, or plastic deformations resulted from the hole piercing process. An alternative 2D simplification is a model representing the through-thickness cross-section of the material with axis-symmetric elements [9] similar to those of the hole piercing model. Still, such a 2D model cannot capture the edge cracking behavior as described previously. In the current work, a 3D model is developed. In order to save computation time, the mesh size in the 3D model is much coarser than the hole piercing model. A quarter of the hole expansion model is considered to simulate the ISO16630-2009-based hole expansion test [14] with the geometric dimensions shown in Fig. 4. The dimensions are the same as those of the experimental hole expansion test [15]. The holders and punches are assumed to be rigid bodies with the friction coefficient set at 0.1. The holders are fixed, and the hole expansion is accomplished by the vertical downward movement of the cylindrical punch tool. The outer circumference of the sheet is fixed to prevent it from being drawn in.  Similar to the approach described by Hu et al. [8], a Python script is written to post-process the results of the 2D axis-symmetric hole piercing model, where the coordinates of the part side cutting edge are recorded ( Fig. 5(a)). Those coordinates are used for sketching the 2D geometry of the pierced hole edge (Fig. 5(b)), representing a cross-section of the 3D hole expansion model as shown in Fig. 5(c). Fig. 6 illustrates the mesh generated for the 3D model, where the average mesh size near the pierced hole is 180μm. The 3D brick element C3D8R with reduced integration and hourglass control is used.  The Python script also is used to record the location-dependent equivalent plastic strain, damage (D), and stress tensors of each integration point at and near the cutting edge of the trimming model. The recorded information is mapped into the 3D hole expansion model. The mapping is accomplished via a vectorized user material subroutine (VUMAT) based on the routine developed by Hu et al. [16], where field variables (such as plastic strains) are mapped into the 3D model based on coordinates (xs, ys). The mapping procedure is similar to that described by Hu et al. in [17] but with cylindrical coordinates instead of Cartesian coordinates. The field variable value for an integration point (i) in the 3D model is determined by the (s) stored values from the hole piercing model based on the distance (dis ) between the integration point i (R  i  , Z  i ) in the 3D model and those points stored (r  s  , z  s ).  (5)     d   i s   =   [    (    R   i   −   r   s    )  2  +   (    Z   i   −   z   s    )  2   ]   0.5         The field variable of the sth point in the 2D model, which has a minimum distance to the ith point in the 3D model, is assigned to this ith point in the 3D model.    Fig. 7 shows the results of the mapping of initial plastic strain (one of the field variables) from the 2D axis-symmetric piercing model to the 3D hole-expansion model. It needs to be noted that initial plastic strain has already been scaled based on Taylor factor as described in the subsequent section.  Unlike in the hole piercing model, where elastic, plastic, and damage properties of the AA6111-T4 alloy are represented in the ABAQUS input file by tabular form data points, the material properties in the 3D hole expansion model are realized by the ABAQUS/Explicit user materials subroutine VUMAT. One reason is the data interpolation of field variable values from the 2D piercing model into the 3D model (as mentioned previously), while another benefit of using a user material subroutine is that it also can be used to incorporate the grain level material heterogeneity and customized material damage models. Similar to those reported by Hu et al. [17,18], the grain level heterogeneity is represented by the Taylor factor of grains (M  g ), and the grain’s relative strength is represented by the ratio R between the Taylor factor of each grain (M  g ) and average Taylor factor (  M ¯  ):  (6)     R   g   =     M   g     M ¯         In the current work, the Taylor factor is randomly assigned to each integration point (or element) in the model (see Fig. 8), and the work-hardening behavior of each grain follows the expression:  (7)     σ   g   =   R   g   σ    where σ is calculated through Eq. (2).  The initial field variables for each integration point, such as plastic strain and damage, also can be scaled with the consideration that a softer grain would have larger deformation and more damage during the hole piercing process:  (8)     ε   g   p   ( 0 ) = ε  ( 0 )  / R   D   g    ( 0 )  =   D   g    ( 0 )  / R       The 2D axis-symmetric hole piercing simulations of a ⌀10mm hole are performed for six cutting clearances (δ): 5%, 10%, 15%, 20%, 30%, and 40%, where the cutting clearance is defined as  (9)   δ =  g t  × 100 %    in which g is the punch/holder gap and t is the sample thickness (see Fig. 1).  In addition to the comparisons between predictions and measurements for various piercing clearances in terms of geometric features such as burr height, burr shape, rollover and burnish height, Fig. 9 also shows the predicted equivalent plastic strain contours for different piercing conditions. The results demonstrate that almost no burrs formed at the part side of the sheet under hole piercing with clearances between 5% and 25%. On the contrary, burrs are observed at larger clearances, 30% and 40%. This compares quite well with experimental hole piercing results, which will be further discussed later.    Fig. 10 shows the mapped initial plastic strain from the hole piercing model to the hole expansion model, where Taylor factor scaling is used. As reasoned by Hu et al. [8] in the straight edge trimming–stretchability simulations, the damage (D 0) from the hole piercing simulation does not carry into the hole expansion simulations here. Instead, the initial damage is estimated based on the initial plastic strain with the following equation:  (10)     D   g    ( 0 )  =     ε   g    ( 0 )      ε   c             Fig. 11 depicts the predicted plastic strain contours for various piercing clearances at the moment a through-thickness crack is identified at the edge of the pierced hole. At this moment, the hole’s diameter is recorded for calculating the critical HER (see Eq. (1)). The results are shown in Fig. 12 as the red line. As evident from Fig. 10, more uniform deformation is predicted in the sheet material under the hole expansion punch for cases with clearances less than 20%. Plastic strain is more concentrated at the hole edge, with little deformation in the region away from the pierced edges for clearances of 30% and 40%. The predicted HER reflects this observation as well. The HERs change very little for the cases with clearances less than 20%, but then suddenly decrease for clearances larger than 20%. The trend of variation of the calculated HERs corresponds well with experimental measurements [15] (shown as discrete points in Fig. 11).  Experimental hole piercing can be far from the ideal axi-symmetric condition simulated above. As described in the trimming operations [11], tool stiffness is one problem that can result in cutting clearance variation as the hole piercing process progresses. Another issue is that the punch cylinder may be off-center from the upper and lower cylindrical clamp tools, resulting in variable clearances along the circumference of the hole. Cross sections can be cut at different locations around the pierced hole. The actual clearances of these locations can be measured based on the method described by Hu et al. [11]. Experimental results show that no burr is formed for nominal clearances less than 25%. For 30% clearance or larger, burrs are apparent. This corresponds well with previously mentioned simulation results showing no burrs appearing for clearances less or equal to 25%. Burrs are obvious in both simulations and experiments for clearances are equal to or larger than 30% (Fig. 9).  As shown in Fig. 12, the predicted HER is close to the results from experimental measurements for different hole piercing clearances. Here, it must be noted that the piercing clearance variation along the hole circumference observed experimentally is not considered in the current finite element models, i. e., the 3D hole expansion models are constructed with the 2D piercing simulation predicted edge geometry (i. e., burr, roll over and burnish, etc.) under a specific piercing clearance. The influence of such variances on the HER remains unclear, and warrants further studies. In addition, the HER measurement is done by observing the occurrence of through-thickness edge cracks with the aid of a charge-coupled device (CCD) camera. Therefore, it is subject to human error. An alternative of determination of the critical HER is by observing the punch load versus punch displacement curve. Fig. 13 shows these curves calculated by finite element models of hole expansions for different cutting clearances, where the location of the first-observed through-thickness crack is marked by arrows. The location shown by arrows in the figure is quite different from the location with maximum load but corresponds more to the point of the load displacement curve, which deviates from the curve if no failure occurs. It should be noted that the hole expansion test equipment used in the current work does not have the capability of recording load during the hole expansion process, otherwise the results of simulations for the load–displacement curves can be numerically compared with the experiments.  As described herein, the critical HER for hole expansion of previously hole-pierced aluminum sheets can be successfully calculated using the integrated framework that incorporates the deformation and damage information of the piercing step into the hole expanding step. With this computational framework established, potential methods for improving edge quality and stretchability may be investigated. In this section, we discuss the effects of two methods: (1) removing initial plastic strain and (2) using dull punch.  As reported in the literature, the damage in aluminum 5xxx and 6xxx alloys typically stems from excessive plastic deformation [19–22] versus the gradual void nucleation and coalescence processes in many other alloys. This is confirmed experimentally in the current AA6111-T4 alloy as very little physical damage (i. e., voids) is observed near the fracture surface of the sheared sheets. This indicates that HER may improve significantly if the initial plastic strain can be reduced or removed. This observation can be tested using the above described integrated HER prediction framework by setting the initial plastic strain to be zero for different piercing clearances. The critical HERs obtained are shown as the solid green line in Fig. 12 which demonstrates notable improvement of the critical HER. The predicted equivalent plastic strain contours during punching for the hole pierced with 40% clearance are shown in Fig. 14: Fig. 14(a) with the original (as pierced) edge condition, and Fig. 14(b) with the annealed (initial plastic strain removed) edge condition. It can be seen that with the edge initial plastic strain removal, much higher and more uniform deformation is sustained in the entire contact region between the punch and the sheet outside the hole area, while the HERs are dramatically improved for the holes pierced with clearance higher than 20%.  As previously reported in trimming of straight edges, the combination of a dull punch and scrap support will transfer the burr from the part side to the scrap side by moving the crack initiation site to the corner of the lower holding die instead of the upper trimming die. Experimentally, the resulted fracture surface at the cutting zone also is much smoother, which significantly increases ductility for the later stretching deformation. Similar concept also applies to the hole piercing process. However, the hole piercing process is different from the straight edge trimming process in that the former has the axis-symmetric membrane constraint on the scrap button, while in the latter case, the scrap side is free to move without scrap support. With the axis-symmetric membrane constraint, scrap support may not be necessary. To investigate this, finite element models have been established for various dull punches with the punch corner radius (r) ranging from 20μm (baseline) to 0.12mm and 0.24mm.    Fig. 15 compares the predicted edge conditions at different piercing clearances for the dull punches. Compared to those of the sharp punch as the baseline, when r=0.12mm, the simulation shows the burr shifts to the scrap side when the clearance is 30%, while when the clearance is 40%, the burr is still on the pierced edge (Fig. 15(aʹ)–(fʹ)). During trimming or hole piercing process, two possible crack initiation sites exist on the sheet metal: the contact corner with the upper punching die and the contact corner with the lower holding die. For the dull punch with r=0.12mm, only the crack at the corner of the lower holding die develops and propagates to final fracture for all clearances (see Fig. 16(a) as one example for 5% clearance) except 40%. Both cracks develop for the case at 40% clearance (Fig. 16(b)), but the one near the corner of the punch die prevails and propagates to final fracture. As the punch radius increases to 0.24mm, the burr shifts to the scrap side completely for all cutting clearances considered (Fig. 15(a2)–(f2)).  Apart from the burr, the sheared edge of a sheet material can be separated into different zones: non-fracture and fracture zones (Fig. 15(f)). The non-fracture zone includes a rollover region that undergoes a bending deformation and an indentation region that is indented by the punch die. Fig. 17 depicts plots of the normalized height (with respect to sheet thickness) of rollover (a), indentation (b), and fracture (c), as well as the normalized burr height (d) for different cutting clearances and punch radii. The general trend for the rollover regions is that it increases with clearances due to the increasing bending moments. This is true for punch radii of 0.02mm and 0.12mm with the latter higher due to a later crack initiation process. This trend also holds for the punch radius of 0.24mm for clearances less than 20%. For clearances larger than 20%, the rollover almost is unchanged. This may be due to the fact that the crack propagation path for the dull punch is mainly initiating from the sharp corner of the lower holding die (see Fig. 18) due to the much lower stress and strain concentration of the material at the contact corner with the dull punch. The crack propagation paths are quite similar for all clearances and have an angle around 20° in reference to the vertical line, but they end up in disparate regions for different cutting clearances. The final fracture occurs within the indentation regions for clearances less than 20%, while it occurs in rollover region for clearances larger than 20%, essentially leaving no indentation section on the part side. This is reflected by the blue dotted line in Fig. 17(b), where the indentation region in the part side is shortened with increasing clearances and equals zero for clearances larger than 20%.  The crack propagation path is quite different compared with that for sharp punch (r=0.02mm). The stress and strain concentrations near the sharp corner of lower holding die are comparable with those under the sharp corner of the punch die with the latter slightly larger due to large bending deformation (see Fig. 19(a)). For clearances less than 20%, the crack initiates from both corners (Fig. 19(b)). However, the crack under the punch die appears earlier, and the large deformation regions in front of the two cracks interact with each other and form a final fracture in the middle, and the angle of fracture path increases with clearances from approximately 5° to about 25°. For the case with clearances of 30% and larger, only one crack initiates under the punch and propagates to final fracture through the thickness. The indentation region is left on the part side for all clearances and increases with clearances (Fig. 17(b)).  For dull punch with r=0.12mm, the indentation decreases with clearances for clearances less than 25%. The indentation is zero for 30% clearance because the crack propagation ends up in the rollover region, similar to those discussed for r=0.24mm. Therefore, the indentation variation for dull punch with r=0.12mm lies in between those for a sharp punch (r=0.02mm) and a duller punch (r=0.24). However, there is an exception for clearances of 40%, where the indentation region height for a clearance of 40% is quite large and a very long burr is observed. This is because, for these large clearances, the crack at the punch die initiates earlier and prevails over the crack initiated later at the sharp corner of the lower holding die due to much higher triaxiality at the region of the plate at the upper bound of the punch die corner, where the sheet tends to lose contact with the die ( Fig. 20). Furthermore, there is much higher deformation in the deformation zone for r=0.12mm with 40% clearances, leading to inferior subsequent hole expansion formability as long as the burr still is on the part side. The long indentation section with dull punch can be explained by the fact that there is smaller local stress and strain near the corner that can sustain more punch indentation before the crack is initiated. This has been observed experimentally during traditional straight line trimming ( Fig. 21), which shows that duller punch (r=0.12mm) would increase the rollover, indentation lengths and burr height of trimmed sheets than sharp punch (r=0.02mm) and is verified by finite element simulations.  The fracture zone height shown in Fig. 17(c) decreases with clearances until 25% for punches with r=0.02mm and 0.12mm due to increased rollover and indentation. This trend changes at 30% or larger clearances due to the burr formation, or zero indentation in the case of 30% clearance with r=0.12mm. The fracture zone height increases with clearance for r=0.24mm because more and more indentation or rollover is contained in the scrap part of the sheet with increasing cutting clearances.  As described previously, no burr is observed for clearances smaller than 30% with sharp punch (r=0.02mm), and burrs form for clearances 30% and greater. This is noted by the black line in Fig. 17(d). When the punch radius increases to 0.12mm, a burr forms only when the clearance is 40%, but the burr height for this clearance is considerably larger than that with sharp punch. No burrs form for all clearances when the punch radius is increased to 0.24mm.  With a relatively smooth fracture surface for dull punches similar to those observed in straight edge trimming with scrap support, improvements in hole expansion formability can be anticipated. Because crack initiation sites are different for each case, no burrs occur at clearances lower than 20% for all cases, and the fracture surface characteristics are different. The simulation with a sharp punch corner shows an indentation section, while the one with dull punch does not, and the deformation is shallower for cases with sharp punch than of those with dull punch.  With the sharp punch, the deformation region of the sheared zone increases slightly with increasing clearance from 5% to 20%, beyond which the deformation region of the sheared zone expands considerably due to the burr formation on the part side. For dull punch with r=0.24mm, the deformation regions of all clearances are similar to each other, which lies in between those predicted for small and large clearances for the sharp punch. Based on the fact there is less variability in the deformation zone for cases with holes pierced by dull punch (r=0.24), less variability can be anticipated in the critical HERs during subsequent hole expansion tests.  Incorporating the predicted edge conditions for the dull punch (r=0.24mm) for all of the aforementioned cutting clearances, hole expansion simulations are performed using the integrated framework. The predicted HER is shown in the blue line in Fig. 12 in comparison with the sharp punch benchmark (red line). In general, the HER does not show much improvement for cutting clearances less than 20% compared to the results from sharp punches. However, the calculated HER results for clearances larger than 20% show substantial improvement compared to the baseline. For example, the HER value for a 40% clearance is around 30% with dull punch, which is much higher than the 14% for sharp punch.  It has been shown experimentally that hole expansion tests which use different punch dies can end up with diverse critical HERs. For instance, Chirac [23] has demonstrated that results from using conical dies are much higher than those using flat-bottom dies. Here, simulations with conical dies are also performed (see Fig. 22(a)) for different hole piercing clearances. The simulation results (Fig. 22(b)) confirm the experimental observation that the critical HER is higher when the conical punch is used instead of a flat-bottom punch. This punch geometry effect also seems to be more pronounced for cases with large piercing clearances.   CONCLUSIONS      • An integrated modeling framework carrying edge conditions from hole piercing to hole expansion has been used to predict the influences of various hole piercing parameters on subsequent hole expansion formability for aluminum alloy AA6111-T4.  By using previously calibrated material and damage properties, the hole piercing models predict burr formations only for clearances greater than 30%, which corresponds well with experimental observations. No burrs are observed for clearances 20% and below.  By incorporating the edge geometry and deformation incurred during the hole piercing process, predicted critical HERs show small variations for clearances less than 20%, while the values drop substantially after clearances exceed 30%. This corresponds quite well with experimental results.  Similar to those demonstrated in trimmed straight edge stretchability, the integrated framework shows that removing the initial plastic strain at the hole edges can significantly enhance the critical HERs for all piercing clearances.  Predicted results also show that using dull punch with a sufficient large corner radius can eliminate burr formation and improve critical HERs.   ACKNOWLEDGMENT   Pacific Northwest National Laboratory is operated by Battelle for the U.S. Department of Energy (DOE) under Contract No. DE-AC05-76RL01830. This work was partially funded by the DOE’s Office of FreedomCAR and Vehicle Technologies under the Automotive Lightweighting Materials Program managed by Mr. William Joost. The authors would like to thank Nan Wang at Oakland University, who provided the cross-section pictures of hole-pierced samples. The authors also would like to thank Yevgeniya Katykova and Amir Hassannejadasl for providing the results of accumulated rolling and tension tests.   REFERENCES", "highlights": "An integrated finite element-based modeling framework is developed to predict the hole expansion ratio (HER) of AA6111-T4 sheet by considering the piercing-induced damages around the hole edge. Using damage models and parameters calibrated from previously reported tensile stretchability studies, the predicted HER correlates well with experimentally measured HER values for different hole piercing clearances. The hole piercing model shows burrs are not generated on the sheared surface for clearances less than 20%, which corresponds well with the experimental data on pierced holes cross-sections. Finite-element-calculated HER also is not especially sensitive to piercing clearances less than this value. However, as clearances increase to 30% and further to 40%, the HER values are predicted to be considerably smaller, also consistent with experimental measurements. Upon validation, the integrated modeling framework is used to examine the effects of different hole piercing and hole expansion conditions on the critical HERs for AA6111-T4."}