{"id": "S0168874X16000123", "article": "MAIN-TITLE A composite mixed finite element model for the elasto-plastic analysis of 3D structural problems   HIGHLIGHTS          The element is simple and easy nevertheless is accurate and robust in plasticity.      The displacement and stress interpolations produces an isostatic element.      The element is locking free.      The piece-wise constant stress addresses the discontinuities in the plastic strain.      T.      The numerical experiments show that the element is stable also with irregular meshes.          KEYPHRASES   Mixed finite element  3D structural problems  Plastic collapse analysis  Elastoplasticity  Conic programming   The evaluation of the elastoplastic behavior of structures plays an important role in structural design. The finite element method is the most common numerical tool employed for the practical solution of many engineering problems including the evaluation of the plastic collapse state of structures. Improvements in the accuracy and reliability of finite element models for structural analysis have often been pursued using strategies based on complicated interpolations for the unknown fields. This can obscure the nature of the mechanical problem which is sometimes of simple interpretation. A more interesting approach may be the development of essential models [1,2] capable of capturing the main features of the structural behavior which could work well in a wide context. The plastic collapse state of a structure is, for example, characterized by a continuous displacement field and by strong concentrations and discontinuities in the plastic strain field. By simply considering this basic aspect a successful finite element (FE) model could be built [3]. The robustness of the numerical process, the accuracy with respect to all the mechanical fields involved in the numerical formulation and the applicability to a wide range of geometrical and numerical data are other desirable features of the model.  Another important aspect of the numerical model is its capability in analyzing structural problems with constraints on the possible strains, such as near incompressibility which concerns the elastic behavior of rubber-like materials and the broad field of elastic–plastic analysis when the plastic behavior is controlled by the deviatory part of the stress tensor and in bending problems. Compatible finite elements are usually unable to ensure the features described above and often they suffer from locking phenomena related to the choice of interpolations which are inadequate to describe internally constrained strains [4,5].  Several formulations have been proposed as alternatives to the compatible one in the context of linear elasticity. These include: the assumed stress formulations that, starting from the pioneering work by Pian [6], have been developed by several authors [7–9]; the mixed-enhanced elements that use additional strain fields to augment the compatible strain fields from the simplex interpolations [10]; elements based on the average nodal pressures/strains that compute the average volumetric strains or strains at nodes based on surrounding triangles or tetrahedrals [11,12]; the average nodal strain approach that alleviates the locking due to bending [13,14]. An assumed-strain finite element technique for the solution of plasticity problems stemming from the Nodally Integrated Continuum Element (NICE) formulation is presented in [12]. Another important family of FEM models is represented by the so-called smoothed-FEM [15] in which the average strain is assumed on the conflict faces of a background tetrahedral grid. In this category we also find the Edge-Smoothed and Node-Smoothed finite element model, developed for 2D problems, which assumes an average strain in a conflicting region associated to each edge or node of a background triangular mesh [16,17]. Smoothed elements have also been used successfully in plasticity problems [18,19].  In the analysis of elastic–plastic problems the finite element model should ensure even greater accuracy in determining the stress field and should be able to truly represent the strong strain concentration in the presence of the incremental collapse mechanism and then discontinuous fields. The presence of discontinuities makes many standard formulations, which furnish results sometimes poor in localizing the plastic regions and sensitive to the mesh pattern, of little use. In particular compatible elements with a point-wise enforcement of the plastic admissibility conditions in a series of Gauss points, even if still the most popular approach [20] are, in this respect, not the best possible choice. Recently, several mixed or generalized mixed formulations have been developed for 2D elasto-plastic problems. By formulating the optimality conditions of the elastoplastic holonomic step in a weak form, a class of three field elements has been proposed in [3,21] that allow discontinuities of the plastic multipliers and then of the plastic strains, within the element.  In this work a mixed finite element model which uses the assumption of an average stress field in the fashion of smoothed elements, also following the idea underlying the construction of composite elements [22,1], is proposed. It has been designed with the aim of describing solutions which can include the effects of discontinuous plastic strains as in [3]. The element is very easy to formulate and implement because it is based on simple assumptions for the displacement and stress fields, without any burden deriving from the management of a background mesh. As the internal variables are locally defined to the element, the proposed FEM model gives discrete operators with a smaller bandwidth with respect to existing smoothed FEMs. Furthermore it maintains the same algebra as a standard mixed element which makes it simple to implement also in existing codes. As the numerical results show, the element achieves the favorite framework in the plastic range where it takes advantage of the absence of volumetric locking, the capability of representing discontinuities within the element and the rather fine meshes required to describe complex data and constitutive discontinuities. Another great advantage is the computational efficiency which derives from the block-like shape of the complementary operator for which the inversion is trivial with respect to other FEM models for computing the algorithmic tangent operator.  The paper is organized as follows. Section 2 introduces the notation of the elastoplastic problem. Section 3 presents the assumed interpolations for the displacement and stress fields, reporting the closed-form expression of the discrete compatibility/equilibrium operator. Section 4 presents a unified variational formulation for both the limit analysis and the discrete holonomic elastoplastic step of a standard strain-driven formulation. The numerical results relative to a series of benchmarks are presented in Section 5. Finally Section 6 reports the conclusions.  We denote with σ [ x ] and ε [ x ] the stress and strain fields, and with x a point of the body domain Ω . Assuming perfectly plastic material, and omitting the dependence on x to simplify the notation, the stress σ is restrained to belong to the fixed admissible Elastic Domain   (1)  E ≡ { σ : f [ σ ] ≤ 0 , with  f [ 0 ] < 0 }   where f [ σ ] is a convex yield function. E will be closed and convex and its boundary ∂ E is characterized by f [ σ ] = 0 .  The strain increment   ε   ̇   can be subdivided into the elastic part     ε   ̇     e   and the plastic part     ε   ̇     p   . The elastic part is linearly linked to the stress through the elastic law:  (2)    σ   ̇   =   F   − 1       ε   ̇     e   =   F   − 1   (   ε   ̇   −     ε   ̇     p   )   where F is the compliance operator, symmetric and positive definite.     ε   ̇     p   can be other than zero only if the stress σ ∈ ∂ E and is defined by the plastic flow rule:  (3)      ε   ̇     p   =   γ   ̇   n [ σ ] ,    γ   ̇   ≥ 0 ,    γ   ̇     f   ̇   = 0 ,    γ   ̇   f = 0   vector n [ σ ] being contained in the sub-differential ∂ f [ σ ] of f in σ , for regular yield functions we have  (4)  n [ σ ] =   ∂ f [ σ ]   ∂ σ     In these hypotheses, the following Drucker condition holds:  (5)    (    σ   y   − σ  )   T       ε   ̇     p   ≥ 0  ∀ σ ∈ E       σ   y   and     ε   ̇     p   being related by the flow rule (3), (4).  Two standard yield functions will be considered. The classical H.V. Mises yield functions expressed as [20]   (6)  f [ σ ] ≡   J   2   [ σ ] −   τ   0   2   ≤ 0  with    τ   0   2   =     σ   0   2     3     where σ 0 is the uniaxial yield stress,   J   2   [ σ ] is the second invariant of the deviatoric stress tensor, 3   J   2   [ σ ] =   1   2     σ   T   P σ and  (7)  P = [     2   − 1   − 1   ·   ·   ·     − 1   2   − 1   ·   ·   ·     − 1   − 1   2   ·   ·   ·     ·   ·   ·   6   ·      ·   ·   ·   ·   6   ·     ·   ·   ·   ·   ·   6     ] ,      To study pressure-sensitive materials [20] we also introduce the Drucker–Prager conical yield surface in which the effect of the first invariant   I   1   [ σ ] of the stress tensor is considered  (8)  f [ σ ] ≡ α   I   1   [ σ ] +     J   2   [ σ ]   −   τ   0   ≤ 0   where α and τ 0 are material parameters obtained from the friction angle φ and the cohesion c as   α =   3  tan  φ     9 + 12  tan    φ   2       ,    τ   0   =   3 c     9 + 12  tan    φ   2       ,      With reference to 3D problems, a composite tetrahedral mesh is assumed over the domain lying in the ( x , y , z ) space. Within each tetrahedral element the displacement field is described by a continuous interpolation expressed in terms of parameters located on its boundary sides, while the stress field is represented by a discontinuous description obtained by introducing a subdivision of the element into four tetrahedral regions. Each face of the element is a triangle with six nodes [23].  The tetrahedral volume co-ordinate system makes the description of the relevant quantities of the discrete model compact and simple. The tetrahedral co-ordinates (   ξ   1   ,   ξ   2   ,   ξ   3   ,   ξ   4   ) are related to the Cartesian ones ( x , y , z ) by the transformation [23]   (9)  [     1     x     y     z     ] = [     1   1   1   1       x   1       x   2       x   3       x   4         y   1       y   2       y   3       y   4         z   1       z   2       z   3       z   4       ] [       ξ   1         ξ   2         ξ   3         ξ   4       ] ⇒ [       ξ   1         ξ   2         ξ   3         ξ   4       ] =   1   6 V   [       a   1       b   1       c   1       d   1         a   2       b   2       c   2       d   2         a   3       b   3       c   3       d   3         a   4       b   4       c   4       d   4       ] [     1     x     y     z     ]   where V is the element volume and the coefficients   a   i   ,   b   i   ,   c   i   ,   d   i   are implicitly defined through (9).  The integrals of the products between polynomial terms can be evaluated in closed form through the expression  (10)    ∫   V     ξ   1   α     ξ   2   β     ξ   3   γ     ξ   4   δ    dV =   α ! β ! γ ! δ !   ( α + β + γ + δ + 3 ) !   6 V      The interpolations of the Mixed Tetrahedron presented here and denoted, from now on, as   MT   10 / 4   are based on 10 displacement nodes and 4 stress regions. The element displacement field u [   ξ   1   ,   ξ   2   ,   ξ   3   ,   ξ   4   ] =   { u , v , w }   T   is an interpolation as  (11)  u [   ξ   1   ,   ξ   2   ,   ξ   3   ,   ξ   4   ] = Φ [   ξ   1   ,   ξ   2   ,   ξ   3   ,   ξ   4   ]   u   e   ,  Φ = [     ϕ   0   0     0   ϕ   0     0   0   ϕ     ]   where the matrix ϕ collects the quadratic shape functions   ϕ = [   ξ   1   ( 2   ξ   1   − 1 ) , ( 2   ξ   2   − 1 )   ξ   2   , ( 2   ξ   3   − 1 )   ξ   3   , ( 2   ξ   4   − 1 )   ξ   4   , 4   ξ   1     ξ   2   , 4   ξ   2     ξ   3   , 4   ξ   3     ξ   1   , 4   ξ   4     ξ   1   , 4   ξ   4     ξ   3   , 4   ξ   4     ξ   2   ]   while the element displacement vector  (12)    u   e   T   = [    u   1   , … ,   u   10   ,   v   1   , … ,   v   10   ,   w   1   , … ,   w   10    ]   collects the thirty displacement components of the ten nodes located at the vertices of the tetrahedral element and at the mid points of its sides (see Fig. 1 ).  The stress interpolation is assumed to be piece-wise constant over the element, allowing discontinuities within it. In particular, the stress components are taken as constant over each tetrahedral region defined by the element faces and the centroid (see Fig. 1). The stress components   σ   i   =   [   σ   xx   i   ,   σ   yy   i   ,   σ   zz   i   ,   σ   yz   i   ,   σ   xz   i   ,   σ   xy   i   ]   T   associated to each region V  i of the element are collected in the element vector of the stress parameters  (13)    β   e   =   [    σ   xx   1   , … ,   σ   xx   4   ,   σ   yy   1   , … ,   σ   yy   4   ,   σ   zz   1   , … ,   σ   zz   4   ,   σ   yz   1   , … ,   σ   yz   4   ,   σ   xz   1   , … ,   σ   xz   4   ,   σ   xy   1   , … ,   σ   xy   4    ]   T        The element equilibrium operator is obtained by the exact integration of the element contribution to the internal work  (14)    ∫   V     σ   T   ε  dV =   ∑   i = 1   4       ε   ¯     i   T     σ   i     V   i   =   β   e   T     D   e     u   e   ,      ε   ¯     i   ≡   1     V   i       ∫     V   i     ε  dV   where the linear strain field ε is derived through the compatibility equations from the assumed displacements. In particular introducing the small displacement differential operator D we have  (15)  ε = D u ,    D   T   = [       ∂   ∂ x     0   0   0     ∂   ∂ z       ∂   ∂ y       0     ∂   ∂ y     0     ∂   ∂ z     0     ∂   ∂ x       0   0     ∂   ∂ z       ∂   ∂ y       ∂   ∂ x     0     ]   The evaluation of the integral contribution over each region, by exploiting Eq. (10), is carried out analytically. In this way it is possible to obtain the following closed form expression of the equilibrium operator  (16)    D   e   T   =   1   96   [     b   0   0   0   d   c     0   c   0   d   0   b     0   0   d   c   b   0     ]   where the matrix b is defined as  (17)  b = [     −   b   1     3   b   1     −   b   1     −   b   1       −   b   2     −   b   2     3   b   2     − b 2     −   b   3     −   b   3     −   b   3     3 b 3     − 3   b   1   − 3   b   2   − 3   b   3       b   1   +   b   2   +   b   3       b   1   +   b   2   +   b   3       b   1   +   b   2   +   b   3       − 5   b   1   − 5   b   2     − 5   b   1   −   b   2     −   b   1   − 5   b   2     − 5 b 1 − 5   b   2       − 5   b   2   − 5   b   3     − 5   b   2   − 5   b   3     − 5   b   2   −   b   3     −   b   2   − 5   b   3       − 5   b   1   − 5   b   3     − 5   b   1   −   b   3     − 5   b   1   − 5   b   3     −   b   1   − 5   b   3       4   b   1   + 5   b   2   + 5   b   3     − 4   b   1   +   b   2   +   b   3     5   b   2   + 5   b   3     5   b   2   + 5   b   3       5   b   1   + 5   b   2   + 4   b   3     5   b   1   + 5   b   2     5   b   1   + 5   b   2       b   1   + b 2 − 4   b   3       5   b   1   + 4   b   2   + 5   b   3     5   b   1   + 5   b   3       b   1   − 4   b   2   +   b   3     5   b   1   + 5   b   3       ]   and the matrices c and d have the same structure as b , but contain the coefficients c  i and d  i respectively (see Eq. (9)).  The expression of the elastic energy in its complementary form  (18)    1   2     ∫   V     σ   T   F σ  dV =   1   2     ∑   i = 1   4     (   σ   i   )   T     F   i     σ   i     V   i   =   1   2     β   e   T     H   e     β   e    with    F   i   ≡   1     V   i       ∫     V   i     F  dV   allows us to introduce the discrete compliance operator   H   e   needed to complete the formulation of the   MT   10 / 4   .  The element contribution   p   e   to the external work is  (19)    p   e   ≡   ∫   V     Φ   T   b  dV +   ∫   ∂   V   f       Φ   T   t  dA   where b and t are the external bulk loads and assigned tractions on the element boundary ∂   V   f   .  Finally, introducing the vector function f [   β   e   ] =   [ f [   σ   1   ] , f [   σ   2   ] , f [   σ   3   ] , f [   σ   4   ] ]   T   , the plastic admissibility for the element stresses, decoupled at the stress region level, can be written as  (20)  f [   β   e   ] ≤ 0  ⇒  f [   σ   i   ] ≤ 0 ,  i = 1 ⋯ 4      Making q and β the global FE vectors and introducing the incidence element matrices for displacements   u   e   =   T   eu   q and stresses   β   e   =   T   e β   β we obtain, from the sum of all the element contributions to the stress–strain work (21), the compatibility/equilibrium operator  (21)     ∑   e       β   e   T     D   e     u   e   =   β   T   Qq  with  Q ≡    ∑   e    (    T   β e   T     D   e     T   ue    )   Similarly for the complementary energy (22) we have  (22)     ∑   e       β   e   T     H   e     β   e   =   β   T   H β  with  H ≡    ∑   e    (    T   β e   T     H   e     T   β e    )   Finally it is possible to obtain the global load vector p as  (23)     ∑   e      u   e   T     p   e   =   p   T   q  with  p ≡    ∑   e    (    T   ue   T     p   e    )      The previous description highlights the simplicity of the interpolations adopted for the stress and displacement fields and the compactness of the involved discrete operators.  The extension of the topological element format presented previously in [1] to the analysis of 3D bodies discretized by tetrahedrons preserves all the attractive features of the bidimensional approach. As the expression (17) shows, the resulting discrete operator has a compact form and the computer implementation of the model is still very simple. Moreover the simple stress interpolation adopted is equilibrated for zero volume loads, avoiding any co-ordinate transformation which could introduce noise related to the mesh distortion. The element proposed shares some properties with S-FEMs [24–26]. In particular from a topological point of view they are similar to the so-called cell-based elements [25] in which the mesh coincides with the discretization of the geometry and the smoothing effect is obtained by using a function for averaging the compatible strain on each subdomain. In the present model this effect is obtained considering an assumed stress method. In particular, similar to the plane element   MT   6 / 3   proposed in [1], the   MT   10 / 4   element presents a balanced, then optimal, number of displacement and stress parameters. For deeper discussions of this topic see [1,8]. The difference in the element   MT   10 / 4   with respect to ES-FEM, NS-FEM and FS-FEM elements is topological, as for these models the mesh and the discretization of the geometry are not coincident. Moreover even although they can be formulated by a mixed approach usually they are used in displacement based form. A mixed approach is the natural context for the formulation of elastoplastic problems as it furnishes the stresses used in the plastic admissibility condition directly. As in plastic analysis the use of fine meshes suitable to localize discontinuities in the plastic strains is the main mechanical aspect to be addressed, the discontinuous interpolation for the stress field will be shown to be particularly effective notwithstanding its simplicity.  In this section the elastoplastic step equations of a standard strain driven strategy are obtained using the mathematical programming formulation proposed in [3,27] to which we refer readers for further details. It includes, as a sub-case, the static theorem of the limit analysis. The mathematical programming point of view allows a simple and efficient use of Interior Point or Interior Point-like solution strategies [28].  The limit state of an elastoplastic body subjected to a load proportionally increasing with a scalar multiplier λ can be evaluated by using the theorem of limit analysis (direct methods) or by running a strain driven strategy based on the incremental computation of a sequence of discrete points along a time/loading process. When the load path is known the latter also gives quantitative information about the displacement field while the collapse multiplier λ  c is evaluated as the limit value for the equilibrium path. The approximation furnished by the static characterization of the collapse load, giving a safe estimate, is always more attractive from an engineering point of view.  In the following we will denote with a superscript ( n − 1 ) the quantities relative to the current instant/load in which the solution is known and with a superscript ( n ) the unknown quantities at the new instant. The symbol Δ ( · ) =   ( · )   n   −   ( · )   n − 1   will denote, henceforth, the difference between quantities at new state (n) and the quantities at current state (n−1). Following [27], the set of nonlinear equations of each finite step of the strain-driven path following formulation, when a Backward-Euler process is used to integrate the incremental constitutive laws (3), are obtained as the first order conditions of the following nonlinear convex optimization problem:  (24)     max   ( λ ,   β   e   )     Δ ξ λ −   1   2      ∑   e      ( Δ   β   e   )   T     H   e   Δ   β   e   , subject  to    Q   T   β = λ p  f [   β   e   ] ≤ 0  ∀ e ,   where the superscript (n) has been omitted to simplify the notation and Δ ξ represent the assigned step-length. In this way the path-dependent elastoplastic behavior is transformed into a sequence of finite holonomic steps. The Lagrangian associated to problem (24) is  (25)  L [ z ] = Δ ξ λ −    ∑   e , i    Δ   γ   e   i   f [   σ   e   i   ] −   1   2      ∑   e      ( Δ   β   e   )   T     H   e   Δ   β   e   + Δ   q   T   (   Q   T   β − λ p ) ,   where z = { q , β , γ , λ } collect all the problem variables and Δ q and Δ γ ≥ 0 are the Lagrangian multipliers associated to the equilibrium and plastic admissibility constraints respectively.  From the stationary condition of L with respect to   β   e   and Δ   γ   e   i   and exploiting the block structure of the compliance matrix   H   e   we obtain  (26a)  Compatibility :    D   e   Δ   u   e   =   ∑   i = 1   4   (    F   i   Δ   σ   i   + Δ   γ   e   i     ∂ f   ∂   σ   i      )  ∀ e Admissibility  and  consistency :  f [   σ   ( i )   ] ≤ 0  Δ   γ   e   i   ≥ 0  Δ   γ   e   i   f [   σ   ( i )   ] = 0 ,   while by performing the stationary conditions with respect to q and λ we obtain the equilibrium equations and the step length (arc-length) condition:  (26b)  Equilibrium :    Q   T   β − λ p = 0 Step  length :  Δ   q   T   p = Δ ξ   The previous equations can be easily solved using standard iterative approaches. In particular the stress   β   e   and the plastic multiplier Δ   γ   e   can be obtained by the exact solution of Eq. (26a) using standard Closest-Point projection algorithms, i.e. by solving them for each element and each stress region i   (27)     min   (   σ   i   )       1   2     (   σ   i   −   σ   tr   i   )   T     F   i   (   σ   i   −   σ   tr   i   ) , subject  to  f [   σ   i   ] ≤ 0   where   σ   tr   i   =   σ   n − 1   +   F   i   − 1     D   e   Δ   u   e   is the elastic predictor. The closest point projection problem in Eq. (27), due to the assumed stress interpolation, is very simple and decoupled for each tetrahedral finite element area in which the stresses are kept constant and, then, has the same format and cost of a four-node Gauss point integration scheme. From Eq. (27) we obtain both stresses and plastic multiplier as a function of the displacements that substituted in the equilibrium equations and the arc-length constraints in Eqs. (26b) furnish a nonlinear system of equations function of the displacements alone. Their solution is obtained iteratively using a standard Newton scheme. In this way the problem is described by a compatible format even when the FE is mixed and this, in general, increases the nonlinearity and affects the efficiency. When the elastoplastic step is solved as an optimization problem it is possible to use different, potentially more efficient, solution strategies with respect to that based on return mapping procedures by closest point projection schemes (see [28]).  In particular the Interior Point (IP) strategy [29,30] and its specialized implementations to limit and shakedown analysis [31–36] represents, nowadays, an established approach to solve this problem. Assuming this point of view the actual solution strategy can be implemented on the basis of a nonlinear programming technique suitable for solving (24). Readers can refer to [27,28] for more details of these aspects.  Furthermore the mathematical programming formulation in (24) allows the static theorem to be easily recovered by setting to zero the quadratic stress term in the objective function (see [27] for details). In this way the computation of the collapse multiplier is obtained as the solution of a single step of the proposed nonlinear mathematical programming problem while its solution can be effectively obtained with IP algorithms.  Most of the classical failure criteria employed in structural analysis can be represented in conic format [2,37]. It requires a simple variable change and in particular for the present model the stress assumption makes it very simple. For the conic formulation of the Von Mises yield criterion, for each subregion new variables have to be introduced  (28)    Z   i   −   A   i     σ   i   =   g   i    with    σ   i   =   T   σ   i   β   where  (29)    Z   i   =   [       z   0         z   1         z   2         z   3         z   4         z   5         z   6       ]   i   ,    A   i   = [     ·   ·   ·   ·   ·   ·       2   3     3     −     3     3     −     3     3     ·   ·   ·     −     3     3       2   3     3     −     3     3     ·   ·   ·     −   3   / 2   −   3   / 2     3     ·   ·   ·     ·   ·   ·     6     ·   ·     ·   ·   ·   ·     6     ·     ·   ·   ·   ·   ·     6       ]   g   i   =   [       c   y       ·     ·     ·     ·     ·     ·     ]   i     The subscript   ( · )   i   is used to indicate the sub-tetrahedron and   c   y   =   σ   0   i     2   . For the whole structure Eq. (28) becomes   Z − A β = g   where the block matrix A and the vectors g and Z , without apex, denote the assemblage vectors and matrices of the contributions for all the elements and subregions.  The static theorem of the limit analysis, deleting the quadratic terms from (24) can be rewritten as  (30)  max    h   T   x subject  to  Bx − ℓ = 0   Z   i   ∈   C   7    ∀  i = 1 ⋯   N   β     where h = [ 0 , 1 , 0 ] ,   C   7   is a second order cone defined as   C   n   = {  z ∈   R   n   :   z   0   ≥     ∑   k     z   k   2      } ,   N   β   represent the total number of stress regions and  (31)  x =   [ β , λ , Z ]   T   ,  B = [       Q   T     − p   0     − A   0   I     ] ,  ℓ =   [ 0 , g ]   T     The matrix 0 and I are null and identity matrix of the proper dimensions.  Slightly different is the case of the Drucker–Prager failure criterion. In fact it is only necessary to replace the first row of the matrix   A   i   by the vector row   q   I   =   6   α [ 1 , 1 , 1 , 0 , 0 , 0 ] and the new definition   c   y   =   τ   0   i     6   .  Even when a large number of linear constraints are introduced for the solution of the problem as conic, the solution is usually much faster and more accurate [37].  In respect of the plastic admissibility check some remarks are useful. The proposed element seems attractive because simplifies the choices regarding average procedures [3]. This aspect is important because here there are no complicated formulas of the definition of the constraints involved even when they are expressed as cones. This method corresponds then to a mixed formulation, also with respect to the plastic multipliers   γ   ̇   as defined in (3) assumed as piecewise functions with the same shape as the stress field.  Finally it is well known how a quadratically constrained quadratic programming problem can easily be transformed into a Second Order Cone Programming problem [38] so the elasto-plastic step can also be transformed and solved in this way. The elastoplastic analysis is performed by an implementation of the strain-driven algorithm as discussed in [28]. Moreover, since our objective is to test the performances of the proposed element, a standard numerical tool has also been chosen to solve the limit analysis in Eq. (30). In this way the proposed results for limit analysis are unaffected by our implementation details and comparisons with future proposals can be made in a standard and well consolidated environment without any special modifications. To this end a high level of accuracy, robustness and efficiency are obtained, by employing MOSEK [39] toolbox for MATLAB [40].  The good performances of the proposed model are investigated by performing some numerical tests. In particular the capability of the element in reproducing the plastic mechanism of classical 2D problems accurately without any deterioration in the solution when a dimension is small with respect to others in both in-plane bending dominated problems and stress concentration is checked. The element also shows little sensitivity to the mesh distortion and no locking phenomenon is detected in problems simulating plane strain conditions. Finally a purely 3D test, analyzed in nearly incompressible conditions is performed in order to make an exhaustive picture of the element behavior. Both the Von Mises and Drucker–Prager failure criterion are adopted in order to show how the stress assumption made is almost indifferent and how simple the numerical solution strategies are with respect to the shape of the yield surface. The proposed element is compared with the 10 nodes compatible tetrahedral elements   CT   10 / 4   and   CT   10 / 5   , with 4 and 5 integration points respectively, and with some reference solutions found in the literature.  The standard test known as Cook׳s problem, see Fig. 2 , is analyzed by using the three meshes shown. The analyses are performed by simulating the condition of plane stress, i.e. by constraining in its normal direction only one of the two plate planes parallel to the applied load. Young׳s modulus E=20000, Poisson׳s ratio ν = 0.3 and the yield normal stress     σ   ¯     y   = 1 are assumed in order to characterize the material and the intensity of the applied traction is 1. Fig. 2 also shows the dimension of the plate by indicating the coordinates of the 4 bottom corners. The plate thickness is 0.001.   Tables 1 and 2  report the values of the collapse load multiplier, the total number of loops and steps, the relative error, the CPU times required by each loop and each step, for each analysis performed by comparing the 3 meshes and the element formulations. Regular and irregular meshes have been analyzed and have been generated by considering a one edged element in the thickness and by dividing the sides on the other planes by n=4, 8 or 16 edge elements. Irregular meshes have been simply built by disabling the transfinite command of the mesh generator GMSH [41]. The accuracy in the evaluation of the collapse multiplier in the case of the   MT   10 / 4   element is always better than the other formulations and the CPU time per step of the   MT   10 / 4   element is lower than the time of the other formulations, particularly in the case of Mesh 2. The error reported in the same tables is evaluated with respect to the numerical solution obtained by the   CT   10 / 5   element and the finer mesh with n=64. In the same table the rows denoted by (Q) and (C) show the results obtained by performing the limit analysis on the basis of a quadratic or conic mathematical programming formulation respectively.  The contour maps of the equivalent plastic strain at collapse are shown in Fig. 3 by comparing all the meshes and the elements used in the analyses.  It is important to note that the numerical results obtained by the proposed element outperform the   CT   10 / 5   element notwithstanding the latter requires 5 nonlinear constraints per element while the proposed one only 4. This is because the subgrid implicitly defined by the stress interpolation better addresses the plastic deformation as the stress components are all independent from each other.  In the second test case a square plate, of side equal to 0.5, with a circular hole of radius 0.1 subjected to a traction is considered. The domain of the plate, only one-quarter needs to be analyzed, together with the applied load, the boundary conditions and the discretization meshes considered, are shown in Fig. 4 . In order to simulate a plane stress condition one of the two boundary planes parallel to the applied load is constrained along its normal direction. The material parameters are E=20000, ν = 0.3 and     σ   ¯     y   = 10 and the modulus of the applied boundary traction is equal to 10.   Table 3 reports the results of the step-by-step analyses comparing them with respect to the meshes and finite element formulations used. As can be observed the accuracy of the element proposed,   MT   10 / 4   , is better than the others without any effect on the computational costs. For each analysis the   MT   10 / 4   requires a total number of loops greater than the   CT   10 / 4   element but in any case lower than the loops required by   CT   10 / 5   . In any case, for example for Mesh 1, the error of the   MT   10 / 4   is almost equal to 2% while it is 2.8% and 2.7% for the   CT   10 / 4   and   CT   10 / 5   , respectively, and the CPU cost for each loop is practically the same.  The better performance is also highlighted in Fig. 5 where the error in the evaluation of the collapse load multiplier is plotted against the number of degrees of freedom and the total CPU time required by the analysis. The reference solution   λ   ref   = 0.803037 used for the plots of Fig. 5 is evaluated refining by splitting the Mesh 3 so obtaining a very fine mesh with 5323   CT   10 / 5   elements and 10906 nodes.   Fig. 6 shows the contour maps of the equivalent plastic strain at the final step evaluated for the elements considered in the case of Mesh 1 and Mesh 4. The high quality of the contour map relative to the   MT   10 / 4   element, a quality very close to that given by the   CT   10 / 5   element, can be observed.  In Table 4 the results relative to the same problem, but analyzing the plate by simulating a plane strain condition, are reported. In this case both the plate faces parallel to the applied load are constrained in its normal direction. In this case it can be observed that, on the same mesh, the values of the collapse multipliers given by   CT   10 / 5   and   MT   10 / 4   are very close but in almost all cases the number of loops produced by the   CT   10 / 5   is greater than the   MT   10 / 4   . In Fig. 7 the contour maps of the equivalent plastic strain at collapse are depicted.  The last test regards the 3D problem as can be seen in Fig. 8 and also analyzed in [42] where it is proposed in order to check the robustness of the finite element formulations with respect to a condition of incompressible elasticity. The problem domain, as can seen in the figure, is composed of two distinct volumes. The small volume, 5×5×1, is practically rigid and used to apply the vertical load of 0.01. The second volume, 10×10×10, is characterized by E=1000, ν = 0.499 and     σ   ¯     y   = 0.01 . The two vertical faces under the area of application of the load are totally free and the other two vertical faces together with the bottom face are constrained in the normal direction.   Table 5 shows the analysis reports relative to the 3 meshes considered by comparing the elements   CT   10 / 4   ,   CT   10 / 5   and   MT   10 / 4   . As can be observed, the higher accuracy of the   MT   10 / 4   element is even more evident with an error ranging from 17.2%, for Mesh 1, to 0.3% for Mesh 3. On the contrary the other elements start with an error equal to 22.7% and finish with an error of 3.4%, see also Fig. 9 . The reference collapse multiplier was obtained by using the mesh reported in Fig. 8 which has 4467   CT   10 / 5   elements and 22878 dofs.  The Fig. 10 shows the plot of the equivalent plastic strain field for Mesh 1 and Mesh 3 and for each kind of finite element formulation compared here.  In Table 6 the FEM model is employed to test its effectiveness when the Drucker–Prager failure criterion is described as intersections of cones. Different friction angles are used in performing the analysis and the algorithm shows no sensitivity in terms of iterations with respect to the constitutive parameters.  The reference results have been obtained by considering a mesh with 4476 elements and 21263 dofs.  The paper proposes a 3D mixed finite element and tests its capability in the analysis of elasto-plastic and limit analysis problems. The main features of the model are its simplicity and easy implementation within existing computational tools. Nevertheless the element proves to be accurate and robust and has a better performance for limit analysis problems with respect to the compatible counterpart models. The efficiency of the model derives from the balanced choice of the interpolations used to describe the displacements and stress fields and by the piece-wise constant description of the stress field that allows the discontinuities inherent in the plastic solution.  The numerical experimentation shows the higher accuracy of the element compared with its compatible counterpart while the computational cost is almost the same. It is worth noting that the model proves able to furnish very accurate results by employing moderately fine meshes and this is of great interest in technical applications.  The experiments also demonstrate the robustness of the proposed finite element. The element is locking-free. The numerical results are stable for both regular and irregular meshes and do not degenerate when marked distortions are present.  The element also performs well in the evaluation of the elastic response and this encourages the employment of the model in shakedown analysis.   REFERENCES", "highlights": "The paper proposes a 3D mixed finite element and tests its performance in elasto-plastic and limit analysis problems. A composite tetrahedron mesh is assumed over the domain. Within each element the displacement field is described by a quadratic interpolation, while the stress field is represented by a piece-wise constant description by introducing a subdivision of the element into four tetrahedral regions. The assumptions for the unknown fields make the element computationally efficient and simple to implement also in existing codes. The limit and elasto-plastic analyses are formulated as a unified mathematical programming problem allowing the use of Interior Point like algorithms. A series of numerical experiments shows that the proposed finite element is locking free and has a good plastic behavior."}