{"id": "S0168874X16300397", "article": "MAIN-TITLE A new approach to reduce the number of integration points in mass-matrix computations   HIGHLIGHTS          We present a new approach to compute the mass matrix of solid finite elements.      The number of integration points is significantly reduced for the same accuracy.      Numerical examples focus on consistent mass matrix of 10-node tetrahedral element.      The new integration scheme enables a degree of precision 4 with 1 integration point.      In comparison, conventional schemes require 11 points for degree of precision 4.          KEYPHRASES   Numerical integration  Improved degree of precision  Semi-analytical  Closed form  Mass matrix   FE analysis is an indispensable tool being used today in almost every field of engineering, design, and research. The need in simulating increasingly larger structures with many degrees of freedom leads to a constant race aiming at reducing the computation time. This is achieved by improvements in hardware capabilities, but also in raising the code efficiency.  Any dynamic or transient simulation as well as modal-analyses of solid continua requires the calculation of the mass matrix. Conventionally, the mass matrix is computed using numeric integration with standard quadrature [1,2]. The mass matrix computational cost is proportional to the number of integration points. Thus, the motivation to formulate a numerical scheme that enables the same accuracy with a smaller number of integration points is clear. In this paper, we propose a semi-analytical approach for calculating the mass matrix. The method is based on the observation that the integrand of the mass matrix is composted from two multiplicative terms. The first is a simple polynomial expression that does not depend on the mesh, thus can be treated analytically. The second term is a mesh-dependent function which is handled by means of a simple polynomial approximation. In other words, we use information regarding the structure of the integrand in order to enhance the degree of precision of the numerical integration.  Similar concepts have been considered previously, but in a different context. For example, it has been shown that symbolic computations combined with code generation allow significant reduction of computation time compared to traditional quadrature use (e.g. [3–6]). Also, closed form integration has been used in order to calculate more efficiently the stiffness matrix of specific elements, including plane elements [7–10], 3-D bricks [8,11,12], triangles [13,14], and 3-D elastic and electro-elastic tetrahedral elements [14–19]. Closed form formulation was also used to formulate an accurate and robust 10-node tetrahedral Cosserat-Point Element (CPE) that does not exhibit numerical stiffness for nearly incompressible material [20]. In another study, a systematic approximation combined with analytical integration of the weak form enabled high-accuracy closed-form expressions for the natural frequencies of skewed parallelepipeds [21]. Hinnant [22] proposed a technique of numerical quadrature especially suited for quadrilateral and hexahedron p-version finite element matrices. This technique is based on separating the integrand into two parts, and numerically operating on each part separately.  In this paper, we propose a new integration approach specifically designed to compute the mass matrix of solid elements. By exploiting information regarding the mathematical structure of the integrand, we significantly improve the degree of precision of the numerical integration compared to standard quadrature use, for the same number of integration points. In other words, our approach provides a similar accuracy to standard quadrature using a smaller number of integration points, enabling lower computation cost. Our new approach is not limited to a specific element type, and can be applied to the calculation of consistent and lumped mass matrices [23]. Here, we thoroughly examine the consistent mass matrix of the widely used 10-node tetrahedral element. Accordingly, we organize the paper as follows: Section 2presents the general theoretical considerations. Two new approaches are discussed, namely the Optimization-Based (OB) and Semi-Analytical (SA) approaches. In Section 2.1, we propose a systematic procedure to obtain the unknown coefficients of the OB and SA approaches for the 10-node tetrahedral element. In Sections 3 and 4, we provide the necessary details and considerations in order to implement the OB and SA approaches, respectively, with 1, 4, 5, 8, and 10 integration points. In Section 5, we study the performance of the OB and SA approaches and compare their accuracy with that of conventional quadrature. Summary and main conclusions are discussed in Section 6.  The consistent mass-matrix of a solid finite element is defined as    M   i j   =   ∫   V      ρ   0     N   i     N   j    d V  ,  where   ρ   0   is the initial mass density,   N   i   are the element shape functions, and the integration is carried out over the initial volume of the element V  [24]. By introducing the local coordinates of the element  ξ ,  η ,  ζ  , the mass matrix takes the form  (1)     M   i j   =   ∫     V   □        N   i     N   j    (   ρ   0   J )  d ξ  d η  d ζ  .       Above, J is the Jacobian determinant of the transformation from the global to the local coordinate system, and   V   □   is the integration domain associated with the local coordinate system. The common approach to approximate (1) is to employ a numerical integration schemes, i.e.    M   i j   =  ∑  p = 1     n   p        w   p     N   i p     N   j p     ρ   0 p     J   p     . Here, the index p indicates evaluation at an integration point,   w   p   is the corresponding weight, and   n   p   is the number of integration points. Thus, based on this “standard” (ST) approach,    M   i j   ≈   M   i j   S T    with  (2)     M   i j   S T   =   M   i j p   S T      ρ   0 p      J   p   ;    M   i j p   S T   =   w   p     N   i p     N   j p   .       In order to reduce the computational cost of the numerical integration, it is of interest to use the minimum number of integration points that still provides the sufficient accuracy. We propose to reduce the number of integration points by adopting a semi-analytical (SA) approach by rewriting (1) as follows. First, we note that the integrand can be separated into two multiplicative terms. The first,    N   i     N   j    , is a simple polynomial expression that does not depend on the mesh (the locations of the element nodes), thus can be treated analytically. The second term,    ρ   0    J  is a mesh-dependent function of the local element coordinates. Hence, we approximate    ρ   0   J  with  (3)     ρ   0   J ≈  ∑  p = 1     n   p         N ^    p   ( ξ , η , ζ ) ⋅    (   ρ   0   J )  |   (   ξ   p   ,   η   p   ,   ζ   p   )    =  ∑  p = 1     n   p         N ^    p      ρ   0 p      J   p    .       Note that the ansatz functions    N ^    p   and corresponding sampling points in (3) differ from the element shape functions   N   i   and integration points associated with the ST approach (1). Plugging (3) into (1) yields the SA approximation for the mass matrix    M   i j   ≈   M   i j   S A    with  (4)     M   i j   S A   =   M   i j p   S A     ρ   0 p      J   p   ;    M   i j p   S A   =   ∫     V   □        N   i     N   j       N   ^     p    d ξ  d η  d ζ  .       Note the similar mathematical form of the ST and SA approximations in (2)a and (4)a, which only differ in the way the coefficient matrix   M   i j p   is defined. Importantly, this matrix does not depend on the mesh, thus can be precomputed. In addition, the coefficients matrix   M   i j p   has to be computed only once. In other words, once these coefficients are set they are to be used for all elements (of the same type). In this sense, the use of the coefficients   M   i j p   S A   is similar to the implementation of weights   w   p   in the standard approach. The main difference in terms of implementation is that in the standard approach each entry of   M   i j p   S T   requires two multiplications of the pre-stored quantities   w   p   and   N   i p   , e.g.    M   123   S T   =   w   3     N   13     N   23    ; on the other hand, the entries of   M   i j p   S A   are pre-stored as is. Consequently, the SA approach requires slightly more memory but fewer multiplications. These differences in resources are minor, and, practically, the two approaches require a similar computational cost for the same number of points,   n   p   . However, we show in the following sections that the SA approach enables accuracy similar to that of the standard approach with significantly smaller number of integration points.  Following the mathematical structure of (2)a and (4)a, we propose a third approach which we term “optimization-based” (OB) approach, where    M   i j   ≈   M   i j   O B    with  (5)     M   i j   O B   =   M   i j p   O B     ρ   0 p      J   p   .       The coefficient matrix   M   i j p   O B   is pre-computed, as in the SA approach. However, here, it is calculated by means of an optimization process which aims to maximize the accuracy of   M   i j   O B   . In-depth discussion of this procedure is provided in Section 3.  In summary, we present in this paper two new approaches, namely the SA and OB approaches. We develop a systematic method to obtain the coefficient matrices, and compare the accuracy of our new rule with that of the standard (ST) approach, which is the prevalent method in commercial finite-element software. Finally, we emphasize that the above considerations are general, and not specific to a particular element type. For specificity, we consider in what follows the well-known and widely used ten-node tetrahedral element.  The OB and SA approaches require specification of the sampling points along with the coefficients   M   i j p   O B   (for the OB) and the ansatz functions    N ^    p   (for the SA). Here, we view these as “unknowns” and look for the most suitable ones, namely those that make the SA and OB approximations most accurate for a prescribed number of points. Below, we propose a systematic procedure aiming at finding these unknowns. This procedure involves the following steps: (i) Generation of a set of random elements, representing the element population generated by automatic mesh generators, which we term “learning set”. (ii) Formulation of an objective function which reflects the average error with respect to the exact mass matrix of each element in the learning set. (iii) Determination of the unknowns by minimization of an objective function.  For specificity, we consider below the ten-node tetrahedral element. Standard definitions of this element are recalled in Appendix A. In addition, without loss of generality, we consider the case of constant initial density,    ρ   0   = 1  .  The learning set includes random elements which are generated as follows. We begin with the parent element, shown in Fig. 1. The nodes of the next element are randomly relocated by changing each degree of freedom by a random number uniformly distributed between  [ − δ , δ ]  . The value of δ is linearly increased from zero for the first element to   δ   max   for the last element. Without loss of generality, the locations of nodes 1 and 5 are kept unchanged. This procedure repeats until the entire set is generated. In order to avoid unphysical elements we choose    δ   max   = 0.12  , and exclude from the learning set elements having a negative metric,  J < 0  . Examples of such randomly generated elements are shown in Fig. 1b–d, and a flow chart summarizing the above procedure is presented in Fig. 2. Once the learning set is generated, the exact mass matrix   M   i j   ( n )   of each element in the set is calculated using (1) (see also Appendix A). Here  n = 1 , … ,   n   l s    where   n   l s   denotes the total number of elements in the learning set.  In order to formulate the objective function, we introduce the relative error for each entry of the mass matrix for each element in the learning set, i.e.  (6)     E   i j   ( n )   ≡     M   i j   ( n )   −   M   i j   X X ( n )       M   i j   ( n )     ;  X X = O B , S A .       Note that   E   i j   ( n )   is a function of the unknowns through   M   i j   X X ( n )   . We define the objective function as the sum of squared relative errors over all elements and entries. Recalling the symmetry of the mass matrix, we write  (7)   S =  ∑  n = 1     n   l s       ∑  i = 1   10     ∑  j = 1  i     1 2     (    E   i j   ( n )    )  2     .       The factor  1 / 2  merely reflects common convention of objective function formulation. Finally, the unknowns are determined by the minimization of S .  In this section we apply the procedure described in Section 2 for determining the OB unknowns, namely the location of the sampling points and the coefficients   M   i j p   O B   . We repeat this procedure for five different cases that differ in the number of sampling points, i.e.    n   p   = 1 , 4 , 5 , 8 , 10  . We note that the OB approximation of the mass matrix (5) depends linearly on the coefficients   M   i j p   O B   while non-linearly on the sampling points through J (see Appendix A). The same applies to the relative errors   E   i j   ( n )    (6). In other words, if the sampling points are prescribed, the minimization of the objective function S becomes a standard linear least-squares problem, which makes the minimization process simple and straightforward (e.g. [25,26]). Hence, we minimize S by assuming locations of the sampling points and then determining the coefficients by means of a standard least means squares. This step is systematically repeated to establish the solution associated with the lowest residual (magnitude of the objective function evaluated using the solution for the unknowns).  Symmetry considerations lead to the conclusion that a single sampling point,   P   1   , should be located at the centroid of the tetrahedral element, i.e.  (8)     P   1   :   (  ξ =   1 4    ,   η =   1 4    ,   ζ =   1 4    )  .       Once the location of the sampling point has been determined, the metric at the sampling point,   J   1   , can be calculated for each element in the learning set (see Appendix A). Using (5)–(7), the objective function is formulated in terms of the coefficients   M   i j p   O B   . Following the least squares formalism, the minimization of S with respect to the coefficient   M   i j 1   O B   yields a set of linear algebraic equations. The solution of this minimization problem gives “the best” coefficients, and is obtained using the symbolic mathematical software MapleTM. These coefficients, i.e. the components of a  10 × 10  symmetric matrix   M   i j 1   O B   , are detailed in the supplementary file Result_Matrices.xls, and yield a residual of  S = 775.6  .  The tetrahedron is a 3-D structure with four faces and four head nodes. Thus, it is not possible to arrange two or three sampling points inside the domain while maintaining symmetry. Turning to four sampling points, symmetry considerations suggest that the sampling points should be located on the lines connecting the centroid to the head nodes  1 , 2 , 3 , 4  , each at a (normalized) distance a from the centroid. 1   1 We note that another arrangement may be considered, where the points are located on the lines connecting the centroid to the geometric center of each face. However, this arrangement yields a higher residual (inferior accuracy) and is therefore not presented. Here a may take values between zero and one, where  a = 0  represents the centroid and  a = 1  coincides with a head node (see Fig. 3), i.e.  (9)     P   1   :   (  ξ =   1 4   −   1 4   a  ,   η =   1 4   −   1 4   a  ,   ζ =   1 4   −   1 4   a  )    P   2   :   (  ξ =   1 4   +   3 4   a  ,   η =   1 4   −   1 4   a  ,   ζ =   1 4   −   1 4   a  )    P   3   :   (  ξ =   1 4   −   1 4   a  ,   η =   1 4   +   3 4   a  ,   ζ =   1 4   −   1 4   a  )    P   4   :   (  ξ =   1 4   −   1 4   a  ,   η =   1 4   −   1 4   a  ,   ζ =   1 4   +   3 4   a  )  .       Prescribing a defines the locations of the four sampling points, and similarly to the procedure described in Section 3.1, we minimize S with respect to the coefficients    M   i j p   O B     ( p = 1 , 2 , 3 , 4 )  by means of a linear least-squares method. This procedure is repeated for various values of a , and the corresponding residuals are recorded (see Table 1). Table 1 indicates that the optimal location of the sampling points corresponds to the range  0.3 < a < 0.4  . A careful analysis in this range reveals that the location of the sampling points which leads to the lowest residual is around  a = 0.36  with a residual of  S = 13.3  . The corresponding coefficients    M   i j p   O B     ( p = 1 , …  , 4 )  are detailed in the supplementary file Result_Matrices.xls.  The same symmetry considerations used in Section 3.2 suggest that four of the five sampling points should be located on the lines connecting the centroid to the head nodes (9), while the fifth point at the centroid (8). Based on a similar analysis we find that the location, a , associated with the lowest residual is  a = 0.5  , with a residual of  S = 4.4  . The corresponding coefficients    M   i j p   O B     ( p = 1 , …  , 5 )  are detailed in the supplementary file Result_Matrices.xls.  Following the symmetry considerations described in Section 3.2, the eight sampling points are located as follows. Four points are located on the lines connecting the centroid to the head nodes (9), and four points are located on the lines connecting the centroid to the geometric center of each face, i.e.  (10)     P   5   :   (  ξ =   1 4   −   1 4   b  ,   η =   1 4   +   1  12    b  ,   ζ =   1 4   +   1  12    b  )    P   6   :   (  ξ =   1 4   +   1  12    b  ,   η =   1 4   −   1 4   b  ,   ζ =   1 4   +   1  12    b  )    P   7   :   (  ξ =   1 4   +   1  12    b  ,   η =   1 4   +   1  12    b  ,   ζ =   1 4   −   1 4   b  )    P   8   :   (  ξ =   1 4   +   1  12    b  ,   η =   1 4   +   1  12    b  ,   ζ =   1 4   +   1  12    b  )  .       Above, b measures the normalized distance between the centroid and the geometric center of the face, i.e. b may take values between zero and one, where  b = 0  represents the centroid and  b = 1  coincides with a face center.  The locations of the sampling points are dictated by two parameters a and b . Performing a similar analysis to that described in Section 3.2, we find that values of  a = 0.6  and  b = 0.7  lead to the lowest residual,  S = 0.65  . The corresponding coefficients    M   i j p   O B     ( p = 1 , . .   , 8 )  are detailed in the supplementary file Result_Matrices.xls.  The ten sampling points are located on the lines connecting the centroid to each node. The four points associated with the head nodes are described in (9), and the locations of the other six points is dictated by the normalized distance b , i.e.  (11)     P   5   :   (  ξ =   1 4   +   1 4   b  ,   η =   1 4   −   1 4   b  ,   ζ =   1 4   −   1 4   b  )    P   6   :   (  ξ =   1 4   +   1 4   b  ,   η =   1 4   +   1 4   b  ,   ζ =   1 4   −   1 4   b  )    P   7   :   (  ξ =   1 4   −   1 4   b  ,   η =   1 4   +   1 4   b  ,   ζ =   1 4   −   1 4   b  )    P   8   :   (  ξ =   1 4   −   1 4   b  ,   η =   1 4   −   1 4   b  ,   ζ =   1 4   +   1 4   b  )    P   9   :   (  ξ =   1 4   +   1 4   b  ,   η =   1 4   −   1 4   b  ,   ζ =   1 4   +   1 4   b  )    P   10   :   (  ξ =   1 4   −   1 4   b  ,   η =   1 4   +   1 4   b  ,   ζ =   1 4   +   1 4   b  )  .       Carrying out a similar procedure as in Section 3.4 we find that the lowest residual is obtained with  a = 0.6  ,  b = 0.5  , leading to  S = 0.034  . The corresponding coefficients    M   i j p   O B     ( p = 1 , . …  , 10 )  are detailed in the supplementary file Result_Matrices.xls.  The SA approximation requires the determination of the coefficients   M   i j p   S A   , which are calculated using ansatz function,    N ^    p   , and sampling points (4). Here, we propose a systematic procedure to determine the ansatz functions, and show that the corresponding residual is similar to that of the OB approach. Since the OB approach enables one to obtain the lowest possible residual for the learning set, this is an indication that our choice of    N ^    p   is sound. A main advantage of the SA approach over the OB approach is by providing the exact mass matrix for a wide range of practical cases. This is further discussed below.  Recall that J is a 3rd order polynomial. Thus, we use a polynomial approximation in (3) which is exact at the sampling points. To this end, we chose    N ^    p   to be polynomials satisfying the condition  (12)          N   ^     p    |     P   k     =   δ   p k   ;  p , k = 1  , …  ,   n   p   .       The polynomial order of the ansatz functions    N ^    p   increases with the number of sampling points, resulting in higher accuracy of the approximation for    ρ   0   J  . In particular, one sampling point is associated with a zero order polynomial, four sampling points enable a complete set of first order polynomials, and ten points a complete set of second order polynomials. Accordingly, one sampling point enables computing the exact mass matrix for all constant-metric (flat-faced) elements. In addition, with four points, we are able to exactly compute the mass matrix of all elements with a linear metric, and with ten points we are able to compute the exact mass matrix of all elements with a quadratic metric.  In order to determine the SA coefficients, we need to specify the location of the sampling point   P   1   and the ansatz function    N ^    1   . The location of the sampling point is determined by the same considerations as in Section 3.1 to be at the centroid of the element (8). Also,  (13)      N ^    1   = 1 .    in accordance with condition (12). Calculating the SA coefficients using (4) leads to  (14)     M   i j 1   S A   =  (     6   1   1   1    − 4     − 6     − 5     − 4     − 6     − 6      1   6   1   1    − 4     − 4     − 6     − 6     − 4     − 6      1   1   6   1    − 6     − 4     − 4     − 6     − 6     − 4      1   1   1   6    − 6     − 6     − 6     − 4     − 4     − 4       − 4     − 4     − 6     − 6     32     16     16     16     16    8      − 6     − 4     − 4     − 6     16     32     16    8    16     16       − 4     − 6     − 4     − 6     16     16     32     16    8    16       − 4     − 6     − 6     − 4     16    8    16     32     16     16       − 6     − 4     − 6     − 4     16     16    8    16     32     16       − 6     − 6     − 4     − 4    8    16     16     16     16     32      )  ⋅  1  2520   .       The corresponding residual is  S = 867.8  .  Following the same considerations as in Section 3.2, the location of the four sampling points is determined by (9). The ansatz functions that form a complete set of first order polynomials are  (15)       N   ^     p   =   c   p 0   +   c   p 1   ξ +   c   p 2   η +   c   p 3   ζ ,  p = 1  ,  …  , 4    where   c   p m   are constants (independent of the local element coordinates) that are found from condition (12). Thus, we conclude with  (16)       N   ^     1   =     1   a      (      1   4     ( a + 3 ) − ξ − η −  ζ   )  ;      N   ^     2   =     1   a      (      1   4     ( a − 1 ) + ξ  )      N   ^     3   =     1   a      (      1   4     ( a − 1 ) + η  )  ;      N   ^     4   =     1   a      (      1   4     ( a − 1 ) +  ζ   )  .       For a prescribed a , the SA coefficients are calculated directly using (4), and the corresponding residual is obtained from (7). The procedure is repeated for several values of a , and the corresponding residuals are recorded (see Table 2). The lowest residuals in Table 2 are those associated with  a = 0.3  and 0.4. The two residuals are practically equal, and any value of  0.3 < a < 0.4  is a reasonable choice. We use  a = 0.36  resulting in a residual of  S = 15.04  . The corresponding SA coefficients are provided in the supplementary file Result_Matrices.xls. A comparison between Tables 1 and 2 indicates that the residuals of the SA approach almost reproduce those of the OB approach, both in terms of magnitude and in terms of dependency with a . The fact that the residuals of the SA approach are slightly higher than the residuals of the OB approach is not surprising, since the OB coefficients are the optimal coefficients for the learning set.  As in Section 3.3, we locate four of the five sampling points on the lines connecting the centroid to the head nodes (9), and the fifth point at the centroid (8). Five ansatz functions are not sufficient to form a complete second-order polynomial. Thus, we write     N ^    p   =   c   p 0   +   c   p 1   ξ +   c   p 2   η +   c   p 3   ζ +   c   p 4   f ( ξ , η , ζ )  ;  p = 1  ,  …  , 5  , where f is a higher order polynomial of the local coordinates. Since J is a 3rd-order polynomial, several symmetric expressions (and their linear combinations) may be considered, e.g.    ξ  2  +   η  2  +   ζ  2   ,  ξ η + ξ ζ + η ζ  ,  ξ η ζ  , etc. We find that the residual obtained with the function  f =   ξ  2  +   η  2  +   ζ  2   is significantly lower compared to the other alternatives. Hence, we write  (17)       N   ^     p   =   c   p 0   +   c   p 1   ξ +   c   p 2   η +   c   p 3    ζ  +   c   p 4    (    ξ   2   +   η   2   +   ζ   2    )  ,  p = 1 , …  ,  5 .       The constants   c   p m   are determined by imposing condition (12). The resulting ansatz functions are detailed in Appendix B. Once the ansatz functions are specified, we repeat the procedure described in the previous subsection to determine the locations of the sampling points. We conclude with  a = 0.5  producing a residual of  S = 4.9  . The corresponding SA coefficients,   M   i j p   S A   , are calculated using (4) and appear in the supplementary file Result_Matrices.xls.  For    N   p   = 8  , the locations of the sampling points are described in (9) and (10). Since eight Ansatz functions are not sufficient to form a complete second-order polynomial, we adopt an approach similar to the one described in the previous subsection, i.e.     N ^    p   =   c   p 0   +   c   p 1   ξ +   c   p 2   η +   c   p 3   ζ +  ∑  m = 4  7     c   p m     f   m   ( ξ , η , ζ )   where   f   m   are higher order polynomials, and    c   p m     ( p , m = 1 , … ,  8 )  are constants independent of the local coordinates. As in the case of    n   p   = 5  , several symmetric combinations of the functions   f   m   may be considered. We find that the combination yielding the lowest residual is  (18)       N   ^     p   =   c   p 0   +   c   p 1   ξ +   c   p 2   η +   c   p 3   ζ +   c   p 4     ξ   2   +   c   p 5     η   2   +   c   p 6     ζ   2   +   c   p 7    (  ξ η + ξ ζ + η ζ  )  ,  p = 1 , …  ,  8 .       As in the previous subsection, the constants   c   p m   are determined from condition (12), see Appendix B for details, and the location of the sampling points, defined similarly to Section 3.4, is found as  a = 0.6  and  b = 0.7  with a residual of  S = 0.82  . The corresponding SA coefficients,   M   i j p   S A   , are calculated using (4) and appear in the supplementary file Result_Matrices.xls.  As in Section 3.5, the ten sampling points are located on the lines connecting the centroid to each node. The locations of the four points associated with the head nodes are defined by a  (9), and the locations of the other six points are determined by b  (11). With ten ansatz functions it is possible to form a complete second-order polynomial that satisfies condition (12) (see Appendix B). Following the same procedure described in the previous subsections, we determine the locations of the sampling points as  a = 0.6  and  b = 0.5  , which yield a residual of  S = 0.036  . The corresponding SA coefficients,   M   i j p   S A   , are calculated using (4) and appear in the supplementary file Result_Matrices.xls. A summary of the residuals obtained with the OB and SA approaches for 1, 4, 5, 8, and 10 sampling points is presented in Fig. 4.   RESULTS   In this section we compare the performance of the ST, SA, and OB approaches. The SA and OB coefficients,   M   i j p   S A   and   M   i j p   O B   , are determined based on a randomly generated learning set, as described in Sections 2 and 3. It is therefore important to test the performance of the resulting schemes, (4) and (5), when applied to realistic elements associated with meshing of 3-D geometries. To this end, we use the well-established commercial automatic mesh generator of ABAQUS to mesh various 3-D geometries. We term this set of elements “test set”, and use it to compare between the accuracy of the standard approach (ST) and the SA and OB schemes.  The test set, which we use to compare between the accuracy of the three approaches, includes five 3-D geometries. We consider these as five examples which are a representation of standard geometries, curved geometries, and a combination of both fine and coarse meshes. In particular we consider: (I) A 3-D box with 583 elements and 994 nodes, which are all flat-faced elements. (II) A ball with 3358 elements and 5147 nodes. (III) A segment of a thick curved surface including 332 elements and 682 nodes. (IV) A segment of a spherical shell with a coarse mesh, including 136 elements and 310 nodes. (V) A curved body with complex geometry. The body is poorly meshed with 302 elements and 722 nodes, resulting in a majority of elements having high-aspect ratio and curved faces. Such mesh represents a worst-case scenario and is not expected in practical use. Fig. 5 visualizes the five geometries considered in our test set.  Below, we compare the accuracies of the mass-matrix approximations calculated with ST, SA, and OB approaches. For each of the meshes in the test set, we calculate the exact mass-matrix of each element, as well as the corresponding ST, SA, and OB approximations. For each mass matrix, we compute a measure of the accuracy of the approximation,  E r   r   ( n )    , where n denotes the “identifying number” of the element in the mesh. Here,  E r   r   ( n )   =  ∑  i = 1   10     ∑  j = 1  i   |    E   i j   ( n )    |    is the average absolute error of all the mass-matrix components. Finally, after calculating  E r   r   ( n )    for all elements in the mesh, we record the minimum, maximum and average values for each approximation (ST, SA, and OB).   Tables 4–8 show the results for the SA and OB approaches with    n   p   = 1 , 4 , 5 , 8 , 10  points, described in Sections 3 and 4. The accuracy of the ST approach is presented for 1, 4, 10, 11, and 15 integration points, which yield a degree of precision 2   2 “A formula is said to have the degree of precision d if it integrates exactly every polynomial of degree ≤d and there exists at least one polynomial of degree d+1 for which it is not exact” [26]. of 1, 2, 3, 4, and 5, respectively [2,27]. For reference, we recall that ABAQUS uses the standard integration scheme (ST) with 15 integration points.    Table 3 summarizes the results for geometry-I (a box). For this simple geometry the mesh includes only flat-faced elements. Flat-faced elements are characterized by a constant metric, i.e.  J = c o n s t  . This is the simplest possible case since the integrand in (1) possesses the lowest polynomial order. The most notable feature in Table 3 is that the SA approach is exact for all constant-metric elements even with a single sampling point, in accordance with the derivation presented in Sections 2 and 4. As expected, the ST approach is exact only with 11 integration points (or more), which enable a degree of precision 4. A lower number of integration points leads to relatively poor approximations associated with high  E r   r   ( n )    values. It is striking that while the SA approach enables exact computation with one sampling point, the average error of ST approach is about 180%. The OB approach is significantly more accurate than the ST approach for the same number of points; still, it underperforms the SA approach. We recall that the residuals of the OB approach were consistently lower than those of the SA approach (see Fig. 4). The reason is that the OB approach was specialized to give the lowest residual for the learning set, while the SA was formulated to accurately represent a large class of practical elements and to enable exact results for a wide range of practical elements.  Geometry-II (a ball) represents a typical “standard” curved geometry with rather fine mesh that includes a majority of flat-faced elements (found mostly inside the ball) and some curved-faced elements (found mostly at the surface of the ball). The results in Table 4 provide further evidence for the superiority of the SA approach. In particular, its maximum error is reasonable even with a single point, and flat-faced elements are computed exactly.      Tables 5–7 show the results for coarse meshes. Specifically, geometries IV and V (Tables 6 and 7) include elements with exceptionally high-aspect ratios and curved faces, which we consider in order to examine the performance of the integration schemes in “worst case scenario” of practical implementations. The SA approach is by far superior to the ST approach in terms of accuracy, and is also advantageous over the OB approach since it enables exact computation and higher accuracy for many practical elements. For example, with respect to geometry-V, the average accuracy of the 4-points SA approach 0.1% while that of the ST approach is 38.2%. A comparable accuracy with the ST approach requires 15 integration points.   DISCUSSION AND CONCLUSIONS   We presented in this paper two new approaches, namely the SA and OB approaches, to calculate the mass matrix. The SA approach is based on the observation that the integrand of the mass matrix is composted from two multiplicative terms. The first,    N   i     N   j    , is a simple polynomial expression with respect to the local coordinates that does not depend on the mesh (see also Appendix A), thus can be treated analytically. The second term,    ρ   0    J  is a mesh-dependent function of the local element coordinates. Hence, we suggest a simple polynomial approximation for    ρ   0   J   (3), which allows analytical integration to precompute the SA coefficients   M   i j p   S A    (4). This way we effectively increase the degree of precision. For example, in the case of a ten-node tetrahedral element, the term    N   i     N   j    is a fourth order polynomial (see Appendix A); thus by approximating    ρ   0   J  with a single sampling point (     N ^    1   = 1  ,    ρ   0   J ≈    N ^    1     ρ   01     J   1    ) we obtain an integration scheme with degree of precision 4. Note that in the general case a degree of precision 4 requires a minimum number of 11 integration points [2]. The SA scheme has been formulated to integrate expressions having the specific mathematical structure of Eq. (1), hence is a “case-specific” integration formula, specialized for calculating mass matrices. In other words, we use information regarding the structure of the integrand in order to enhance the degree of precision of the formula.  The OB approximation (5) possesses a mathematical structure similar to that of the SA approach. However, the OB coefficients are calculated merely by an optimization process aiming at maximizing the accuracy of the formula. We developed a systematic procedure for this process, which includes: (i) Generation of a set of random elements (learning set). (ii) Calculation of the exact mass matrix for each element in the learning set. (iii) Formulation of an objective function in terms of the unknowns, based on which the optimization was performed. (iv) Determination of the unknowns. Note that the SA approach uses a similar procedure to determine the location of the sampling points. Since the OB approach enables one to obtain the lowest residual for the learning set, it is viewed as a lower bound for assessing the residual of the SA approach. Fig. 4 indicates that the residuals of the SA approach are close to those of the OB approach. The competency of the SA approach is further emphasized in Tables 3–7, as discussed below.  By definition, the OB and SA coefficients,   M   i j p   , do not depend on the mesh, thus can be precomputed. The precomputation, which involves an optimization procedure, may appear challenging; however it needs to be performed only once. In other words, once these coefficients are set they are to be used for all elements (of the same type). In this sense, the role of the coefficients   M   i j p   S A   is analogous to that of weights in the standard approach. Moreover, we have shown that the ST approach can be rewritten with a mathematical structure similar to that of the SA and OB approaches, and that the three schemes require a similar computational cost for the same number of points,   n   p   .  The numerical results in Section 5 indicate that the accuracy of the SA approach is, by far, superior to that of the ST approach. The SA approach is also preferable over the OB approach since it enables exact integration for many practical elements. As a reference, we recall that ABAQUS uses 15 integration points with the ST approach in order to compute the mass matrix of ten-node tetrahedral elements. Our results show that the SA approach with four sampling points yields a comparable accuracy, and that the SA approach with 8 sampling points outperforms the ST approach with 15 points for all the examined geometries. In the same line of thought, the SA approach with a single sampling point outperforms the ST approach with 4 integrations points. In addition, the SA approach can be easily adjusted to use conventional locations of integration points. This slightly decreases the accuracy of the integration (see Appendix C), yet it enables one to use the values of   J   p   which have been computed for the purpose of other integrations, e.g. stiffness matrix and internal forces.  In summary, we have shown that:  • The SA and ST approaches require a similar computational cost for the same number of points.  The SA coefficients are mesh independent, and are precomputed. In that sense they resemble the weights used in the ST approach.  The degree of precision of the SA approach is higher than that of the ST approach for the same number of points. For example, a degree of precision 4 is achieved with 1 point for the SA approach compared to 11 points for the ST approach.  A direct consequence of the previous point is that the SA approach enables significantly higher accuracy compared to the ST approach for the same number of points. Specifically:  1. The accuracy of SA with 4 points is practically equivalent to ST with 15 points.  The accuracy of SA with 1 point is practically equivalent to ST with 4 points.  The above features have been tested for the entire range of practical elements, from flat-faced elements to elements with high aspect ratios and highly curved faces.  Following the above, we undoubtedly conclude that the SA approach is superior to the ST approach. Implementing the SA scheme may require some modifications to “standard” computational procedures currently used in commercial software. However, these changes pose no significant challenge and are clearly worthwhile since the SA approach enables accuracy comparable to that of the ST approach with a significantly lower computational cost.  The purpose of this appendix is to recall standard definitions of the solid 10 node tetrahedral element. We begin with the element shape functions:  (19)     N   1   =  (  1 − ξ − η − ζ  )   (  1 − 2 ξ − 2 η − 2 ζ  )  ,    N   2   = ξ  (  2 ξ − 1  )  ,    N   3   = η  (  2 η − 1  ) ,    N   4   = ζ  (  2 ζ − 1  )  ,    N   5   = 4 ξ  (  1 − ξ − η − ζ  )  ,    N   6   = 4 ξ η ,    N   7   = 4 η  (  1 − ξ − η − ζ  )    N   8   = 4 ζ  (  1 − ξ − η − ζ  )  ,    N   9   = 4 ξ ζ ,    N   10   = 4 η ζ .       The location of a material point X is given by  X =  ∑  i = 1   10      N   i     X   i     where   N   i   are the shape function (19), and   X   i   are nodal positions    X   i   =  ∑  m = 1  3     X   m i     e   m     . In (1), J is the determinant of the Jacobian matrix associated with the transformation from global to the local coordinate system, i.e.  (20)   (        X   1 , ξ         X   1 , η         X   1 , ζ           X   2 , ξ         X   2 , η         X   2 , ζ           X   3 , ξ         X   3 , η         X   3 , ζ        )  .      Each of the components in (20) is a first order polynomial of the local coordinates. Thus, J is a third order polynomial of the local coordinates, and we write  (21)   J =     J   ^     1   +     J   ^     2   ξ +     J   ^     3   η +     J   ^     4   ζ +     J   ^     5     ξ   2   +     J   ^     6   η ξ +     J   ^     7     η   2   +     J   ^     8   ξ ζ +     J   ^     9   η ζ +     J   ^     10     ζ   2       J   ^     11     ξ   3   +     J   ^     12   η   ξ   2   +     J   ^     13     η   2   ξ +     J   ^     14     η   3   +     J   ^     15     ξ   2   ζ +     J   ^     16   η ξ ζ +     J   ^     17     η   2   ζ +     J   ^     18   ξ   ζ   2   +     J   ^     19   η   ζ   2   +     J   ^     20     ζ   3   ,    where     J ^    k   =    J ^    k   (   X   i   )  ( i = 1 , ..10 ,  k = 1 , … , 20 )  are mesh dependent terms that can be obtained directly from the location of the nodes. Using the above definitions, the integration of an arbitrary function, φ , admits:  (22)    ∫ V   φ d V  =  ∫    V   □      φ J d □  =  ∫ 0  + 1     ∫ 0  1 − ζ     ∫ 0  1 − η − ζ    φ J d ξ d η d ζ    .       In this appendix we provide the explicit forms of the ansatz functions    N ^    p      ( p = 1 , . … ,   n   p   )  for the SA approach with five, eight, and ten sampling points    n   p   = 5 , 8 , 10  .  Five sampling points,    n   p   = 5  :  (23)      N ^    1   =  1  36   a  2    (  (  − 44 ξ − 44 η − 44 ζ + 33  )  a + 16   ξ  2  + 16   η  2  + 16   ζ  2  − 8 ξ − 8 η − 8 ζ + 3 )    N ^    2   =  1  36   a  2    (  (  28 ξ − 8 η − 8 ζ − 3  )  a + 16   ξ  2  + 16   η  2  + 16   ζ  2  − 8 ξ − 8 η − 8 ζ + 3 )    N ^    3   =  1  36   a  2    (  (  − 8 ξ + 28 η − 8 ζ − 3  )  a + 16   ξ  2  + 16   η  2  + 16   ζ  2  − 8 ξ − 8 η − 8 ζ + 3 )    N ^    4   =  1  36   a  2    (  (  − 8 ξ − 8 η + 28 ζ − 3  )  a + 16   ξ  2  + 16   η  2  + 16   ζ  2  − 8 ξ − 8 η − 8 ζ + 3 )    N ^    5   =  1  36   a  2    ( 36   a  2  +  (  32 ξ + 32 η + 32 ζ − 24  )  a − 64   ξ  2  − 64   η  2  − 64   ζ  2  + 32 ξ + 32 η + 32 ζ − 12 ) .    where a controls location of sampling points (see Section 4.3). Eight sampling points,    n   p   = 8  :  (24)       N   ^     p   =   1   4   a   2   ( 9   a   2   −   b   2   )       N   ^     p   *   ( a , b , ξ , η , ζ ) ;  p = ( 1 , … , 8 ) .       (25)       N   ^     1   *   = − a   b   2   − 12 a b η − 12 a b ξ − 12 a b ζ + 60 a   η   2   + 132 a ξ η + 132 a η ζ + 60 a   ξ   2   + 132 a ξ ζ + 60 a   ζ   2   + 4   b   2   η + 4   b   2   ξ + 4   b   2   ζ − 12 b   η   2   − 36 b η ξ − 36 b η ζ − 12 b   ξ   2   − 36 b ξ ζ − 12 b   ζ   2   + 9 a b − 96 a η − 96 a ξ − 96 a ζ − 3   b   2   + 24 b η + 24 b ξ + 24 b ζ + 36 a − 9 b     N   ^     2   *   = − a   b   2   + 12 a b ξ − 12 a   η   2   − 12 a η ξ − 12 a η ζ + 60 a   ξ   2   − 12 a ξ ζ − 12 a   ζ   2   − 4   b   2   ξ + 12 b   η   2   + 12 b η ξ + 12 b η ζ − 12 b   ξ   2   + 12 b ξ ζ + 12 b   ζ   2   − 3 a b + 12 a η − 24 a ξ + 12 a ζ +   b   2   − 12 b η − 12 b ζ + 3 b .       (26)       N   ^     3   *   = − a   b   2   + 12 a b η + 60 a   η   2   − 12 a ξ η − 12 a η ζ − 12 a   ξ   2   − 12 a ξ ζ − 12 a   ζ   2   − 4   b   2   η − 12 b   η   2   + 12 b η ξ + 12 b η ζ + 12 b   ξ   2   + 12 b ξ ζ + 12 b   ζ   2   − 3 a b − 24 a η + 12 a ξ + 12 a ζ +   b   2   − 12 b ξ − 12 b ζ + 3 b     N   ^     4   *   = − a   b   2   + 12 a b ζ − 12 a   η   2   − 12 a ξ η − 12 a η ζ − 12 a   ξ   2   − 12 a ξ ζ + 60 a   ζ   2   − 4   b   2   ζ + 12 b   η   2   + 12 b η ξ + 12 b η ζ + 12 b   ξ   2   + 12 b ξ ζ − 12 b   ζ   2   − 3 a b + 12 a η + 12 a ξ − 24 a ζ +   b   2   − 12 b η − 12 b ξ + 3 b .       (27)       N   ^     5   *   =   3 a   b   ( 3   a   2   b − 36   a   2   η + 12 a b η + 36 a   η   2   − 36 a η ξ − 36 a η ζ − 36 a   ξ   2   − 36 a ξ ζ − 36 a   ζ   2   − 20 b   η   2   + 4 b η ξ + 4 b η ζ + 4 b   ξ   2   + 4 b ξ ζ + 4 b   ζ   2   + 9   a   2   − 3 a b + 36 a ξ + 36 a ζ + 8 b η − 4 b ξ − 4 b ζ − 9 a )     N   ^     6   *   =   3 a   b   ( 3   a   2   b − 36   a   2   ζ + 12 a b ζ − 36 a   η   2   − 36 a η ξ − 36 a η ζ − 36 a   ξ   2   − 36 a ξ ζ + 36 a   ζ   2   + 4 b   η   2   + 4 b η ξ + 4 b η ζ + 4 b   ξ   2   + 4 b ξ ζ − 20 b   ζ   2   + 9   a   2   − 3 a b + 36 a η + 36 a ξ − 4 b η − 4 b ξ + 8 b ζ − 9 a ) .       (28)       N   ^     7   *   =   3 a   b   ( 3   a   2   b − 36   a   2   ξ + 12 a b ξ − 36 a   η   2   − 36 a η ξ − 36 a η ζ + 36 a   ξ   2   − 36 a ξ ζ − 36 a   ζ   2   + 4 b   η   2   + 4 b η ξ + 4 b η ζ − 20 b   ξ   2   + 4 b ξ ζ + 4 b   ζ   2   + 9   a   2   − 3 a b + 36 a η + 36 a ζ − 4 b η + 8 b ξ − 4 b ζ − 9 a )     N   ^     8   *   =   3 a   b   ( 3   a   2   b + 36   a   2   η + 36   a   2   ξ + 36   a   2   ζ − 12 a b η − 12 a b ξ − 12 a b ζ + 36 a   η   2   + 108 a η ξ + 108 a η ζ + 36 a   ξ   2   + 108 a ξ ζ + 36 a   ζ   2   − 20 b   η   2   − 44 b η ξ − 44 b η ζ − 20 b   ξ   2   − 44 b ξ ζ − 20 b   ζ   2   − 27   a   2   + 9 a b − 72 a η − 72 a ξ − 72 a ζ + 32 b η + 32 b ξ + 32 b ζ + 27 a − 12 b ) .    where a and b control locations of sampling points see Section 4.4. For brevity reasons, we detail the ansatz functions for a ten sampling points    n   p   = 10  , given the chosen parameters  a = 0.6  and  b = 0.5  see Section 4.5:  (29)       N   ^     1   =   1   747   ( 3875   η   2   + 8025 η ξ + 8025 η ζ + 3875   ξ   2   + 8025 ξ ζ + 3875   ζ   2   − 5950 η − 5950 ξ − 5950 ζ + 2175 )     N   ^     2   =   1   747   ( − 275   η   2   − 275 η ξ − 275 η ζ + 3875   ξ   2   − 275 ξ ζ − 275   ζ   2   + 275 η − 1800 ξ + 275 ζ + 100 )     N   ^     3   =   1   747   ( 3875   η   2   − 275 η ξ − 275 η ζ − 275   ξ   2   − 275 ξ ζ − 275   ζ   2   − 1800 η + 275 ξ + 275 ζ + 100 )     N   ^     4   =   1   747   ( − 275   η   2   − 275 η ξ − 275 η ζ − 275   ξ   2   − 275 ξ ζ + 3875   ζ   2   + 275 η + 275 ξ − 1800 ζ + 100 ) .       (30)       N   ^     5   =   1   747   ( 792   η   2   − 10164 η ξ + 1788 η ζ − 10164   ξ   2   − 10164 ξ ζ + 792   ζ   2   + 204 η + 10164 ξ + 204 ζ − 786 )     N   ^     6   =   1   747   ( 792   η   2   + 11748 η ξ − 204 η ζ + 792   ξ   2   − 204 ξ ζ − 204   ζ   2   − 1788 η − 1788 ξ + 204 ζ + 210 )     N   ^     7   =   1   747   ( − 10164   η   2   − 10164 η ξ − 10164 η ζ + 792   ξ   2   + 1788 ξ ζ + 792   ζ   2   + 10164 η + 204 ξ + 204 ζ − 786 ) .       (31)       N   ^     8   =   1   747   ( 792   η   2   + 1788 η ξ − 10164 η ζ + 792   ξ   2   − 10164 ξ ζ − 10164   ζ   2   + 204 η + 204 ξ + 10164 ζ − 786 )     N   ^     9   =   1   747   ( − 204   η   2   − 204 η ξ − 204 η ζ + 792   ξ   2   + 11748 ξ ζ + 792   ζ   2   + 204 η − 1788 ξ − 1788 ζ + 210 )     N   ^     10   =   1   747   ( 792   η   2   − 204 η ξ + 11748 η ζ − 204   ξ   2   − 204 ξ ζ + 792   ζ   2   − 1788 η + 204 ξ − 1788 ζ + 210 ) .       The SA approach can be easily adjusted to use conventional locations of integration points. This slightly decreases the accuracy of the integration, yet it enables one to use the values of   J   p   which have been computed for the purpose of other integrations, e.g. stiffness matrix and internal forces. Below, we compare between the accuracy of the SA approach with conventional locations of sampling points (  a =  5  / 5  ) to that of the SA approach with optimal locations of sampling points (  a = 0.36  , see Section 4.2). Stiffness matrix of 10-node tetrahedral elements is computed with four integration points in commercial packages, e.g. ABAQUS. Thus, for practical reasons, we present in Table 8 the results associated with four integration points. Results of the ST approach with four integration points are also indicated for convenience. The corresponding SA coefficients are provided in the supplementary file Result_Matrices.xls.  Supplementary data associated with this article can be found in the online version at doi:10.1016/j.finel.2016.03.004.      Supplementary material        REFERENCES", "highlights": "We present a new approach to compute the mass matrix of solid finite elements which allows a significant reduction in the number of integration points. The method is based on exploiting information regarding the mathematical form of the integrand. This enables higher degree of precision for the same number of integration points compared to standard quadrature use. The approach is general and can be applied to both consistent and lumped matrices of all element types. Here, we focus on the consistent mass matrix of the widely used 10-node tetrahedral element, and demonstrate the superiority of the new approach over conventional quadrature use. For example, we show that the new integration scheme enables a degree of precision 4 with 1 integration point compared to 11 points with conventional numerical integration. Also, our 4-points integration rule is practically equivalent to conventional numerical integration with 15 points."}