{"id": "S0168874X14001346", "article": "MAIN-TITLE A total-Lagrangian position-based FEM applied to physical and geometrical nonlinear dynamics of plane frames including semi-rigid connections and progressive collapse   HIGHLIGHTS          Development of an alternative FE for physical and geometrical nonlinear dynamics.      Generalized vectors with natural energy conserving property.      Analysis of 2D frames and machines.      Multi-linear elastoplastic for continuum members and semi-rigid connections.      Progressive collapse analysis of structures subjected to seismic loads.          KEYPHRASES   Physical and geometrical nonlinear dynamics  Frames  Machines  Finite element methods  Semi-rigid connections  Progressive collapse   Due to recent advances in computational resources new possibilities are opened to the dynamic analysis of solids, structures and mechanisms. Particularly, in structural analysis, time domain nonlinear formulations are gaining more space in the specialized literature. It occurs because this kind of analysis allows forecasting the behavior of structures in situations beyond the elastic limit, including the loss of strength and stiffness related to the inelastic behavior of materials and the occurrence of large displacements and rotations [1].  Regarding large displacement and rotations one must make difference between the geometrically exact representations present in works like [2,3,4,5] and the approximate second order ones described by [6,7,8,9], for example. Second order formulations, for which stability functions are employed to modify the stiffness of bending elements, do not consider the inertial properties of transverse movements and are not capable of giving precise results for mechanism analysis and for the post-critical behavior of ruined structures. Therefore, in this work we choose to adopt a geometrically exact formulation.  Among the geometrically exact formulations for the analysis of structures and mechanisms one should highlight the updated Lagrangian or co-rotational schemes and the total Lagrangian strategies. Due to the change of reference the mass matrix varies in updated Lagrangian approaches, arising the need of special time integration algorithms to guarantee the energy and momentum conservation [3,5,10]. The total Lagrangian formulations present a constant (or quasi-constant) mass matrix, which allows the use of well established time integration procedures developed in the context of geometrically linear analysis, as for example the Newmark β algorithm [11].  Thus, in this work we use the total Lagrangian formulation based on positions to develop a strategy for the physical and geometrical nonlinear analysis of plane structures and mechanisms. The developed frame elements have cross sections constituted by laminas of different materials and widths following the Reissner–Mindlin kinematics which includes a complete constitutive relation. These elements are connected among each other by semi-rigid connections. Both elements and connections have multi-linear elastoplastic behavior with isotropic hardening.  Various researches related to geometrical nonlinear analysis of two and three-dimensional frames that consider plasticity can be cited. Some pioneering authors [12,13] applied co-rotational techniques to analyze three-dimensional frames developing plasticity. In these works elastoplasticity is treated in a discrete way (plastic hinges), in which a moment–curvature relation is assumed for continuous members cross sections. One can cite some recent works that follow the same localized plastic hinge strategy to model the behavior of frame elements, like [14–22].  Some authors [23–25] use distributed plasticity to model two and three dimensional frames. One advantage of distributed plasticity, when compared to plastic hinges, is the better representation of the plastic evolution over cross sections, without the necessity of a previous knowledge of moment–curvature curves. However, both plastic hinges and the existent distributed plasticity frame models do not consider the shear stress influence like the finite element proposed in this work.  In the context of three dimensional analyses advanced works such as [26–28] should be mentioned. In these works cable, truss and beam-column elements are specifically designed to guarantee efficiency for practical applications. Authors include second order formulations for the beam-column element and apply lumped mass matrix to proceed with time integration when all elements are coupled together. Moreover, fiber concept plasticity is introduced to consider distributed plasticity along elements.  Concerning problems in which semi-rigid connections are present one can cite the works of [29–36]. All these works use second order geometrical description, which limits the range of applications, i.e., displacements and rotations should not be large as required, for example, in machine and progressive collapse analysis including the post-critical behavior of ruined structures.  In order to implement semi-rigid connections in any computational code it is necessary to use results from works that study the experimental behavior of these connections, as, for example, [37,38]. Some works, using experimental results, to establish empirical mathematical models for connections behavior are also present in literature; see, for example, the works of [29,39–44]. Based on these studies and in second order instability theory some authors [45] adopted elastoplastic power laws to model the nonlinear behavior of semi-rigid connection for the analysis of 2D structures subjected to seismic loads. These authors also adopted localized plasticity at extremity of elements (as the elastic instability approach has been adopted along bars) to model the physical nonlinear behavior of 2D frames.  In the present work an alternative position based on finite element (FE) formulation [46,47] is developed to comprise geometrical and physical nonlinearity of both frame members and connections for dynamic analysis of machines and structures. The formulation, originally developed and presented in this work, is geometrically exact and, considering the Reissner kinematic hypothesis, includes shear stress contribution for both displacement and failure criterion. Based on [48] the developed elastoplastic algorithm is multi-linear with an alternative flow direction rule, which allows the reproduction of any stress–strain curve and the determination of closed solution for the plastic multiplier. Moreover, semi-rigid elastoplastic connections develop large rotations allowing realistic analysis of unload situations for which connections and/or frame elements suffer plastic deformations.  We start the formulation description by defining the Reissner kinematic for laminate frame elements passing through the establishment of the total potential energy including plastic dissipation for both frame elements and semi-rigid connections. After that, the principle of stationary energy is employed to write the dynamic equilibrium equations (regarding positions) and the elastoplastic evolution is defined. The Newmark time integration algorithm and the Newton–Raphson procedure are combined to solve the resulting time step nonlinear system of equations. Examples are presented to validate the proposed formulation and to show its possibilities.  The FE formulation presented here is called positional as it is based on positions, not displacements [46,47]. The main advantages of this total Lagrangian strategy are the establishment of gradient deformation without the explicit use of the chain rule and the achievement of quasi-constant mass matrix [49–52]. The chain rule operation appears as a simple numerical (2×2) matrix inversion, which allows an easy generalization of this procedure for any class of nonlinear mechanical problems.  In this section we present the complete development of the alternative 2D positional laminate Reissner kinematics to be used in the proposed finite element formulation.  The positional formulation is based on two mappings, one related to the initial configuration and another related to the current configuration. To describe the initial configuration mapping one starts with the reference line approximation, see Fig. 1a, by the following expression:  (1)    f   o i   m   (   ξ   1   ) =   x   i   m   (   ξ   1   ) =   ϕ   ℓ     X   i ℓ   m     in which i is the coordinate direction (1 or 2), m represents the reference line and ℓ the element node (or shape function). In expression (1) the repetition of index ℓ indicates summation (Einstein notation). Fig. 1a shows 4 nodes (cubic approximation); however any number of nodes or approximation order may be chosen.  In Fig. 1a    f →    0   m   (   ξ   1   ) is the mapping from the non-dimensional variable   ξ   1   to the initial reference line. To define the cross sections initial position one calculates the nodal angle   θ   k   0   that the normal vector   v   i k   makes with the horizontal direction (x 1 axis), see Fig. 1b, as  (2)    θ   k   0   = a r c t g (   v   2 ( k )   /   v   1 ( k )   )   in which  (3)    v   1 k   = −   T   2 k   / | |  T →  | |  and    v   2 k   =   T   1 k   / | |  T →  | |   and  (4)    T   i k   =      d   ϕ   ℓ   (   ξ   1   )   d   ξ   1      |     ξ   1   k       X   i ℓ   m        Knowing the nodal (cross sections) angles we use the same shape functions to approximate   θ   0   (   ξ   1   ) along the initial configuration  (5)    θ  0  (   ξ   1   ) =   ϕ   ℓ   (   ξ   1   )   θ   ℓ   0        In Fig. 2 one can find any point inside the continuum (laminate frame) using the following expressions:  (6)    f   01   (   ξ   1   ,   ξ   2   ) =   x   1   l a m   (   ξ   1   ,   ξ   2   ) =   ϕ   ℓ   (   ξ   1   )   X   1 ℓ   + (   d   l a m   +     h   l a m    2    ξ   2   ) cos (   ϕ   ℓ   (   ξ   1   )   θ   ℓ   0   )      (7)    f   02   (   ξ   1   ,   ξ   2   ) =   x   2   l a m   (   ξ   1   ,   ξ   2   ) =   ϕ   ℓ   (   ξ   1   )   X   2 ℓ   +  (    d   l a m   +     h   l a m    2    ξ   2    )  sin (   ϕ   ℓ   (   ξ   1   )   θ   ℓ   0   )   in which   ξ   2   is the second non-dimensional variable,   d   l a m   is the distance of the lamina mid line from the reference line,   h   l a m   is the height of a lamina and the pair ( cos (   ϕ   ℓ   (   ξ   1   )   θ   ℓ   0   ) ,  sin (   ϕ   ℓ   (   ξ   1   )   θ   ℓ   0   ) ) is the parameterized unit orthogonal vector. In Eqs. (6) and (7) the symbol m is suppressed, and from now on   X   i ℓ   is simply the initial nodal coordinate.  The width of each lamina (   b   l a m   ) is introduced at the integration procedure as an additional weighting value.  The necessary information to build the initial configuration comprises the reference line nodal coordinates and the distance of each lamina from the reference line (assumed constant) as well as the height and width of each lamina (assumed constant). The current configuration is achieved by a nonlinear process that uses a trial position to start the solution procedure. So, at this stage, we do not worry about the solution process and write the current configuration similarly to the initial one, as  (8)    f   11   (   ξ   1   ,   ξ   2   ) =   y   1   l a m   (   ξ   1   ,   ξ   2   ) =   ϕ   ℓ   (   ξ   1   )   Y   1 ℓ   +  (    d   l a m   +     h   l a m    2    ξ   2   ) cos (   ϕ   ℓ   (   ξ   1   )   θ   ℓ    )       (9)    f   12   (   ξ   1   ,   ξ   2   ) =   y   2   l a m   (   ξ   1   ,   ξ   2   ) =   ϕ   ℓ   (   ξ   1   )   Y   2 ℓ   +  (    d   l a m   +     h   l a m    2    ξ   2    )  ( sin (   ϕ   ℓ   (   ξ   1   )   θ   ℓ     Here   y   i   l a m   are the current coordinates of a general point inside the frame element and lamina,   Y   i ℓ   are current nodal coordinates and   θ   ℓ   are the current angles of cross sections, see Fig. 3.  One can see from Fig. 3 and from Eqs. (8) and (9) that cross sections remain straight, but not orthogonal to the reference line. This characterizes the general Reissner kinematics. Moreover we kept   h   l a m   and   b   l a m   unchanged, limiting our constitutive relation to accept any shear elastic modulus (G), but null Poisson ratio regarding the longitudinal strain relations, see Eq. (16).  As the mappings from the non-dimensional space to initial and current configurations had been defined in previous section, we start the description of the deformation of the analyzed body (laminate frame). This is done by joining the two mappings of Figs. 2 and 3 in a single representation, see Fig. 4, for which the function  f →  describes the deformation from initial configuration (   B   0   ) to the current one ( B ) . As is well known [46]   f →  is written as a composition of mappings    f →    0   and    f →    1   as  (10)   f →  =    f →    1     (    f →    0   )   − 1     and the gradient of  f →  , called here A (a 2×2 tensor), is written from the gradient of    f →    0   and    f →    1   as  (11)  A =   A  1  ⋅   (   A  0  )   − 1    or    A   i j   =   A   i k   1     D   k j     in which   D   k j   is the inverse of   A  0  .  The gradients of initial and current mappings are written as  (12)    A   i j   0   =   ∂   f   0 i     ∂   ξ   j     =   f   0 i , j   =  [      {    ϕ   ℓ , 1     X   1 ℓ   −  (    d   l a m   +     h   l a m    2    ξ   2    )  sin (   ϕ   k     θ   k   0   ) (   ϕ   z , 1     θ   z   0   )  }     {      h   l a m    2   cos (   ϕ   ℓ     θ   ℓ   0   )  }       {    ϕ   ℓ , 1     X   2 ℓ   +  (    d   l a m   +     h   l a m    2    ξ   2   ) cos (   ϕ   k     θ   k   0   ) (   ϕ   z , 1     θ   z   0    )   }     {      h   l a m    2   sin (   ϕ   ℓ     θ   ℓ   0   )  }      ]       (13)    A   i j   1   =   ∂   f   1 i     ∂   ξ   j     =   f   1 i , j   =  [      {    ϕ   ℓ , 1     Y   1 ℓ   −  (    d   l a m   +     h   l a m    2    ξ   2    )  sin (   ϕ   k     θ   k   ) (   ϕ   z , 1     θ   z   )  }     {      h   l a m    2   cos (   ϕ   ℓ     θ   ℓ   )  }       {    ϕ   ℓ , 1     Y   2 ℓ   +  (    d   l a m   +     h   l a m    2    ξ   2    )  cos (   ϕ   k     θ   k   ) (   ϕ   z , 1     θ   z   )  }     {      h   l a m    2   sin (   ϕ   ℓ     θ   ℓ   )  }      ]       The objective Green–Lagrange strain measure E is chosen to develop the geometrically exact FE, that is  (14)  E =  1 2  ( C − I ) =  1 2  (   A  t  ⋅ A − I )  or    E   i j   =  1 2  (   A   k i     A   k j   −   δ   i j   )   where I is the second order identity tensor and C is the right Cauchy stretch.  In this section, the elastic Saint-Venant-Kirchhoff constitutive relation is adopted to relate the second Piola–Kirchhoff stress S and the Green strain E for frame elements. Moreover, semi-rigid linear elastic connections are introduced to make a preliminary development of the complete nonlinear solution technique, including plasticity, to be shown in the next section.  In order to unify the notation, the degree of freedom   θ   ℓ   will be called   Y   3 ℓ   . Each element node has three degrees of freedom but when connecting elements by means of semi-rigid connections (global numbering) an extremity node may have more than three degrees of freedom, as the rotations of the connected elements are not the same. Fig. 5 shows three cases to illustrate the linking by means of free connections (joints).  Following Fig. 5 one observes that a master element defines the first rotation degree of freedom (the third of the node) and each slave element introduces an extra degree of freedom for the connection node. Fig. 6 shows the introduction of elastic connections in the arrangement of Fig. 5.  In general, the strain energy stored in a semi-rigid connection with stiffness modulus   k   ( η α β )   is given by  (15)    U   η   S R   =     k   ( )    2    (   θ   α   η   −   θ   β   η   )  2  =     k   ( η α β )    2    (   Y   3 α   η   −   Y   3 β   η   )  2       in which η is the node where the connection is considered, α is the first connected element (master) and β is the other connected element. No summation is implied.  As mentioned before the Saint-Venant-Kirchhoff specific strain energy is adopted here to relate the Green strain (E) and the second Piola–Kirchhoff stress (S) as  (16)    u   e   =  E 2  (   E   11   2   +   E   22   2   ) + G (   E   12   2   +   E   21   2   )  or    u   e   =  1 2  E : ℭ : E   in which G = E /  [  2 ( 1 + ν )  ]  is the shear elastic modulus, ν is the Poisson ratio and   E   i j   are the Green strain tensor in Einstein notation. Alternatively, in dyadic notation, E is the Green strain tensor and ℭ is the elastic constitutive tensor. Expression (16) avoids Poisson locking by annihilating the transverse material expansion or contraction.  As the Green strain has been written as a function of nodal positions, see Eqs. (11) (through 14), the strain energy stored in structure elements is written as  (17)    U   e   (  Y →  ) =  ∫    V   0        u   e   (  Y →  ) d   V   0      in which   V   0   is the initial volume of the analyzed structure [47,50].  In order to write the total potential energy of the mechanical system Π (  Y →  ) (conservative and isothermal) one sums the strain energy of frame elements, the strain energy of semi-rigid connections, the potential energy of external loads (and moments), the potential energy of external distributed forces and the kinetic energy, resulting in  (18)  Π (  Y →  ) =  ∫    V   0        u   e   (  Y →  ) d   V   0    +   U   e   S R   −  F →  ⋅  Y →  −  ∫    S   0       q →  ⋅    y →   m   d   S   0    +  1 2   ∫    V   0        ρ   0      y →  ̇  ⋅   y →  ̇   d   V   0      where  F →  is the external nodal force vector (including moments),  q →  is the general distributed force vector written as function of nodal values (   q   i   =   ϕ   ℓ   ( ξ )   Q   ℓ i   ) ,   ρ   0   is the mass density related to the initial configuration,   y →  ̇  is the velocity of a general point inside the domain,    y →   m  is the current position at the reference line of frame elements (see Eqs. (8) and (9)) and d   S   0   is the infinitesimal length of the curved frame element.  In order to find the equilibrium configuration one applies the principle of stationary potential energy on Eq. (18), using as parameters the nodal positions:  (19)  δ Π =  ∫    V   0        ∂   u   e     ∂ E   :   ∂ E   ∂  Y →    ⋅ δ  Y →   d   V   0    +   ∂   U   e   S R     ∂  Y →    ⋅ δ  Y →  −  F →  ⋅ δ  Y →  −  ∫    S   0       q →  ⋅   ∂    y →   m    ∂  Y →    ⋅ δ  Y →    d   S   0   +  ∫    V   0        ρ   0     y →  ¨  ⋅ ( ϕ ⋅ δ  Y →  ) d   V   0    =  0 →    in which   y →  ̇   δ t = δ  y →  has been used.  By the energy conjugate principle [53], the first term of the first integral of Eq. (19) is the second Piola–Kirchhoff stress and the derivative of the strain energy stored in elastic connections is the internal moment    M →    int   . Therefore, in order to simplify the understanding of the physical nonlinear procedure shown in the next section, one rewrites Eq. (19) as  (20)  δ Π =  ∫    V   0      S :   ∂ E   ∂  Y →    d   V   0   ⋅ δ  Y →  +    M →    int   ⋅ δ  Y →  −  F →  ⋅ δ  Y →   −  ∫    S   0       q →  ⋅ ϕ d   S   0   ⋅ δ  Y →   +  ∫    V   0        ρ   0     Y →  ¨  ⋅  ϕ →  ⊗  ϕ →  d   V   0   ⋅ δ  Y →   =  0 →    To obtain Eq. (20) the property ∂    y →   m  / ∂  Y →  =  ϕ →  and the nodal characteristic of δ  Y →  have been used. Moreover, the same approximation adopted to position is used for acceleration.  The understanding of Eq. (20) can be further improved as  (21)  δ Π =    F →    int   ⋅ δ  Y →  +    M →    int   ⋅ δ  Y →  −  F →  ⋅ δ  Y →  − L ⋅  Q →  ⋅ δ  Y →  + M ⋅   Y →  ¨  ⋅ δ  Y →  + D ⋅   Y →  ̇  ⋅ δ  Y →  =  0 →    in which L is the matrix that transforms the distributed forces into nodal equivalent ones, M is the constant mass matrix and D is the mass proportional damping [52,54,55]. Due to the arbitrariness of δ  Y →  Eq. (21) represents the geometrical nonlinear dynamic equilibrium equation, i.e.  (22)     F →    int   +    M →    int   −  F →  − L ⋅  Q →  + M ⋅   Y →  ¨  + D ⋅   Y →  ̇  =  0 →       It is important to note that this work deals with relatively slender bars whose cross section rotational inertia is neglected; see [47] for more information regarding this subject.  To close this item we show the pair of internal moments, for an elastic semi-rigid connection, associated to a global node η related to the initial (or final) point of a frame element α and to the final (or initial) point of a frame element β , as  (23)    F   3 α   η   =   M   α   η   =   k   ( η α β )   (   Y   3 α   η   −   Y   3 β   η   )  a n d    F   3 β   η   =   M   β   η   = −   k   ( η α β )   (   Y   3 α   η   −   Y   3 β   η   )      In Appendix A one finds explicit expressions to calculate ∂ E / ∂  Y →  present in Eq. (20). In Section 4 the nonlinear dynamic equilibrium is extended to include plasticity. In Section 5 the Newmark time integration and the Newton–Raphson procedure are combined to solve the resulting nonlinear dynamic system of equations.  The previous section is used to introduce the geometrical nonlinearity concept into the total Lagrangian dynamic formulation based on positions. This section takes advantage of the previous equations to introduce elastoplasticity into the nonlinear dynamic problem and briefly presents the multi-linear elastoplastic evolution model, adopted for both frame end semi-rigid connections.  The difference between the elastic and inelastic procedures is the way the potential energy of external forces is transferred to the deformed body and dissipated during the dynamic process. In this case, instead of using the elastic strain energy, for both the frame element and connections, one adopts the Helmholtz free energy potential [54].  Following this reasoning the total potential energy for isothermal problems is written as  (24)  Π (  Y →  ) =  ∫    V   0      Ψ ( E , α ) d   V   0    +   Θ   S R   ( (   Y   3 α   η   −   Y   3 β   η   ) ,  α ¯  ) −  F →  ⋅  Y →  −  ∫    S   0       q →  ⋅    y →   m  (  Y →  ) d   S   0    +  1 2   ∫    V   0        ρ   0     y →  ̇  ⋅   y →  ̇  d   V   0      where Ψ and   Θ   S R   are, respectively, the frame elements and the connections free energy potentials. These potentials are written as a function of the Green strain tensor, the relative angle positions at connections and the thermodynamic parameters α and  α ¯  .  The variation of the total potential energy is zero at the equilibrium position, i.e.  (25)  δ Π =  ∫    V   0        ∂ Ψ   ∂ E   :   ∂ E   ∂  Y →    d   V   0   ⋅ δ  Y →  +   ∂   Θ   S R     ∂  Y →    ⋅ δ  Y →  −  F →  ⋅ δ  Y →   −  ∫    S   0       q →  ⋅ ϕ d   S   0   ⋅ δ  Y →   +  ∫    V   0        ρ   0     Y →  ¨  ⋅  ϕ →  ⊗  ϕ →  d   V   0   ⋅ δ  Y →   =  0 →    in which parameters α and  α ¯  are not present due to their intrinsic relation with E and S and with the relative rotation and    M →    int   to be shown in Section 4.2.  Even for inelastic problems, the derivative of the free energy potential with reference to Green strain is the second Piola–Kirchhoff stress tensor. For the same reason, the energy conjugate of the free energy at elastoplastic connections with repect to relative angles are internal moments. In this way Eq. (25) can be written exactly as Eq. (21) or (22). However, with a physical nonlinear meaning; i.e., while the passage from Eq. (19) to Eq. (20) is done by a simple differentiation of the quadratic potential shown by Eq. (16), now it is necessary to define an inelastic (plastic for instance) relation to describe the material behavior and its evolution rule.  In this item, we summarize the constitutive elastoplastic relation developed by [48] and [56]. We follow a general 3D description in order to adequate the constitutive relation to any finite element kinematic, avoiding volumetric locking. A brief description of the main equations is given for both frame and connections.  Although the developed displacements are high, the strain level present in our applications is relatively small. Therefore, the Green strain approximates the linear strain and the second Piola–Kirchhoff stress can be used in place of the Cauchy stress. Following this reasoning we adopt the additive strain decomposition as  (26)  E =   E  e  +   E  p   or    E  e  = E −   E  p    in which   E  e  and   E  p  are, respectively, the elastic and plastic parts of E . Therefore, the free energy potential can be written as  (27)  Ψ ( E −   E  p  , α ) =  1 2    E  e  : ℭ :   E  e  +  1 2  h   α  2    where ℭ is the elastic constitutive tensor and h is the isotropic hardening parameter.  The second Piola–Kirchhoff stress and the thermodynamic force χ are written as  (28)  S =   ∂ Ψ   ∂ E   = ℭ :   E  e  = ℭ : ( E −   E  p  )      (29)  χ = −   ∂ Ψ   ∂ α   = − h  α   As mentioned after Eq. (25), in order to eliminate α from equilibrium equation it is necessary to relate   E  p  and α . In classical formulations this is done introducing a plastic potential F  (  S , χ  )   [57] for which the plastic flow is given by  (30)     E ̇   p  =  λ ̇    ∂ F   ∂ S    and   α ̇  =  λ ̇    ∂ F   ∂ χ     or in infinitesimal notation  (31)  d   E  p  = d λ   ∂ F   ∂ S    and  d α = d λ   ∂ F   ∂ χ     where λ is the plastic multiplier. In the adopted formulation [48,56] Eqs. (29) and (31) are replaced by α = − λ and  (32)  d   E  p  = η d λ  and  d χ = h d λ   for which  (33)  η =   D  p  : S =  G      J   2        (    S ¯   2 G   +   t r ( S )   9   k  p    I  )   and    D  p  =  G      J   2         (   ℭ  p  )   − 1     In Eq. (33)    J   2   = 1 / 2  [   S ¯  :    S ¯   t   ]  is the second invariant of the deviatory stress  S ¯  and   ℭ  p  is an elastic constitutive tensor, similar to ℭ changing the ν by   ν  p  . Moreover   k  p  = E /  [  3  (  1 − 2   ν  p   )   ]  is the elastoplastic bulk modulus. Following this strategy, when   ν  p  ≅ 0.5 isochoric plasticity takes place and when ν =   ν  p  the plastic flow occurs in the same direction of elastic flow. In this work we adopt   ℭ  p  = ℭ , defined by the second derivative of expression (16) with reference to strain. This choice releases any possible locking related to Reissner kinematic.  To complete the elastoplasticity procedure one defines the yielding failure expression as  (34)  f =     J   2     − χ −   S   y     in which   S   y   =   σ   y   /  3  is the initial size of the Von-Mises surface (f=0) with   σ   y   being the yielding uniaxial stress.  It is important to know that the plastic multiplier should satisfy the Khun–Tucker conditions, related to the yielding surface (34), i.e.  (35)  d λ ≥ 0 ,  f ≤ 0 ,  d λ  f = 0   which means that if f ≤ 0 then d λ = 0 and no plastic evolution occurs and if, for some situation, one finds f > 0 then d λ > 0 should be achieved in order to guarantee the equality f = 0 .  In terms of incremental solution we assume isotropic hardening (h), constant by parts, and a typical interval [    t   n   ,   t   n + 1    ] for which n is a previous (solved) step and n + 1 is the current step. Therefore, one writes        E  ( n + 1 )     t      → elastic  trial  of  the  total  strain        E  ( n + 1 )   p    t  =   E   n   p       → accumulated  plastic  strain  ( assumed  as  trial )        λ  ( n + 1 )     t  =   λ   n       → trial  internal  variable        χ  ( n + 1 )     t  =   χ   n       → trial  thermodynamic  internal  force       Using these variables we calculate the stress level considering Δ   E  p  ( instead  of  d   E  p  ) as the main unknown, as follows:  (36)    S   ( n + 1 )   = ℭ : (  E  ( n + 1 )     t  −  E  n   p    t  − Δ   E  p  ) =  S  ( n + 1 )     t  − ℭ : Δ   E  p    where the trial stress  S  ( n + 1 )     t  is known. Using this value we calculate the trial yielding expression  (37)   f  ( n + 1 )     t  =    J 2    t    −  χ     t  −   S   y     If  f  (  n + 1  )     t  ≤ 0 the step is elastic and the trial variables are the correct ones. However, if  f  (  n + 1  )     t  > 0 then the step is elastoplastic and   f   (  n + 1  )   should be zero, resulting in  (38)  Δ λ =  f  ( n + 1 )     t  / ( G + H )   Finally, the correct stress tensor to be introduced in Eq. (25) results by substituting (38) into (32) and using (32) and (36), i.e.  (39)    ∂ Ψ   ∂ E   = S =  S     t  −    f  ( n + 1 )     t    ( G + H )   ℭ :  (      S ¯   ( n + 1 )     t    2    J  2 ( n + 1 )     t      +   G  t r  (   S     t   )    9   k  P     J  2 ( n + 1 )     t      I  )    Moreover, the constitutive elastoplasticity tensor is written as [56]   (40)    ℭ   e p   =   ∂ S   ∂ E   =     ∂  2  Ψ   ∂ E ∂ E   = ℭ -  (    E : η ⊗   S ¯      t  : ℭ     S ¯      t  : ℭ : η + 2     J   2     H    )  = ℭ −   ℭ  p       In this item the previous general elastoplastic procedure (multi-linear) is simplified to accomplish the semi-rigid connection. Firstly, the notation of Eqs. (15) and (23) is changed to  (41)    R   3 α β   η   = (   Y   3 α   η   −   Y   3 β   η   )   in which   R   3 α β   η   is the relative rotation between frame bars α and β at a connection node η . From now on, to simplify the developments, this relative rotation will be called simply R . This variable is clearly one-dimensional and is separated into elastic and plastic parts, as  (42)  R =   R  e  +   R  p   o r    R  e  = R −   R  p    The free Helmholtz energy potential, implicit in Eq. (24), is written as  (43)    Θ   S R   ( R −   R  p  ,  α ¯  ) =  1 2  k   (   R  e  )  2  +  1 2  h    α ¯   2    where k is the elastic stiffness of the connection and h its isotropic hardening. Following the previous item one writes the internal moment and the thermodynamic force related to the internal variable  α ¯  as  (44)  M =   ∂   Θ   S R     ∂ R   = k   R  e  = k ( R −   R  p  )      (45)  χ = −   ∂ θ   ∂  α ¯    = − h  α ¯       In the case of semi-rigid connections, the elastic limiting moment   M   y   > 0 is used to write the failure expression as  (46)  f = | M | −   M   y   − χ ≤ 0  a n d  f = | M | −   M   y   + h  α ¯  ≤ 0   Following the steps described in the previous item, one achieves  (47)  Δ   R  p  = s i g n ( M ) .    f     t    k + h     in which s i g n represents signal. Moreover the tangent modulus is obtained as  (48)    k   t   =     ∂  2    Θ   S R     ∂   R  2    =   k . h   k + h        In this section we combine the Newmark time integration and the Newton–Raphson algorithm to solve the nonlinear dynamic equilibrium described by Eqs. (25) or (22), rewritten here joining the external conservative loads into one single vector  F →  :  (49)   g →  =    F →    int   +    M →    int   −  F →  + M ⋅   Y →  ¨  + D ⋅   Y →  ̇  =  0 →    in which  g →  is a vector that is null if  Y →  is the right position trial used to calculate internal forces    F →    int   and    M →    int   , if not it turns into the unbalanced mechanical force. Expression (49) represents the dynamic equilibrium equation at any time and has to be solved. In order to do so the first step is to write this equilibrium for a specific instant   t   s + 1   , as follows:  (50)   g →    |   S + 1   =      ∂ Π   ∂  Y →     |   S + 1   =      ∂ Ψ   ∂  Y →     |   S + 1   +      ∂   Θ   S R     ∂  Y →     |   S + 1   −    F →    S + 1   + M ⋅     Y →  ¨    S + 1   + D ⋅     Y →  ̇    S + 1   =  0 →    in which internal forces are assumed as the derivatives of Helmholtz free energy potentials regarding positions. Substituting the Newmark approximations [52,55] into Eq. (50) gives  (51)   g →    |   S + 1   =      ∂ Π   ∂  Y →     |   S + 1   =      ∂ Ψ   ∂  Y →     |   S + 1   +      ∂   Θ   S R     ∂  Y →     |   S + 1   −    F →    S + 1   +  M  β Δ   t  2    ⋅    Y →    S + 1   − M ⋅    T →    S   + D ⋅    R →    S   +   γ D   β Δ t   ⋅    Y →    S + 1   − γ Δ t D ⋅    T →    S   = 0   where vectors    T →    s   and    R →    s   represent the dynamic contribution of the past as  (52)     T →    S   =      Y →    S     β Δ   t  2    +       Y →  ̇    S     β Δ t   +  (   1  2 β   − 1  )      Y →  ¨    S    a n d     R →    S   =     Y →  ̇    S   + Δ t ( 1 − γ ) _     Y →  ¨    S     and β and γ are the usual Newmark parameters [11].  Eq. (51) can be understood simply by  g →  (    Y →    S + 1   ) = 0 and is clearly nonlinear in    Y →    S + 1   . A Taylor expansion to solve this nonlinear equation is developed. The second derivative of the total energy potential is then given by  (53)         ∂  2  Π   ∂  Y →  ∂  Y →     |   S + 1   = H = ∇  g →  =        ∂  2  Ψ   ∂  Y →  ∂  Y →     |   S + 1   +        ∂  2  Θ   ∂  Y →  ∂  Y →     |   S + 1   +  M  β Δ   t  2    +   γ D   β Δ t     and the first order expansion results  (54)   0 →  =  g →  (    Y →    s + 1   ) ≅ g (    Y →    s + 1   0   ) + ∇ g (    Y →    s + 1   0   ) ⋅ Δ    Y →    s + 1     From Eq. (54) the Newton–Raphson procedure to solve the nonlinear equation (51) gives  (55)  H ⋅ Δ    Y →    s + 1   = −  g →  (    Y →    s + 1   0   )  a n d  Δ    Y →    s + 1   = −   H   - 1   ⋅  g →  (    Y →    s + 1   0   )   where    Y →    s + 1   0   is a trial position (usually    Y →    s   as the first choice) for   Y   s + 1   used in Eq. (51) to calculate  g →  (    Y →    s + 1   0   ) . Solving Δ    Y →    s + 1   one calculates a new trial for    Y →    s + 1   as  (56)     Y →    S + 1   =    Y →    s + 1   0   + Δ    Y →    s + 1     Acceleration and velocity are corrected, for each iteration, by,  (57)      Y ¨  →    S + 1   =      Y →    S + 1     β Δ   t  2    −    T →    S    a n d      Y →  ̇    S + 1   =     Y →  ̇    S   + Δ t ( 1 − γ )     Y →  ¨    S   + γ Δ t     Y →  ¨    S + 1     The stop criterion when a chosen tolerance (TOL) is satisfied, is  (58)  | |  g →  (    Y →    s + 1   ) | | ≤ T O L  o r  | | Δ    Y →    s + 1   | | ≤ T O L      In order to conclude the description of the formulation the second derivatives of the Helmholtz free energy potentials of frame elements and semi-rigid connections regarding positions are presented. From Eqs. (25), (40), (48) and (53) one writes  (59)      ∂  2  Ψ   ∂  Y →  ∂  Y →    =   ∂ E   ∂  Y →    :     ∂  2  Ψ   ∂ E ∂ E   :   ∂ E   ∂  Y →    +   ∂ Ψ   ∂ E   :     ∂  2  E   ∂  Y →  ∂  Y →    =   ∂ E   ∂  Y →    :   ℭ   e p   :   ∂ E   ∂  Y →    + S :     ∂  2  E   ∂  Y →  ∂  Y →         (60)      ∂  2    Θ   S R     ∂  Y →  ∂  Y →    =     ∂  2    Θ   S R     ∂ R ∂ R   =   k   t     The necessary expressions to calculate the last term of Eq. (59) is presented in Appendix B.  Various examples have been selected to test the formulation regarding all its features; they are nonlinear dynamics, large rotation, elastoplastic connections, elastoplastic behavior of materials and all aspects working together.  The first numerical example is used to show the ability of the proposed formulation to deal with nonlinear dynamics and large rotations, it is a benchmark of nonlinear dynamic formulations presented in several references [2,4,58,59]. The spin-up-maneuver is subject to a turn function (ψ(t)), applied on the restricted node, see Fig. 7. The adopted parameters for the beam are EI=1.4×104, EA=2.8×107, ρI=6.0×10−4, ρA=1.2 for a slender bar. The adopted time step to run the problem is Δ t = 0.0015 . This type of turn function represents a typical helicopter blade rotation. The structure is approximated by a mesh of 10 cubic Reissner kinematic finite elements.  The expressions of the turn function are as follows:   ψ ( t ) =  2 5   [      t  2   2  +   (    15   2 π    )  2   (  cos    2 π   15   t − 1  )   ]   rad ,  0 ≤ t ≤ 15       ψ ( t ) = ( 6 t − 45 )  rad ,  t > 15      All results compare very well with the ones presented by all references. Fig. 8 shows the difference between the free cross section angle (at the blade free extremity) and the imposed rotation angle. Reference [4] results are used for comparison.  In Fig. 9 some selected positions are compared with the rigid bar and the solution achieved by [4] using an Euler–Bernoulli kinematics.  In Fig. 10 the difference between the distance of the extreme free cross section from the pin and the original length of the bar is depicted against time. There is an apparent reduction of the length of the bar due to the bending that occurs at the beginning of the movement. As expected, the achieved final stretching presents a slight oscillation around the technical solution ρ   ω  2    ℓ  3  / ( 3 E ) .  This example is used to confirm the computational implementation of the elastoplastic connection and to demonstrate the geometrically exact description of the proposed total Lagrangian frame formulation. A clamped bar is divided into two equal elastic parts linked by an elastoplastic connection, as seen in Fig. 11.  The cross section and the elastic properties of the bar are also depicted in Fig. 11. Two finite elements of cubic approximation order have been used and the load is divided into 30 steps. Fig. 12a shows the moment versus rotation graphic comparing the achieved numerical result with the analytical curve for a monotonically crescent load. The initial elastic modulus of the connection is k = 12  kN  cm with elastic limit   M   y   = 3  kN  cm . Fig. 12b shows the connection behavior when subjected to a cyclic loading.  As one can see in Fig. 12 the multi-linear strategy is capable of accurately reproducing any elastoplastic curve.    Fig. 13 shows partial positions for 15 equally spaced loading levels, demonstrating that the nonlinear geometric description is exact. This level of rotation is not accomplished by formulations that adopt second order geometrical descriptions.  In order to show the behavior of the implemented elastoplasticity, a simply supported beam, subjected to a monotonically crescent controlled displacement at load positions, see Fig. 14, is analyzed. The cross section is also presented in Fig. 14, for which three laminas and five Gauss integrations points for each lamina are employed to perform the Gauss integration procedure. Two different materials are employed for comparisons, one is perfect elastoplastic and the other presents softening, see Fig. 15a.   Fig. 15b shows the beam behavior for both materials. Results are compared to the elastic limit load and the ultimate load for perfect elastoplasticity. Position control is sufficient to model the post-critical behavior of this example. Three cubic elements (without considering symmetry) are used to model this case.    Fig. 16 shows the evolution of bending moments for different load levels. One can observe that for the perfect elastoplastic case a degradation spreads over the beam; moreover the load stabilizes after the displacement of 7cm. After the imposed displacement of 2.2cm a reduction in the load level occurs for the softening case and, consequently, in the bending moment. Moreover, no bending moment spreads along the beam.  This example tests the formulation regarding the coupling of plasticity and geometrical nonlinearity. It is the simulation of an eccentric compression of a column, depicted in Fig. 17a. The material properties are E = 21 , 000  kN/cm2, ν = 0.0 and   σ   y   = 21  kN/cm2 with perfect elastoplasticity. Fig. 17b compares the results obtained using the proposed formulation with the elastic closed second order analytical solution (secant formulae). We adopt six cubic finite elements to run this example: four along the column and two for the small consoles at extremities. Position control is employed and, to impose symmetry, the rotation of the central node is restricted.  This example confirms that the elastic second order theory gives a more flexible result than the elastic geometrically exact one. The plastic flow starts at the load level of 13  kN, 16 % less than the column critical load ( 15.545  kN). The elastic release starts at the load level 3.773  kN and the residual displacement, at the new unloaded situation, is about 30  cm .  In this example the frames depicted in Fig. 18 are analyzed considering elastoplastic connections. The original data of this problem are given by [60,36]. In these works the connection model handles nonlinear elasticity and bars follow second order approximation. Moreover the kinematics does not include shear effects. To simplify comparisons, we adopt elastic bars with E = 21 , 000  kN/cm2 and ν = 0.0 .  The adopted multi-linear connection diagrams, shown in Fig. 19, are extracted from [60]. The adopted elastic limits of the connections for the four tested cases are   M   y   A   = 750  kNcm,   M   y   B   = 1625  kNcm,   M   y   C   = 5000  kNcm and   M   y   D   = 20 , 480  kNcm with their corresponding rotations   θ   y   A   = 1.67 ×   10   − 3    rad,   θ   y   B   = 1.67 ×   10   − 3    rad,   θ   y   C   = 5.00 ×   10   − 3    rad and   θ   y   D   = 6.67 ×   10   − 3    rad. More data information can be seen in [60].  Beams are constituted of steel wide flange shaped section W 14 × 48 while columns are constituted of W 12 × 96 section. It is interesting to note that bars behave elastically because the ultimate limit of the strongest connection (case D) is practically equal to the elastic limit of beams, and loads are applied at connections.  The load P (Fig. 18) grows monotonically until the critical load shows up.  Figs. 20 and 21 show that the results presented by our formulation agree with the ones given by references. For semi-rigid connections the differences in results are less than 2% for all cases. For rigid connection the difference is about 6%, explained by the difference among the exact geometrical description and second order approximations.  For connections A and B the displacement levels are very small and failure occurs in an abrupt way. In order to show up the horizontal plateau (for A and B), Figs. 20 and 21, we used lateral loads of 0.0015 P and 0.003 P instead of 0.001 P and 0.002 P . However, this procedure does not change the critical load value.  This example demonstrates the capability of the proposed formulation to model the behavior of structures to real seismic loading. The real event chosen is the Superstation Hill in 1987. The original unscaled time series record has been extracted from [61]. Both vertical (UP) and horizontal (360) accelerations are transformed into displacements (cm) and applied as base movements in the time domain analysis. The structure is a 25 storeys building, Fig. 22, modeled with (a) free connections (articulated joints), (b) rigid connections, (c) semi-rigid connections, (d) semi-rigid connections with bracing and (e) semi-rigid connections with bracing and pendulum.  All beams are made of wide flange W200×46. The columns are divided as follows: (i) from the 1st to the 5th floor W610×155, (ii) from the 6th to the 10th floor W610×140, (iii) from the 11th to the 15th W610×113, (iv) from the 16th to the 20th floor W460×74 and (v) from the 21st to the 25th W200×46. Bracings are 3.606  m long and pose square cross section of 5.83  cm side.  The adopted material is structural steel with simplified properties depicted in Fig. 23. The adopted density of columns is   ρ   s t   = 7000  kg/m3. For beams we adopt an equivalent density   ρ   e q   = 15 , 333  kg/m3, in order to include the mass influence of a reinforced concrete slab with 10cm of height and 4m of width. The considered vertical load q = 4088  kN/m is uniformly distributed over beams. The frame is considered simple supported and the soil moves horizontally and vertically following the real earthquake data.  The adopted semi-rigid connection moment–rotation diagram is depicted in Fig. 24, in which 70  kNm is the elastic limit of the connection and 120  kNm is the final strength.  The pendulum is modeled by a steel bar connected through a free joint at the top of the structure (point A of Fig. 22) and a steel cylinder also connected to this bar through a free joint. The bar is 1.75  m long and has square cross section of 5.83  cm side. The cylinder is 2.50  m long with a diameter of 1.93  m; the body weight of the cylinder is distributed over its length. The adopted time step is the same as the one given by the earthquake data, i.e., Δ t = 0.005  s.  The structure modeled in case (a) suffers a progressive collapse shown in Fig. 25. Fig. 25a presents sequential positions for time from 2.25s through 3s with a displacement scale amplification of 10. Fig. 25b presents sequential positions from time 3s through 4s without amplification.  In Fig. 26 the horizontal displacements at the top of the building for cases ‘b’ through ‘e’ are depicted together with the horizontal soil movement; values are presented for 50 time steps. The horizontal displacements are computed subtracting the resting value. This static displacement is different for each case due to the difference of the respective elastic center and the maintenance of the external vertical applied load.  As one can see the proposed formulation is a good tool to model the behavior of structures under seismic loads. Starting with rigid connection one may say that substituting them by semi-rigid elastoplastic connections reduces the general amplitude with time and reduces the overall movement frequency; however the first pick has been increased during the plastic dissipation. The introduction of bracings along the stair case increases the overall frequency and reduces the plastification of connections, but does not reduce the overall amplitude. The best solution for the problem is introducing a contra-balance pendulum; however the columns from floor 21st through 23rd, under the pendulum connection, should be substituted by the same ones used in floors 16th through 20th, in order to resist the extra load. In order to illustrate the pendulum movement, Fig. 27 shows some select positions for case (e); displacements are enlarged 20 times.   CONCLUSIONS   In this study an alternative position based on finite element formulation is presented and successfully implemented. The formulation is originally presented here, providing all steps for its reproduction. It is capable of accurately solving geometrical and physical nonlinear dynamic problems of both machines and structures.  Examples show good behavior of the formulation for various applications, covering progressive collapse of structures under seismic loading. Future works include the implementation of damage mechanics, also allowing the analysis of reinforced concrete structures developing large displacements and under severe dynamic loading.   ACKNOWLEDGMENTS   The authors would like to thank FAPESP (São Paulo Research Foundation) and CNPq (National Council for Scientific and Technological Development – Brazil) for the financial support of this research (FAPESP: 11/15731-5; CNPq: 306152/2013-4).  From expression (14), reproduces as,  (A1)  E =  1 2  ( C − I ) =  1 2  (   A  t  ⋅ A − I )   one writes  (A2)    ∂ E   ∂  Y →    =  1 2    ∂ C   ∂  Y →    =  1 2   ∂  ∂  Y →    {   A  t  ⋅ A } =  1 2   ∂  ∂  Y →    { [   (   A  0  )   − t   ⋅   (   A  1  )  t  ] ⋅ [ (   A  1  ) ⋅   (   A  0  )   − 1   ] } =  1 2   {   [    (   A  0  )   − t   ⋅   (    ∂   A  1    ∂  Y →     )  t   ]  ⋅ [ (   A  1  ) ⋅   (   A  0  )   − 1   ] + [   (   A  0  )   − t   ⋅   (   A  1  )  t  ] ⋅  [   (    ∂   A  1    ∂  Y →     )  ⋅   (   A  0  )   − 1    ]   }    In which all terms are known except ∂   A  1  / ∂  Y →  , detailed as follows:  (A3)    ∂   A  1    ∂   Y   1 ϖ     =  [        ϕ   ϖ , 1      0     0   0     ]       (A4)    ∂   A  1    ∂   Y   2 ϖ     =  [     0   0        ϕ   ϖ , 1      0     ]       (A5)    ∂   A  1    ∂   Y   3 ϖ     =   ∂   A  1    ∂   θ   ϖ     =  [      {  −  (    d   l a m   +      h   l a m    2     ξ   2    )  [  cos (   ϕ   k     θ   k   ) (   ϕ   z , 1     θ   z   )   ϕ   ϖ   +  sin (   ϕ   k     θ   k   )   ϕ   ϖ , 1   ]  }     {  −      h   l a m    2    sin (   ϕ   ℓ     θ   ℓ   )   ϕ   ϖ    }       {   (    d   l a m   +      h   l a m    2     ξ   2    )  [  cos (   ϕ   k     θ   k   )   ϕ   ϖ , 1   −  sin (   ϕ   k     θ   k   ) (   ϕ   z , 1     θ   z   )   ϕ   ϖ   ]  }     {       h   l a m    2    cos (   ϕ   ℓ     θ   ℓ   )   ϕ   ϖ    }      ]    in which   Y   i ϖ   is the degree of freedom i of node ϖ , component of vector  Y →  .  From expression (A2) one writes:  (B1)      ∂  2  E   ∂  Y →  ∂  Y →    =  1 2   {     2 ⋅  [    (   A  0  )   − t   ⋅   (    ∂   A  1    ∂  Y →     )  t   ]  ⋅  [   (    ∂   A  1    ∂  Y →     )  ⋅   (   A  0  )   − 1    ]  +     +    [    (   A  0  )   − t   ⋅   (      ∂  2    A  1    ∂  Y →  ∂  Y →     )  t   ]  ⋅ [ (   A  1  ) ⋅   (   A  0  )   − 1   ] + [   (   A  0  )   − t   ⋅   (   A  1  )  t  ] ⋅  [   (      ∂  2    A  1    ∂  Y →  ∂  Y →     )  ⋅   (   A  0  )   − 1    ]   }         All terms are known except   ∂  2    A  1  / ( ∂  Y →  ∂  Y →  ) . From Eqs. (A3) and (A4) one concludes that all second derivatives regarding translations are null. However, from Eq. (A5) one writes:  (B2)          ∂  2    A  1    ∂   Y   3 ϖ   ∂   Y   3 μ          =  [      {  −  (    d   l a m   +      h   l a m    2     ξ   2    )   [     cos (   ϕ   k     θ   k   )   ϕ   μ , 1     ϕ   ϖ   +  cos (   ϕ   k     θ   k   )   ϕ   ϖ , 1     ϕ   μ   +     −  sin (   ϕ   k     θ   k   ) (   ϕ   z , 1     θ   z   )   ϕ   ϖ     ϕ   μ       ]   }     {  −      h   l a m    2    cos (   ϕ   ℓ     θ   ℓ   )   ϕ   ϖ     ϕ   μ    }       {  −  (    d   l a m   +      h   l a m    2     ξ   2    )   [     sin (   ϕ   k     θ   k   )   ϕ   ϖ , 1     ϕ   μ   +  sin (   ϕ   k     θ   k   )   ϕ   μ     ϕ   μ , 1   +     +  cos (   ϕ   k     θ   k   ) (   ϕ   z , 1     θ   z   )   ϕ   ϖ     ϕ   m       ]   }     {  −      h   l a m    2    sin (   ϕ   ℓ     θ   ℓ   )   ϕ   ϖ     ϕ   μ    }      ]           REFERENCES", "highlights": "In this study we apply the total Lagrangian formulation based on positions to develop a strategy for the physical and geometrical nonlinear analysis of plane structures and mechanisms. The developed frame elements have cross sections constituted by laminas of different materials and widths. The Reissner–Mindlin kinematics is adopted to include shear effects into the formulation. These elements are connected among each other by semi-rigid connections. Both elements and connections have multi-linear elastoplastic behavior with isotropic hardening. An alternative flow direction rule, which allows the reproduction of any stress–strain curve and the determination of closed solution for the plastic multiplier, is shown. All steps to reproduce the formulation are provided. Various examples are used to demonstrate the good behavior of the formulation, including a progressive collapse analysis of a tall building subjected to a real seismic load."}