{"id": "S0168874X14001838", "article": "MAIN-TITLE 3D robust iterative coupling of Stokes, Darcy and solid mechanics for low permeability media undergoing finite strains   HIGHLIGHTS          Robust method to couple iteratively Stokes, Darcy and solid mechanics.      Application to industrial composite manufacturing (finite deformations, thin pure fluid layer, low permeability down to 10−15  m 2 and complex shapes).      Solution for key issues for Stokes Darcy coupling with low permeability (mass conservation).      Iterative fluid/solid coupling method based on Terzaghi principle and explicit permeability computation through solid mechanics volume changes.          KEYPHRASES   Stokes–Darcy coupled problem  Fluid–solid interaction  Iterative coupling  P1+/P1  Manufactured Exact Solution Method  Composites   This paper presents an iterative method to strongly couple Stokes and Darcy flows, in low permeability media, with finite strain solid mechanics in order to deal with fluid seepage into and out from low permeability media undergoing finite strains. It is applied here to complex manufacturing processes for composites in an industrial framework. It represents an improved extension of the work presented by Celle in [2,3] to 3D and complex shapes with low permeability down to   10   − 15      m   2   , opening the possibility to deal with industrial cases. In this approach two main problems have to be tackled, first the coupling between Stokes (pure fluid) and Darcy (flow through low permeability porous medium) flows and second, the fluid/structure interaction. In the case of low permeability media, the couplings are quite tricky to handle numerically especially due to the system conditioning where, for example, penalty coefficients will combine with very low contributions. Special attention will be paid, in this paper, to validate the numerical development in this framework.  Stokes and Darcy coupling has recently been a matter of interest for many researchers in various domains of application such as bio-mechanics [4], environment (river flow) [5,6] or composite processing [2,3,7]. From those works, one can identify two strategies to deal with Stokes–Darcy coupling, a unified approach [4,7,8] relying on a monolithic formulation of the so-called Brinkman problem (Stokes + Darcy), and an iterative one [3,9] based on two formulations interacting through boundary/interface conditions.  As for the fluid structure interaction, it is usually considered at a scale of observation where the porous medium can be seen as homogeneous. Then, the corresponding solid–fluid mechanical formulation is seen as ‘smeared-out’ and corresponds to poroelasticity which has been widely used and therefore developed in soil mechanics [10–12] and bio-mechanics [13,4]. In this case as well, different ways are presented in the literature to deal with fluid–structure interaction. First, simplified fluid–solid mechanics frameworks can be considered, introducing in 1D models some relationships relating explicitly interstitial fluid pressure with thickness variation [14–18], therefore limiting the domain of interest to simplistic processes. Second, in a more general framework, some researchers chose to solve a fully three dimensional solid–fluid mechanical formulation either through heavy monolithic approaches [19] or using an iterative method based on permeability and stress updates depending on displacement–velocity considerations [2,3]. In any case, all these coupling methods between fluid flow and solid mechanics within porous media rely on Terzaghi׳s principle [10].  The originality of the proposed method is that it remains robust and accurate even for real severe physical parameters such as low permeability values, thin pure fluid layer, large deformations and complex geometries which are often discarded in recent publications but definitively more relevant with respect to industrial applications. Second, the proposed industry-targeted method feature stands in its global approach which yields well-founded mechanistic relationship between flows and deformations. All the phenomena (pure and porous flows, and solid mechanics) are fully simulated and strongly coupled iteratively together. This permits to minimize the number of physical parameters which are required for describing the coupling mechanisms, somehow tricky and expensive to characterize within industrial context. Indeed, this approach does not require to perform compression test on wet fiber beds, only the constitutive law of the dry preforms is required. Moreover, the use of three independently formulated formulations makes it easy to use one, two of them, or the whole package to simulate all kinds of processes based on the same physical phenomena and to add, in the future, other formulations such as thermo-physico-chemical aspects, to simulate more complex coupled phenomena and processes.  This paper will present first the FE formulation for the fluid problem, in Stokes, Darcy, and coupled regimes, in Section 2. This coupled flow formulation will be then validated using test cases along with the Method of the Manufactured Exact Solution (MMES) [1] in Section 3. Second, the finite strain solid mechanics formulation will be exposed (Section 4) and coupled with the fluid flow problem (Section 5) and validated. Eventually, examples of fluid infiltration into 3D compacting orthotropic porous media will be given.  Let us formulate first the stabilized Stokes, Darcy, and Stokes–Darcy coupled problems. As depicted in Fig. 1 , for the fluid flow one may split the whole domain Ω to be studied, into two areas.  The purely fluid region   Ω   S   is governed by the Stokes equations system:  (1)  |       ∇   ̲   · ( 2 η     D   ̲     ̲   (     v   ̲     S   ) ) −   ∇   ̲     p   S   = 0       ∇   ̲   ·     v   ̲     S   = 0       where η is the fluid dynamic viscosity,     v   S     ̲   the fluid velocity, p the fluid pressure and     D   ̲     ̲   (   v   ̲   ) =   1   2   (     ∇   ̲     ̲     v   ̲   +       ∇   T     ̲     ̲     v   ̲   ) the Eulerian strain rate associated with the velocity field   v   ̲   . The porous medium area   Ω   D   is governed by the Darcy equations system:  (2)  |         v   ̲     D   =    1   η        K   ̲     ̲   ( −   ∇   ̲     p   D   + ρ   g   ̲   )       ∇   ̲   ·     v   ̲     D   = 0       where     v   ̲     D   is the Darcy velocity or the macroscopic mean velocity of the fluid with respect to the preforms, p the pore pressure,     K   ̲     ̲   the permeability tensor assumed diagonal in the element frame, η the fluid viscosity and ρ the volumetric mass of the fluid. The two domains are separated by an interface Γ =   Ω   S   ∩   Ω   D   through both mass conservation and normal stress continuity must be fulfilled (see Fig. 1). In addition, it is chosen to control the tangential velocity jump with a drag coefficient α leading to the Beavers–Joseph–Saffman [20] condition. Since Darcy׳s law assumptions imply that shear is neglected (       σ   ̲     ̲     D   = −   p   D       I   ̲     ̲   ), the normal stress continuity is equivalent to a Dirichlet boundary condition on the hydrostatic pressure when using the primal formulation of Darcy system (5), leading to the following system of conditions on Γ :  (3)  |         v   ̲     S   ·   n   ̲   =     v   ̲     D   ·   n   ̲       2    n   ̲   ·     D   ̲     ̲   (     v   ̲     S   ) ·     τ   i     ̲   =    − α       K   ii        (     v   ̲     S   −     v   ̲     D   ) ·     τ   i     ̲         p   D   =   p   S         where   n   ̲   =     n   ̲     S   = −     n   ̲     D   is the outward normal vector of Stokes/Darcy interface, τ  i refers to the unit tangential vectors to the interface and K  ii are the corresponding permeabilities.  Numerically, there are several ways to formulate the coupled problem. Indeed, the form of the Darcy problem allows us to separately solve for pressure and velocity fields [17]. Those methods consist in finding the pressure field and then post-treating the velocity with Darcy׳s law. However, those approaches imply velocity discontinuities if permeability changes within the domain, leading to mass conservation issues. This is even more drastic for Stokes/Darcy coupling where velocities may strongly differ in the vicinity of the Stokes/Darcy interface proportionally to the permeability jump. As for the Stokes equations, they are ideally solved using a mixed velocity/pressure formulation to ensure mass conservation. For those reasons, a mixed velocity/pressure formulation is chosen for both Stokes and Darcy problems. These formulations can take two different forms in which velocity and pressure boundary conditions appear as Dirichlet or Neumann conditions. A convenient choice for our approach is the dual mixed formulation for Stokes and primal mixed formulation for Darcy [2,3] presented below.  The dual mixed velocity/pressure formulation of Stokes equation writes as follows:  (4)  |     Find  (   v   ̲   , p ) ∈   E     v   ̲     ×   L   2   (   Ω   S   )  |  ∀ ( δ   v   ̲   , δ p ) ∈   E   δ   v   ̲     ×   L   2   (   Ω   S   ) ,        ∫      Ω   S     2 η     D   ̲     ̲   ( δ   v   ̲   ) :     D   ̲     ̲   (   v   ̲   )  dv −    ∫      Ω   S     p   ∇   ̲   · δ   v   ̲    dv =        ∫    ∂   Ω   S , t     2 η δ   v   ̲   ·     D   ̲     ̲   ( δ   v   ̲   ) ·   n   ̲    ds −    ∫    ∂   Ω   S , t     p δ   v   ̲   ·   n   ̲    ds   ︸        ∫    ∂   Ω   S , t     δ   v   ̲   ·     σ   ̲     ̲   ·   n   ̲    ds          ∫      Ω   S     δ p   ∇   ̲   ·   v   ̲    dv = 0       E   δ   v   ̲     = {  δ   v   ̲   ∈   H   1   (   Ω   S   ) | δ   v   ̲   =   0   ̲    on  ∂   Ω   S ,   v   ̲      }       E     v   ̲     = {    v   ̲   ∈   H   1   (   Ω   S   ) |   v   ̲   =     v   ̲     d    on  ∂   Ω   S ,   v   ̲      }       where ∂   Ω   S , t   is a boundary of the Stokes domain submitted to normal stress   t   ̲   =     σ   ̲     ̲     n   ̲   and ∂   Ω   S ,   v   ̲     is the complementary boundary submitted to a prescribed velocity     v   ̲     d   .  The primal mixed velocity/pressure formulation of Darcy equation writes as follows:  (5)  |     Find  (   v   ̲   , p ) ∈   L   2   (   Ω   D   ) ×   E   p    |  ∀ ( δ   v   ̲   , δ p ) ∈   L   2   (   Ω   D   ) ×   E   δ p   ,        ∫      Ω   D     δ   v   ̲      η       K   ̲     ̲        v   ̲    dv +    ∫      Ω   D     δ   v   ̲     ∇   ̲   p  dv =    ∫      Ω   D     δ   v   ̲   ρ   g   ̲    dv        ∫      Ω   D       v   ̲     ∇   ̲   δ p  dv =    ∫    ∂   Ω   D , v     δ p   v   ̲     n   ̲    ds       E   δ p   = {  δ p ∈   H   1   (   Ω   D   )  |  δ p = 0  on  ∂   Ω   D , p    }       E   p   = {  p ∈   H   1   (   Ω   D   )  |  p =   p   d    on  ∂   Ω   D , p    }       where ∂   Ω   D , p   is a boundary of Darcy domain submitted to an imposed pressure p  d and ∂   Ω   D ,   v   ̲     is the complementary boundary submitted to a prescribed normal velocity     v   ̲     n   d   =   v   ̲   ·   n   ̲   .  When discretizing those formulations with a velocity-based finite element method, stability problems appear due to the fluid incompressibility. In order to avoid non-physical pressure modes due to this instability, one must consider to choose elements that fulfill the Brezzi–Babuska condition [21]. A good way to respect this condition is to ensure that the degree of approximation for the velocity field is larger than the pressure one [22]. In the literature two families of elements can be found. The first one is the Taylor–Hoods elements type (P2/P1 or P1/P0) [23,24]. The second type corresponds to standard finite element formulations stabilized with the so-called multi-scale stabilization method that consists in formulating the problem on a coarse scale (nodes) and a fine scale (center of the element), the fine scale being possibly condensed in a stabilization term. Among those approaches one can find the Hughes variational multi-scale (HVM) method [7,8] and the mini-element [2,3,25]. In the present work, the mini-element is selected for its robustness and simplicity of implementation. Indeed, it is based on the same degree of interpolation for both pressure and velocity and there is no constant to introduce and to calibrate in the stabilization term contrary to HVM [8] or ASGS methods [26,27].  In what follows, is described the practice of the stabilization for the dual mixed formulation of Stokes problem, the same procedure is applied to stabilize the primal mixed Darcy formulation. The mini-element stabilization method stands on the enrichment of the velocity field approximation by the introduction of an extra node in the center of the element (see Fig. 2 ). Since the velocity field degree of interpolation is higher than the pressure one, the Brezzi–Babuska condition is fulfilled avoiding pressure parasitic modes [21].  Let us introduce the superscript h to distinguish the approximated fields from the exact ones. The extra velocity degree of freedom leads to the following decomposition for the velocity approximation (     v   ̲     h   (   x   ̲   ) ) and the corresponding weighting function ( δ     v   ̲     h   (   x   ̲   ) ), taken in the functional spaces described in Eq. (8):  (6)      v   ̲     h   (   x   ̲   ) =     v   ̲     l   h   (   x   ̲   ) +     v   ̲     b   h   (   x   ̲   ) =   ∑   i = 1     n   e     [   N   i   (   x   ̲   ) ] {      v   ̲       l   i     h    } + [    b   e   (   x   ̲   )  ] {      v   ̲     b   h    } δ     v   ̲     h   (   x   ̲   ) = δ     v   ̲     l   h   (   x   ̲   ) + δ     v   ̲     b   h   (   x   ̲   ) =   ∑   i = 1     n   e     [    N   i   (   x   ̲   )  ] {  δ     v   ̲       l   i     h    } + [    b   e   (   x   ̲   )  ] {  δ     v   ̲     b   h    }   where   N   i   (   x   ̲   ) are the shape functions of the element equal to 1 at node i and 0 at the other nodes, n  e is the number of nodes in the element and b  e is the bubble shape function that vanishes on the edge of the element (see Fig. 2). The following decomposition for the pressure approximation (   p   h   (   x   ̲   ) ) and the corresponding weighting function ( δ   p   h   (   x   ̲   ) ) is proposed (functional spaces are described in Eq. (8)):  (7)    p   h   (   x   ̲   ) =   ∑   i = 1     n   e       N   i   (   x   ̲   )   p   i   h   δ   p   h   (   x   ̲   ) =   ∑   i = 1     n   e       N   i   (   x   ̲   ) δ   p   i   h     Introducing the previous discretization in system (4), the weak form of the Stokes problem writes as follows:  (8)  |     Find  (      v   ̲     l   h   ,     v   ̲     b   h   ,   p   h    ) ∈   E       v   ̲     l   h     ×   E       v   ̲     b   h     ×   L   2   (    Ω   S    )  |  ∀ (  δ     v   ̲     l   h   , δ     v   ̲     b   h   , δ   p   h    ) ∈   E   δ     v   ̲     l   h     ×   E   δ     v   ̲     b   h     ×   L   2   (    Ω   S    ) ,        ∫    Ω   2 η     D   ̲     ̲   (  δ     v   ̲     l   h    ) :     D   ̲     ̲   (      v   ̲     l   h   +     v   ̲     b   h    )  dv −    ∫    Ω     p   h      ∇   ̲   · δ     v   ̲     l   h    dv =    ∫    ∂   Ω   t     δ     v   ̲     l   h   ·     σ   ̲     ̲   ·   n   ̲    ds        ∫    Ω   2 η     D   ̲     ̲   (  δ     v   ̲     b   h    ) :     D   ̲     ̲   (      v   ̲     l   h   +     v   ̲     b   h    )  dv −    ∫    Ω     p   h     ∇   ̲   · δ     v   ̲     b   h    dv = 0        ∫    Ω   δ   p   h     ∇   ̲   ·     v   ̲     l   h    dv +    ∫    Ω   δ   p   h     ∇   ̲   ·     v   ̲     b   h    dv = 0       E   δ     v   ̲     l   h     = {  δ     v   ̲     l   h   ∈   H   1   (    Ω   S    )  |  δ     v   ̲     l   h   =   0   ̲    on  ∂   Ω   S ,     v   ̲     l   h      }       E       v   ̲     l   h     = {      v   ̲     l   h   ∈   H   1   (    Ω   S    )  |      v   ̲     l   h   =     v   ̲     l   hd    on  ∂   Ω   S ,     v   ̲     l   h      }       E   δ     v   ̲     b   h     =   E       v   ̲     b   h     = {      v   ̲     b   h   ∈   H   1   (    Ω   S    )  |      v   ̲     b   h   =   0   ̲    on  ∂   Ω   S ,     v   ̲     b   h      }       After few mathematical steps described in [21], the discrete stabilized Stokes system can be written under the following form:  (9)  [     [    K   ll    ]     [   K   lp   ]   T       [    K   pl    ]   [    C   pp    ]     ] {     {      v   ̲     l    }     {  p  }     } = {       F   ̲         0   ̲       }   where [    C   pp    ] = − [    K   pb    ]   [   K   bb   ]   − 1     [   K   bp   ]   T   is the stabilization term. Finally, one can summarize the method to the introduction of a stabilization term [    C   pp    ] inversely proportional to the viscosity η that relaxes the fluid incompressibility constrain. In the same way, one can stabilize the Darcy formulation with a term proportional to     K   ̲     ̲   / η  [2,3].  This stabilization method has been validated on test cases in [2,3] for hierarchical bubble functions (P1+, see Fig. 2) and its good rate of convergence verified with the method of the manufactured exact solution (MMES) proposed in [28]. In Section 3, are presented an analytical validation of the coupled problem and an illustration of the MMES validation.  The solution selected for coupling Stokes and Darcy flows consists in dealing with two sub-meshes, respectively for Stokes and Darcy domains, non-necessarily structured but matching at the interface. The flows are solved individually, in an iterative scheme, until equilibrium is reached at their interface. Practically, normal velocity taken from Darcy׳s domain,     v   ̲     D   ·   n   ̲   , is imposed by a penalty method into Stokes equations through a Dirichlet boundary condition in velocity, and the hydrostatic pressure taken in the Stokes׳ domain, p  S , is prescribed into Darcy equations as a Dirichlet boundary condition in pressure (see points 2 and 3 in Fig. 12). Convergence is reached when both pressure and velocity corrections tend toward zero, lower than a given admissible bound.  Numerically, the coupling methods introduced imply to pay attention in the construction of the global system to be solved, let us say [ κ ] { u } = { F } . First of all, the kinematic boundary conditions (tangential and normal velocity) prescribed by penalty method lead to the following system for a general interface defined by its normal components (   n   ̲   =   n   x   ·   x   ̲   +   n   y   ·   y   ̲   +   n   z   ·   z   ̲   ) :  (10)  (     ⋯   ⋯   ⋯   ⋯   ⋯     ⋯   A   B   C   ⋯     ⋯   D +   Qn   x     E +   Qn   y     F +   Qn   z     ⋯     ⋯   G   H   I   ⋯     ⋯   ⋯   ⋯   ⋯   ⋯     )   {     ⋮       v   x   i         v   y   i         v   z   i       ⋮     }   global   = {     ⋮     L     M + Q     v   ̲     D   ·   n   ̲       N     ⋮     }   where Q is a penalty coefficient usually taken as   10   8 − 12   max (   κ   ij   ) . However, on one hand high values of Q ensure that the condition is well fulfilled, while on the other hand they will lead to an ill conditioned system due to extra out-of diagonal terms for which iterative solvers poorly behave. To ensure a good conditioning, the Dirichlet conditions can be prescribed by penalty but in a local reference system attached to the nodes where normals to the frontier (or the interface) have to be considered as one of the axes of this local reference system (see Fig. 3 ). In practice, the velocity degrees of freedom are locally rotated. For an interface of normal   n   ̲   =   n   x     x   ̲   +   n   y     y   ̲   the system at the elementary level will become  (11)    [     [ I ]   [ 0 ]     [ 0 ]   [ R ]     ]   T   [    κ   e    ] [     [ I ]   [ 0 ]     [ 0 ]   [ R ]     ] {     {    V   g    }     {    V   l    }     } =   [     [ I ]   [ 0 ]     [ 0 ]   [ R ]     ]   T   {   f   e   }   where [ R ] is the rotation matrix from the global to the local reference system, {   V   g   } is the unknown nodal velocity vector expressed in the global reference system and {   V   l   } is the unknown nodal velocity vector expressed in the local reference system. The local problem thus writes now in a dominant-diagonal form  (12)  (     ⋯   ⋯   ⋯   ⋯   ⋯     ⋯     An   y   −   Bn   x       An   x   +   Bn   y     C   ⋯     ⋯     Dn   y   −   En   x       Dn   x   +   En   y   + Q   F   ⋯     ⋯     Gn   y   −   Hn   x       Gn   x   +   Hn   y     I   ⋯     ⋯   ⋯   ⋯   ⋯   ⋯     )   {     ⋮       v   x   i         v   y   i         v   z   i       ⋮     }   local   = {     ⋮     L     M + Q     v   ̲     D   ·   n   ̲       N     ⋮     }   After solving the system, the velocity needs to be post-treated to be expressed in the global reference system. It must be noted that due to the relatively small permeabilities considered in this study, the Darcy velocity to impose as Dirichlet boundary conditions in Stokes formulation is small. So in order to penalize properly the system, the penalty coefficient Q should be chosen regarding permeability to ensure M ≪ Q     v   ̲     D   ·   n   ̲   . It was verified for permeabilities down to   10   − 15      m   2   that Q =   10   5   / K for K <   10   − 6      m   2   leads to satisfactory results [27,28].  Secondly, an important issue concerns the use of the mini-element P1+/P1. Indeed, as shown in Section 2.1, the stabilization method relies on the relaxation of the fluid incompressibility constrain equivalent to  (13)    ∇   ̲   ·   v   ̲   + β p = 0   with β the stabilization term proportional to 1 / η for Stokes and to     K   ̲     ̲   / η for Darcy. When considering a regular Stokes flow β is sized by the viscosity (η) and remains sufficiently low to consider β p negligible, ensuring the fluid incompressibility (   ∇   ̲   ·   v   ̲   ≈ 0 ). However when this Stokes׳ flow is coupled to a porous flow with low permeability, the Darcian normal velocity to be imposed into the Stokes formulation can be extremely low, down to   10   − 13    m    s   − 1   , implying small velocities over the whole domain. In such a case, typical in composite process simulation, the stabilization term β p may not be negligible at all, leading to a non-zero velocity divergence in Stokes domain. The incompressibility constrain cannot be enforced anymore. To ensure an acceptable value of the velocity divergence, it may be necessary to introduce an artificial viscosity in the computation of the stabilization term β in Eq. (13) or [    C   pp    ] in the global system (9). It has been found that an artificial viscosity equal to 10 times the real one guarantees good results down to permeability values of   10   − 15      m   2   . This is another improvement proposed in this paper, since it allows us to deal with real severe physical applications as shown in validation cases and in the final example of Section 7.  In order to demonstrate the benefit of the artificial viscosity a comparison was made on a simple test case. This test case is described in Fig. 4 and consists of a flow perpendicular to the Stokes/Darcy interface. Given the boundary conditions, this case has a simple analytic solution   v   ̲   = − 1.76 ×   10   6     K   yy   . Fig. 5 shows the ratio of simulated velocity magnitude over analytical velocity magnitude without and with artificial viscosity for different permeability values.  To validate the Stokes/Darcy coupling, we investigate the test case of a flow parallel to the interface in a steady state, presented in Fig. 6 . Let us consider a porous medium of permeability K =   10   − 15      m   2   and dimensions   H   D   = 2  m and L=5m crossed by a fluid of viscosity η=1Pas submitted to a pressure differential of   p   1   −   p   0   = 10  Pa in contact with a pure fluid layer of thickness   H   S   = 1  m and submitted to the same pressure differential. The remaining boundaries are considered as impervious walls   v   ̲   ·   n   ̲   = 0 . This test case has an analytical solution [7]:  (14)  |       v   x   = −    K   2 η    (       λ   2   + 2 α λ   1 + α λ     )    dP   dx    (  1 +    α     K   y     ) +    1   2 η    (    y   2   + 2 α y   K    )    dP   dx      for  0 ≤ y ≤   H   S         v   x   = −    K   η    (       p   1   −   p   0     L     )   for  y < 0       v   y   = 0   for  any  y       with λ =   H   S   /   K   , dP / dx = (   p   1   −   p   0   ) / L and α being the drag coefficient.   Fig. 7 shows the results obtained for four values of α, the coefficient controlling the tangential velocity on the Stokes/Darcy interface (Eq. (3)). It confirms the good implementations of the coupling methods. One can verify the effect of this coefficient leading to Poiseuille׳s flow in the extreme case (α large). Finally, one can remark that α should be chosen regarding permeability, in the present case we chose α = 0 , α =   K   , α =   10   2     K   and α =   10   4     K   . In Fig. 8 , the pressure and velocity fields computed for α = 0 , corresponding to Fig. 7(a) case, are presented.  The numerical simulations were performed over a mesh of 3094 triangles made up of two non-necessarily structured meshes matching at the interface. The convergence, corresponding to Stokes/Darcy equilibration, was reached (for the four cases) in three iterations with a relative error between the two last iterations of the order of 10−9.  The proper implementation of the coupling algorithm was verified with the method of the manufactured exact solutions (MMESs) [1]. This method consists in building an analytical solution, that is then introduced into the analytical system of PDE to be solved, to deduce the corresponding source term. Finally, the finite element problem is loaded with this source term, and solved for the discrete solution that can be compared with the exact analytical one, to assess the accuracy.  Let us consider a domain Ω = ( 0 , 1 ) × ( 0 , 2 )    m   2   divided into two subdomains   Ω   S   = ( 0 , 1 ) × ( 1 , 2 )    m   2   governed by the Stokes׳ equation and   Ω   D   = ( 0 , 1 ) × ( 0 , 1 )    m   2   governed by Darcy׳s law in contact along the interface Γ =   Ω   S   ∩   Ω   D   . The pressure and velocity fields proposed by Discacciati in [6] are considered:  (15)  |         v   ̲     S   ·   x   ̲   = − cos ( π / 2 y ) sin ( π / 2 x )         v   ̲     S   ·   y   ̲   = cos ( π / 2 x ) sin ( π / 2 y ) − 1 + x       p   s   = 1 − x          (16)  |         v   ̲     D   ·   x   ̲   = sin ( π / 2 x ) cos ( π / 2 y ) + y         v   ̲     D   ·   y   ̲   = cos ( π / 2 x ) sin ( π / 2 y ) + x − 1       p   d   = 2 / π  cos ( π / 2 x ) cos ( π / 2 y ) − y (  x − 1  )          Let us consider regular meshes constructed with squares of size h × h split into two triangles. Each computation was made over a more refined mesh (h is divided by 2) than the previous one starting with h=0.1 down to h=0.0125. For the sake of simplicity we chose η=1Pas and K=1m2 as proposed in [6]. Fig. 9 shows isovalues of the numerical solution for pressure and for velocity, for h=0.0125.  For every mesh and each numerical solution v  h and p  h , the errors are calculated using the L 2 norm:  (17)  ∥ u   ∥   0 , Ω   =   (    ∫   Ω     u   2    d Ω  )   1 / 2     and H 1 norm:  (18)  ∥ u   ∥   1 , Ω   =   (  ∥ u   ∥   0 , Ω   2   +   ∑   j = 1   d     ∥    ∂ u   ∂   x   j      ∥   0 , Ω   2    )   1 / 2        Errors thus calculated permit to compare the numerical rates of convergence to the theoretical ones. Stokes rate of convergence should verify [29]:  (19)  ∥   v   ̲   −     v   h     ̲     ∥   1 ,   Ω   S     + ∥ p −   p   h     ∥   0 ,   Ω   S     ≤   C   1   h ( ∥   v   ̲     ∥   2 ,   Ω   S     + ∥ p   ∥   1 ,   Ω   S     )   and Darcy rate of convergence should verify [29]:  (20)  ∥   v   ̲   −     v   h     ̲     ∥   1 ,   Ω   D     + ∥ p −   p   h     ∥   0 ,   Ω   D     ≤   C   2   h ( ∥   v   ̲     ∥   2 ,   Ω   D     + ∥ p   ∥   1 ,   Ω   D     )   where C 1 and C 2 are some constants. Convergence of the solution was studied and computed errors for pressure and velocity for the different mesh sizes are presented in Tables 1 and 2  for Stokes and Darcy domain respectively. Fig. 10 shows that pressure and velocity converge respectively with rates of 1.8 and 2.2 in Stokes domain and with rates of 2 and 1.4 in Darcy domain. These results correspond to the theoretical and numerical convergence rates determined in [29] with Eqs. (19) and (20).  Finally, the good convergence rates and the good agreement with analytical results allow us to validate the implementation of the coupling algorithm and to confirm its robustness.  The solid mechanics problem is non-linear on two counts, first due to the non-linear response of the porous medium and second due to the finite deformations. An updated Lagrangian formulation in displacement is adopted here [2,3] which writes          where     S   ̲     ̲   is the second Piola–Kirchoff stress tensor,     δ E   ̲     ̲   is the virtual Green–Lagrange tensor,     f   ̲     s   are the contact forces acting on the solid surface and   δ u   ̲   is the virtual displacement field. This formulation relies on a Newton–Raphson scheme to deal with those non-linearities. Actually, the hyper-elastic orthotropic constitutive relationship is solved in a local reference system for each element to take into account the material orientations. The procedure consists of a first elastic prediction:  (22)  [    M   T   (  { 0 }  )  ] {    u   0    } = {  R  }   where [   M   T   ( { 0 } ) ] is the initial tangent matrix computed with the stiffness taken at the origin of the constitutive law and {   u   0   } is the unknown displacement at the prediction iteration. Then convergence is checked with the relative residual as follows:  (23)    ∥  [    M   S   (  {   u   i − 1   }  )  ] {    u   i − 1    } − {  R  }  ∥   ∥  {  R  }  ∥   ≤ r  for  i ≥ 1   where [    M   S   (  {   u   i − 1   }  )  ] is the current secant matrix computed from the constitutive response, {    u   i − 1    } the displacement at previous iteration and r the target component residual value. If convergence is not reached, a correction increment is computed:  (24)  |     [    M   T   (  {    u   i − 1    }  )  ] {  Δ   u   i    } = [    M   S   (  {   u   i − 1   }  )  ] {    u   i − 1    } − {  R  }     {    u   i    } = {    u   i − 1    } + {  Δ   u   i    }       where {  Δ   u   i    } is the correction increment at iteration i, {    u   i    } is the displacement at iteration i. This procedure is encapsulated in the block 1 and 4 of the global algorithm (see Fig. 12) used to solve the entire fluid–solid problem.  In addition, the porous medium is represented by an equivalent homogeneous medium composed of rigid fibers, so that each macroscopic strain is reflected by fiber rearrangements at the microscopic scale (see Fig. 11 ). Therefore the porosity can be directly computed from the mechanical rate of deformations.  Indeed, mass conservation of the homogeneous porous medium writes as follows:  (25)    D   Dt   (  m (  Ω  )  ) =   D   Dt      ∫      Ω   t     ρ  dv = 0   where D / Dt is the particular derivative with respect to time and ρ is the density of the porous medium. This porous medium is actually a biphasic medium constituted of fibers and fluid. Using the mixture low and noting that there is no mass transfer between the fluid and the fibers Eq. (25) leads to  (26)  |        D   Dt       ∫      Ω   t       ρ   s   (  1 − ϕ  )  dv = 0        D   Dt       ∫      Ω   t       ρ   r   ϕ  dv = 0       with ρ  s being the fiber density, ρ  r the fluid density and ϕ the porosity or fluid fraction corresponding to micro- and macro-voids in Fig. 11, i.e., ϕ = 1 −   V   f   with V  f being the fiber fraction. The first equation of system (26) is actually the mass conservation of the solid phase, i.e., the fibers. This equation will be used to update the porosity (ϕ) from the displacement field. Using a Lagrangian approach, this equation can be written in the reference configuration as follows:  (27)    D   Dt      ∫      Ω   ref       ρ   s   (  1 − ϕ  ) J    dV   ref   = 0   where J denotes the Jacobian of the transformation between the reference configuration Ω  ref and the current configuration Ω  t and dV  ref is the elementary volume defined on Ω  ref . Since, the mechanical problem is also treated with a Lagrangian approach, the reference domain is the domain of the material particles, so, the convective velocity is zero. In addition, we can note that dV  ref is constant over time. So Eq. (27) becomes  (28)     ∫      Ω   ref       ∂   ∂ t   (    ρ   s   (  1 − ϕ  ) J  )    dV   ref   = 0   Furthermore, we consider that the fibers are incompressible, so  (29)    ∂   ρ   s     ∂ t   = 0   leading to  (30)     ∫      Ω   ref       ∂   ∂ t   (  (  1 − ϕ  ) J  )    dV   ref   = 0   Finally, Eq. (30) means that the product ( 1 − ϕ ) J is constant over time, so it can be reduced to the following relation:  (31)  J (    x   ̲   , t + Δ t  ) (  1 − ϕ (    x   ̲   , t + Δ t  )  ) = J (    x   ̲   , t  ) (  1 − ϕ (    x   ̲   , t  )  )   where J is the Jacobian of the transformation,   x   ̲   the position vector and ϕ the porosity of the porous medium, i.e., ϕ = 1 −   V   f   with V  f being the fiber volume fraction. This approach proposed by Celle et al. in [2,3] and also used later in [19] does not restrict the analysis to one dimension, as it is usually the case in the literature when using semi-empirical laws expressing porosity or thickness variation as a function of pressure [14–16]. Moreover, it allows us to use any constitutive law for the porous medium (elastic or hyper-elastic and isotropic or orthotropic). This is one of the major feature of the presented global approach, opening new prospects in terms of industrial outcomes.  This formulation has been validated on analytical test cases and by comparison with the commercial solver Abaqus [2,3]. In the present paper, we focus on the fluid/structure validation (see Section 5.1).  The fluid/structure strong coupling is treated iteratively in a quasi-static context (see Fig. 12 ). Indeed, the Stokes/Darcy coupled problem (see points 2 and 3 in Fig. 12) is solved on a fixed grid (i.e. rigid porous medium), the fluid influence on the porous medium being taken into account through pore (interstitial) pressure by Terzaghi׳s law [10]:  (32)        σ   tot     ̲     ̲   (     ϵ   ̲     ̲   ) =       σ   eff     ̲     ̲   (     ϵ   ̲     ̲   ) + Sp     I   ̲     ̲     where       σ   tot     ̲     ̲   is the overall stress applied to the system,       σ   eff     ̲     ̲   is the effective stress in the fibers,     I   ̲     ̲   is the unity tensor, p is the hydrostatic pressure and S is the saturation factor of the pore. Let us notice that the updated Lagrangian scheme adopted for the solid mechanics problem permits us to use the quasi-Eulerian stress field to compute the corresponding Terzaghi stress tensor [2,3]. The non-linear finite strain mechanical problem (see point 4 in Fig. 12) is then solved considering a given pore pressure (i.e. for a Terzaghi equivalent behavior) acting as an internal load. Then, the deformation is reflected by the porosity variation modifying the permeability     K   ̲     ̲   of the medium. The permeability can be computed with any porosity dependent measurement or model. Here, for the example, the Carman–Kozeny׳s law [30] can be considered:  (33)      K   ̲     ̲   =     d   f   2     16     h   ̲     k         ϕ   3       ( 1 − ϕ )   2       where d  f is the fiber diameter,     h   ̲     k   the Kozeny constant and ϕ the porosity. Finally, convergence is verified by a relative error computation on both fluid velocity and pressure fields of fluid, and solid displacement between two iterations.  Using an analytical approach based on Airy׳s functions (see Appendix A), it is possible to build a test case for Terzaghi׳s principle which has an analytical solution in the case of linear elastic preforms. The test case represents the compaction of a porous medium submitted simultaneously to an internal loading due to the pressure of the fluid present in the pores (see Fig. 22) [2,3] and an external loading acting on the upper side.  We consider an isotropic material of Young׳s modulus E=266kPa and Poisson׳s ratio ν = 0.3 . The plate is submitted to an external load   P   imp   =   10   4    Pa , a linear internal load   P   int   ( y ) = − 5 ×   10   5   y +   10   4    Pa . Dimensions of the domain are H = 2 ×   10   − 2    m and L = 4 ×   10   2    m . The analytical solution is  (34)  |       u   x   ( x , y ) =    1 + ν   E    [  (  1 − 2 ν  ) ( ay + b ) x + ν Gx  ]       u   y   ( x , y ) =    1 + ν   E    [  (  1 − 2 ν  ) (     a   2    y + b  ) y + ( ν − 1 ) Gy −    1 − 2 ν   2      ax   2    ]       where G = aH + b +   P   imp   , a = − 5 ×   10   5   and b =   10   4   .   Fig. 13 shows the perfect agreement between analytical and numerical results.  There are several methods for tracking the flow front, such that the level-set method and the FE-CV method [31]. As part of this work, we did not study these methods but have used the filling algorithm already present in PAM-RTM™ [32,33]. This algorithm is based on a division of the transient regime in a series of quasi-static states. New elements filled between two time steps are determined from the flow rate calculated at the last known time step. A filling factor varying from 0 to 1 is associated with each element. In the case of flow in deformable porous medium, porosity changes over time. Because the time increment is determined before the calculation, it is necessary to correct it so that the total amount of resin present in the system corresponds to the volume of saturated pore. The following correction is proposed:  (35)  Δ t = Δ   t   algo       V   t + Δ t       V   t       where Δ t is the corrected time increment, Δ   t   algo   is the time increment given by the filling algorithm,   V   t   is the volume of resin that would have been injected in the system during the time step with no deformation and   V   t + Δ t   is the actual injected volume of resin during the time step.  In order to demonstrate the ability of the approach to handle industrial cases, the complete infusion simulation of a “T” stiffened panel is presented. The geometry, proposed by Daher-Socata within the INFUCOMP project, consists of the assembly of a 380 × 280 × 3    mm   3   plate and a “T” stiffener which is made of a two 3mm thick “L” preforms as described in Fig. 14 .  Infusion condition is presented in Fig. 15 . One distribution medium is located between the panel and the mould and a second one is placed on the top of the “T” under the vacuum bag. Resin inlet is located in the center of the plate under the mould while the vent is in the center of the second distribution medium on the top of the “T”.  Preforms are made of 48,302 woven fabric from Hexcel Reinforcements constituted of T700 12k carbon fibers. Orthotropic permeability measured by Hexcel Reinforcements is  (36)  |       K   p   = 9.76 ×   10   − 12      m   2     in  the  plane  of  the  fabrics       K   t   = 6.75 ×   10   − 13   exp ( − 9.8   V   f   )    m   2     in  the  transverse  direction       where V  f is the fiber volume fraction. The resin used for this infusion is the RTM6, epoxy from Hexcel whose viscosity is 0.033Pas at 120°C.  Due to the symmetry of the problem, we simulate only one-quarter of the geometry as described in Fig. 17(a). The mesh used is composed of 8100 tetrahedrons and 1884 nodes. The distribution medium at the bottom of the preform is represented by a pure resin flow (Stokes area) and is 1mm thick. It is considered as non-deformable. The preform is considered as an equivalent porous homogeneous medium (Darcy area), whose constitutive law has not been studied. However, for the example, we will assume that it obeys to the same behavior as fabric G1157 (UD plain) from Hexcel Reinforcement that has been extensively studied in [34–36]. The constitutive law is presented in Fig. 16 . The behavior of a stack of UD, not preformed (G1157 tested by P. Wang), is much more flexible than a preform held in shape by an epoxy powder (industrial preforms), so deformations presented in the results are larger than the ones usually observed. Injection is represented by a pressure boundary condition of 1bar and the vent by a pressure boundary condition of 0bar. Finally, the other boundary conditions are impervious walls (   v   ̲   ·   n   ̲   = 0 ). The boundary conditions are summarized in Fig. 17 (b) and (c).   Figs. 18 and 19  show the filling ratio at times t=63s, t=273s and t=550s. The results reflect a fast filling of distribution medium (1s), then a transverse infusion of the plate. When the resin starts to infuse the plate, beginning of the swelling can be identified (see Fig. 20 ). After about one minute, the plate is completely filled, the pressure is balanced in its extremities and the preform swells back to its initial thickness (see Fig. 19 at t=69s). Then, the resin begins to migrate in the base of the “T”, first in the transverse direction, and then, when it reaches the curvature, in the plane of the plies (see Fig. 18 at t=273s). Finally, resin finishes impregnating the upper part of the “T” and the filling ends after 550s.   Fig. 20 shows the variation of the thickness during the infusion. It may be noted that the areas of the part that have been impregnated in the in-plane direction (curvature and upper part of the T) present a linear swelling along time, while the plate and the base of the T, which have been impregnated transversely, have three distinct phases. Indeed, one can observe a first phase of filling with a small swelling. Then, when resin reaches the vacuum bag (top of the plate), a sharp increase of thickness occurs. Finally, the preform continues to swell linearly during the end of the infusion.   CONCLUSION   An innovative and robust iterative method to fully couple Stokes, Darcy and solid mechanics has been presented, applied here to composite process simulation. Based on the previous work by Celle et al., the model has been extended to three dimensional cases and new coupling conditions have been introduced to improve the global performance, stability and robustness of the code. All the numerical methods have been detailed and validated with analytical approaches and the convergence of the fully coupled Stokes/Darcy formulation was checked with the method of manufactured exact solutions. Finally, a numerical example in 3D on a complex shape showed the capability of the tool to simulate industrial cases.  Concerning forthcoming developments, a full experimental validation is currently conducted with industrial partners in the frame of a FP7 funded project and a transient formulation is studied for the simulation of three-dimensional dynamic consolidation of the porous medium. Moreover, to fully meet industrial needs, thermo-chemical couplings must be introduced allowing us to simulate non-isothermal transient processes and an elasto-plastic behavior for the fabric that may be more realistic with respect to compaction experiments.   ACKNOWLEDGMENT   The authors would like to thank the support of the European Union in the INFUCOMP project (European Community׳s Seventh Framework Program FP7/2009-2013 under Grant agreement no. 233926) financing partially these researches.  Neglecting the inertial forces, the momentum conservation equation can be written as follows:  (A.1)      ∇   ̲   ·   ̲       σ   ̲     ̲   +     f   v     ̲   =   0   ̲        Let us admit that volume forces derive from a potential V as follows:  (A.2)    f   v   = {       f   x         f   y       } =   grad   ̲    V ( x , y )   leading to the following form of the momentum equation:  (A.3)  |        ∂ (    σ   xx   + V  )   ∂ x    +      σ   xy     ∂ y    = 0          σ   xy     ∂ x    +    ∂ (    σ   yy   + V  )   ∂ y    = 0          To determine the stress field, we need to find a scalar biharmonic function ϕ ( x , y ) (known as the Airy function) which satisfies  (A.4)    ∇   4   ϕ ≡     ∂   4   ϕ   ∂   x   4     + 2     ∂   4   ϕ   ∂   x   2   ∂   y   2     +     ∂   4   ϕ   ∂   y   4     = C (  ν  ) (    ∂   f   x     ∂ x   +   ∂   f   y     ∂ y    )   with   C ( ν ) = {        1 − ν   1 − 2 ν      ( plane  strains )        1   1 − ν      ( plane  stresses )       the ϕ function needs also to satisfy the stress boundary conditions on the frontiers of the domain:  (A.5)      ∂   2   ϕ   ∂   y   2       n   x   −     ∂   2   ϕ   ∂ x ∂ y     n   y   =   t   x       ∂   2   ϕ   ∂   x   2       n   x   −     ∂   2   ϕ   ∂ y ∂ x     n   x   =   t   y        In a 2D case, the plane strains stress field is given by the following relations:  (A.6)    σ   xx   =     ∂   2   ϕ   ∂   y   2     − V   σ   yy   =     ∂   2   ϕ   ∂   x   2     − V   σ   xy   =   σ   yx   = −     ∂   2   ϕ   ∂ x ∂ y     σ   zz   = ν (    σ   xx   +   σ   yy    )   σ   xz   =   σ   yz   = 0      Knowing the stress field, we can compute the strain field with Hooke׳s law. To evaluate the displacements the relation   ϵ   ij   =   1   2   (   u   i , j   +   u   j , i   ) is used. Let us consider a point x 0 in the solid, where displacement and rotation are equal to zero. We can compute the displacement of any point in the solid by integrating the strains along the most proper way (see Fig. 21 ):  (A.7)    u   i   (  x  ) =    ∫      x   0     x     U   ij   ( x , ξ )  d   ξ   j     with  (A.8)    U   ij   (  x , ξ  ) = ε (  ξ  ) + (    x   k   −   ξ   k    ) [    ∂   ε   ij   (  ξ  )   ∂   ξ   k     −   ∂   ε   kj   (  ξ  )   ∂   ξ   i      ]   where x  k are the position vector components of the point in which we are computing the displacements and ξ  j are the position vector components of a point along the integration path.  The problem is summarized in Fig. 22 and boundary conditions of the problem are presented below:   {       σ   ij     n   j   = 0 ⇒   σ   xx   =   σ   yx   = 0   on  x = ± L  for  any  y       σ   xy   = 0 ,    σ   yy   = −   P   imp     on  y = H  for  any  x       u   x   ( 0 , 0 ) =   u   y   ( 0 , 0 ) = 0           Using Terzaghi׳s law (     σ   ̲     ̲   =       σ   e     ̲     ̲   −   p   r       I   ̲     ̲   ) with   p   r   ( x , y ) = V = − ( ay + b ) we can write the momentum conservation:     div   ̲          σ   e     ̲     ̲   +     f   ̲     p   = 0   with       f   ̲     p   = {     0     − a     }      So we can find an Airy function that satisfies the boundary conditions whose form is   ϕ ( x , y ) =   A   1     x   2   +   A   2   xy +   A   3     y   2        This polynomial function verifies Eq. (A.4) for any value of A 1, A 2 and A 3. From Eq. (A.6), we obtain the following relations:     σ   xx   = 2   A   3   + ( ay + b )   σ   yy   = 2   A   1   + ( ay + b )   σ   xy   = −   A   2        Left and right frontiers being free,   σ   xx   =   σ   yx   = 0 on x = ± L , implying   A   3   =   A   2   = 0 and leading to     σ   xx   = ( ay + b )   σ   yy   = 2   A   1   + ( ay + b )   σ   xy   =   σ   yx   = 0      The last constant A 1 can be determined with the boundary conditions on y=H  (   σ   yy   = −   P   imp   ) :     σ   yy   = 2   A   1   + ( aH + b ) = −   P   imp   ⇒   A   1   = −     P   imp   + aH + b   2        Finally the stress field in the 2D plate is  (A.9)  {       σ   xx   = ay + b       σ   yy   = −   P   imp   + a ( y − H )       σ   xy   =   σ   yx   = 0          Then, using Hooke׳s law we can compute the strain field:  (A.10)  {       ε   xx   =    1 + ν   E    [  (  1 − 2 ν  ) ( ay + b ) + ν G  ]       ε   yy   =    1 + ν   E    [  ( 1 − 2 ν ) ( ay + b ) + ( ν − 1 ) G  ]       ε   xy   = 0       with G = aH + b +   P   imp   .  Using Eq. (A.8), we have     U   xx   =   1 + ν   E   [  ( 1 − 2 ν ) ( a η + b ) + ν G  ] + ( y − η )   1 + ν   E   [  ( 1 − 2 ν ) a  ]   U   yy   =   1 + ν   E   [  ( 1 − 2 ν ) ( a η + b ) + ( ν − 1 ) G  ]   U   xy   = 0   U   yx   = −   1 + ν   E   ( x − ξ ) [  ( 1 − 2 ν ) a  ]      We can finally determine the displacements u  x and u  y by resolving the following integral:   |       u   x   ( x , y ) =    ∫    ( 0 , 0 )   ( x , y )     U   xx    d ξ +   U   xy    d η       u   y   ( x , y ) =    ∫    ( 0 , 0 )   ( x , y )     U   yx    d ξ +   U   yy    d η          So, the displacement field is   |       u   x   ( x , y ) =    1 + ν   E    [  ( 1 − 2 ν ) ( ay + b ) x + ν Gx  ]       u   y   ( x , y ) =    1 + ν   E    [  ( 1 − 2 ν ) (     a   2    y + b  ) y + ( ν − 1 ) Gy −    1 − 2 ν   2      ax   2    ]       with G = aH + b +   P   imp   .   REFERENCES", "highlights": "Stokes, Darcy and solid mechanics coupling is a matter of interest in many domains of engineering such as soil mechanics, bio-mechanics, and composites. The aim of this paper is to present a robust iterative method to deal with this coupling for low permeability media within the framework of industrial simulation, and especially for composite manufacturing processes. Stokes and Darcy problems are solved using a mixed velocity–pressure finite element using a mini-element formulation, and coupled together by the so-called Beavers–Joseph–Saffman conditions through their interface. This fluid formulation is then coupled to a non-linear solid mechanics formulation in finite deformations using Terzaghi׳s law at the pore level, and an explicit dependence of permeability with respect to porosity that is exactly computed from the solid mechanics kinematics. Then, those formulations are validated with test-cases and by the Method of the Manufactured Exact Solution (MMES) (Knupp and Salari, 2003[1]). Finally, a 3D curved transient example of application is presented."}