{"id": "S0168874X16300403", "article": "MAIN-TITLE Least-squares stabilized augmented Lagrangian multiplier method for elastic contact   HIGHLIGHTS          Stabilized method for finite element solution of elastic contact problems.      Stabilized augmented Lagrange multiplier method for contact.      FEA solution of Hertzian contact problem.          KEYPHRASES   Lagrange multiplier  Stabilization  Contact  Augmented Lagrangian   This paper is motivated by the recent work by Chouly and Hild [9] on Nitsche׳s method for contact problems. In their work, the contact conditions were incorporated into the bilinear form to transform the variational inequality describing the contact problem to a nonlinear variational equality. We here point out that the same can be done for a more standard stabilized Lagrange multiplier method if we augment the Lagrangian using the standard approach of, e.g., Alart and Curnier [1]. Using a multiplier method has an advantage compared to the Nitsche method in that there is an increased freedom in choosing the multiplier space. For example, using a continuous multiplier with nodes coinciding with the displacement nodes on the surface we can use nodal quadrature schemes to emulate point Lagrange multipliers (at least for low order elements). For such schemes, contact will be checked at the nodes as is usually done in engineering practice. This is not possible following the Nitsche approach.  A basic issue when using Lagrange multipliers to enforce contact is the number of degrees of freedom in the discrete Lagrange multiplier space. If too many constraints are used, the discrete system might be singular, and if there are too few constraints, there might be unphysical violation of the non-penetration condition. There are, basically, two different possibilities to obtain a stable discretization. The first approach is to choose discrete spaces that fulfill the inf–sup condition which guarantees stability (cf. [7]). A well-known example of such a scheme is the mortar method introduced by Bernardi et al. [5], and applied to contact problems by Ben Belgacem et al. [4]. The other option is to change the bilinear form in such a way that stability is ensured, as pioneered by Barbosa and Hughes [2,3] and this is the approach taken in this paper. We consider an augmented version of the stabilized Lagrange multiplier method introduced by Hansbo et al. [11] and adapted to contact by Heintz and Hansbo [12]. Unlike the method in [11,12], which was based on a global polynomial approximation of the multiplier, the method herein is suitable for locally defined multipliers.  The rest of the paper is organized as follows. First, we describe the proposed method. Secondly, we make some comments on the stability and convergence properties of the discretization. Finally, we present some numerical results and conclusions.  We consider an elastic body covering the domain Ω in   R   d   , d=2, 3, with boundary Γ =   Γ   D   ∪   Γ   N   ∪   Γ   C   and outward pointing normal n . We consider the case where the domains are subjected to proper Dirichlet (on   Γ   D   ) and traction (on   Γ   N   ) boundary conditions and are coming into frictionless contact along   Γ   C   , and are subjected to volume forces f ∈   (   L   2   ( Ω ) )   d   . The unilateral contact problem in linear elasticity consists in finding the displacement field u satisfying the equations and conditions  (1)      − ∇ · σ = f   in  Ω ,     σ = 2 μ ε ( u ) + λ ∇ · uI   in  Ω ,     u = 0   on    Γ   D   ,     σ · n = 0   on    Γ   N   ,       u   n   ≤ 0 ,    σ   n   ( u ) ≤ 0 ,    u   n      σ   n   ( u ) = 0   on    Γ   C   ,     }   with   σ   n   ( u ) ≔ n · σ ( u ) · n ,   u   n   ≔ u · n , and with ε ( u ) the strain tensor with components   ε ( u ) =    1   2    (  ∇ ⊗ u +   (  ∇ ⊗ u  )   T    ) ,   where   ( w ⊗ v )   ij   =   w   i     v   j   , with μ =   E   2 ( 1 + ν )   and λ =   ν E   ( 1 + ν ) ( 1 − 2 ν )   , where E is the modulus of elasticity, ν is Poisson׳s ratio, and with I the identity tensor. We shall assume that μ and λ are constant in the domain.  One interesting way of deriving an augmented Lagrangian method is to replace   σ   n   ( u ) by a Lagrange multiplier p (the contact pressure) so that the final line in (1) is written  (2)    u   n   ≤ 0 ,  p ≤ 0 ,    u   n   p = 0 ,   (the Kuhn–Tucker conditions) and, using the notation,  (3)    [ a ]   +   ≔ {     a   if  a > 0 ,     0   if  a ≤ 0 ,       replace conditions (2) by the equivalent statement  (4)  p = −   1   γ     [   u   n   − γ p ]   +     with γ a positive number, cf. Chouly and Hild [9, Proposition 2.1].  Defining function spaces  (5)  V = { v ∈   (   H   1   )   d   : v = 0  on    Γ   D   } ,  Q =   L   2   (   Γ   C   ) ,   and seeking ( u , p ) ∈ V × Q we have by Green׳s theorem, with   a ( u , v ) ≔   ∫   Ω   σ ( u ) : ε ( v )  d Ω ,  L ( v ) ≔   ∫   Ω   f · v  d Ω ,   that   a ( u , v ) −   ∫     Γ   C     p    v   n    d s = L ( v )   where v ∈ V and   v   n   ≔ v · n . Following [9] we write   v   n   =   v   n   + γ q − γ q for an arbitrary function q ∈ Q , so that we may write   a ( u , v ) −   ∫     Γ   C     p  (   v   n   − γ q )  d s −   ∫     Γ   C     γ p  q  d s = L ( v ) .   Replacing the p in the first integral by the expression in (4) we finally obtain the problem of finding ( u , p ) ∈ V × Q such that  (6)  a ( u , v ) +   ∫     Γ   C       1   γ     [   u   n   − γ p ]   +   (   v   n   − γ q )  d s −   ∫     Γ   C     γ p  q  d s = L ( v )  ∀ ( v , q ) ∈ V × Q .      This problem is related to seeking stationary points to the functional  (7)  Π ( u , p ) ≔ a ( u , u ) − L ( u ) +   ∫     Γ   C       1   2 γ     [    u   n   − γ p  ]   +   2    d s −   ∫     Γ   C       γ   2     p   2    d s ,   which is the well known nonlinear variational equality version of the augmented Lagrangian method, see, e.g., Alart and Curnier [1]. While replacing the standard variational inequality formulation (cf., e.g., [4,13]) by a nonlinear variational equality is not strictly necessary in an augmented method, cf. Chen [8], the nonlinear equality approach is well suited for applying Newton methods, and allows for avoiding the activation/deactivation of multipliers as the contact zone changes during nonlinear iterations. In a standard variational inequality setting, an active set of multipliers is typically used, which favours iterative algorithms able to accomodate active sets, cf. [6].  The formulation (7) constitutes the starting point for our finite element approximation. A remarkable fact is that by replacing p by   σ   n   ( u ) in (7) we formally obtain the Nitsche method of [9] which can be interpreted as a stabilized multiplier method in the linear case [15]. The augmented Lagrange multiplier method is, however, not a stabilized method and is subject to the standard problems of matching spaces for stability of the discrete problem, cf. [7].  Assume that we are given a triangulation   T   h   of the domain Ω. We denote by h the meshsize of   T   h   . We introduce the finite element space       V   →     h   = { v : v ∈   [    H   1   (   Ω   i   )  ]   d   ,  v   |   K   ∈   [   P   1   ( K ) ]   d   ,  ∀ K ∈   T   h   ,  v = 0  on    Γ   D   } ,   where   P   1   ( K ) denotes the space of affine polynomials on K. On   Γ   C   we introduce a family of spaces Q  h of discrete multipliers. As a particular case, we will consider the spaces Q  h   i , i=0 or i=1, of piecewise constants or linears defined as follows: the interface   Γ   C   is decomposed as the union of the faces of the triangulation   T   h   on   Γ   C   which gives a set of faces   F   C   h   consisting of the faces of simplices in   T   h   .  Our particular choices of multiplier space are  (8)    Q   0   h   = { q ∈ Q : q   |   K   ∈   P   0   ( K ) ,  ∀ K ∈   F   C   h   } ,   and  (9)    Q   1   h   = { q ∈   C   0   (   Γ   C   ) : q   |   K   ∈   P   1   ( K ) ,  ∀ K ∈   F   C   h   } ,   and finite element methods based on (6) are to find (   u   h   ,   p   h   ) ∈     V   →     h   ×   Q   i   h   such that  (10)  a (   u   h   , v ) +   ∫     Γ   C       1   γ     [    u   n   h   − γ   p   h    ]   +     v   n    d s = ( f , v )  ∀ v ∈     V   →     h   ,   and  (11)    ∫     Γ   C     (    1   γ     [    u   n   h   − γ   p   h    ]   +   +   p   h    ) q  d s = 0 ,  ∀ q ∈   Q   i   h   .   These methods are not in general stable, so we proceed to add a stabilizing term.  The difficulty in choosing appropriate combinations of discrete spaces for the finite element approximation (10)–(11), in particular with respect to stability of the discrete system, prompts the introduction of a stabilized discrete functional whose stationary point are sought:  (12)    Π   Stab     (   u   h   ,   p   h   ) ≔ Π (   u   h   ,   p   h   ) −   ∫     Γ   C       δ   2   (   p   h   −   σ   n   (   u   h   ) )   2    d s .   This approach is close to that introduced in [12] and analyzed by Hild and Renard [13], but different in being an augmented Lagrangian method. Another recent related contribution can be found in Tur et al. [16].  Introducing  (13)    B   h   ( u , p ; v , q ) ≔ a ( u , v ) +   ∫     Γ   C       1   γ     [    u   n   − γ p  ]   +   (   v   n   − γ q )  d s −   ∫     Γ   C     γ  pq  d s −   ∫     Γ   C     δ (  p −   σ   n   ( u )  ) (  q −   σ   n   ( v )  )  d s ,   the stationarity of   Π   Stab   leads to the problems of seeking (   u   h   ,   p   h   ) ∈     V   →     h   ×   Q   i   h   such that  (14)    B   h   (   u   h   ,   p   h   ; v , q ) = L ( v )  ∀ ( v , q ) ∈     V   →     h   ×   Q   i   h   .   Here we make the particular choices   γ ≔ h /   γ   0   ,  δ ≔ h /   γ   1   ,   where γ 1 is a number to be chosen so as to ensure stability of the discrete system whereas the choice of γ 0 is not crucial for stability.  We shall here briefly comment on the source of the stability of the method and the significance for the choice of γ 0. Let us for simplicity assume that there is contact all along   Γ   C   and consider the resulting matrix problem arising from (14):  (15)  [     S   B       B   T     − C     ] [     u     p     ] = [     f     0     ] ,   which, if we use a basis   φ   i   for the displacements and a basis ψ  i for the multipliers, is constructed as     (  S  )   ij   = a (   φ   j   ,   φ   i   ) +   1   γ     ∫     Γ   C     n ·   φ   j    n ·   φ   i    ds − δ   ∫     Γ   C       σ   n   (   φ   j   )   σ   n   (   φ   i   )  ds ,   (  B  )   ij   = −   ∫     Γ   C     n ·   φ   j     ψ   i    ds − δ   ∫     Γ   C       σ   n   (   φ   j   )   ψ   i    ds   (  C  )   ij   = δ   ∫     Γ   C       ψ   j     ψ   i    ds .   We split   S =   S   1   − δ   S   2   ,  where    (    S   1    )   ij   = a (   φ   j   ,   φ   i   ) +   1   γ     ∫     Γ   C     n ·   φ   j    n ·   φ   i    ds .   For stability, it is then sufficient to have, for arbitrary v ≠ 0 ,     v   T   (    S   1   − δ   S   2    ) v ≥   c   1     |  v  |   2     and, for arbitrary q ≠ 0 ,     q   T   (    B   T     S   − 1   B + C  ) q ≥   c   2     |  q  |   2     for constants c 1 and c 2, i.e., that both S and   B   T     S   − 1   B + C are positive definite matrices. As is well known (cf., e.g., [9]),  (16)    C   I     u   T     S   1   u > h   u   T     S   2   u   where h is the meshsize and C  I depends on the elastic moduli but not on h (this argument works elementwise as well). This means that if δ < h /   C   I   , or, equivalently,   γ   1   >   C   I   , the matrix S is positive definite. The determination of C  I can be performed by a local eigenvalue problem and it is tabulated for some different approximations in [10]. This in turn means that   B   T     S   − 1   B —while in worst case singular—certainly is positive; since C is positive definite we conclude that   B   T     S   − 1   B + C is also positive definite, as desired. Thus, one might say that this stabilization method borrows some excess stability from   S   1   in order to create stability for the multipliers.  We begin by showing the effect of the stabilization method. The example we consider is non-smooth with an elastic object covering the domain ( 0 , 1 ) × ( 0 , 1 ) being pushed downwards using the Dirichlet boundary condition u = ( 0 , − 0.1 ) at y=1. The body comes in contact with a rigid foundation that stretches from x=0.1875 to x=0.8125. We set E=100, ν=0.3 and   γ   0   = 200 . For the approximation of the contact pressure we use Q  h  0 and we take   Γ   C   to be the line y=0. We compare the cases δ=0 (no stabilization) with δ = h / 200 (stabilized). In Fig. 1 we show the displacement field and a blow up at the corner of the foundation for the unstabilized scheme. The displacement field exhibits no serious signs of instability, whereas the contact pressure, shown in Fig. 2 exhibits strong oscillations.  The corresponding results for the stabilized scheme are shown in Figs. 3 and 4  and we note that the oscillations in the contact pressure is alleviated and the displacement field has a monotone variation near the singularities.  In this section we solve the Hertzian problem of an elastic cylinder contacting a rigid surface by using the method presented in previous sections. We assume small deformations and frictionless contact. The numerical results will also be compared to an analytical solution. A distributed load is applied on the top boundary edge of the half cylinder as shown in Fig. 5 a.  The distribution of the normal traction σ  n due to applied load W = ∫ w  ds , where w is load per unit length, can be determined analytically by the following relation which is based on the Hertzian contact theory [14]   (17)    σ   n   ( x ) =   σ   n   max     1 −   (    x   b    )   2     ,   where x is the distance from the symmetry line of the cylinder, b is the width of the contact zone given as  (18)  b = 2     WR ( 1 −   ν   2   )   π E     ,   and σ  n   max is the maximum normal traction given as  (19)    σ   n   max   =     WE   π R ( 1 −   ν   2   )     .      Here R is the radius of the cylinder, ν is the Poisson׳s ratio and E is the modulus of elasticity. For the results presented in this work, the parameters are set as follows: R=1, E=7000, ν=0.3 and w=100. For the finite element analysis, plane strain assumption is adapted and movement of a point at (0,1) is fixed along x-axis. The movement of the rigid surface is fixed both in x and y. The cylinder is finely meshed in the area which could come in contact with rigid surface as shown in Fig. 5b. The outer edges of all the elements in this area are set to have equal length. A contact zone is defined on the surface of the cylinder within the limits − 0.25 < x < 0.25 . The number of active multipliers is determined in advance and do not change during the iterations.  The root-mean-square error (RMSE), defined as  (20)    (    ∫     Γ   C       (    σ   n   ana   −   σ   n   aug    )   2    ds  )     where σ  n   ana is the analytical normal traction computed by (17) and     σ   n   aug   =   1   γ     [    u   n   h   − γ   p   h    ]   +   ,   will be used to compare the results. The length of the boundary edge, h  e , of a contacting element will be used to describe the meshing of cylinder.  In Fig. 6 a the error is shown as a function of γ 1 when   γ   0   = E and h  e =0.01. It can be seen that after the initial jump, the error shows decreasing trend as γ 1 increases. The minimum error occurs when   γ   1   = E ×   10   7   . Fig. 6b shows the distribution of the normal traction when the error is minimum.  In Fig. 7 the error is plotted against two measures of mesh size, h  av and h  e , when   γ   1   = E ×   10   7   and   γ   0   = E . The average element size, h  av is defined as   h   av   =   A ( Ω )       N   el       where A ( Ω ) is the area of the domain and N  el is the number of elements. Quadratic convergence can be observed in Fig. 7a.  In Fig. 8 a the error is plotted against γ 0 when   γ   1   = E ×   10   7   and h  e =0.001. The minimum error occurs when   γ   0   = E / 0.45 . Fig. 8b shows the distribution of normal traction when the error is minimum.   CONCLUSIONS   In this paper, a stabilized augmented Lagrange multiplier method for the finite element solution of elastic contact problems is presented. Results from two numerical examples are also presented. In the first example it has been shown that stability of the method depends on the γ 1. In the second example, the Hertzian problem is solved and compared to an analytical solution. It also investigates the dependence of error on γ 0, γ 1 and mesh size. In the future this method could be extended to contact between two elastic bodies with friction and large deformations.   REFERENCES", "highlights": "In this paper, we propose a stabilized augmented Lagrange multiplier method for the finite element solution of small deformation elastic contact problems. We limit ourselves to friction-free contact with a rigid obstacle, but the formulation is readily extendable to more complex situations."}