{"id": "S0168874X14000535", "article": "MAIN-TITLE Finite element based dynamic analysis of viscoelastic solids using the approximation of Volterra integrals   HIGHLIGHTS          A mathematical description of viscoelastic solids based on the generalized Kelvin-Voigt model is presented and it is applied to modeling vibrations in a solid.      Two finite element methods for either creep or relaxation functions as the input data are proposed for the analysis of viscoelastic materials.      The longitudinal wave propagation subject to a step and a sinusoidal excitation is studied and compared in an elastic and viscoelastic media.      Analytical solutions based on the Laplace transform method are provided for the case studies.      The accuracy of the proposed computational methods were estimated in terms of their error variation and mesh size.          KEYPHRASES   Viscoelasticity  Finite Element Method  Creep and relaxation  Longitudinal wave propagation  Axial vibration  Laplace transform   To describe the viscoelastic nature of solids, the generalized Kelvin–Voigt model is commonly used. It is based on a Volterra-history integral equation which represents the stress (strain) at the current time t in terms of the strain (stress) history up to time t [1,2]. This corresponds to the viscoelastic constitutive equations with integer time derivatives for the description of stress relaxation and creep of strain. A generalization of viscoelastic laws replaces the integer order time derivatives by those of fractional order [3]. Recently, special interest is dedicated to the implementation of fractional constitutive equations into Finite Element (FE) formulations [4,5]. In this context, the numerical methods in the time domain are generally associated with the Grünwald formalism for the fractional order derivative of the stress–strain relation in conjunction with a time discretization scheme [6,7]. Schmidt and Gaül [6] presented a three-dimensional FE formulation based on fractional derivatives and performed useful parameter identification between the integer and fractional order constitutive equations. In the research by Gaül and Schanz [8], two time domain boundary element approaches including generalized viscoelastic behavior are compared with the Laplace domain boundary element approach and subsequent numerical inverse transformation. In another work by Gaül [4], the two different integer and fractional models of viscoelasticity for the description of stress–strain damping hysteresis under cyclic oscillations are compared.  The conventional viscoelastic models, like those used herein, need more parameters and therefore sometime many Kelvin–Voigt elements to model viscoelasticity but in fact this matter is not a big deal. Because, in the implementation of the methods illustrated in this research, the Kelvin–Voigt element coefficients are mainly utilized in the calculation of summation expressions which are independent of the unknowns and are calculated only once outside the main loop. As a result, employing more Kelvin–Voigt elements does not increase the simulation time significantly. In addition, there are a number of viscoelastic materials which can adequately be modeled using the classical models with even a few Kelvin–Voigt elements. For this type of materials, the use of fractional derivatives which are very sophisticated is not necessary. For these reasons, the current research aims at providing convenient FE formulations based on conventional viscoelastic models.  Chazal and Pitti [9] suggested a Dirichlet series expansion of the creep function to overcome the difficulties associated with the calculation of the convolution integrals. This article however, does not contain any numerical example to demonstrate its accuracy for problems of generalized Kelvin–Voigt model made from many elements. An efficient method for viscoelastic modeling using the integral Laguerre transform for the evaluation of time derivatives and convolution integrals is provided by Mikhailenko et al. [10]. The Anelastic Displacement Fields (ADF) method was implemented by Rusovici et al. [11] to model frequency-dependence within a time-domain FE framework. It was used to model shock propagation and absorption through viscoelastic structures. Chen and Lin [12] derived an incremental functional based on Hamilton׳s variational principle to estimate the transient viscoelastic behavior. Although this research has the advantage of avoiding the storage of complete history calculations, it suffers from necessary iterations in each time step, reducing the speed of solution procedure. Sim and Lee [13] presented a Finite Element Method (FEM) for the time domain analysis of the transient dynamic viscoelastic problems. It does not consider the inertia terms explicitly, but the inertia effect is taken into account by spatially discretization to obtain the semi-discrete equations in the time integration. As a result, the conventional time integration schemes such as the Newmark and Houbolt methods are avoided. The formulation of this research needs to retain the complete past history results. The seismic wave propagation in a viscoelastic media can also be described and solved in the frequency domain where the integral terms are presented by complex parameters [14–16]. Sorrentino and Fasana [17] presented a method for reducing the computational effort due to Finite Element (FE) analysis of vibrating linear systems with the fractional derivative viscoelastic model. Some fundamentals of frequency analysis for fractionally damped systems are also illustrated. Hammerand [18] studied the FEM for geometrically nonlinear viscoelastic structures.  In the current research a formula to approximate the convolution integral terms stemming from the viscoelastic behavior is provided. Then using that and the conventional constitutive equations of viscoelastic media, a new FE approach to deal with the three-dimensional structural problems is presented. The important advantage of the new approach is that by using such formulations, the retaining of the complete past history of stress or strain to calculate unknowns at the current time is avoided. Another important feature of this research is that it provides two alternative FE formulations: one assumes the relaxation function is given and the other considers the creep compliance function as the viscoelastic data. This avoids performing complicated operations associated with obtaining creep from relaxation function or vice versa. To validate the method, the problem of uniaxial wave propagation in a viscoelastic rod is considered. This problem has been previously investigated by some researchers such as Ma [19], Leonov [20], Barakat [21] and the exact solution has been obtained using Laplace transform [22–25]. More recently, Keramat and Ahmadi [26] gave several issues to distinguish between axial wave propagations in elastic and viscoelastic rods. Therein, viscoelasticity is prescribed by creep function. Their solution is based on approximation of convolution integrals similar to the current research, but herein, the finite element formulation was extended to accept creep or relaxation function to define viscoelasticity. The suggested FEM is applied to investigate wave propagations in a one and a three dimensional viscoelastic bar. Semi-analytical solutions based on the Laplace transform method reveal the successful computations.  In describing a linear viscoelastic response, the elastic behavior of materials is modeled using springs, while dashpots are used to model the viscous behavior. By using various combinations of spring and dashpot elements in series and/or parallel connections, a wide range of linear viscoelastic materials can be modeled [27]. Among them, the two simplest combinations that come to mind are those of the spring and dashpot in parallel called the Kelvin model, or the spring and dashpot in series called the Maxwell model ( Fig. 1). These simple models provide two basic patterns for systematically designing two well-known complex models. The first one is the generalized Kelvin–Voigt model, having N Kelvin units in series together with an additional spring. The second one consists of N Maxwell units in parallel called the generalized Maxwell model ( Fig. 2).  One of the most distinguishing features of linear viscoelastic materials is their response to a step stress. In such a case, the strain response continues to increase and then ultimately approaches an asymptote. The strain response being a function of time under the unit step stress defines an important property of material called the creep compliance function E  c (t).  Another distinguishing characteristic of viscoelastic materials is relaxation, in which an instantaneous step strain is imposed on the specimen and maintained at the value which the resulting stress is recorded as a function of time. The decrease in the stress values over the duration of the test is referred to as the stress relaxation. For a unit step strain in the relaxation test, the resulting stress response equates the relaxation modulus function E  r (t).  According to the generalized Kelvin–Voigt mechanical model depicted in Fig. 2-left, the force in each Kelvin element and the spring is the same as force applied on the whole model. Furthermore, the total displacement is the sum of displacements in the individual Kelvin elements and in the spring. For each Kelvin element, the immediate displacement is zero and the ultimate displacement (when time t goes to infinity) is given by the spring response when it is fully stretched. Therefore, in terms of Prony series, the creep compliance function will take the following form:  (1)    E  c  ( t ) : =   E   0   c   +  ∑  k = 1     N   K V        E   k   c   ( 1 −   e   − t /   τ   k   c     )  ,   where   E   0   c   : = 1 /   E   0   represents the immediate response of the material;   E   k   c   defined by   E   k   c   : = 1 /   E   k   is the creep compliance of the spring of the k-th Kelvin element;   E   k   is the modulus of elasticity of the k-th spring and τ  k is retardation time of the k-th dashpot in each Kelvin element. Here,   τ   k   c   : =   μ   k   /   E   k   in which µ  k is the viscosity of the k-th dashpot. An alternative way to derive relation (1) is found by noting that the stress–strain relation of one Kelvin element is governed by σ = E ε + μ  ε ̇  where E is the modulus of elasticity of the spring and µ is the viscosity of the dashpot and  ε ̇  is the strain rate (Fig. 1-left). In this view, it is convenient to write the formulation for each element in the Laplace domain to be released from the existing time derivative, and then calculate the displacement corresponding to a unit step stress. Using this approach, the stress relaxation function (response to a step strain) is found to be [1] as follows:  (2)    E  r  ( t ) : =   E   ∞   r   +  ∑  k = 1     N   K V        E   k   r      e   − t /   τ   k   r      ,   in which   E   ∞   r   is E  r (∞) representing the ultimate stress subjected to a unit step strain. It is worth nothing that there are no simple expressions relating   E   ∞   r   ,   E   k   r   and   τ   k   r   to E 0, E  k and μ  k (see Fig. 2-left) like those given for relation (1).  There is no simple relation between the creep and relaxation functions in the time domain [35]. However, there exists a simple relation between them in the Laplace domain which is discussed in the next section. The standard approach to obtain one from the other is to solve the Volterra integral equation with numerical methods [1]. In the algebraic approach, it can be shown that the degree of instability grows exponentially with the number of elements in the model [29].  For an arbitrary applied uniaxial stress on a linear viscoelastic material, the strain response is found by means of the principle of superposition. In this view, the principle argues that the total strain resulting from a sequence of applied stresses is equal to the sum of the strains due to the individual stresses from time t=−∞ till the current time t. This is represented by the following hereditary integral:  (3)  ε ( t ) =  ∫  − ∞  t   σ ( t − s )   d   E  c  ( s )   d s   d s  = σ ( t )   E  c  ( 0 ) +  ∫ 0 t   σ ( t − s )   d   E  c  ( s )   d s   d s  = σ ⁎ d   E  c  ( t )   in which the third expression is deduced assuming that the stress prior to t=0 is zero and there is a discontinuous initial stress as σ(0)=σ 0. The notation “⁎ d” is the Stieltjes convolution operator which as seen its use simplifies the formulation favorably. Using the integration by parts, it is proven that Eq. (3) can also be written as ε ( t ) =   E  c  ⁎ d σ ( t ) , meaning that the Stieltjes convolution operator is commutable.  By the same discussion as what was made for Eq. (3) but now to obtain the stress response caused by the applied strain on a material having the relaxation modulus E  r  , the resulting stress will be  (4)  σ ( t ) = ε ⁎ d   E  r  ( t ) =   E  r  ⁎ d ε ( t ) .   The mathematical relation between E  r and E  c can be obtained by noting that for a step stress σ(t)=σ 0, strain is given by ε(t)=σ 0 E  c (t) (see Eq. (3)). Thus considering Eq. (4) for t ≥ 0 , this yields  (5)    σ   0   =   σ   0     E  c  ( t ) ⁎ d   E  r  ( t )  ⇒    E  c  ( t ) ⁎ d   E  r  ( t )  = 1  .   In the Laplace domain, Eq. (5) is expressed as  (6)     E ¯   c     E ¯   r  = 1 /   a  2  ,   where the overbar denotes the Laplace transform and a is the Laplace parameter. Letting t=0 in the second expression of Eq. (5) and then expanding it according to the Stieltjes convolution operator, results in  (7)    E  c  ( 0 )   E  r  ( 0 )  = 1 .   Note that   E  r  ( 0 )  =   E   ∞   r   +  ∑  k = 1     N   K V        E   k   r    , if the relaxation modulus is used according to relation (2). Letting t=∞ in Eq. (5), after some operations it gives  (8)    E  c  ( ∞ )   E  r  ( ∞ )  = 1 ,   in which for the creep compliance function (1),   E  c  ( ∞ ) =  ∑  k = 0     N   K V        E   k   c    . The interested reader in the relation between relaxation and creep functions is referred to [28].  To represent the constitutive equations for three-dimensional response, assuming the linearity of response and material isotropy, the total elongation along any direction at time t has contributions from all the axial-stress components along x, y and z which are present on the sample, as follows [1]:  (9)    ε   x x   =   σ   x x   ⁎ d   E  c  − (   σ   y y   ⁎ d υ +   σ   z z   ⁎ d υ ) ⁎ d   E  c  ,      (10)    ε   y y   =   σ   y y   ⁎ d   E  c  − (   σ   x x   ⁎ d υ +   σ   z z   ⁎ d υ ) ⁎ d   E  c  ,      (11)    ε   z z   =   σ   z z   ⁎ d   E  c  − (   σ   y y   ⁎ d υ +   σ   x x   ⁎ d υ ) ⁎ d   E  c  ,   in which Poisson׳s ratio υ is a function of time. Let G  c (t) express the creep function in shear strain, the set of shear stress–strain relations reads  (12)    ε   x y   =   σ   x y   ⁎ d   G  c  ,    ε   x z   =   σ   x z   ⁎ d   G  c  ,    ε   y z   =   σ   y z   ⁎ d   G  c  .   The relation between G  c , E  c and υ is proved to be [2]   (13)    G  c  = 2 ( 1 + υ ) ⁎ d   E  c  .   In relations (9)–(12), the general three-dimensional constitutive relations in linear viscoelasticity were presented. Obviously, the numerical model for these equations needs to deal with some terms containing the double Stieltjes convolution which makes the problem very cumbersome. The remedy to this difficulty is to simplify the problem according to material properties. Three choices are offered [1,3]: material is incompressible, bulk modulus of material is independent of time, and the Poisson ratio is independent of time. To describe the first two choices, the constitutive stress–strain relations need to be expressed by pure shear and pure volumetric response [30]. In this research, the third choice is selected and the numerical solution based on that assumption is developed. However, the proposed formulations in Section 4 of this research can be applied for the other two cases.  The experimental determination of Poisson ratio function involves severe difficulties in view of high accuracy required. Thus, reliable information on the viscoelastic Poisson׳s ratio is as yet rather scanty [31]. If the constant Poisson ratio assumption is applied into relations (9)–(11) and (13), and then G  c in Eq. (12) is substituted by that of Eq. (13), the following matrix-form relation between stress and strain is obtained:  (14)  ε = C σ ⁎ d   E  c  =   E  c  ( 0 ) C σ +  ∫ 0 t     d   E  c  ( s )   d s   C σ  ( t − s ) d s .   In this relation, E  c is the creep compliance function and should be thought of a scalar function of time which acts on all elements of vector σ (or Cσ) by the Stieltjes convolution operator. Vectors ε and σ and matrix C are  (15)  ε =   {   ε   x x      ε   y y      ε   z z      ε   x y      ε   y z      ε   z x   }  T  ,      (16)  σ =   {   σ   x x      σ   y y      σ   z z      σ   x y      σ   y z      σ   z x   }  T  ,      (17)  C =  [     1    − υ     − υ    0   0   0      − υ    1    − υ    0   0   0      − υ     − υ    1   0   0   0     0   0   0    2 ( 1 + υ )    0   0     0   0   0   0    2 ( 1 + υ )    0     0   0   0   0   0    2 ( 1 + υ )      ]  .   Using Eq. (5) and assuming the linear isotropic viscoelasticity, Eq. (14) can also be written according to the relaxation modulus function as  (18)  σ =   C   − 1   ε ⁎ d   E  r  .      If the creep compliance function given by Eq. (1) and the relaxation function given by Eq. (2) are substituted in Eqs. (14) and (18) respectively, they will form some integral expressions consisting of the summation of product of an unknown function with another exponential function. For the analysis in time domain, these terms should be calculated by direct relations of the unknowns. For this purpose, the integrals are approximated by linear functions of the unknowns at the current time step and calculated values at the previous time step. This is done with the aid of the following relation which reads if I  k (t) is the convolution integral generated by the aforementioned substitution in Eqs. (14) and (18), then an excellent approximation for the current type of convolution integral using a recursive relation is found as (see Appendix)  (19)    I   k   ( t ) =  ∫ 0 t   g ( t − s )   e   − s /   τ   k      d s ≈ g ( t )  (    τ   k   −     τ   k   2     Δ t   ( 1 −   e   ( − Δ t /   τ   k   )   )  )  + g ( t − Δ t )  (  −   τ   k     e   ( − Δ t /   τ   k   )   +     τ   k   2     Δ t   ( 1 −   e   ( − Δ t /   τ   k   )   )  )  +   e   ( − Δ t /   τ   k   )     I   k   ( t − Δ t ) ,   where g(t) is an arbitrary function to be applied in the calculations of the Stieltjes convolution with either E  r or E  c . Using this formula, the convolution integrals are calculated by direct relations, allowing for the use of standard FEM, which will be described in the next sections. This approach was also successfully applied to study the viscoelastic behavior of pipelines by Covas et al. [32] and Keramat et al. [33].  In matrix form, the virtual work equation in domain Ω with boundary Γ is written as [34]   (20)   ∫ Ω   δ   u  T  ρ  u ¨  d Ω  +  ∫ Ω   δ   ε  T  σ d Ω  −  ∫ Ω   δ   u  T  b d Ω  −  ∫ Γ   δ   u  T  t d Γ  = 0 ,   where the vectors u, b and t denote the displacement field, the body force per unit mass and the traction force normal to Γ , respectively and ρ is the mass density. Finite element approximations to displacements and virtual displacements are denoted by  (21)  u = N   u ^  ,  δ u = N δ  u ^   ⇔  δ   u  T  = δ    u ^   T    N  T  ,   where   u ^  denotes time dependent vector of nodal displacements (degrees of freedom in each element) and N specifies shape functions matrix. Strains and virtual strains are computed as  (22)  ε = S  u = SN   u ^  = B  u ^  ,      (23)  δ ε = B δ  u ^  ,   in which matrix S defines the appropriate spatial derivative operator and B specifies the appropriate spatial derivative of matrix N.  By substitution from Eqs. (21)–(23) in Eq. (20) for each element (with now domain   Ω   e   and boundary   Γ   e   ), it reduces to  (24)  M   u ^  ¨  +  ∫    Ω   e        B  T  σ d Ω  −   f   b   −   f   t   = 0 ,   where the mass matrix M and vectors f  b and f  t are defined as  (25)  M =  ∫    Ω   e      ρ   N  T  N d Ω  ,    f   b   =  ∫    Ω   e        N  T  b d Ω  ,    f   t   =  ∫    Γ   e        N  T  t d Γ  .   To deal with the second term of Eq. (24), two different techniques can be proposed offering two different FEM formulations. One approach results in a modified form (compared to formulations of elastic problems) for the stiffness matrix and another one ends up with a modified mass matrix. The former uses the relaxation modulus and the latter employs the creep compliance function. Depending upon the input data of viscoelastic properties being the relaxation or creep function, one formulation is favored. This is due to the fact that the creep compliance function cannot conveniently be obtained from the relaxation function and vice versa, especially when many Kelvin–Voigt elements are utilized in the simulation.  The stress relaxation function E  r given by Eq. (2) is substituted into Eq. (18), the result is  (26)  σ ( t ) =   C   − 1   ε ⁎ d   E  r  ( t ) =   C   − 1   B  u ^  ⁎ d   E  r  ( t ) = (   C   − 1   B )  u ^  ⁎ d   E  r  ( t ) = (   C   − 1   B )  [    E  r  ( 0 )  u ^  ( t ) +  ∫ 0 t    u ^  ( t − s )   d   E  r  ( s )   d s   d s   ]  = (   C   − 1   B )  [    E  r  ( 0 )  u ^  ( t ) −  ∑  k = 1     N   K V          E   k   r       τ   k   r        ∫ 0 t    u ^  ( t − s )   e   −  s /    τ   k   r       d s   ]  = (   C   − 1   B )  [    E  r  ( 0 )  u ^  ( t ) −  ∑  k = 1     N   K V          E   k   r       τ   k   r       I   1 k   ( t )   ]  ,  with    I   1 k   ( t ) =  ∫ 0 t    u ^  ( t − s )   e   − s /   τ   k   r     d s   .   Approximation of I 1k in the above equation using the formula (19) leads Eq. (26) to  (27)  σ  ( t ) ≈ (   C   − 1   B )   E  r  ( 0 )   u ^  ( t ) − (   C   − 1   B )  ∑  k = 1     N   K V          E   k   r       τ   k   r     [   a   1 k   r    u ^  ( t ) +   a   2 k   r    u ^  ( t − Δ t ) +   e   ( − Δ t /   τ   k   r   )     I   1 k   ( t − Δ t ) ]    where  (28)    a   1 k   r   =  (    τ   k   r   −     (   τ   k   r   )  2    Δ t   ( 1 −   e   ( − Δ t /   τ   k   r   )   )  )  ,    a   2 k   r   =  (  −   τ   k   r     e   ( − Δ t /   τ   k   )   +     (   τ   k   r   )  2    Δ t   ( 1 −   e   ( − Δ t /   τ   k   r   )   )  )  .   This form of the stress vector in Eq. (27) allows for its representation in a recursive form according to the calculated values at the previous time step and unknown variables at the current time step:  (29)  σ  ( t ) ≈   C   − 1   B (   c   1    u ^  ( t ) +   c   2   ) ,  with   c   1   =   E  r  ( 0 ) −  ∑  k = 1     N   K V        a   1 k   r       E   k   r       τ   k   r        c   2   = −  ∑  k = 1     N   K V          E   k   r       τ   k   r      [    a   2 k   r    u ^  ( t − Δ t ) +   e   ( − Δ t /   τ   k   r   )     I   1 k   ( t − Δ t )  ]   .   Now the resulting expression for σ can be applied in Eq. (24) to form the desired FE formulation:  (30)  M   u ^  ¨  +   K  ⁎   u ^  =   f   b   +   f   t   −   f   r   ,  with    K  ⁎  =   c   1   K ,    f   r   = K   c   2   ,  K =  ∫    Ω   e        B  T    C   − 1   B d Ω  ,   where the subscript \"r\" stands for the part of the right-hand-side vector (force vector) of element calculated according to the relaxation function. K  ⁎ can be called the modified stiffness matrix.  This formulation is preferred when the viscoelastic behavior is given in terms of the relaxation function E  r . According to Eqs. (30) and (29), the relaxation function is used in forming the element matrix relation through parameters c 1 and c 2.  Starting from Eq. (14), if it is left-multiplied by matrix B T C  –1 and then integrated over the element domain Ω  e , the outcome is  (31)   (   ∫    Ω   e        B  T  σ d Ω   )  ⁎ d   E  c  =  ∫    Ω   e        B  T    C   − 1   ε d Ω   .   Now the second term in Eq. (24) is obtained and substituted for the same expression in Eq. (31). This gives  (32)  ( − M   u ^  ¨  +   f   b   +   f   t   ) ⁎ d   E  c  =  ∫    Ω   e        B  T    C   − 1   ε d Ω   .   Substitution for ε from Eq. (22) into (32), and then arrange it, gives  (33)  M   u ^  ¨  ⁎ d   E  c  + Ku = (   f   b   +   f   t   ) ⁎ d   E  c  ,  with  K =  ∫    Ω   e        B  T    C   − 1   B d Ω  .   The first expression in Eq. (33) is written using the Stieltjes convolution operator. The resulting convolution-integral terms are approximated using the formula (19) as follows:  (34)  M   u ^  ¨  ⁎ d   E  c  ≈ M (   c   3     u ^  ¨  +   c   4   ) ,  with   c   3   =   E  c  ( 0 ) +  ∑  k = 1     N   K V        a   1 k   c       E   k   c       τ   k   c      ,    c   4   =  ∑  k = 1     N   K V          E   k   c       τ   k   c     [   a   2 k   c     u ^  ¨  ( t − Δ t ) +   e   ( − Δ t /   τ   k   c   )     I   2 k   ( t − Δ t ) ]  ,   I   2 k   ( t ) =  ∫ 0 t     u ^  ¨  ( t − Δ t )   e   − s /   τ   k   c     d s  ,   where   a   1 k   c   and   a   2 k   c   are given by relation (28) with replacing superscript r by c in them. Other terms of Eq. (33) containing the Stieltjes convolution operator, are treated by similar way. Considering Eqs. (33) and (34), the FE formulation for linear viscoelastic problems, when the creep compliance function is given to describe the viscoelastic behavior, becomes  (35)    M  ⁎    u ^  ¨  + K  u ^  =   f   c   ,  with   M  ⁎  =   c   3    ∫ Ω   ρ   N  T  N d Ω  =   c   3   M ,   f   c   = − M   c   4   +   c   3   (   f   b   +   f   t   ) +   c   5   ,   c   5   =  ∑  k = 1     N   K V          E   k   c       τ   k   c      [    a   2 k   c   (   f   b   ( t − Δ t ) +   f   t   ( t − Δ t ) ) +   e   ( − Δ t /   τ   k   c   )     I   3 k   ( t − Δ t )  ]    ,   I   3 k   ( t ) =  ∫ 0 t   (   f   b   ( t − s ) +   f   t   ( t − s ) )   e   − s /   τ   k   c     d s   .   here the subscript “c” on the force vector stands for the terms calculated using the creep function. The importance of this formulation is mainly due to the fact that obtaining E  r from E  c is really cumbersome when the number of Kelvin–Voigt elements in simulation is large. In addition, the conversion from creep compliance to relaxation is more unstable than the conversion from relaxation to creep especially in viscoelastic solids [29]. In this situation, the provided FEM in Eq. (35) which is based on creep the compliance function is preferred, instead of calculating E  r from E  c and then employing formulation (30).  Consider uniaxial wave propagation in a viscoelastic bar of length L, fixed at one end (z=0) and subjected to a suddenly applied axial force F(t) at the other end (z=L). The equation of motion for a viscoelastic bar with mass density ρ and cross sectional area A yields  (36)      ∂  2  u   ∂   x  2    = ρ     ∂  2  u   ∂   t  2    ⁎ d   E  c  .   The initial conditions are  (37)  u ( x , 0 ) = 0 ,    ∂ u   ∂ t   ( x , 0 ) = 0 ,   and the boundary conditions are  (38)  ( a )  u ( 0 , t ) = 0 ,  ( b )    ∂ u   ∂ x   ( L , t ) =   F ( t )  A  ⁎ d   E  c  ( t ) .   Using the approximation formula (19), the second expression of Eq. (38) is calculated as  (39)    ∂ u   ∂ x   ( L , t ) =   c   3     F ( t )  A  +   c   6   ,  with   c   6   =  ∑  k = 1     N   K V          E   k   c       τ   k   c      [    a   2 k   c     F ( t − Δ t )  A  +   e   ( − Δ t /   τ   k   c   )     I   4 k   ( t − Δ t )  ]   ,   I   4 k   ( t ) =  ∫ 0 t     F ( t − s )  A    e   − s /   τ   k   c     d s  .   To obtain an alternative representation for Eq. (36), its Stieltjes convolution with function E  r is calculated and then Eq. (5) is employed. The result is  (40)  ρ     ∂  2  u   ∂   t  2    =     ∂  2  u   ∂   x  2    ⁎ d    E  r  .   The appropriate boundary condition for this case, according to Eq. (38) may be written as  (41)  ( a )  u ( 0 , t ) = 0 ,  ( b )    ∂ u   ∂ x   ( L , t ) ⁎ d    E  r  ( t ) =   F ( t )  A  .      To solve the problem described by Eqs. (36)–(38) or (40), (37) and (41), linear shape functions can be used for the interpolation in the FE procedure. By using linear shape functions, the matrices M and K in Eqs. (25) and (30) will reduce to  (42)    M   0   =   ρ l  6   [     2   1     1   2     ]  ,    K   0   =  1 l   [     1    − 1       − 1    1     ]  ,   where l is the length of element located between points x  a and x  b denoting the coordinates of the end points of the finite element. Now, depending upon the input data of viscoelastic behavior of material which may be either relaxation or creep function, one FE formulation is preferred.  The formulation expressed in Section 4.1 is employed. For the uniaxial wave propagation in a bar, Eq. (30) results in  (43)    M   0     u ^  ¨  +  (    E  r  ( 0 ) −  ∑  k = 1     N   K V        a   1 k   r       E   k   r       τ   k   r        )    K   0    u ^  = −   f   r   +   [   N  T  σ ]     x   a       x   b      with   f   r   =   K   0     c   2   ,   c   2   = −  ∑  k = 1     N   K V          E   k   r       τ   k   r     [   a   2 k   r    u ^  ( t − Δ t ) +   e   ( − Δ t /   τ   k   r   )     I   1 k   ( t − Δ t ) ]   ,   I   1 k   ( t ) =  ∫ 0 t    u ^  ( t − s )   e   − s /   τ   k   r     d s  ,   where  u ^  is the nodal displacements of element with the end point coordinates of x  a and x  b . The last expression in the right-hand-side of Eq. (43) concerns with the element boundaries. Using bar elements for the current problem, after assembling of this term for all elements and then applying Eq. (4), infinitesimal strain theory ( ε = ∂ u / ∂ x ) and Eq. (41), it reduces to  (44)  σ   |     x   b   = L   =   [ ε ⁎ d   E  r  ]     x   b   = L   =   [    ∂ u   ∂ x   ⁎ d   E  r   ]     x   b   = L   =   ∂ u   ∂ x   ( L , t ) ⁎ d   E  r  ( t ) =   F ( t )  A  .      This means that in the global force vector, only the term F(t)/A remains due to the last expression of Eq. (43). In fact, in the force vector, this term is stored in the position corresponding to the force applies thereto, which in the current problem is the last node of the domain.  The formulation provided in Section 4.2 is applied. For uniaxial wave propagation, Eq. (35) yields  (45)    M   0    (    E  c  ( 0 ) +  ∑  k = 1     N   K V        a   1 k   c       E   k   c       τ   k   c       )    u ^  ¨  +   K   0    u ^  = −   M   0      c   4   +   [   N  T  σ ⁎ d   E  c  ]     x   a       x   b      with   c   4   =  ∑  k = 1     N   K V          E   k   c       τ   k   c      [    a   2 k   c     u ^  ¨  ( t − Δ t ) +   e   ( − Δ t /   τ   k   c   )     I   2 k   ( t − Δ t )  ]    ,   I   2 k   ( t ) =  ∫ 0 t     u ^  ¨  ( t − Δ t )   e   − s /   τ   k   c     d s    The last expression in the right-hand-side of Eq. (45) concerns with the element boundaries. If bar elements are incorporated and this term is assembled for all elements, considering Eqs. (3), (38) and (39) it simplified to  (46)  σ ⁎ d   E  c    |     x   b   = L   =  [    ∂ u   ∂ x    ]         x   b   = L   =   ∂ u   ∂ x   ( L , t ) =   F ( t )  A  ⁎ d   E  c  =   c   3    F A  +   c   6   .   To integrate matrix Eq. (45) (or Eq. (43)) in the time domain, the Newmark-beta scheme with β=1/4 which corresponds to the constant acceleration method is carried out [35].  An alternative solution based on the Laplace transform method is used here to study the axial vibration of viscoelastic bars.  Laplace transformation of the equations of uniaxial wave propagation (36) and (40), leads them to ODEs which can be solved for the unknown in the Laplace domain. The inverse Laplace transform of an expression cannot in general be obtained analytically. Therefore, numerical methods are employed. In the present research, the de Hoog algorithm [36], a numerical scheme for calculating the inverse Laplace transform is applied to obtain the solution in the time domain.  Solving Eqs. (36) and (40) offers two solutions to study the longitudinal wave propagation in a viscoelastic bar as follows.  Applying Laplace transform with respect to time onto Eq. (40) under zero initial conditions (Eq. (37)), one obtains  (47)  a     E ¯   r      ∂  2   u ¯    ∂   x  2    − ρ   a  2   u ¯  = 0 ,   where a is the Laplace transform independent variable, overbar denotes transformed quantities and  u ¯  =  u ¯  ( x , a ) . Solving Eq. (47) for  u ¯  yields  (48)   u ¯  =   α   1     e   λ x   +   α   2     e   − λ x   ,  with  λ =     ρ a      E ¯    r   ( a )     ,   where α 1 and α 2 are constants of integration. In view of boundary conditions (41)-a, it is inferred that α 1=α 2 causing (48) to  (49)   u ¯  =   α   1   (   e   λ x   −   e   − λ x   ) .   Applying the Laplace transform onto Eq. (41)-b, the transformed boundary condition is obtained as follows:  (50)    ∂  u ¯    ∂ x   ( L , a )    E ¯   r  ( a ) a =    F ¯  ( a )  A  .   The constant of integration α 1 is obtained considering Eqs. (49) and (50) as  (51)    ∂  u ¯    ∂ x   ( L , a ) =   α   1   λ (   e   λ L   +   e   − λ L   ) =    F ¯  ( a )      E ¯   r  ( a ) a   ⇒   α   1   =    F ¯  ( a )      E ¯   r  ( a ) a λ (   e   λ L   +   e   − λ L   )   .   Replacing the exponential terms with the hyperbolic functions, the solution in the Laplace domain is written as  (52)   u ¯  =   F ¯      E ¯   r  a λ     sinh ( λ x )   cosh ( λ L )   ,    λ =     ρ a      E ¯   r      .   Eq. (52) provides the Laplace transformed solution at each arbitrary point x. The Laplace transform of the relaxation function defined by Eq. (2) is determined to be  (53)     E ¯   r  =     E   ∞   r    a  +  ∑  k = 1     N   K V          E   k   r     τ   k   r     1 + a   τ   k   r      .      Applying Laplace transform with respect to time on Eq. (36) under zero initial conditions (Eq. (37)), gives  (54)      ∂  2   u ¯    ∂   x  2    − ρ   a  3     E ¯   c   u ¯  = 0 .   Solving Eq. (54) one obtains  (55)   u ¯  =   α   1     e   λ x   +   α   2     e   − λ x   ,    λ = a   ρ a    E ¯    c   ( a )   ,   where α 1 and α 2 are constants of integration. In view of boundary condition (38)-a, it is seen that α 1=α 2 causing (55) to  (56)   u ¯  =   α   1   (   e   λ x   +   e   − λ x   ) .   The application of the Laplace transform onto Eq. (38)-b results in the transformed boundary condition of the form:  (57)    ∂  u ¯    ∂ x   ( L , a ) = a    E ¯   c  ( a )  F ¯  ( a ) .   The constant of integration α 1 is obtained considering Eqs. (56) and (57) as  (58)    ∂  u ¯    ∂ x   ( L , a ) =   α   1   λ (   e   λ L   +   e   − λ L   ) = a    E ¯   c  ( a )  F ¯  ( a ) ⇒   α   1   =   a    E ¯   c  ( a )  F ¯  ( a )   λ (   e   λ L   +   e   − λ L   )   .   Eventually, the solution in the Laplace domain is written as  (59)   u ¯  =    F ¯     E ¯   c  a  λ    sinh ( λ x )   cosh ( λ x )   ,  λ = a   ρ a    E ¯   c    .   The Laplace transform of the creep compliance function given by Eq. (1) is found to be  (60)     E ¯   c  =     E   0   c    a  +  ∑  k = 1     N   K V      (      E   k   c    a  −     E   k   c     τ   k   c     1 + a   τ   k   c      )  .      Wave propagation in a viscoelastic rod with length L=4m, fixed at x=0 and subjected to two different load cases including a step and a sinusoidal excitation at the other end, is investigated in this section. Other specifications of the problem are A=0.01m2 and ρ=1200kg/m3. The material relaxation modulus is assumed as follows:  (61)    E  r  ( t ) =   10  9  × ( 1 +   e   − t / 0.001   + 7   e   − t / 0.01   +   e   − t / 0.05   ) ,   where t is time in seconds (s) and E  r (t) is in Pascals (Pa). This function represents the generalized seven-parameter Kelvin–Voigt model and is used when methods described by Eqs. (43) and (52) are employed to solve the problem. If methods described by Eqs. (45) and (59) are used, the following creep function which corresponds to the relaxation function (61) should be applied in the formulation.  (62)    E  c   ( t )  =   10   − 9   ×  (  0.1 + 0.0092   e    − t  /  0.001101    + 0.1105   e   −  t /  0.030115     + 0.7803   e   −  t /  0.150784      )    This is obtained from Eq. (61) with the aid of relation (6). The unit of E  c (t) is Pa−1.  The wave propagation problem is solved by one-dimensional (1-d) and three-dimensional (3-d) FE formulations for elastic and viscoelastic solids. The results of the 1-d case corresponding to axial wave propagation are then compared against 3-d FEM results. The comparison reveals the effects of lateral waves formed due to Poisson׳s ratio of material, which are taken into account in 3-d simulations and are ignored in the 1-d calculations.  The axial wave problem in the rod is solved by the four solution methods given in Section 5. It is demonstrated that all four methods arrive at the same answer. The methods include approximations in different parts of the implementation process. Approximations used for the FEM relate to the time and space discretization, the incorporated interpolation functions and approximation of the existing convolution integrals. Solutions based on the Laplace transform include approximation in inverting the response from the Laplace to the time domain. In the numerical procedure of Laplace inversion, the time and Laplace domains are split into segments in order to invert each value individually. If an adequate number of elements are used for the simulation, like the examples of this paper built up 100 elements, then comparatively the same results are obtained. The details of this numerical survey for each load case are set out as follows.  The applied load F(t) in Eqs. (38) and (41) is considered to be constant and equal to F 0=10N. The displacement results at the right end (x=L) and midpoint (x=L/2) for elastic and viscoelastic rod are plotted in Fig. 3. The residual irreversible displacements and reduction in the amplitude of oscillations observed in the results are manifestations of viscoelastic behavior. It was also found from the computations that the four methods (E  c and E  r based Laplace transform solution and E  c and E  r based FEM solution) arrive at the same response on condition that the domain is divided into enough number of elements (up to 100 elements herein).  In the application of Eq. (46) which calculates the boundary condition when the FEM with the modified mass matrix is implemented, one can see that for a constant applied force (F(t)=F 0) it reduces to  (63)  σ ⁎ d   E  c    |     x   b   = L    = [    ∂ u   ∂ x    ]         x   b   = L   =   ∂ u   ∂ x   ( L , t ) =     F   0    A  ⁎ d   E  c  =     F   0    A    E  c  ( t ) .   The two proposed FEM solutions are compared with the exact solution given by the semi-analytical method, in Fig. 4. Only two elements were used for the FE simulation to observe the behavior of each method in achieving convergence. Apparently, the solution using the modified mass-matrix formulation introduces spurious oscillations to the results with time progress, when number of elements (NE) is small.  Error in each FE solution (modified mass-matrix and modified stiffness-matrix) is investigated in Fig. 5 for simulations with two elements to the left and five elements to the right. According to the definition of the relative error percent ( 100 × | u −  u ˜  | /  u ˜  ) , in which  u ˜  is the calculated (approximate) displacement, the error is large when the displacement is zero which for this case corresponds to the initial condition (t=0). By employing more elements the error significantly decreases and becomes less that 10% for five elements. The solution based on the modified mass-matrix gives relatively larger errors when small number of elements is used but for more elements both methods show similar error variation.    Fig. 6 provided at four different time sections shows change of relative error of each FE formulation with the number of elements used in the simulation. Obviously, the accuracy increases with the increase in the number of elements. However, at some time sections (e.g. t=0.005s or t=0.02s), with less elements more accuracy is achieved but this is not a common trend and occurs just in rare occasions. For a fine enough mesh (i.e. more elements) which has around 20 elements herein, the results do not differ by a large amount meaning that this number of elements is probably good enough for that particular geometry, loading and constraints.  The applied load F(t) is assumed to be sinusoidal with the amplitude α and frequency ω:  (64)  F ( t ) = α  sin  ω t .   In the FEM implementation, to calculate the boundary condition, Eq. (46) which calculates the convolution integral numerically has to be applied. Alternately, it can be calculated analytically as follows  (65)    F ( t )  A  ⁎ d   E  c  =  α A   sin  ω t ⁎ d   E  c  ( t ) =  α A    E  c  ( 0 ) sin  ω t  +  α A   ∫ 0 t   sin  ω ( t − s )   d   E  c    d s    =  α A    E   0   c    sin  ω t +  α A   ∑  k = 1     N   K V          E   k   c       τ   k   c      ∫ 0 t   sin  ω ( t − s )   e   − s /   τ   k   c     d s   =  α A    E   0   c    sin  ω t +  α A   ∑  k = 1     N   K V        E   k   c     sin  ω t − ω   τ   k   c   ( cos  ω t −   e   − t /   τ   k   c     )   1 +   ω  2    τ   k   c      .   Results (which are the same in all four solutions) at the right end and midpoint for the sinusoidal excitation with α=2N and ω=80 π Rad/s are compared for the viscoelastic and elastic case in Fig. 7.  The proposed numerical solutions obtain much better results in case of the sinusoidal loading compared to the step loading. The two FEM solutions behave similarly and show comparatively identical results relative to each other ( Fig. 8). Even with one element for FE simulation, the results become close to the exact results and they gradually equate them with time progress. These issues can also be identified from error variation results provided in Fig. 9. Regarding this figure one should notice that instead of the relative error expression in which at moments of zero displacement becomes infinite (division by zero), the absolute error, |  u −  u ˜   | is employed to report error variations.  For this particular load case, in the two FE schemes, Fig. 10 shows the trend of error reduction by time for various number of elements used in the simulation. They demonstrate that although with the increase in the number of elements from one to ten the error considerably decreases, yet this fashion does not continue, concluding that a mesh with about ten elements is fine enough for the current problem.  Three-directional wave propagation in the rod of previous section is now analyzed. The numerical relations of FEM presented in Section 4 are employed. It is aimed at studying the effects of Poisson׳s ratio of viscoelastic material on the dynamic responses.  Firstly, to check the prepared numerical solution for the three-dimensional analysis of a viscoelastic solid, the Poisson ratio is set to zero. It is then confirmed that the results coincide to those of one dimensional wave propagation investigated in the previous section. Next, the wave propagation in the 3-d rod with Poisson׳s ratio equal to 0.46 is compared with the 1-d solution.  To perform the 3-d simulation of the bar, it is divided in 100 elements with 25 along the rod axis and two elements along the other two directions.  The boundary conditions for the 3-d analysis are adjusted such that the simulation resembles to that of 1-d analysis. As Fig. 11 implies, the rod is fixed at the left end and is truncation free at surfaces parallel to the rod axis. A uniform step excitation equal to 1KPa as a tensile stress is applied on the right end with area=0.01m2. This load case corresponds to 0.625N for the four nodes at the corners, 1.25N for the four nodes at the middle of each edge and 2.5N at the center of the free end. The difference between the results of the two sets of simulations is small and it manifests the extent that lateral wave propagations influence the axial dynamic response.  The 1-d longitudinal displacement at the right end of the rod in the previous section subject to the axial step load excitation is compared to the 3-d response. Fig. 12 corresponds to the bar vibration with elastic material and Fig. 13 represents viscoelastic rod vibrations. Gaül and Schanz [8] obtained results with a similar damping pattern in the 3-d simulation of a viscoelastic rod.  Two new FE formulations in the time domain for viscoelastic solids when they are simulated by the generalized Kelvin–Voigt model are presented. The formulations are based on an excellent approximation formula which allows the convolution integrals arising from the viscoelastic models to be evaluated by direct relations of unknowns at the current time step and calculated expressions at the previous time step. The material viscoelastic properties can be given by either creep compliance or relaxation modulus functions for which the appropriate FE formulations being the modified mass or the modified stiffness matrix are provided. The Newmark algorithm is employed for the time integration of the structural responses. The proposed two FE solutions were then used to study the longitudinal uniaxial and three-directional wave propagation in a viscoelastic bar. Based on the Laplace transform and its inverse, two other semi-analytical solutions were illustrated for solving the uniaxial wave propagation in a viscoelastic bar. They were employed to verify the results of the proposed FE solutions. The use of the FE-formulations and the Laplace-based methods is exemplified in some numerical examples concerning the response of a viscoelastic bar subjected to the step or sinusoidal excitations. It turned out that all four solutions converge to the same response when enough number of elements is used for the domain discretization in each method. The error variation with respect to time and number of computational elements for the two load cases revealed that the two proposed FE formulations work satisfactorily, and with the use of a fine enough mesh, the calculations become very close to the exact solution. The error analysis also demonstrated that the modified stiffness-matrix FE formulation is preferred as it comparatively converges to the response with less error.   ACKNOWLEDGMENT   This study was initiated and almost completed at the Department of Mathematics and Computer Science, Eindhoven University of Technology. Thanks are also due to Dr. Arris S. Tijsseling for his helps and comments.  The numerical approximation of the convolution integral appearing in many of the equations is done as follows:     I   k   ( t ) =  ∫ 0 t   g ( t − s )   e   ( − s /   τ   k   )    d s =      ∫ 0  Δ t    g ( t − s )   e   ( − s /   τ   k   )   d s    ︸     A   +      ∫  Δ t  t   g ( t − s )   e   ( − s /   τ   k   )   d s    ︸     B   A =  ∫ 0  Δ t    g ( t − s )   e   ( − s /   τ   k   )   d s  = −  ∫ t  t − Δ t    g ( y )   e   ( y − t ) /   τ   k      d y =     J   k       τ   k       e   ( − t /   τ   k   )    ∫  t − Δ t  t   g ( y )   e   ( y /   τ   k   )    d y =   e   ( − t /   τ   k   )    (  g ( y )   τ   k     e   ( y /   τ   k   )     |   t − Δ t   t   −  ∫  t − Δ t  t     ∂ g ( y )   ∂ y     τ   k     e   ( y /   τ   k   )    d y  )  =   e   ( − t /   τ   k   )     τ   k    (  g ( t )   e   ( t /   τ   k   )   − g ( t − Δ t )   e   ( t −   Δ   t   ) /   τ   k     −  ∫  t − Δ t  t     ∂ g ( y )   ∂ y     e   ( y /   τ   k   )    d y  )  ≈   e   ( − t /   τ   k   )     τ   k    (  g ( t )   e   ( t /   τ   k   )   − g ( t − Δ t )   e   ( t −   Δ   t   ) /   τ   k     −  g ̇  ( t − Δ t )  ∫  t − Δ t  t     e   ( y /   τ   k   )    d y  )  ≈   e   ( − t /   τ   k   )     τ   k    (  g ( t )   e   ( t /   τ   k   )   − g ( t − Δ t )   e   ( t −   Δ   t   ) /   τ   k     −  g ̇  ( t − Δ t )   [   τ   k     e   ( y /   τ   k   )   ]   t − Δ t  t   )  ≈   e   ( − t /   τ   k   )     τ   k    (  g ( t )   e   ( t /   τ   k   )   − g ( t − Δ t )   e   ( t −   Δ   t   ) /   τ   k     −   τ   k    (    g ( t ) − g ( t − Δ t )   Δ t    )  (   e   ( t /   τ   k   )   −   e   ( t −   Δ   t   ) /   τ   k     )  )  ≈   τ   k   g ( t ) −   τ   k   g ( t − Δ t )   e   ( − Δ t /   τ   k   )   −   τ   k   2    (    g ( t ) − g ( t − Δ t )   Δ t    )  ( 1 −   e   ( − Δ t /   τ   k   )   ) ≈ g ( t )  (    τ   k   −     τ   k   2     Δ t   ( 1 −   e   ( − Δ t /   τ   k   )   )  )  + g ( t − Δ t )  (  −   τ   k     e   ( − Δ t /   τ   k   )   +     τ   k   2     Δ t   ( 1 −   e   ( − Δ t /   τ   k   )   )  )  B =  ∫  Δ t  t   g ( t − s )     J   k       τ   k       e   ( − s /   τ   k   )    d s =  ∫ 0  t − Δ t    g ( t − Δ t − u )     J   k       τ   k       e   − ( u +   Δ   t   ) /   τ   k     d u  =   e   ( − Δ t /   τ   k   )    ∫ 0  t − Δ t    g ( t − Δ t − u )     J   k       τ   k       e   ( − u /   τ   k   )   d u  =   e   ( − Δ t /   τ   k   )     I   k   ( t − Δ t )       REFERENCES", "highlights": "Two new finite element based methods for time-domain dynamic analysis of viscoelastic solids are proposed in this research. The viscoelastic property is given by either the relaxation or creep functions and is simulated by the conventional generalized Kelvin–Voigt model. The viscoelastic behavior during the dynamic response is taken into account by the Volterra integral. This avoids the difficulties associated with the need for high order time-derivatives used in differential models of viscoelasticity. An accurate numerical approximation for the Volterra integrals is provided. It is used for implementation of the finite-element procedure in the time domain by the introduction of additional terms to the mass matrix (or the stiffness matrix) and the force vector. The additional terms are functions of calculations at the previous time step. In the two provided finite element formulations, one uses the relaxation and the other employs the creep compliance function. This makes it unnecessary to calculate the creep function from the given relaxation modulus or vice versa which are cumbersome operations. As a case study, the wave propagation in a one- and three-dimensional viscoelastic rod subject to a step and sinusoidal load is formulated and solved by the proposed two finite element methods. The computations were validated by direct solutions based on the Laplace transform method."}