{"id": "S0168874X13001601", "article": "MAIN-TITLE Configuration-dependent interpolation in higher-order 2D beam finite elements   HIGHLIGHTS          We propose a configuration-dependent interpolation for 2D non-linear beams.      We establish a connection between this interpolation and linked interpolation in linear analysis.      The results obtained show good performance regardless of the integration order.          KEYPHRASES   Non-linear analysis  Reissner–Simo beam theory  Configuration-dependent interpolation   Geometrically exact beam theory and its finite element implementation have been the subject of extensive research in the recent past (see e.g. [1–4]). We are concerned with the geometrically exact 3D beam theory of Reissner [5] and Simo [1] which has provided the basis for many of the recent finite element formulations for 3D beams (e.g. [2,3,6]). The geometrically exact theory provides the relationship between the configuration and the adopted strain measures which are fully consistent with the virtual work principle and the differential equations of motion, regardless of the magnitude of displacements, rotations and strains involved [1].  Most of the procedures in the finite element method in general, and in the application of the beam theories with an independent rotational field in particular, use Lagrangian polynomials as interpolation functions to describe unknown functions approximately. (A typical example of such a theory in engineering practice is the Timoshenko beam theory, which in the geometrically non-linear environment generalises to the Reissner beam theory considered here. In the Bernoulli beam, in contrast, the rotational field is not independent of the displacements eventually leading to Hermitean, rather than the Lagrangian interpolation.) Since non-linear analysis employs Newton–Raphson solution procedure to solve the system of equations iteratively, this allows us to generalise the interpolation procedure without additional computational efforts apart from the changes made on one element level.  When choosing new interpolation functions we demand that they result in exact solution where such exists, such as linear analysis and pure bending in non-linear analysis. In order to define this new configuration dependent interpolation, existing configuration-dependent interpolations are used as a template [7,8].  In [7] a strain-invariant and path-independent geometrically exact isoparametric 3D beam element with arbitrary number of nodes has been derived. The key to the formulation is found in the interpolation of current local rotations. A different approach, aimed at resolving a more general type of non-objectivity of the numerical results with respect to the chosen definition of the beam reference line, is given in [8]. The resulting formulation in the process returns exactly the same solution for the interpolation of the rotation field as [7], and it additionally eliminates the problem of shear locking by design. However, the formulation is only applicable to two-noded elements and the given methodology has been strictly limited to that case.  In non-linear 3D beam theory with rotational degrees of freedom [1] configuration-dependent interpolation therefore may be utilised to provide a result invariant to the choice of the beam reference axis [8] or invariant to a rigid-body rotation [7]. For 2D beam elements, the latter issue vanishes, and such elements are more illustrative for the study of accuracy of the configuration-dependent interpolation in higher-order elements.  In Section 2 we present the methodology used to design a configuration-dependent interpolation for the position vector in 3D beam elements of arbitrary order. In Section 3 we apply this interpolation to derive a new family of beam elements and in Section 4 we conduct some 2D numerical tests to assess the performance of these elements against the elements with Lagrangian or linked interpolation.  In the first three subsections we present the three basic ingredients on which we build our family of elements with configuration-dependent interpolation.  The first of these is the family of generalised interpolation functions for the rotation increments which, for a two-noded element, coincides with the interpolation for the same quantity in the helicoidal interpolation, our second basic ingredient. Since the helicoidal interpolation is only applicable to two-noded elements and it utilises the same interpolation also for the position vector, it appears to be a natural idea to use the generalised interpolation from our first ingredient when attempting to generalise the helicoidal interpolation to higher-order elements. This interpolation is next fine-tuned to provide the exact solution in linear analysis, our third ingredient. In the following subsection we constrain this interpolation to satisfy the strain-invariance condition and in the last subsection we give the result for the 2D case.  A strain-invariant path-independent formulation for geometrically exact higher-order beam element has been derived in [7]. In this formulation the position vector of the beam reference axis, taken to coincide with the line of centroids, in the deformed state r (   x   1   ) has been interpolated in a Lagrangian manner as  (1)  r (   x   1   ) ≈   r   h   (   x   1   ) =   ∑   i = 1   N     P   i   (   x   1   )   r   i   ,   where   x   1   ∈ [ 0 , L ] is the material-point position parameter, N is the number of element nodes,   P   i   (   x   1   ) are the Lagrangian polynomials of order N − 1 satisfying   P   i   (   x   1 j   ) =   δ   ij   and   r   i   =   r   h   (   x   1 i   ) , where index h denotes an interpolated field, and   δ   ij   is the Kronecker symbol (   δ   ij   = 1 if i = j and   δ   ij   = 0 otherwise).  The rotations have been treated in a very specific manner. The rotation matrix Λ (   x   1   ) has been decomposed into a part which is constant for the whole beam and rigidly attached to a node (   Λ   r   ) , and the part due to a local   Ψ   l   rotation with respect to   Λ   r   :  (2)  Λ (   x   1   ) =   Λ   r    exp    Ψ   l   (   x   1   ) ≈   Λ   h   (   x   1   ) =   Λ   r    exp      Ψ   ^     lh   (   x   1   ) ,   with  (3)  exp     Ψ   ^     lh   = I +    sin    Ψ   lh       Ψ   lh          Ψ   ^     lh   +    1 − cos    Ψ   lh       (   Ψ   lh   )   2        (     Ψ   ^     lh   )   2   ,   where   Ψ   lh   = ∥   Ψ   lh   ∥ and   Λ   r   may be taken to coincide with a particular node I or may be related to two chosen nodes I and J via  (4)    Λ   r   =   Λ   I    exp (    1   2      ϕ   ^   ) ,   where ϕ is the relative material rotation between the nodes I and J extracted from  (5)  exp   ϕ   ^   =   Λ   I   T     Λ   J     and index l denotes a local value of a rotation taken with respect to the reference triad   Λ   r   . Note that for I = J ,  exp    ϕ   ^   = I or, in other words, there is no relative rotation ϕ .  The hat (      ^   ) above a 3D vector in (3) and throughout the text denotes a cross-product operator such that for a vector v = {       v   1       v   2         v   3     } ,   v   ^   is defined as     v   ^   = [     0   −   v   3       v   2         v   3     0   −   v   1       −   v   2       v   1     0     ] .      The local rotation   Ψ   l   (   x   1   ) is interpolated in the Lagrangian way  (6)    Ψ   l   (   x   1   ) ≈   Ψ   lh   (   x   1   ) =   ∑   i = 1   N     P   i   (   x   1   )   Ψ   i   l   ,   where the local nodal rotations   Ψ   i   l   are extracted from  (7)  exp      Ψ   ^     i   l   =   Λ   r   T     Λ   i   .      For the non-linear finite-element solution procedure it is necessary to interpolate the Newton–Raphson increments Δ r and Δ ϑ in Δ Λ =   Δ ϑ   ^   Λ . Obviously  (8)  Δ r ≈ Δ   r   h   =   ∑   i = 1   N     P   i   Δ   r   i   ,   while Δ ϑ has been closely investigated in [7] and the result found in the form  (9)  Δ ϑ ≈ Δ   ϑ   h   =   ∑   i = 1   N       I   ˜     i   (   Λ   h   ) Δ   ϑ   i   ,   with  (10)      I   ˜     i   =   ∑   j = 1   N     ∑   k = 1   N     Δ   k   ij     Λ   r   {  (   δ   Ik   +   δ   Jk   ) [  I − H (   Ψ   lh   )   ∑   m = 1   N     P   m     H   − 1   (   Ψ   m   l   )  ]   V   j   + H (   Ψ   lh   )   P   k     H   − 1   (   Ψ   j   l   )  }   Λ   r   T   ,      (11)    V   I   =    1   2    (  I +    1   ϕ     tan     ϕ   4      ϕ   ^    ) ,      (12)    V   J   =    1   2    (  I −    1   ϕ     tan     ϕ   4      ϕ   ^    )   and  (13)  H (   Ψ   l   ) = I +    1 − cos    Ψ   l       (   Ψ   l   )   2          Ψ   ^     l   +      Ψ   l   − sin    Ψ   l       (   Ψ   l   )   3        (     Ψ   ^     l   )   2   ,      (14)    H   − 1   (   Ψ   l   ) = I −    1   2        Ψ   ^     l   −    1   2         Ψ   l    sin    ψ   l   + 2  cos    Ψ   l   − 2     (   Ψ   l   )   2   ( 1 − cos    Ψ   l   )      (     Ψ   ^     l   )   2   ,   while  (15)    Δ   k   ij   = {     1   for  i = j = k     0   otherwise .          For I = J the generalised interpolation (10) simplifies considerably and reads  (16)      I   ˜     i   =   ∑   j = 1   N     ∑   k = 1   N     Δ   k   ij     Λ   I   {    δ   Ik   [  I − H (   Ψ   lh   )   ∑   m = 1   N     P   m     H   − 1   (   Ψ   m   l   )  ] + H (   Ψ   lh   )   P   k     H   − 1   (   Ψ   j   l   )  }   Λ   I   T   .      The helicoidal interpolation presented and developed in many different aspects in [8–12] may be thought of as originating from a requirement that the finite-element solution should be invariant to the choice of the beam reference line and kinematically consistent in the sense that it should belong to the solution space including the orthogonality group SO ( 3 ) .  The first of these requirements boils down simply to the condition that both the position vector of the reference line ( r ) and the rotation tensor ( Λ ) should be interpolated using the same interpolation functions. This issue is explored in more detail in Section 2.6. For instance, using the Lagrangian polynomials this yields [12]    r   h   (   x   1   ) =   ∑   i = 1   N     P   i   (   x   1   )   r   i   and  (17)    Λ   h   (   x   1   ) =   ∑   i = 1   N     P   i   (   x   1   )   Λ   i   .      The above interpolation of the rotation tensor, however, is clearly kinematically inconsistent, i.e.   Λ   h   (   x   1   ) is in general neither orthogonal nor unimodular. To satisfy this requirement, an alternative interpolation has been proposed in [8] which reads  (18)    r   h   (   x   1   ) =   ∑   i = 1   2       N   ˜     i     r   i        (19)    Λ   h   (   x   1   ) =   ∑   i = 1   2       N   ˜     i     Λ   i   ⇒ Δ   ϑ   h   (   x   1   ) =   ∑   i = 1   2       N   ˜     i   Δ   ϑ   i   ,   where the generalised interpolation functions     N   ˜     i   are identical to     I   ˜     i   in (10) for N = 2 (two-noded element). It is important to note that the proposed helicoidal interpolation makes sense only for two-noded elements.  Since, for I = J , the interpolation functions     I   ˜     i   in (10) also satisfy     Λ   h   (   x   1   ) =   ∑   i = 1   N       I   ˜     i     Λ   i     it appears that the helicoidal interpolation may be generalised to higher-order elements using the interpolation functions from (10) and applying them to both the translations and the rotations via  (20)    r   h   (   x   1   ) =   ∑   i = 1   N       I   ˜     i     r   i        (21)    Λ   h   (   x   1   ) =   ∑   i = 1   N       I   ˜     i     Λ   i   ,  Δ   ϑ   h   (   x   1   ) =   ∑   i = 1   N       I   ˜     i   Δ   ϑ   i   .      With the above generalisation to a higher-order element (expressions (20) and (21)), however, the exact result, even in the limit case of the analysis becoming linear, cannot be achieved. To show this let us first note that  (22)    Λ   I     Λ   I   T   = I ,      (23)    Λ   I   H (   Ψ   lh   )   Λ   I   T   = H (   Λ   I     Ψ   lh   ) ,      (24)    Λ   I     H   − 1   (   Ψ   i   l   )   Λ   I   T   =   H   − 1   (   Λ   I     Ψ   i   l   ) ,      (25)    Λ   I     V   I     Λ   I   T   =    1   2    I +    1   2       lim   ϕ → 0   (     1   ϕ     tan     ϕ   4        Λ   I   ϕ   ^    ) =    1   2    I   and also   Λ   I     Ψ   i   l   and   Λ   I   ϕ are the spatial counterparts of   Ψ   i   l   and ϕ :  (26)    ψ   i   l   =   Λ   I     Ψ   i   l   ,      (27)  φ =   Λ   I   ϕ = 0 .      Now, in the case of linear analysis, the rotations become infinitesimally small which means that   Λ   I   =   Λ   0   , where   Λ   0   is a matrix of initial undeformed orientation, which results in the following expressions:  (28)  H (   ψ   lh   ) = I +   lim     Ψ   lh   → 0   (     1 − cos    ψ   lh       (   ψ   lh   )   2       )     ψ   ^     lh   +   lim     ψ   lh   → 0   (       ψ   lh   − sin    ψ   lh       (   ψ   lh   )   3          ψ   ^     lh    )     ψ   ^     lh   ,   which further reduces to  (29)  H (   ψ   lh   ) = I +    1   2        ψ   ^     lh   .   Also, for the case of linear analysis:  (30)    H   − 1   (   ψ   i   l   ) = I −    1   2        ψ   i   l     ^   −    1   2       lim     ψ   i   l   → 0   (       ψ   i   l    sin    ψ   i   l   + 2  cos    ψ   i   l   − 2     (   ψ   i   l   )   2   ( 1 − cos    ψ   i   l   )     )   (     ψ   ^     i   l   )   2   ,   which further reduces to  (31)    H   − 1   (   ψ   i   l   ) = I −    1   2        ψ   ^     i   l   .   Also  (32)    Λ   0     V   I     Λ   0   T   =    1   2    I ,   and, owing to   Λ   I   =   Λ   0   , the rotations cease to be local, i.e.   ψ   i   l   =   ψ   i   .  In linear analysis from (16) we thus have  (33)      I   ˜     i   =   ∑   j = 1   N     ∑   k = 1   N     Δ   k   ij     δ   Ik   [  I − (  I +   1   2       ψ   ^     h    )   ∑   m = 1   N     P   m   (  I −   1   2       ψ   ^     m    )  ] +   ∑   j = 1   N     ∑   k = 1   N     Δ   k   ij     P   k   (  I +   1   2       ψ   ^     h    ) (  I −   1   2       ψ   ^     j    ) =   P   i   (  I +   1   2       ψ   h   −   ψ   i     ^    ) =   P   i   (  [     1   0   0     0   1   0     0   0   1     ] +    1   2    [     0   − (   ψ   3   h   −   ψ   i 3   )     ψ   2   h   −   ψ   i 2         ψ   3   h   −   ψ   i 3     0   − (   ψ   1   h   −   ψ   i 1   )     − (   ψ   2   h   −   ψ   i 2   )     ψ   1   h   −   ψ   i 1     0     ]  ) ,   after elimination of the second-order terms.  The results from (20) and (21) now become  (34)    r   h   =   ∑   i = 1   N     P   i   (  I +    1   2        ψ   h   −   ψ   i     ^    )   r   i   =   ∑   i = 1   N     P   i   (  I +    1   2        ψ   h   −   ψ   i     ^    ) (   R   i   +   u   i   ) ,      (35)  Δ   ϑ   h   =   ∑   i = 1   N     P   i   (  I +    1   2        ψ   h   −   ψ   i     ^    ) Δ   ϑ   i   ,   where   R   i   is the vector of initial nodal positions and   u   i   is the vector of nodal displacements. Since   r   h   =   R   h   +   u   h   and   R   h   =   ∑   i = 1   N     P   i     R   i   and because in linear analysis Δ   ϑ   i   =   ψ   i   and the second-order terms vanish, we further have  (36)    ∑   i = 1   N     P   i     R   i   +   u   h   =   ∑   i = 1   N     P   i     R   i   +   ∑   i = 1   N     P   i     u   i   +    1   2      ∑   i = 1   N     P   i       ψ   ^     h     R   i   −    1   2      ∑   i = 1   N     P   i       ψ   ^     i     R   i   ,      (37)    ψ   h   = (  I +    1   2        ψ   ^     h    )   ∑   i = 1   N     P   i     ψ   i   ,   i.e.  (38)  (  I −    1   2        ψ   ^     h    )   ψ   h   =   ∑   i = 1   N     P   i     ψ   i   ⇒   ψ   h   =   ∑   i = 1   N     P   i     ψ   i     and  (39)    u   h   =   ∑   i = 1   N     P   i     u   i   +    1   2        ψ   ^     h     ∑   i = 1   N     P   i     R   i   −    1   2      ∑   i = 1   N     P   i       ψ   ^     i     R   i   =   ∑   i = 1   N     P   i   (    u   i   +    1   2        R   i   −   R   h     ^     ψ   i    ) .      In [13] it has been shown that in linear analysis the exact result follows from the interpolation  (40)    ψ   h   =   ∑   i = 1   N     P   i     ψ   i   ,      (41)    u   h   =   ∑   i = 1   N     P   i   (    u   i   +    1   N        R   i   −   R   h     ^     ψ   i    ) ,   which coincides with the result in (38) and (39) only for two-noded element where N = 2 . In other words, an attempt to generalise the helicoidal interpolation from (20) and (21) to higher-order elements by using the generalised interpolation from (10) would fail to provide the exact linear result. Remark In [13] it has been shown that (41) may be written as     u   h   =   ∑   i = 1   N     P   i     u   i   −    L   N      ∏   j = 1   N     N   j     ∑   p = 1   N     ( − 1 )   p − 1   (     N − 1     p − 1     )   G   1   ×   ψ   p   ,   where   N   1   =   x   1   / L ,   N   j   = 1 − ( ( N − 1 ) / ( j − 1 ) )   x   1   / L for j = 2 , … , N , and   G   1   is the material unit vector along the beam axis. The meaning of the interpolation functions multiplying the nodal parameters   u   i   and   ∑   p = 1   N     ( − 1 )   p − 1   (   N − 1   p − 1   )   G   1   ×   ψ   p   is shown in Fig. 1 .  Alternatively, a ‘Hermitean-like’ linked interpolation for a Timoshenko beam in 3D may be derived [14], which by-passes the need for the internal nodes, but requires additional problem-dependent terms which depend on the applied loading in order to provide the exact field distribution. In the presently considered non-linear environment, however, the internal nodes shown in Fig. 1 have the potential to offer additional accuracy even for the point loading.  In order to generalise the formulation from (20) and (21) to higher-order elements, the generalised interpolation from (10) may still be used if accordingly modified. In particular, to achieve the desired interpolation for   u   h   in (41), we have to have a generalised interpolation which will result in the linearised form equal to   P   i   ( I + ( 1 / N )     ψ   h   −   ψ   i     ^   ) , rather than the result obtained in (33). This is possible if the generalised interpolation in (16) is modified into  (42)    J   i   =   ∑   j = 1   N     ∑   k = 1   N     Δ   k   ij     Λ   I   {    δ   Ik   [  I − H ( β   Ψ   lh   )   ∑   m = 1   N     P   m     H   − 1   ( β   Ψ   m   l   )  ] + H ( γ   Ψ   lh   )   P   k     H   − 1   ( γ   Ψ   j   l   )  }   Λ   I   T   ,   with β = 1 and γ = 2 / N and used in   r   h   (   x   1   ) =   ∑   i = 1   N     J   i     r   i   . However, if β and γ (which are introduced to provide the most general form) are considered as free parameters alternative interpolations may be obtained. In particular, for β = γ = 1 we thus recover the original interpolation from (16).  As mentioned in Section 2.1, to keep the formulation strain invariant and at the same time make it reduce to the exact form in linear analysis regardless of the number of nodes, it turns out to be necessary to interpolate the rotational changes exactly as in (9), with     I   ˜     i   given in (10). It has to be remembered, however, that such duality goes against the logic of the helicoidal interpolation which was motivated by a desire to make the formulation independent of the choice of the beam reference axis, as explained in Section 2.2.  Furthermore, as stated earlier, the strain invariant interpolation is given as Δ   ϑ   h   =   ∑   i = 1   N       I   ˜     i   Δ   ϑ   i   and   r   h   =   ∑   i = 1   N     P   i     r   i   , not   r   h   =   ∑   i = 1   N       I   ˜     i     r   i   , or in this case the modified interpolation   r   h   =   ∑   i = 1   N     J   i     r   i   . In other words, the latter interpolation is acceptable only if we can prove that it also gives a strain-invariant solution.  To check this, we recall from [7] that a strain invariant interpolation   r   h   must satisfy  (43)      r   ̲     h   =   Λ   R   (   r   R   +   r   h   ) ,   where   Λ   R   and   r   R   are arbitrary constant rotation and translation, respectively, and     r   ̲     h   is the interpolated position of a configuration rotated by   Λ   R   and displaced by   r   R   , such that  (44)      Λ   ̲     i   =   Λ   R     Λ   i   ,      (45)      r   ̲     i   =   Λ   R   (   r   R   +   r   i   ) .      For the interpolation given in (42) we thus have to check if  (46)    ∑   i = 1   N       J   ̲     i       r   ̲     i   =   Λ   R   (    r   R   +   ∑   i = 1   N     J   i     r   i    ) .      Since   Ψ   l   in   J   i   in (42) is a local rotation, which is by definition not affected by any constant rotation, it follows that     J   ̲     i   =   J   i   (   Λ   R   Λ ) =   Λ   R     J   i     Λ   R   T   and we are left to check if  (47)    ∑   i = 1   N     Λ   R     J   i     Λ   R   T     Λ   R   (    r   R   +   r   i    ) =   Λ   R   (    r   R   +   ∑   i = 1   N     J   i     r   i    ) ,   which is equivalent to checking if     ∑   i = 1   N     J   i     r   R   =   r   R   .   Since   r   R   belongs to the null-space of   ∑   i = 1   N     J   i   − I , its rank is zero and the matrix vanishes. In other words the generalised interpolation functions must be complete, i.e.   ∑   i = 1   N     J   i   = I .  The condition for a strain-invariant solution is therefore (note that   ψ   l   =   Λ   I     Ψ   l   )     ∑   i = 1   N     J   i   =   ∑   i = 1   N   {    δ   Ii   [  I − H ( β   ψ   lh   )   ∑   m = 1   N     P   m     H   − 1   ( β   ψ   m   l   )  ] + H ( γ   ψ   lh   )   P   i     H   − 1   ( γ   ψ   i   l   )  } = I ,   i.e.   I − H ( β   ψ   lh   )   ∑   m = 1   N     P   m     H   − 1   ( β   ψ   m   l   ) + H ( γ   ψ   lh   )   ∑   i = 1   N     P   i     H   − 1   ( γ   ψ   i   l   ) = I ,   leading to H ( β   ψ   lh   )   ∑   i = 1   N     P   i     H   − 1   ( β   ψ   i   l   ) = H ( γ   ψ   lh   )   ∑   i = 1   N     P   i     H   − 1   ( γ   ψ   i   l   ) .  The strain-invariance condition therefore is satisfied if β = γ although other solutions may also exist. The resulting interpolation obtained in this way, therefore, has only one free parameter β and can be written in the form:  (48)    J   i   =   δ   Ii   [  I − H ( β   ψ   lh   )   ∑   m = 1   N     P   m     H   − 1   ( β   ψ   m   l   )  ] + H ( β   ψ   lh   )   P   i     H   − 1   ( β   ψ   i   l   ) .      In conclusion, the helicoidal interpolation may be generalised to higher-order elements in the following two ways:  (1)   β = 1 , which provides a same interpolation for the position vector and the rotation matrix and thus gives a solution which is independent of the position of the beam reference axis (see also Section 2.6); this solution, however, does not represent the exact field distribution in the linear limit;    β = 2 / N , which provides the exact field distribution in the linear limit, but fails to provide the solution which is independent of the position of the beam reference axis.  It is obvious from the above presentation that one of the principal motivations for the development of the generalised interpolation (48) lies in the analysis of the conditions for objectivity of the numerical solution [7], which is a problem that exists only in 3D and is solved by introducing the generalised interpolation (9). However, since we here study the implications of applying this result to the interpolation of translations, it makes sense to limit our attention only to 2D, where the complexities of implementation of the kinematics of 3D rotations vanish.  In 2D these results simplify considerably since all the rotations are coaxial. Owing to the structure of matrices H and   H   − 1   , which contain the skew-symmetric matrices of rotational components, it turns out simply that  (49)  Δ   ϑ   h   =   ∑   i = 1   N       I   ˜     i   Δ   ϑ   i   =   ∑   i = 1   N     P   i   Δ   ϑ   i   ,   which means that the total rotations in 2D (let us denote them as φ rather than ϑ ) are interpolated simply as φ ≈   φ   h   =   ∑   i = 1   N     P   i     φ   i   .  After the node I has been chosen, the rigid rotation from   Λ   r   in (4) is simply  (50)    φ   r   =   φ   I     and the local nodal rotations are obtained as  (51)    φ   i   l   =   φ   i   −   φ   I   ,   while the interpolated local rotations are  (52)    φ   lh   =   φ   h   −   φ   I   =   ∑   i = 1   N     P   i     φ   i   −   ∑   i = 1   N     P   i     φ   I   =   ∑   i = 1   N     P   i     φ   i   l   .      Since all the rotations are planar, note that   ψ   l   and   Ψ   l   in   J   i   are the same, and in 2D we have denoted them as   φ   l   .  Since all the rotations are coaxial (   φ   h   =   φ   h     e   3   ,   φ   i   =   φ   i     e   3   ,   φ   I   =   φ   I     e   3   ,   φ   lh   =   φ   lh     e   3   ,   φ   i   l   =   φ   i   l     e   3   , where   e   3   is a unit vector orthogonal to the plane of the problem), the products of matrices H ( β   φ   lh   ) and   H   − 1   ( β   φ   m   l   ) in   J   i   in (48) simplify.  Denoting     e   3   = {     0     0     1     } ⟺     e   ^     3   = [     0   − 1   0     1   0   0     0   0   0     ] ,   these matrices become  (53)  H ( β   φ   lh   ) = I +    1 − cos  β   φ   lh     β   φ   lh          e   ^     3   +    β   φ   lh   − sin  β   φ   lh     β   φ   lh        (     e   ^     3   )   2   ,      (54)    H   − 1   ( β   φ   m   l   ) = I −    β   φ   m   l     2        e   ^     3   −    1   2       β   φ   m   l    sin  β   φ   m   l   + 2  cos  β   φ   m   l   − 2   1 − cos  β   φ   m   l        (     e   ^     3   )   2     and noting that   J   i   only ever multiplies the position vector, which only has the first two components different from zero, we may introduce   e   ^   = [   0   1     − 1   0   ] , where   (   e   ^   )   2   = − I . Finally in 2D, matrices H ( β   φ   lh   ) and   H   − 1   ( β   φ   m   l   ) can be written as  (55)  H ( β   φ   lh   ) =    sin  β   φ   lh     β   φ   lh      I +    1 − cos  β   φ   lh     β   φ   lh        e   ^   ,      (56)    H   − 1   ( β   φ   m   l   ) =    β   φ   m   l     2       sin  β   φ   m   l     1 − cos  β   φ   m   l      I −    β   φ   m   l     2      e   ^   .      Let us analyse the product H ( β   φ   lh   )   H   − 1   ( β   φ   m   l   ) in expression (48). From (55) and (56) it follows  (57)  H ( β   φ   lh   )   H   − 1   ( β   φ   m   l   ) =    β   φ   m   l     2    (     sin  β   φ   lh     β   φ   lh      I +    1 − cos  β   φ   lh     β   φ   lh        e   ^    ) (     sin  β   φ   m   l     1 − cos  β   φ   m   l      I −   e   ^    ) .      Using the double angle trigonometric transformations, and the relations   φ   lh   =   φ   h   −   φ   I   and   φ   m   l   =   φ   m   −   φ   I   , we finally have the following result expressed in terms of the actual rotational unknowns   φ   1   , … ,   φ   N   :  (58)  H ( β   φ   lh   )   H   − 1   ( β   φ   m   l   ) =       sin     β   φ   lh     2         β   φ   lh     2            sin     β   φ   m   l     2         β   φ   m   l     2          [  cos (  β      φ   h   −   φ   m     2     ) I + sin (  β      φ   h   −   φ   m     2     )   e   ^    ] .      Taking the above result and substituting it into (48), gives  (59)    J   i   =   δ   Ii   (  I −   ∑   m = 1   N     N   m    ) +   N   i   ,   with  (60)    N   i   =   P   i         sin (  β      φ   h   −   φ   I     2     )   β      φ   h   −   φ   I     2            sin (  β      φ   i   −   φ   I     2     )   β      φ   i   −   φ   I     2          [  cos (  β      φ   h   −   φ   i     2     ) I + sin (  β      φ   h   −   φ   i     2     )   e   ^    ] .      Introducing substitutions   ψ   h   = β (   φ   h   −   φ   I   ) / 2 and   ψ   i   = β (   φ   i   −   φ   I   ) / 2 this may be further compacted to  (61)    N   i   =   P   i         sin    ψ   h       ψ   h           sin    ψ   i       ψ   i         [ cos (   ψ   h   −   ψ   i   ) I + sin (   ψ   h   −   ψ   i   )   e   ^   ] ,   where the result in the brackets is the 2D orthogonal tensor of rotation   ψ   h   −   ψ   i   .  Note that the above result is well defined in the limit when   φ   i   →   φ   I   ⟺   ψ   i   → 0 :     lim     ψ   i   → 0     N   i   =   P   i      sin    ψ   h       ψ   h      ( cos    ψ   h   I + sin    ψ   h     e   ^   ) .      If   ψ   h   → 0 , too,   N   i   obviously reduces to the Lagrangian interpolation.  Here we derive the conditions under which the solution of the beam problem does not depend on the chosen reference axis. Two different reference axes will be considered, denoted as   p   0   and   p   c   in Fig. 2 .  The position vector in the undeformed state R can be defined with respect to both reference lines as  (62)  R ( x ) =   R   0   (   x   1   ) +   Λ   0     Y   0   (   x   2   ,   x   3   ) =   R   c   (   x   1   ) +   Λ   0     Y   c   (   x   2   ,   x   3   ) ,   where   R   0   is the position vector of the point on the reference line   p   0   in a cross-section,   R   c   is the position vector of the point on the reference line   p   c   in the cross-section considered, E is the position vector of the point on reference line   p   c   with respect to the point on   p   0   ,   Λ   0   is the initial rotation matrix defining orientation of the cross-section,   Y   0   is the position vector of the observed point in the cross-section with respect to the point on   p   0   , and   Y   c   is the position vector of the observed point with respect to the point on   p   c   .  From (62) there follows  (63)    Y   0   −   Y   c   =   Λ   0   T   (   R   c   −   R   0   ) .      Further, the position vector in the deformed state can also be written with respect to both these axes as follows:  (64)  r ( x ) =   r   0   (   x   1   ) + Λ   Y   0   (   x   2   ,   x   3   ) =   r   c   (   x   1   ) + Λ   Y   c   (   x   2   ,   x   3   ) .      Let us now assume an orientation-dependent interpolation     C   ˜     i   (   Λ   h   (   x   1   ) ,   x   1   ) for the position of a chosen reference line, i.e.  (65)    r   0   (   x   1   ) =   ∑   i = 1   N       C   ˜     i     r   0 , i        (66)    r   c   (   x   1   ) =   ∑   i = 1   N       C   ˜     i     r   c , i   .      Using (65) and (66), (64) can be written as     ∑   i = 1   N       C   ˜     i   (   x   1   )   r   0 , i   + Λ (   x   1   )   Y   0   (   x   2   ,   x   3   ) =   ∑   i = 1   N       C   ˜     i   (   x   1   )   r   c , i   + Λ (   x   1   )   Y   c   (   x   2   ,   x   3   )      Since   r   0 , i   =   r   c , i   −   Λ   i   E and   Y   0   = E +   Y   c   , the above expression reduces to  (67)  (  Λ −   ∑   i = 1   N       C   ˜     i     Λ   i    ) E = 0 .      This expression has to be satisfied for any E , therefore  (68)  Λ =   ∑   i = 1   N       C   ˜     i     Λ   i   .      This is the condition that has to be satisfied if a solution is to be independent of the choice of the beam reference axis. In other words, such a solution is possible only if the same interpolation functions are used to interpolate both the position vector field and the rotation tensor field.  The configuration-dependent interpolation derived will be now illustrated and compared to the Lagrangian interpolation polynomials for a two-noded and a three-noded element.  If a reference node I is chosen to be the left node of a two-noded element ( I = 1 ), interpolation matrices   J   1   and   J   2   are obtained from (59) as     J   1   = I −   N   2    and    J   2   =   N   2   ,   where   N   2   is calculated from (61) for   ψ   1   = 0 ,   ψ   h   =   P   2     ψ   2   ,   P   1   = 1 −   x   1   / L and   P   2   =   x   1   / L and various values of   ψ   2   = ( β / 2 ) (   φ   2   −   φ   1   ) . The matrix function   N   2   is for a planar problem a two-dimensional tensor with its components given in Fig. 3 as functions of x 1. Different line-types are used to illustrate these functions for different values of   ψ   2   ( 0 , π / 3  and  π / 2 ). As expected, for   ψ   2   = 0 ,   J   1   and   J   2   coincide with the Lagrangian polynomials P 1 and P 2. As   ψ   2   increases the diagonal terms in   N   2   increasingly deviate from   P   2   =   x   1   / L , while the off-diagonal terms also grow from the initial zero value.  In this case the reference node is chosen to be the middle node of the element ( I = 2 ). The configuration-dependent interpolation   J   1   ,   J   2    and    J   3   follow from (59) as     J   1   =   N   1   ,    J   2   = I −   N   1   −   N   3    and    J   3   =   N   3   ,   where matrices   N   1   and   N   3   are calculated from (61). To simplify the calculation, the local rotations of the first and the last node are taken to be equal in magnitude and of an opposite sign. The components of   J   1   ,   J   2   and   J   3   are shown in Figs. 4–6   for three different values of   ψ   1   = −   ψ   3   ( 0 , π / 6 , π / 4 ) . Again, it can be observed that, for a zero local rotation, the proposed interpolation functions coincide with the Lagrangian polynomials  x  1   2   = 1 − 3   x   1   / L + 2   x   2   /   L   2   ,  x  1   2   = 4   x   1   / L − 4   x   2   /   L   2   and  x  1   2   = −   x   1   / L + 2   x   2   /   L   2   . Obviously, the departure of the proposed interpolation from the Lagrangian interpolation is in this element far smaller than in the two-node element.  A straight beam (Fig. 7 ) of a length L and a uniform cross-sectional area A is considered.  The beam axis is taken to be a straight line which coincides with the   x   1   -axis of the Cartesian frame with the orthonormal unit base vectors   g   1 , 0   ,   g   2 , 0   ,   g   3 , 0   . The orthonormal triad   e   1   ,   e   2   ,   e   3   defines spatial frame. These two frames are connected with the initial rotational matrix   Λ   0   which depends only on the angle of inclination of the beam in the undeformed state. Equation that defines connection between these two frames is given by     g   i , 0   =   Λ   0     e   i   ,  i = 1 , 2 , 3 .   A similar connection can be defined for the orientation of the cross-section in the deformed configuration as     g   i   = Λ   e   i   ,  i = 1 , 2 , 3 ,   where   g   i   is the orthonormal triad that defines the cross-section in the deformed configuration and Λ is the rotation matrix in the deformed state. The first member of this triad   g   1   is perpendicular to the plane of the cross-section while the other two members   g   2   ,   g   3   are situated within the plane of the cross-section, along the principal axes of the cross-section.  The position vector x of an arbitrary point of the deformed beam is defined by three parameters (   x   1   ,   x   2   ,   x   3   ) where the first one is the coordinate of the length along the axis of the beam and the other two are the coordinates of the cross-section for the given   x   1   . This can be written by an equation  (69)  x = r + Λ {     0       x   2         x   3       } ,   where r is the position vector of the point on the deformed axis of the beam and   〈 0    x   2      x   3   〉   T   is the material position of the considered point with respect to the intersection of the reference line with the cross-section. In this way the kinematics of the beam is completely defined by a position vector on the axis of the beam and the orientation of the cross section ( r , Λ ). Further, the position vector r (   x   1   ) can be expressed in terms of the displacement vector u (   x   1   ) and the position vector of the point on the axis of the beam in the undeformed state R (   x   1   ) as r (   x   1   ) = R (   x   1   ) + u (   x   1   ) .  Strain measures of the Reissner–Simo beam theory are given in [1] as  (70)  Γ =   Λ   T   r ′ −   E   1   ,   κ   ^   =   Λ   T   Λ ′ ,   where Γ is a vector of translational strain measures made up of one axial ( ε ) and two shear strains (   γ   2   ,   γ   3   ). Matrix of rotational strain measures is represented with a symbol   κ   ^   and it consists of one torsional (   κ   1   ) and two bending strains (   κ   2   ,   κ   3   ). Here and throughout the text a dash (’) denotes the derivative d /   dx   1   and the material vector   E   1   = {    1     0     0    } .  The constitutive law for a linear elastic material is given by     F   N   =   C   N   Γ ,    F   M   =   C   M   κ ,   where, for the beam reference axis coinciding with the centroidal axis,   C   N   = diag ( EA ,   GA   2   ,   GA   3   ) and   C   M   = diag (   GI   t   ,   EI   2   ,   EI   3   ) are constant constitutive matrices of a linear elastic material. Here, E and G denote Young's and shear modulus of the material, A is the cross-sectional area,   A   2   and   A   3   are the shear areas of the cross section,   I   t   is the torsional constant and   I   2   and   I   3   are the second moments of area of the cross section.  To apply the interpolation derived in the previous section, we consider the Reissner–Simo beam [2] with the strain energy  (71)  ϕ =    1   2      ∫   0   L   〈   Γ   T     κ   T   〉 {       F   N         F   M       }    dx   1     and the potential of the applied loading  (72)  U =   ∫   0   L   〈   u   T     ϑ   T   〉 {       n   ¯         m   ¯       }    dx   1   + 〈   u   0   T     ϑ   0   T   〉 {         F   ¯     N 0           F   ¯     M 0       } + 〈   u   L   T     ϑ   L   T   〉 {         F   ¯     NL           F   ¯     ML       } ,   where   n   ¯   ,   m   ¯   are the distributed force and moment loading, and     F   ¯     N 0   ,     F   ¯     M 0   ,     F   ¯     NL   ,     F   ¯     ML   are the endpoint concentrated force and moment loadings. Here,   u   0   ,   u   L   denote endpoint displacement vectors, while   ϑ   0   ,   ϑ   L   denote endpoint rotation vectors. Note that the potential in (72) makes sense only for conservative loading and in 3D the applied moments are very often non-conservative.  For conservative loading, the equilibrium follows from the requirement that the variation of the total potential energy should be zero:  (73)  δ ( ϕ − U ) = 0 ⟺   ∫   0   L   〈 δ   Γ   T   δ   κ   T   〉 {       F   N         F   M       }    dx   1   − δ U = 0 ,   with  (74)  δ U =   ∫   0   L   〈 δ   r   T   δ   ϑ   T   〉 {       n   ¯         m   ¯       }    dx   1   + 〈 δ   r   0   T   δ   ϑ   0   T   〉 {         F   ¯     N 0           F   ¯     M 0       } + 〈 δ   r   L   T   δ   ϑ   L   T   〉 {         F   ¯     NL           F   ¯     ML       } .      Strain measures of a 2D problem contain only one shear strain   γ   2   = γ and one bending strain   κ   3   = κ , hence the strain measures given in (70) can be simplified and written in an expanded form as  (75)  {     ε     γ     κ     } = [     cos (   φ   0   + φ )   sin (   φ   0   + φ )   0     − sin (   φ   0   + φ )   cos (   φ   0   + φ )   0     0   0   1     ] {     cos    φ   0   + u ′     sin    φ   0   + v ′     φ ′     } − {     1     0     0     } ,   where   φ   0   is the initial slope of the beam in the undeformed state.  The variation of the strain energy is  (76)  δ ϕ ≈ δ   ϕ   h   =   ∫   0   L   〈 δ   r   T   δ φ 〉 [       I   2      d     dx   1          0   2         r   ′ T     e   ^        d     dx   1          ] [     Λ     0   2         0   2   T     1     ] {       F   N         F   M       }    dx   1   ,   with   0   2   as the two-dimensional null-vector. After application of interpolation of δ r and δ φ , the above becomes   δ ϕ = δ   p   T     q   i   = 〈 δ   p   1   T   ⋯ δ   p   N   T   〉 {       q   i , 1       ⋮       q   i , N       } =   ∑   j = 1   N   δ   p   j   T     q   i , j   ,   where   δ   p   j   = {     δ   r   j       δ   φ   j       } .      To find the internal force vector at a node j,   q   i , j   , our interpolation will be introduced  (77)  r ≈   r   h   =   ∑   i = 1   N     J   i     r   i   ,      (78)  φ ≈   φ   h   =   ∑   i = 1   N     P   i     φ   i   ,   with   J   i   given in (59). Obviously,   δ φ ≈ δ   φ   h   =   ∑   i = 1   N     P   i   δ   φ   i   ,   while   δ r ≈ δ   r   h   =   ∑   i = 1   N   ( δ   J   i     r   i   +   J   i   δ   r   i   ) =   ∑   i = 1   N     J   i   δ   r   i   +   ∑   i = 1   N   δ   J   i     r   i   .      In order to write the complete variation of   J   i   given by (59), variation of the function   N   i   will be needed.  Variation of the function   N   i   is  (79)  δ   N   i   =    β   2      N   i     ∑   k = 1   N     M   ik   δ   φ   k   ,   where (see Appendix A for the derivation)  (80)    M   ik   =   P   k   ( −   f   h   I +   e   ^   ) + (   f   i   I −   e   ^   )   δ   ik   −   δ   Ik   (   f   i   −   f   h   ) I ,   with     f   i   =    1     ψ   i      −    cos    ψ   i     sin    ψ   i       and    f   h   =    1     ψ   h      −    cos    ψ   h     sin    ψ   h      .      Variation of the interpolation function   J   i   is  (81)  δ   J   i   =   ∑   k = 1   N     Q   ik   δ   φ   k   ,   where  (82)    Q   ik   =    β   2    (    N   i     M   ik   −   δ   Ii     ∑   m = 1   N     N   m     M   mk    ) .   Further   δ   J   i     r   i   =   ∑   k = 1   N     Q   ik     r   i   δ   φ   k   = [    Q   i 1     r   i      Q   i 2     r   i    ⋯    Q   iN     r   i    ] {     δ   φ   1       δ   φ   2       ⋮     δ   φ   N       }   and  (83)  δ r ≈ δ   r   h   =   ∑   i = 1   N   (   J   i   δ   r   i   + δ   J   i     r   i   ) = [ [   J   1     j   1   ]  ⋯  [   J   N     j   N   ] ] {     {     δ   r   1       δ   φ   1       }     ⋮     {     δ   r   N       δ   φ   N       }     } ,   where  (84)    j   k   =   ∑   i = 1   N     Q   ik     r   i   =    β   2      ∑   i = 1   N     N   i     M   ik   (   r   i   −   r   I   ) .      Note that, in linear analysis, (83) reads   δ   r   h   =   ∑   i = 1   N     P   i   [  δ   r   i   +    β   2      e   ^   (   R   h   −   R   i   ) δ   φ   i    ] ,   which for β = 2 / N coincides with the variation of (41) thus confirming that the linked interpolation is a limiting case of the configuration-dependent interpolation with β = 2 / N in linear analysis.  Let us introduce the following notation:  (85)  {     δ r     δ φ     } =   ∑   j = 1   N     K   j   δ   p   j   ,   where  (86)  δ   p   j   = {     δ   r   j       δ   φ   j       }   and  (87)    K   j   = [       J   j       j   j         0   2   T       I   j       ] ,   as well as the matrices of Reissner's beam theory [15]   (88)  D = [       I   2      d     dx   1        −   e   ^   r ′       0   2   T        d     dx   1          ] ,  L = [     Λ     0   2         0   2   T     1     ] ,  S = {       F   N         F   M       } ,   where   0   2   is a two-dimensional null vector and   I   2   is a two-dimensional unity matrix. With this notation, the strain-energy variation may be expressed as  (89)  δ ϕ ≈ δ   ϕ   h   =   ∑   j = 1   N   δ   p   j   T     ∫   0   L     (   DK   j   )   T   LS    dx   1   =   ∑   j = 1   N   δ   p   j   T     q   i , j   .      The vector of the internal forces   q   i , j   at node j is given as  (90)    q   i , j   =   ∫   0   L     B   j   T   LS    dx   1   ,   with  (91)    B   j   =   DK   j   = [       J   j   ′       ∑   i = 1   N     Q   ij   ′     r   i   −   e   ^     P   j   r ′       0   2   T       P   j   ′       ] = [       J   j   ′       j   j   ′   −   e   ^     P   j   r ′       0   2   T       P   j   ′       ] ,      (92)    J   j   ′   =   N   j   ′   −   δ   Ij     ∑   m = 1   N     N   m   ′   ,      (93)    N   j   ′   =   N   j   [  (       P   j   ′       P   j      −   f   h     ψ   h ′    ) I +   ψ   h ′     e   ^    ] ,      (94)    ψ   h ′   =    β   2      ∑   p = 1   N     P   p   ′     φ   p   ,      (95)    Q   ij   ′   =    β   2    [    N   i   ′     M   ij   +   N   i     M   ij   ′   −   δ   Ii     ∑   m = 1   N   (   N   m   ′     M   mj   +   N   m     M   mj   ′   )  ] ,      (96)    M   ij   ′   =   P   j   ′   ( −   f   h   I +   e   ^   ) + (   δ   Ij   −   P   j   )   f   h ′   I ,      (97)    f   h ′   = − (     1     (   ψ   h   )   2      −    1     sin   2      ψ   h       )   ψ   h ′   = −     g   ˜     h     ψ   h ′   ,      (98)      g   ˜     h   =    1     (   ψ   h   )   2      −    1     sin   2      ψ   h      ,      (99)  r ′ =   ∑   j = 1   N     J   j   ′     r   j   ,      (100)    j   j   ′   =   ∑   i = 1   N     P   ij   ′     r   i   .      The nodal equilibrium  (101)    g   j   ≡   q   i , j   −   q   e , j   = 0   is to be established iteratively via  (102)    ∑   k = 1   N     K   jk   Δ   p   k   = −   g   j   ,   where   q   i , j   is the vector of the internal forces at node j,   q   e , j   is the vector of the external forces at node j and   K   jk   is the stiffness matrix relating the change in   p   k   to the change of   q   i , j   .  In order to obtain the stiffness matrix of the finite element, it is necessary to carry out the linearisation of the vector of the internal forces   q   i , j   given by (90).  Linearisation of the vector of the internal forces can be performed as follows:  (103)  Δ   q   i , j   =   ∫   0   L   ( Δ   B   j   T   LS +   B   j   T   Δ LS +   B   j   T   L Δ S )    dx   1   .   Denoting Δ   B   j   as Δ   B   j   = Δ   B   1 j   + Δ   B   2 j   with  (104)  Δ   B   1 j   = [     Δ   J   j   ′     Δ   j   j   ′         0   2   T     0     ] ,      (105)  Δ   B   2 j   = [     0   −   e   ^     I   j   Δ r ′       0   2   T     0     ] ,   we may separate the geometric from the configuration-dependent influences in   B   j   , i.e.  (106)  Δ   q   i , j   =   ∫   0   L   Δ   B   1 j   T   LS    dx   1   +   ∫   0   L   Δ   B   2 j   T   LS    dx   1   +   ∫   0   L     B   j   T   Δ LS    dx   1   +   ∫   0   L     B   j   T   L Δ S    dx   1   =   ∑   k = 1   N     K   jk   CD   Δ   p   k   +   ∑   k = 1   N     K   jk   G   Δ   p   k   +   ∑   k = 1   N     K   jk   M   Δ   p   k   .      The first term in the above expression leads to the configuration-dependent part, the next two terms lead to the geometric part and the last leads to the material part of the stiffness matrix.   K   jk   M   and   K   jk   G   are the standard material and geometric nodal stiffness matrix blocks where, however, the strain measures are computed from the interpolated position vector r as given in (77).  Since S depends linearly on the strain measures, the last term in Δ   q   i , j   turns out to be     ∫   0   L     B   j   T   L Δ S    dx   1   =   ∑   k = 1   N     ∫   0   L     B   j   T     LCL   T     B   k      dx   1   Δ   p   k   ,   where C = diag ( EA ,   GA   s   , EI ) is a constitutive matrix for the 2D problem analysed and the material part of the stiffness matrix block is given as  (107)    K   jk   M   =   ∫   0   L     B   j   T     LCL   T     B   k      dx   1   ,   with   B   j   given in (91).  The geometric part of the stiffness matrix block also follows using the standard procedure (see Appendix B):  (108)    K   jk   G   =   ∫   0   L     (   D   2     K   j   )   T   G (   D   2     K   k   )    dx   1   ,   where matrices   D   2   and G introduced in [15] are given as  (109)    D   2   = [        d     dx   1        0   0     0      d     dx   1        0     0   0   1     ] ,      (110)  G = [     0   0   − t     0   0   n     − t   n   − t ( v ′ + sin    φ   0   ) − n ( u ′ + cos    φ   0   )     ] ,   with spatial stress resultants n , t defined as  (111)  n = {     n     t     } = Λ [     EA   0     0     GA   s       ] {     ε     γ     } .      The configuration-dependent part of the stiffness matrix block given by the first term in (106) will be derived from (104) .  From (92), Δ   J   j   ′   follows as   Δ   J   j   ′   = Δ   N   j   ′   −   δ   Ij     ∑   m = 1   N   Δ   N   m   ′ ,       Δ   N   j   =    β   2      N   j     ∑   k = 1   N     M   jk   Δ   φ   k   ,       Δ   N   j   ′   =    β   2      ∑   k = 1   N   (    N   j   ′     M   jk   +   N   j     M   jk   ′  ) Δ   φ   k   =    β   2      N   j     ∑   k = 1   N     T   jk   Δ   φ   k   ,         T   jk   = (       P   j   ′       P   j      +   ψ   h ′   ( −   f   h   I +   e   ^   )  )   M   jk   +   M   jk   ′ ,      (112)  Δ   J   j   ′   =    β   2      ∑   k = 1   N   (    N   j     T   jk   −   δ   Ij     ∑   m = 1   N     N   m     T   mk    ) Δ   φ   k   =   ∑   k = 1   N     Z   jk   Δ   φ   k   .   Here  (113)    Z   jk   =    β   2    (    N   j     T   jk   −   δ   Ij     ∑   m = 1   N     N   m     T   mk    ) =    β   2    [  (   N   j     M   jk   ) ′ −   δ   Ij     ∑   m = 1   N   (   N   m     M   mk   ) ′  ] .      From (95) and (100), Δ   j   j   ′   follows as  (114)  Δ   j   j   ′   =    β   2      ∑   p = 1   N   ( Δ   N   p   ′     M   pj   +   N   p   ′   Δ   M   pj   + Δ   N   p     M   pj   ′   +   N   p   Δ   M   pj   ′   ) (   r   p   −   r   I   ) +    β   2      ∑   p = 1   N   (   N   p   ′     M   pj   +   N   p     M   pj   ′   ) ( Δ   r   p   − Δ   r   I   ) ,   with   Δ   M   pj   =    β   2      ∑   k = 1   N     V   jk   p   Δ   φ   k   ,         V   jk   p   = [  (   P   j   −   δ   Ij   )   g   h   (   P   k   −   δ   Ik   ) −   g   p   (   δ   pj   −   δ   Ij   ) (   δ   pk   −   δ   Ik   )  ] I ,       Δ   M   pj   ′   =    β   2      ∑   k = 1   N     V   jk   p ′   Δ   φ   k   ,      (115)    V   jk   p ′   = [  (   P   j   ′     g   h   +   P   j     g   h ′   −   δ   Ij     g   h ′   ) (   P   k   −   δ   Ik   ) + (   P   j   −   δ   Ij   )   P   k   ′   g   h   )  ] I .   In the upper equation   g   h ′   = − 2   ψ   h ′     h   h   , where   h   h   = 1 /   (   ψ   h   )   3   − cos    ψ   h   /   sin   3      ψ   h   .  Eq. (114) now turns into  (116)  Δ   j   j   ′   =   ∑   k = 1   N     f   jk   Δ   φ   k   +   ∑   k = 1   N     R   jk   Δ   r   k     with  (117)    f   jk   =      β   2     4      ∑   p = 1   N   [   N   p   (   T   pk     M   pj   +   M   pk     M   pj   ′   +   V   jk   p ′   ) +   N   p   ′     V   jk   p   ] (   r   p   −   r   I   )   and  (118)    R   jk   =    β   2    [  (   N   k     M   kj   ) ′ −   δ   Ik     ∑   m = 1   N   (   N   m     M   mj   ) ′  ] .      Finally, the configuration-dependent part of the stiffness matrix block is given as  (119)    K   jk   CD   =   ∫   0   L   [       0   2 x 2       Z   jk   T   n       n   T     R   jk     f     ]    dx   1     with f =   f   jk   T   n and n given in (111).  All numerical examples will be calculated using three different interpolations: the Lagrangian interpolation, linked interpolation introduced in [13] and the new configuration-dependent interpolation (CDI) proposed here. To summarise, between themselves, these interpolations differ in as much as they assume different approximation of the position field as follows:      Lagrangian :    r   h   =   ∑   i = 1   N     P   i     r   i       Linked :    r   h   =   ∑   i = 1   N     P   i   [   r   i   + ( 1 / N )   e   ^   (   R   h   −   R   i   )   φ   i   ]     CDI :    r   h   =   ∑   i = 1   N   [   δ   iI   ( I −   ∑   m = 1   N     N   m   ) +   N   i   ]   r   i   ,      with   R   h   =   ∑   i = 1   N     P   i     R   i   ,   φ   h   =   ∑   i = 1   N     P   i     φ   i   and   N   i   given in (61).  In the tables with results the number behind the name of the interpolation is the number of nodes per element. The stiffness matrix and the internal force vector will be calculated using the full integration as well as the reduced integration. The full integration uses N points, where N is the number of nodes per element, while reduced integration uses N − 1 points. Note that the linked interpolation was originally conceived for application in linear analysis. Here, its application will be tested on examples in non-linear analysis.  When configuration-dependent interpolation is employed, examples will be calculated with both β = 1 and β = 2 / N . In the first case, the interpolation takes the form of the one introduced in [7], but here employed for interpolation of the position vector r , and gives results which are independent of the choice of the beam reference line. When β = 2 / N the interpolation function takes the form which provides exact solution in the linear analysis.  This example was solved analytically by Jenkins et al. [16] using elliptic integrals. Mattiasson [17] performed the numerical evaluation of the elliptic integrals thus providing a valuable test for finite element formulations considering large deflections.  The problem is shown in Fig. 8 and has been solved using two elements only, one per each leg. The number of nodes per element is variable and the stiffness matrix and the internal force vector are calculated using both full and reduced integration. The Newton–Raphson iterative solution procedure is considered to have converged when the displacement norm has become less than   10   − 12   . Geometrical and material characteristics are given as follows: length of each leg is L = 1 , Young's modulus E = 1 , the shear modulus G = 10 E , the second moment of area I = 1 and the area of the cross section as well as the shear area is A = 1000 . The reason for such a large shear area lies in the reference solution [17] given for the case of Euler's elastica ( A → ∞ ,    A   s   → ∞ ) and the results obtained here can only model these properties approximately. As a result, the extension dominated displacement v does not converge towards the reference solution.  The results are compared to the exact ones given in [17] for the maximum ratio   PL   2   / EI = 10 with n load steps employed, as shown in Table 1 .  Mattiasson [17] gave results for the horizontal displacement of the middle node (node 2 in Fig. 8) and the vertical displacement and rotation of the loaded node (node 3 in Fig. 8). Table 1 shows the reference solution as well as our results. The reference node in the configuration-dependent interpolation has been set to I = 1 for CDI2, I = 2 for CDI3 and CDI4 and I = 3 for CDI5.  From Table 1 it can be seen that the results for Lagrangian and linked interpolation are identical when reduced integration is employed. This induces us to conclude that the value of the functions in integrals which define the stiffness matrix and the internal force vector in these Gaussian points is identical. An interesting property occurs with linear configuration-dependent element (CDI2) which shows no sensitivity to the number of the integration points, meaning that the reduced and the full integration give identical result which is a known result [10]. As expected, the accuracy increases as the number of nodes increases. Also, all elements, except Lagrangian 2 with full integration, show some degree of resistance to shear locking. Locking is also obvious in the Linked 2 element with full integration, but to a smaller extent. CDI elements show very little difference between full and reduced integration. The difference in cases when β = 1 and β = 2 / N reduces as the number of nodes per element increases.  Problem of buckling of a hinged right-angle frame was considered in [2,18]. The second moment of area, the area and the shear area of the cross section are I = 2 , A = 6 ,   A   s   = A / 1.2 , respectively, and the length of each leg is l = 120 . The value of Young's modulus is E = 7.2 ×   10   6   and Poisson's ratio is 0.3. The frame will be modelled using 10 elements, five per leg, and the number of nodes per element is variable from two to five nodes. The horizontal leg of the frame is loaded with a point force P=15000 at l/5 applied in one load step only. Fig. 9 shows deformation lines for various values of loading force P = 8000 , 15  000 , 17  000 .  The reference solution for this example is obtained using 100 Lagrangian quadratic elements [15], 50 per leg with reduced Gaussian integration employed for evaluation of the stiffness matrix and the internal force vector. The displacements of the loaded node are given in Table 2 . The Newton–Raphson solution procedure tolerance is set to   10   − 12   for the displacement norm.  As expected, reduced integration shows good behaviour in case when Lagrangian and linked interpolation is applied on three-to-five-noded elements, while full integration shows quite poor behaviour for both these interpolations in case when the number of nodes on an element is two or three. Naturally, higher-order elements give better results.  When CDI2 is applied, full and reduced integration give identical results as shown in the previous example. Also, for higher-order elements the difference between these two integrations becomes smaller as the number of nodes increases.  When comparing the CDI results for a higher-order element with different β between themselves, let us recall that β = 1 gives a solution independent of the position of the beam reference axis, but fails to provide the exact field distribution in linear analysis, while β = 2 / N has exactly the opposite properties. It turns out that for highly non-linear problems like the present one, the former option is preferable. For the problems approaching the linear case, say with P = 1000 instead of P = 15  000 , it is expected that the latter option ( β = 2 / N ) is more accurate. Table 3 confirms that it really is so and that the results for β = 2 / N approach those of the linked interpolation and are less affected by an application of the full integration. Only three-noded element has been reviewed since the higher order elements show less sensitivity to coefficient β .  It can be stated that the effect of coefficient β is also configuration dependent, meaning that as the calculation is getting closer to linear analysis, the use of β = 2 / N is becoming increasingly justified. In contrast to the Lagrangian and linked interpolation, however, configuration-dependent interpolation shows very good behaviour when full integration is used, regardless of the choice of β and the order of element.  On the basis of these results, it appears that an improvement in the definition of the configuration-dependent interpolation may be possible through redefinition of the coefficient β such that it would be equal to 2 / N in the linear case and tend towards the unity as the deformation overall progresses.  The problem of a deep circular hinged-clamped arch shown in Fig. 10 has been considered by many authors [15,19,20] and the exact solution for the critical force, based on the Kirchhoff–Love theory, is given by DaDeppo and Schmidt [19].  The problem will be approximated using 40 straight beam elements of different order with the following characteristics: the value of Young's modulus E = 1 ×   10   8   , Poisson's ratio ν = 0.5 , the second moment of area and the area of the cross section are respectively I = 0.01 and A = 1 , the radius of the arch is R = 100 and the subtending angle of the arch is α = 215 ° . According to the Kirchhoff–Love theory, the critical force that causes this arch to buckle matches the value of 897 [19]. Approximately 80% of the value of this critical force ( P = 700 ) will be used as a loading force at the apex of the arch and the displacements and rotation of the loaded point will be compared using different interpolation functions with the reference solution obtained using 100 Lagrangian linear elements, with reduced Gaussian integration employed for evaluation of the stiffness matrix and the internal force vector. Results are obtained in two load steps and are given in Table 4 . The Newton–Raphson tolerance has been set to   10   − 12   for the displacement norm.  The conclusions drawn from the previous two examples are confirmed by this example. The three-noded elements with different β are now again tested for a smaller value of the force P = 150 . The results are shown in Table 5 .  The full integration with β = 2 / N gives better results than when β = 1 , while the reduced integration gives almost identical solutions for both coefficients.  In the present work two variants of the higher-order configuration-dependent interpolation have been derived in order to preserve an important underlying property of the mechanical problem:  (1) the configuration-dependent interpolation invariant to the beam reference axis,  the configuration-dependent interpolation providing exact field distribution in the limit of the analysis becoming linear.  These two properties cannot be preserved at the same time unless the element is of the lowest order, i.e. the original helicoidal element of [8]. A potential to do so, however, exists and will be investigated in our future work.  The additional numerical overhead in the configuration-dependent interpolation is fully contained within the element formulation, does not introduce additional degrees of freedom (the elements may only have additional internal nodes), and only requires computation of an additional part of the global element tangent stiffness matrix.  In general, the following conclusions may be drawn:  1. The configuration-dependent interpolation practically does not suffer from shear locking regardless of the order of element and the order of numerical quadrature.  In spite of that the results obtained using a reduced integration are better than those using the full integration.  The linked interpolation is more vulnerable to shear locking when using full integration than the configuration-dependent interpolation, but less vulnerable than the Lagrangian interpolation.  The linked interpolation with reduced integration gives the same nodal results as the Lagrangian interpolation with reduced integration.  Generally, the configuration-dependent interpolation gives only marginally better results for the nodal unknowns than the Lagrangian interpolation.  The variant of the configuration-dependent interpolation which gives the result independent of the position of the beam reference axis is generally more accurate than the variant which provides the exact field-distribution in linear analysis; the situation is reversed as the results become closer to the linear results, in particular with full integration.  As the configuration-dependent interpolation is virtually free of shear locking, it has a potential to be used in various problems in material non-linearity (including local effects) where higher-order quadrature may be needed.   ACKNOWLEDGEMENT   The results shown here were obtained within the scientific project no. 114-0000000-3025: “Improved accuracy in non-linear beam elements with finite 3D rotations” financially supported by the Ministry of Science, Education and Sports of the Republic of Croatia.  Function   N   i   is given by the expression     N   i   =   P   i        ψ   i    sin    ψ   h       ψ   h    sin    ψ   i      [  cos (   ψ   h   −   ψ   i   ) I + sin (   ψ   h   −   ψ   i   )   e   ^    ] =   P   i   k X ,   where   k =      ψ   i    sin    ψ   h       ψ   h    sin    ψ   i        and   X = cos (   ψ   h   −   ψ   i   ) I + sin (   ψ   h   −   ψ   i   )   e   ^   .   Now, the variation of function   N   i   is   δ   N   i   =   P   i   δ k X +   P   i    k  δ X .      • Variation of coefficient k:   δ k = k (     δ   ψ   i       ψ   i      −    δ   ψ   h       ψ   h      +    cos    ψ   h     sin    ψ   h      δ   ψ   h   −    cos    ψ   i     sin    ψ   i      δ   ψ   i    )      Variation of matrix X :   δ X = ( δ   ψ   h   − δ   ψ   i   ) [ cos (   ψ   h   −   ψ   i   )   e   ^   − sin (   ψ   h   −   ψ   i   ) I ]      The identity matrix in this expression may be written as I =     e   ^     − 1     e   ^   =     e   ^     T     e   ^   = −     e   ^     2   and now the variation of matrix X can be written as   δ X = ( δ   ψ   h   − δ   ψ   i   ) X   e   ^     Returning these variations into the expression for δ   N   i   gives   δ   N   i   =   P   i   k X (     δ   ψ   i       ψ   i      −    δ   ψ   h       ψ   h      +    cos    ψ   h     sin    ψ   h      δ   ψ   h   −    cos    ψ   i     sin    ψ   i      δ   ψ   i    ) +   P   i   k ( δ   ψ   h   − δ   ψ   i   ) X   e   ^        In this expression the basic function   N   i   =   P   i    k  X can be recognised and the variation further written as   δ   N   i   =   N   i   [  (     δ   ψ   i       ψ   i      −    δ   ψ   h       ψ   h      +    cos    ψ   h     sin    ψ   h      δ   ψ   h   −    cos    ψ   i     sin    ψ   i      δ   ψ   i    ) I + (  δ   ψ   h   − δ   ψ   i    )   e   ^    ] .      With δ   ψ   i   = ( β / 2 ) ( δ   φ   i   − δ   φ   r   ) , and δ   ψ   h   = ( β / 2 ) ( δ   φ   h   − δ   φ   r   ) the variation of δ   N   i   follows as   δ   N   i   =    β   2      N   i   { [ ( δ   φ   i   − δ   φ   r   )   f   i   − ( δ   φ   h   − δ   φ   r   )   f   h   ] I + ( δ   φ   h   − δ   φ   i   )   e   ^   } ,   with     f   i   =    1     ψ   i      −    cos    ψ   i     sin    ψ   i       and    f   h   =    1     ψ   h      −    cos    ψ   h     sin    ψ   h      .   Finally,   δ   N   i   =    β   2      N   i     ∑   k = 1   N     M   ik   δ   φ   k   ,   with     M   ik   =   P   k   ( −   f   h   I +   e   ^   ) + (   f   i   I −   e   ^   )   δ   ik   −   δ   Ik   (   f   i   −   f   h   ) I .      As stated in (106), the geometric stiffness matrix consists of two parts, i.e.     ∑   k = 1   N     K   jk   G   {     Δ   r   k       Δ   φ   k       } =   ∫   0   L   Δ   B   2 j   T   LS    dx   1   +   ∫   0   L     B   j   T   Δ LS    dx   1   =   ∫   0   L   [       0   2 x 2       0   2         P   j   Δ   r   ′ T     e   ^     0     ] {     Λ   F   N         F   M       }    dx   1   +   ∫   0   L   [       J   j   ′ T       0   2         j   j   ′ T   +   P   j     r   ′ T     e   ^       P   j   ′       ] {     Δ Λ   F   N       0     }    dx   1   =   ∫   0   L   {       0   2       −   P   j     F   N   T     Λ   T     e   ^     ∑   k = 1   N   (   J   k   Δ   r   k   +   j   k   Δ   φ   k   ) ′     }    dx   1   +   ∫   0   L   {       J   j   ′ T     e   ^   Λ   F   N     ∑   k = 1   N     P   k   Δ   φ   k       (   j   j   ′ T   +   P   j     r   ′ T     e   ^   )   e   ^   Λ   F   N     ∑   k = 1   N     P   k   Δ   φ   k       } =   ∑   k = 1   N     ∫   0   L   [       0   2 x 2       P   k     J   j   ′ T     e   ^   Λ   F   N       −   P   j     F   N   T     Λ   T     e   ^     J   k   ′       (   P   j     j   k   ′   +   P   k     j   j   ′   )   T     e   ^   Λ   F   N   −   P   j     P   k     r   ′ T   Λ   F   N       ]    dx   1   {     Δ   r   k       Δ   φ   k       } ,   i.e.     K   jk   G   =   ∫   0   L   [       0   2 x 2       P   k     J   j   ′ T     e   ^   Λ   F   N       −   P   j     F   N   T     Λ   T     e   ^     J   k   ′       (   P   j     j   k   ′   +   P   k     j   j   ′   )   T     e   ^   Λ   F   N   −   P   j     P   k     r   ′ T   Λ   F   N       ]    dx   1   .       REFERENCES", "highlights": "In this paper we discuss interpolation functions for the field variables and their variations in relation to geometrically non-linear planar beam finite elements of Reissner's type within the context of a non-standard, configuration-dependent interpolational setting. We derive the new configuration-dependent interpolation functions as an extension of the helicoidal interpolation to higher-order elements. In linear analysis, the new interpolation coincides with the higher-order linked interpolation, which is known to produce exact results for polynomial loading. The numerical analysis performed on representative examples illustrates the performance of the configuration-dependent interpolation compared to the Lagrangian interpolation."}