{"id": "S0168874X14000432", "article": "MAIN-TITLE A geometrically exact finite beam element formulation for thin film adhesion and debonding   HIGHLIGHTS          This work presents a nonlinear finite beam element model for thin film adhesion and debonding.      The theory accounts for shear-flexible, initially curved beams with varying cross section.      Two different adhesion mechanisms are considered: adhesion by body forces and by surface tractions.      The new model allows for a very efficient yet accurate description of thin film peeling.      This is demonstrated by several examples, focusing on the peeling behavior of gecko spatulae.          KEYPHRASES   Nonlinear beam theory  Cohesive zone modeling  Computational contact mechanics  Finite element methods  Gecko adhesion  van der Waals interaction   The adhesion, debonding, and peeling behavior of thin strips and films plays an important role in many applications. Examples are paints and coatings, adhesive tapes, liquid films, and adhesive pads of insects and lizards like the gecko spatula pad. Since thin strips are slender, often also elongated, structures they are natural candidates for the consideration of beam theory. This is the basis of several analytical thin film peeling models that have been formulated starting with the seminal work of Kendall [1], see for example [2–5]. Analytical models are based on simplified assumptions regarding geometry and deformation. Thus they are not suitable to describe general problems characterized by the nonlinearities of large deformations and by complex geometries, as they are found in adhesive systems of insects and lizards. In these cases computational models are indispensable.  The objective of this paper, therefore, is to formulate a computational beam model for adhesion, debonding, and peeling. Here, we focus on a 2D formulation that is suitable to describe plane strain conditions of films, or to describe 2D behavior of beams. The considered formulation is based on the nonlinear, geometrically exact beam theory of Reissner [6], of which a computational counterpart is discussed in a book by Wriggers [7]. This formulation is generalized to beams with an initially curved axis and an arbitrary shaped cross section, which may vary along the beam. This is also accounted for in the presented contact formulation. The beam model is extended by two different adhesion formulations: adhesion by body forces and adhesion by surface tractions. The first is suitable to describe van der Waals adhesion, the second is suitable to include cohesive zone models. The formulation presented here is an extension of the van der Waals-based beam adhesion formulation of Sauer [8]. The new formulation accounts for both the shear deformation of the beam and a bending moment that is caused by the adhesion forces. Both these contributions have not been incorporated into a computational beam model before. It is seen that, combined, the two contributions lead to a symmetric finite element stiffness matrix. The symmetry is lost if one of the contributions is neglected. This symmetry reflects the fact that the model can be derived from a potential. The computational model presented here has been applied by Sauer [9] for studying the peeling behavior of shear-rigid beams with a rectangular cross section. The purpose of that study was to investigate the material and adhesion properties of thin peeling films, and to show that the bending stiffness can play a major role during peeling. It did, however, neither discuss the computational modeling nor the extension to shear-flexible beams with arbitrary, varying cross sections. This is the purpose of the present work.  The major advantage of the new formulation is the huge gain in efficiency it offers compared to adhesion models for 3D solids, like the model of Sauer and Wriggers [10]. To illustrate this, we compare the new beam formulation with the detailed 3D spatula model of Sauer and Holl [11], considering a vibration analysis and several peeling cases. It is seen that the beam model is capable of capturing the behavior of the spatula accurately. For the study, the characteristic beam properties (centroid, cross section, second moment of area, etc.) need to be determined from the detailed 3D geometry, which is discussed in detail. Since a van der Waals-based adhesion model leads to a purely normal (i.e. mode I) contact formulation, we also study gecko adhesion by considering a cohesive zone formulation that can describe tangential (mode II) debonding. In summary, it is shown that the new formulation is (1) more accurate than previous beam formulations, (2) consistent with continuum theory, and (3) a highly efficient alternative to 3D solid models.  The remaining sections of this paper are structured as follows. Section 2 gives an overview of the geometrically exact beam theory and shows how various adhesion formulations are adapted to the beam. Section 3 then presents the corresponding finite element formulation for adhesive beams. Numerical examples are discussed in Section 4. These consider the peeling behavior of a gecko spatula for various loading conditions and compare the beam results with detailed 3D computations based on solid elements. Section 5 concludes this paper.  This section presents the model equations governing the mechanical behavior of a thin adhesive strip. We discuss two different continuum adhesion models and their adaption to beam theory, focusing first on the internal work, δ   Π   int   , and then on the virtual contact work, δ   Π   c   .  For adhesion, the (mechanical) weak form of the equilibrium equation is given by the following statement [10]: find an admissible deformation φ ∈ U satisfying the principle of virtual work  (1)  δ   Π   int   + δ   Π   c   − δ   Π   ext   = 0 ,  ∀ δ φ ∈   V   φ   ,   where δ φ ∈   V   φ   denotes a kinematically admissible virtual deformation. The first term, δ   Π   int   , corresponds to the virtual work of the internal forces, see the following section. The second term, δ   Π   c   , which is discussed in Section 2.3, denotes the virtual work of contact and adhesion forces. The last term, δ   Π   ext   , denotes the virtual work of any external forces acting on the strip.  In the following, we outline the kinematics and constitution of the geometrically exact beam formulation of Reissner [6], see also [7]. This formulation accounts for the exact kinematics of large beam deformations and rotations. According to the assumptions of beam theory, only normal strains, due to axial forces and bending moments, and shear strains, due to shear forces, are considered. This means that the beam is supposed to be shear-flexible (like the Timoshenko beam). Further, the cross section of the beam is supposed to remain planar (but not necessarily normal to the beam axis) during deformation. Fig. 1 shows the nonlinear kinematics of the deforming beam. As shown, the beam axis is described by the coordinate S in the undeformed reference configuration,   B   0   . The deformation of the beam is fully characterized by the three independent fields u(S), w(S), and ψ ( S ) , which denote the displacement of the beam axis and the rotation of the cross section (Fig. 1). The fields can be arranged in the vector  (2)  d = [     u     w     ψ     ] .   The deformation of the beam is then characterized by  (3)  x = [     x     y     θ     ] = [     X     Y     Θ     ] + [     u     w     ψ     ] = X + d .   This formulation corresponds to the global coordinate system shown in Fig. 1. The angle Θ corresponds to the initial inclination of the cross section, which may vary along S but must be perpendicular to the beam axis in the undeformed configuration. This follows from the theory of Reissner. Introducing the rotation  (4)  Q ( θ ) = [     cos  θ   sin  θ   0     − sin  θ   cos  θ   0     0   0   1     ] ,   the displacement vector, d , can be transformed to the local coordinate systems of the reference configuration,   B   0   , and the current configuration, B , as  (5)    d   Loc   ≔ Q ( Θ ) d  and    d   loc   ≔ Q ( θ ) d .   Note that Q ( θ ) = Q ( ψ ) Q ( Θ ) . For the sake of simplicity, we define a vector of partial derivatives, d ′ ≔ ∂ d / ∂ S . Introducing the transformations  (6)    d   Loc   ′   ≔ Q ( Θ ) d ′  and    d   loc   ′   ≔ Q ( θ ) d ′ ,   the axial strain, ε, the shear strain, γ, and the flexure, κ, of the beam, arranged in the vector ε =   [ ε , γ , κ ]   T   , can be either written as [7]   (7)  ε = Q ( ψ )   d   Loc   ′   − ϕ   or equivalently as  (8)  ε =   d   loc   ′   − ϕ ,   where ϕ is defined as  (9)  ϕ = [     1 − cos  ψ     sin  ψ     0     ] .   Expression (8) provides a geometrically exact definition of the beam strains w.r.t. the local coordinate system. The strain definition according to Eq. (8) is the logical extension of the infinitesimal beam kinematics to large deformations and rotations.  The local axial force, N, shear force, V, and bending moment, M, of the beam follow from the chosen constitutive model. Here, we consider linear elastic material behavior, so the cross-sectional force S =   [ N , V , M ]   T   is given by  (10)  S = D ε   with  (11)  D = [     EA   0   0     0     GA   s     0     0   0   EI     ] .   The diagonal entries of D describe the axial, shear, and bending stiffness of the beam. Here, E and G denote Young׳s modulus and the shear modulus. Further, A and I denote the cross section area and second moment of area. In general, these may change along the beam axis.   A   s   denotes the shear-corrected cross section area, which is   A   s   = 5 / 6 A for a rectangular and   A   s   = 9 / 10 A for a circular cross section. In general, it can be obtained from Eq. (104), discussed in Appendix C. A linear material model, like (10), is acceptable as long as the strains ε and γ remain small. The displacements themselves can become arbitrarily large. The internal virtual work, δ   Π   int   , is given by the virtual work done by the sectional forces, S , integrated along the undeformed beam axis, i.e.  (12)  δ   Π   int   =   ∫   L   δ   ε   T   S  d S .   Here, δ ε denotes the virtual strains, which are obtained from Eq. (8) as  (13)  δ ε = Q ( θ ) δ d ′ + [    ∂ Q ( ψ )   ∂ ψ   Q ( Θ ) d ′ −   ∂ ϕ   ∂ ψ    ] δ ψ .   Carrying out the differentiation, this can be written as  (14)  δ ε = δ   d   loc   ′   + A  δ   d   loc   ,   with  (15)  A = [     0   0     w   loc   ′   − sin  ψ     0   0   −   u   loc   ′   − cos  ψ     0   0   0     ]   and  (16)  δ   d   loc   ≔ Q ( θ ) δ d ,  δ   d   loc   ′   ≔ Q ( θ ) δ d ′ .      This section discusses the formulation of adhesive contact, considering either bulk adhesion or adhesion by surface tractions. For both, the substrate is supposed to be much stiffer than the peeling strip, such that the deformation of the substrate can be omitted.  In the case of adhesion by body forces we have [10]   (17)  δ   Π   c   = −   ∫     B   0     δ φ ·   β   0        b   ¯     c    d V ,   where   β   0        b   ¯     c    d V denotes an infinitesimal force acting on the undeformed volume element d V . The term β 0 describes the particle density of d V . For van der Waals adhesion, the body forces   b   c   ≔   β   0        b   ¯     c   can be derived from the Lennard-Jones potential considering analytical half-space integration [10]. This gives  (18)    b   c   =   b   c   ( r )   n   p   ,    b   c   ( r ) =     A   H     2 π   r   0   4      [    1   5     (      r   0     r    )   10   −   (      r   0     r    )   4    ] ,   where r 0 denotes the equilibrium distance of the Lennard-Jones potential and   A   H   denotes the Hamaker constant. According to Eq. (18),   b   c   is parallel to the normal vector,   n   p   , of the substrate surface, ∂   B   s   . The body force field, given in Eq. (18), needs to be integrated over the height of the beam. This leads to a distributed line force,   T   c   , and bending moment,   M   c   , acting along the beam axis as shown in Fig. 2 . We assume in the following that the initial inclination of the beam axis, Θ , is approximately equal to the inclination of ∂   B   s   . By choice, the substrate is oriented such that Θ = 0 . The left hand side of Fig. 2 shows the beam in a general configuration. The integration is performed over an infinitesimal slice of the beam cross section, which is rotated by the angle ψ. 1   1 Due to the shear deformation of the beam, ψ is not equal to the rotation of its lower surface. The right hand side of Fig. 2 shows the undeformed configuration of the cross section slice considered at the same position u =   [ u , w ]   T   and rotation ψ as the deformed slice. The infinitesimal volume element, d V , can be written as  (19)  d V =   W  d r  d S   cos  ψ   ,   where d S is the thickness of the cross section slice, d r is a differential element along   n   p   , and W is the width of the beam. In general, W may vary along both r and S. Nevertheless, since the force field (18) decays very fast for increasing distance [10] we consider the width of the lower strip surface here, W = W ( S ) . Integrating   b   c   W along r gives  (20)      T   ^     c   ≈ W   ∫     r   1       r   2       b   c   ( r )  d r ,   with  (21)    r   1   ( ψ ) =   r   M   −   H   2   cos  ψ ,    r   2   ( ψ ) =   r   M   +   H   2   cos  ψ ,   according to Fig. 2. The term H = H ( S ) is the strip height at S, see Remark 1. The integral is easily evaluated as  (22)      T   ^     c   = T (   r   1   ) − T (   r   2   ) ,   with  (23)  T ( r ) =     A   H    W   2 π   r   0   3     [    1   45     (      r   0     r    )   9   −   1   3     (      r   0     r    )   3    ] .   For convenience, the quantities  (24)    T   c   ≔       T   ^     c     cos  ψ     and  (25)    T   c   ≔   T   c     n   p     are introduced. Thus one can write  (26)    ∫     B   0       b   c    d V ≈   ∫   L     T   c    d S   for the beam. As seen, the sectional rotation, ψ, leads to an increase of the distributed line force,   T   c   . Due to the inclination of the slice, the adhesion forces induce a bending moment,   M   c   , as shown in the figure. It is caused by the eccentricity, e = (   r   M   − r ) tan  ψ , of the body force field, which is not uniform across the height of the beam. Integrating the product   eb   c   W along r then defines the moment  (27)    M   c   ≈ W   ∫     r   1       r   2     (   r   M   − r ) tan  ψ      b   c   ( r )   cos  ψ    d r .   Evaluating the integral yields  (28)    M   c   ≔ (   r   M       T   ^     c   −   r   0     T   c   ⁎   )   tan  ψ   cos  ψ   ,   with  (29)    T   c   ⁎   = W   ∫     r   1       r   2       rb   c   ( r )  d r =   T   ⁎   (   r   1   ) −   T   ⁎   (   r   2   )   and  (30)    T   ⁎   ( r ) =     A   H    W   2 π   r   0   3      [    1   40     (      r   0     r    )   8   −   1   2     (      r   0     r    )   2    ] .   Altogether, it is seen that due to the inclination of the beam, three effects have appeared:  1. An increase of the adhesion force,   T   c   , by the factor 1 / cos  ψ , which has the same effect as an actual increase of the film density,  an additional bending moment,   M   c   , and  a coupling between the adhesion forces and the shear deformation, γ, via the angle ψ appearing in Eq. (8). This last contribution will lead to a fully symmetric finite element tangent matrix as seen in Section 3.  The virtual contact work, δ   Π   c   , now corresponds to the virtual work done by the sectional force,   T   c   , and sectional moment,   M   c   , distributed along the beam, i.e.  (31)  δ   Π   c   = −   ∫   L   δ   d   T   [       T   c         M   c       ] d S .   If no external forces are considered, as is done in the examples of the following sections, 2   2 We thus ignore the self-weight of the beam. the external virtual work is zero, i.e. δ   Π   ext   = 0 . Together with Eq. (12), the weak form governing the beam is then given by  (32)    ∫   L   δ   ε   T   S  d S −   ∫   L   ( δ u ·   T   c   + δ ψ ·   M   c   )  d S = 0 ,  ∀ δ d ∈   V   d   ,   where [ δ   u   T   , δ ψ ] = δ   d   T   .   Remarks:  1. Due to the fast decay of T(r) from Eq. (23) it is convenient to set   r   2   → ∞ if the considered strip is thicker than a few nanometers [9]. The line force,   T   c   , and moment,   M   c   , then simplify due to     T   ^     c   = T (   r   1   ) and   T   c   ⁎   =   T   ⁎   (   r   1   ) .  For an initially stress-free configuration, the lower strip surface must be separated from the substrate either by r = ∞ or by the equilibrium distance,   r   eq   , for which the traction is zero,   T   c   (   r   eq   ) = 0 . Considering Remark 1, this distance can be easily derived from Eq. (23);   r   eq   =   r   0   /   15   6    [9].  Numerical ill-conditioning for r → 0 , where the contact force approaches infinity, can be avoided by regularizing contact formulations (24) and (28). Here, the slopes of   T   c   and   M   c   are limited to a certain threshold, see Appendix A.  A partial increase or decrease of adhesion (e.g. due to varying chemical properties along the strip) can be considered easily by varying the Hamaker constant,   A   H   ≥ 0 , along S. Note that in an efficient computational framework, contact should be evaluated only for the adhesive part of the strip, where   A   H   > 0 , see Section 3.3.  The formulation presented here can also be applied to arbitrary contact laws defined by a body force function   b   c   ( r ) .  In the case of adhesion by surface tractions we consider [12]   (33)  δ   Π   c   = −   ∫   ∂   B   0     δ φ ·   F   c    d A .   Now,   F   c    d A corresponds to an infinitesimal force acting on the undeformed surface element d A . Examples for surface adhesion are cohesive zone models, e.g. [13,14]   (34)    F   c   = −     F   0       g   0      exp (  1 −   ∥   g   s   ∥     g   0      )   g   s   ,   where F 0 and g 0 are constants, and where  (35)    g   s   =   x   s   −   x   p   0     is the gap vector between the surface point   x   s   ∈ ∂ B and a specific reference point   x   p   0   on the substrate surface that could for instance be the initial projection point of   x   s   . The line force,  (36)    T   c   ≔   F   c   W ,   leads to a sectional bending moment as is shown in Fig. 3 . Defining the sectional basis vectors s ≔   [ cos  ψ , sin  ψ ]   T   and h =   [ − sin  ψ , cos  ψ ]   T   = ∂ s / ∂ ψ at x , one determines the surface location  (37)    x   s   = x −   H   2    h ,   evaluates   T   c   =   T   c   (   g   s   ) from Eqs. (36) and (35), and obtains the bending moment as  (38)    M   c   =   H   2    s ·   T   c   .   This bending moment is not only an effect of the section inclination, as in the bulk adhesion model considered in Section 2.3.1, but is also caused by the tangential component of   T   c   . The virtual contact work and the governing weak form remain as they are given in Eqs. (31) and (32), now considering the new expressions for   T   c   and   M   c   . Like in the model for bulk adhesion, the presented surface adhesion model leads to a symmetric finite element tangent matrix, see Section 3.   Remarks:  1. The cohesive zone model (36) is unstable for compression due to the absence of any stabilizing forces perpendicular to   g   s   . In order to stabilize compression, a penalty regularization can be used here.  In principle, also other surface adhesion laws can be considered instead of Eq. (36).  The beam formulation outlined above is now discretized in the framework of the finite element method.  The beam is discretized into   n   el   finite elements. Within each finite beam element, Ω  e , the initial position, X , and the displacement, d , are approximated independently by the interpolations  (39)    X   h   = [       X   h         Y   h         Θ   h       ] =   ∑   I = 1   n     N   I     X   I   ,    d   h   = [       u   h         w   h         ψ   h       ] =   ∑   I = 1   n     N   I     d   I   .   Here,  (40)    X   I   = [       X   I         Y   I         Θ   I       ] ,    d   I   = [       u   I         w   I         ψ   I       ]   denote the axis position/inclination at the finite element nodes as well as the unknown displacement/rotation values. In short, we also write  (41)    X   h   =   N   e     X   e    and    d   h   =   N   e     d   e   .   Here,   N   e   = [   N   1   I ,   N   2   I , … ,   N   n   I ] is an array containing n shape functions, N  I , associated with the n nodes of element Ω  e , and  (42)    X   e   = [       X   1         X   2       ⋮       X   n       ]  and    d   e   = [       d   1         d   2       ⋮       d   n       ]   are the vectors of the nodal initial positions and unknown displacements of the element. The beam geometry w.r.t. the current configuration then reads  (43)    x   h   =   X   h   +   d   h   .   For simplicity, superscript h is dropped in the following. The components of d are transformed to the local coordinate systems according to Eq. (5). We note that here, in general, both d and θ are interpolated quantities. The partial derivative d ′ is then given by  (44)  d ′ =   N   e   ′     d   e   ,   where  (45)    N   e   ′   ≔   ∂   N   e     ∂ S   =   ∂   N   e     ∂ ξ     (    ∂ S   ∂ ξ    )   − 1   .   The derivative ∂ S / ∂ ξ is discussed in Section 3.4. The transformation of d ′ is obtained by inserting Eq. (44) into definition (6), i.e.  (46)    d   loc   ′   ≔ Q ( θ )  d ′ = Q ( θ )    N   e   ′     d   e   .   The virtual displacement field, δ d , considering the same interpolation as in (41), is written as  (47)  δ d =   N   e   δ   d   e   ,   where the arrangement of δ   d   e   is analogous to (42) and (40). According to (16) we then have  (48)  δ   d   loc   ≔ Q ( θ )   N   e   δ   d   e   ,  δ   d   loc   ′   ≔ Q ( θ )   N   e   ′   δ   d   e   .      Given the FE interpolation defined above, we now proceed with the treatment of the internal virtual work (12). Inserting (48) into (14) yields  (49)  δ   ε   e   =   B   e   δ   d   e   ,   with   B   e   = [   B   1   ,   B   2   , … ,   B   n   ] and, due to the sparseness of A ,  (50)    B   I   =   N   I   ′   Q ( θ ) +   N   I   A .   In an actual implementation   B   I   should be multiplied out for efficiency, giving  (51)    B   I   = [       N   I   ′    cos  θ     N   I   ′    sin  θ     N   I   (   w   loc   ′   − sin  ψ )     −   N   I   ′    sin θ     N   I   ′    cos  θ   −   N   I   (   u   loc   ′   + cos  ψ )     0   0     N   I   ′       ] .   With (49), the internal virtual work of element Ω  e becomes, according to (12), δ   Π   int   e   = δ   d   e   T     f   int   e   , where   f   int   e   is the internal force vector of the element that is given by  (52)    f   int   e   =   ∫     L   e       B   e   T   S  d S .   In this form, the components of   f   int   e   are given in the global basis. Here, the sectional force vector S is specified through Eqs. (10), (8), (46), (9) and (41). The stiffness matrix,   k   int   e   , that is associated with   f   int   e   , and which is needed for the solution procedure discussed in Section 3.5, can be found in Appendix B.1.   Remarks:  1. Alternatively, the strain operator matrix   B   I   can be formulated w.r.t. the local coordinate system in the initial configuration, i.e. in direction of   u   Loc   and   w   Loc   . We find  (53)    B   I   =   B   Loc  I   Q ( Θ )  with    B   Loc  I   ≔   N   I   ′   Q ( ψ ) +   N   I     A   Loc     and  (54)    A   Loc   = [     0   0   − ( 1 +   u   Loc   ′   )  sin  ψ +   w   Loc   ′    cos  ψ     0   0   − ( 1 +   u   Loc   ′   )  cos  ψ −   w   Loc   ′    sin  ψ     0   0   0     ] .   These expressions are identical to Eqs. (15) and (51). For the internal force vector of finite element Ω  e follows  (55)    f   int   e   =   ∑   I = 1   n     f   int  I   e   ,    f   int  I   e   =   ∫     L   e       Q   T   ( Θ )   B   Loc  I   T   S  d S .      If only infinitesimal deformations occur, d does not affect the strain operator matrix   B   e   . Considering u ′ ⪡ 1 , w ′ ⪡ 1 , and ψ ⪡ 1 (so that θ ≈ Θ ) we thus find the linearized strain operator  (56)    B   I   lin   =   N   I   ′   Q ( Θ ) +   N   I     A   lin   ,   and  (57)    A   lin   = [     0   0   0     0   0   − 1     0   0   0     ] .      For beams with varying cross section, the interpolation of the cross-sectional properties A, I, W, and H is analogous to interpolation (41).  An alternative FE description is obtained if we first rotate the nodal displacement vectors into the local reference coordinate system, i.e.  (58)    d   Loc  I   = Q (   Θ   I   )   d   I   ,   and then consider the FE interpolation there, i.e.  (59)    d   Loc   =   ∑   I = 1   n     N   I     d   Loc  I   ,    d   Loc   ′   =   ∑   I = 1   n     N   I   ′     d   Loc  I   .   (Here, we still consider   d   Loc   = Q (   ψ   h   )   d   Loc   . ) In this case   B   I   turns into   B   I   =   B   Loc  I   Q (   Θ   I   ) , so that Eq. (55) simplifies to the formulation discussed in the book by Wriggers [7]   (60)    f   int   e   =   ∑   I = 1   n     f   int  I   e   ,    f   int  I   e   =   Q   T   (   Θ   I   )   ∫     L   e       B   Loc  I   T   S  d S .      Inserting interpolation (47) into (31), lets us write the virtual contact work for finite element   Ω   c   e   , e = 1 , … ,   n   ce   , as δ   Π   c   e   = δ   d   e   T     f   c   e   , where  (61)    f   c   e   = −   ∫     L   e       N   e   T   [       T   c         M   c       ] d S   denotes the elemental contact force vector. Here,   n   ce   is the number of elements where   A   H   > 0 , see Remark 4 of Section 2.3.1. The tangent matrix associated with   f   c   e   is given by  (62)    k   c   e   =   ∂   f   c   e     ∂   d   e     = [    ∂   f   c   e     ∂ u      ∂   f   c   e     ∂ ψ    ]   N   e   ,   which yields  (63)    k   c   e   = −   ∫     L   e       N   e   T   [        ∂   T   c     ∂ u         ∂   T   c     ∂ ψ           ∂   M   c     ∂ u         ∂   M   c     ∂ ψ        ]   N   e    d S .   The individual terms are discussed below. It is shown that   k   c   e   is fully symmetric. Due to the strong variation of   T   c   and   M   c   ,   f   c   e   and   k   c   e   are integrated to high accuracy by using several quadrature points, see Section 3.4.  We first consider the formulation of Section 2.3.1, where   T   c   and   M   c   are given by Eqs. (25) and (28). Introducing the abbreviation ( … ) ′ = ∂ ( … ) / ∂   r   M   , considering that δ u = δ x , and noting that ∂   r   M   / ∂ x =   n   p   , the first two submatrices from Eq. (63) are readily obtained as  (64)    ∂   T   c     ∂ u   =   T   c   ′     n   p   ⊗   n   p    and    ∂   T   c     ∂ ψ   = [    T   c   +   H   2      T   d   ′    ]  tan  ψ   n   p   ,   where we have defined   T   d   ≔ T (   r   1   ) + T (   r   2   ) . The third submatrix simply is  (65)    ∂   M   c     ∂ u   =   [    ∂   T   c     ∂ ψ    ]   T   .   The last piece, the derivative of the contact moment w.r.t. inclination ψ, is found as  (66)    ∂   M   c     ∂ ψ   =   H   2   [   r   M     T   d   ′   −   r   0     T   d   ⁎ ′   ]   tan   2    ψ +   M   c     1 +   sin   2    ψ   sin  ψ  cos  ψ   ,   where we have introduced   T   d   ⁎   ≔   T   ⁎   (   r   1   ) +   T   ⁎   (   r   2   ) . With these expressions, the tangent matrix   k   c   e   becomes fully symmetric, as it should, since the adhesion forces can be derived from a potential. Both the proof of symmetry and the derivation of   T   c   ′   ,   T   d   ′   , and   T   d   ⁎ ′   are discussed in Appendix B.2. If the bending moment,   M   c   , is neglected, the symmetry of   k   c   e   is lost, which essentially implies an inconsistency of the formulation. Nothing is gained from this approximation. We note that in the initial configuration ψ = 0 , so that one has   M   c   = 0 , ∂   M   c   / ∂ u = 0 , and ∂   M   c   / ∂ ψ =   r   M       T   ^     c   −   r   0     T   c   ⁎   .  Secondly, we consider the formulation of Section 2.3.2, where   T   c   and   M   c   are given by Eqs. (36) and (38). The first entry in   k   c   e   can now be written as  (67)    ∂   T   c     ∂ u   =   ∂   T   c     ∂   g   s        ∂   g   s     ∂ x   =   ∂   T   c     ∂   g   s     ,   since ∂   g   s   / ∂ x = I according to Eqs. (35) and (37). Writing   T   c   =   T   c        g   ¯     s   with     g   ¯     s   =   g   s   /   g   s   and   g   s   = ∥   g   s   ∥ , and setting   T   c   ′   ≔ ∂   T   c   / ∂   g   s   we can then find  (68)    ∂   T   c     ∂   g   s     =   T   c   ′       g   ¯     s   ⊗     g   ¯     s   +     T   c       g   s      ( I −     g   ¯     s   ⊗     g   ¯     s   ) ,   see [14]. With this, the second entry in   k   c   e   can be easily found as  (69)    ∂   T   c     ∂ ψ   =   ∂   T   c     ∂   g   s       ∂   g   s     ∂ ψ   ,   where  (70)    ∂   g   s     ∂ ψ   =   H   2   s ,   according to Eqs. (35) and (37). It is also easy to see that  (71)    ∂   M   c     ∂ x   =   H   2   s ·   ∂   T   c     ∂   g   s     =   [    ∂   T   c     ∂ ψ    ]   T   ,   caused by the symmetry of ∂   T   c   / ∂   g   s   . The last entry in   k   c   e   is also simple to evaluate; we find  (72)    ∂   M   c     ∂ ψ   =   H   2   h ·   T   c   +     H   2     4   s ·   ∂   T   c     ∂   g   s     s .   As in the above case,   k   c   e   turns out to be fully symmetric – again a consequence of the fact that the formulation is derivable from a potential. The symmetry is lost if   M   c   is neglected.  The integrals appearing in   f   int   e   ,   f   c   e   ,   k   int   e   , and   k   c   e   are evaluated by using numerical quadrature on the master domain ξ ∈ [ − 1 , 1 ] . The element configuration is therefore mapped onto this master configuration by considering the transformation  (73)  d S =   S   , ξ    d ξ ,   where   ( … )   , ξ   is shorthand for the derivative ∂ ( … ) / ∂ ξ . According to (39), the axial coordinate, S, is interpolated in the same way as the displacement field, d , so that  (74)    S   , ξ   =   ∑   I = 1   n     N   I , ξ     S   I   .   For linear elements with n=2 nodes, considered in the examples below, the Jacobians are constant and given as   S   , ξ   =   L   e   / 2 , where L  e is the element length in initial configuration. Using numerical quadrature, the integrals are then rewritten as  (75)    ∫     L   e     f ( S )  d S =   ∫   − 1   1   f ( ξ )   S   , ξ    d ξ ≈   ∑   qp = 1     n   qp     f (   ξ   qp   )   S   , ξ   (   ξ   qp   )   w   qp   ,   where ξ  qp are appropriate quadrature points with the weights w  qp . In order to avoid shear locking we use reduced integration for the internal force and stiffness, e.g.   n   gp   = 1 for linear elements [7]. The contact integrals, on the other hand, are integrated with several quadrature points, e.g.   n   qp   c   = 5 , due to the strong nonlinearities of the considered adhesion formulations.  The elemental force vectors,   f   int   e   and   f   c   e   , are assembled into the global vectors,   f   int   and   f   c   . After accounting for the essential boundary conditions on d (i.e. the vector of all nodal unknowns   d   I   ), we are left with the FE equilibrium equation  (76)  f ( d ) =   f   int   +   f   c   = 0 .   Relation (76) is a system of nonlinear equations, which must be linearized by using e.g. Newton׳s method. The tangent matrix, k =   k   int   +   k   c   , required for this method is assembled from the elemental contributions,   k   int   e   and   k   c   e   , provided in Section 3.3 and Appendix B.1. At every Newton step we then need to solve the linear system  (77)  k Δ d + f = 0 ,   for the new displacement increment, Δ d . A summary of the complete finite element algorithm is given in Table 1 .  This section discusses a simple test case in order to perform a convergence study for the FE beam model. In addition, the results are compared to both an analytical [9] and a 2D finite element [15] adhesion model. A thin strip with rectangular cross section is considered. In the initial state, 75% of its lower surface ( 0 ≤ S ≤ 0.75 L ) adhere to a planar and rigid substrate. The strip is peeled off the substrate by rotating the right boundary by ψ   |   S = L   =   ψ   b   . The length and thickness are taken as L = 200  nm and H = 10  nm . The width, W, and Young׳s modulus, E, are used for normalization and remain unspecified. Considering the van der Waals model, the parameters   A   H   =   10   − 19    J and   r   0   = 0.4  nm are chosen. Poisson׳s ratio is assumed to be ν = 0.2 .  We now consider the bending moment, M , which is required to maintain the prescribed rotation, as well as the internal energy  (78)    Π   int   =   1   2     ∫   L     ε   T   S  d S ,   for   ψ   b   = 150 ° . We obtain M (   ψ   b   ) = 1.5976   EW   3   and   Π   int   (   ψ   b   ) = 2.0736   EW   3   for   n   el   = 6400 elements and   n   qp   c   = 5 quadrature points per contact element. As Fig. 4 a and b shows, both quantities converge for increasing numbers of finite elements and contact quadrature points. (Because of the shear locking effects discussed in Section 3.4, the numerical quadrature of the internal forces is not refined here.) The bending radius of the strip,   R   0   =   κ   − 1   , is measured as   R   0   = 5.2176 H .  For pure bending, the quantities M and R 0 can be derived analytically [9] as  (79)  M =   EWH   2         w   adh     6 EH     ,    R   0   = H     EH   24   w   adh       .   The term   w   adh   denotes the work of adhesion, which is given for the total detachment process by   w   adh   =   15   3     A   H   / ( 16 π   r   0   2   )  [9]. This yields M = 1.5986   EW   3   and   R   0   = 5.2130 H , which is in excellent agreement with our numerical results. Small differences are to be expected here because the assumption of pure bending made for the analytical solution is not valid close to the peeling zone of the strip. A detailed 2D finite element analysis by Sauer [15] provides a bending moment of M = 1.642   EW   3   . This value is very close to the result obtained with the beam model. The difference between both solutions is a consequence of the different models. The 2D model differs from the beam model in the assumptions of nonlinear (Neo-Hookean) elasticity and the independence of the contact traction from the strip inclination, ψ.  The beam model discussed in the previous sections is now used to model the peeling process of a gecko spatula. 3   3 The spatulae form the tips of the fine hairs (setae) covering the gecko toes. A detailed 3D finite element model of a single spatula is provided by Sauer and Holl [11]. On the basis of this model, we generate a reduced beam geometry that has the same cross-sectional properties as the 3D model, but requires significantly less degrees of freedoms. Besides the continuum model, we also re-examine the previous spatula beam model of Sauer [8], which considers both a simplified geometry and contact formulation. The three different models are compared by performing a vibration and peeling analysis.  In the following, we use   L   0   = 1  nm for normalization. As shown in Fig. 5 , the 3D spatula geometry of Sauer and Holl [11] consists of a cylindrical shaft, which ends in a flat, triangular pad. While the pad itself is very thin, its rim is significantly thicker. The geometry is symmetric w.r.t. the (X,Y)-plane, see Fig. 5.  Although its shape is three-dimensional, we assume here that the attachment and peeling of the spatula can be described within the plane of symmetry. We thus reduce the 3D solid model to a two-dimensional beam model by defining the axis, S, within this plane as shown in Fig. 5. The cross section properties, A and I, are obtained according to the procedure outlined in Table 2 .  For the spatial discretization of the beam model, we follow the approach of Sauer and Holl [11] who have used a coarse finite element mesh for the spatula branch and a fine mesh for the pad. Here, elements of length 2   L   0   for the branch and approx. 1 / 3   L   0   for the pad are used. We reduce with the chosen mesh the number of degrees of freedom from approx. 420,000 to 4000, i.e. by approximately 99%.  In Fig. 6 a, the position of the beam axis in the (X,Y)-plane is visualized. The spatula shaft is initially inclined by Θ ≈   5   ○   . Fig. 6b shows the width of the adhesive spatula pad for the present and the previously studied [8] beam model. The pad widths differ substantially at the connection between pad and shaft (for X < 100   L   0   ). The enclosed area,  (80)    A   c   ≔   ∫     L   c     W ( S )  d S ,   defines the contact surface area of the adhesive pad. Here,   L   c   denotes the length of the adhesive part. The contact area   A   c   agrees well for the two models, as Table 3 shows.   Fig. 6c and d shows the cross section area, A, and the second moment of area w.r.t. the beam axis, I, for both models. The figure shows that there are very large differences between the two beam models, especially in the transition zone between the spatula pad and the shaft. The quantities are normalized by the maximum values   A   max   = A   |   S = 0   and   I   max   = I   |   S = 0   occurring at the base of the spatula shaft.   A   max   and   I   max   are specified in Table 3.  For the beam model, the effective cross-sectional shear area,   A   s   , needs to be specified. Here, we consider a shear area of   A   s   = 5 / 6 A , see Appendix C. Following Sauer and Holl [11], we choose the parameters E=2GPa, ν = 0.2 ,   A   H   =   10   − 19    J , and   r   0   = 0.4  nm . Note that in the previous study [11], a Neo-Hooke material behavior has been considered for the 3D spatula. For the sake of comparability, we also consider a Saint Venant–Kirchhoff material model here: this model shows – like our beam model – a linear stress–strain relation, but a geometrically nonlinear behavior.  In the following, we compare the vibration characteristics of the three different spatula models by performing a modal analysis. For this purpose, we clamp the spatula at the shaft boundary, d   |   S = 0   = 0 , and consider the eigenvalue problem  (81)  (   k   lin   −   ω   i   2   m )   ϑ   i   = 0 ,   where m is the mass matrix given in Appendix B.3, and   k   lin   is the linearized stiffness matrix. 4   4 We obtain   k   lin   by following Appendix B.1 with   B   I   lin   from Eq. (56) and   C   IJ   = 0 .     ϑ   i   and ω  i correspond to the characteristic displacement and frequency of the ith eigenmode.   Table 4 shows the first ten eigenfrequencies obtained with the 3D solid spatula model in comparison to the reduced beam model presented here. The eigenfrequencies for the previous spatula model of Sauer [8] are listed for the sake of completeness. The term   e   beam   denotes the relative error, 5   5 Note that the eigenvalues according to the solid model may still be subject to significant discretization errors.     e   beam   = |   ω   beam   −   ω   solid   | /   ω   solid   . The corresponding displacements are shown in Fig. 7 . For both the continuum and the beam model we obtain the first seven bending modes and the first longitudinal mode of the spatula, see Table 4 and Fig. 7. The torsional modes,   ϑ   5   and   ϑ   9   , observed for the solid model cannot be obtained with a two-dimensional model. These modes are anyway not relevant for peeling in the ( X , Y )-plane.  The first eigenmodes of the present beam model agree well with the results obtained with the solid model. It is seen in Fig. 7 that the nodes of vibrations occur at the same locations for both spatula models. Regarding both the first bending and longitudinal modes,   ϑ   1   and   ϑ   6   , the natural frequencies differ in less than 1%, see Table 4. All other errors are less than 10%. The large error in the fourth bending mode,   ϑ   4   , may be caused by significant torsional deformation observed for the mode of the solid model (Fig. 7). We can conclude that our beam model is able to accurately capture the mechanical behavior of the considered structure.  In this section, the peeling behavior of the three spatula models is compared by considering the van der Waals model and by studying peeling due to bending and vertical loading. In addition, we investigate peeling due to horizontal loading, using the cohesive zone formulation described in Section 2.3.2.  First, the spatula is peeled from a flat and rigid substrate by rotating the base of the spatula shaft by ψ   |   S = 0   =   ψ   b   . 6   6 From the chosen orientation of the beam axis follows ψ   |   S = 0   < 0 . For convenience, however, the sign is omitted in the following. The horizontal and vertical degrees of freedom remain unconstrained at this point. Fig. 8 a shows the resulting bending moment for the solid model of Sauer and Holl [11], the present beam model, and the simplified beam model of Sauer [8]. For small inclinations, the peeling behavior of the present beam model agrees well with the results of Sauer and Holl [11]. At the beginning of the peeling process, the bending moment increases rapidly for both considered models and reaches its maximum at similar shaft inclinations, see Table 5 . We observe that the moment drops due to a system instability when the first part of the pad (at S ≈ 0.72 L or X ≈ 80   L   0   ) is peeled from the substrate. Here, the spatula cross section changes remarkably, see Fig. 6c and d. After the drop-off, the beam model produces a larger moment than the solid model. This may be caused by the axis inclination at the rim, which is not accounted for in our adhesion formulation. Regarding the solid spatula, the peeling behavior is very similar for the two considered material models. This observation confirms our assumption of large deformations but small strains.  It is important to note that the detachment behavior of the spatula beam model strongly depends on how the tip of the adhesive pad is modeled. Considering the adhesive pad surface shown in Fig. 6b, the spatula can be rotated by   ψ   b   = 136 ° , which is larger than for the solid model. Fig. 8a shows that the beam model of the spatula detaches quite earlier if we consider e.g. a small part of the spatula tip ( X > 340   L   0   in Fig. 6b or S > 0.98   L   0   in Fig. 6c) as non-adhesive. 7   7 The adhesive area thus decreases to   A   c   = 47 , 385   L   0   2   , i.e. by 3.9%. We discuss the adjustment of the adhesive pad surface in the following section.  In contrast to the other spatula models, the bending moment observed for the previous beam model [8] is considerably lower. After reaching M ≈ 200   EL   0   3   , the bending moment increases only slightly, see Fig. 8a. Compared with the other models, the spatula shaft has a very high bending resistance, while the bending stiffness of the pad is almost negligible (Fig. 6d). For this reason, the spatula pad accommodates most of the deformation. The observation that the bending moment is small for this model illustrates that the thicker rim of the spatula pad contributes significantly to the spatula strength.  After rotating the shaft to an inclination of θ   |   S = 0   = 60 ° (   ψ   b   = 55 ° ), the spatula pulled upward by an imposed displacement along the Y-direction: w   |   S = 0   =   w   rot   +   w   b   and ψ   |   S = 0   =   ψ   b   . The term   w   rot   denotes the vertical displacement caused by the pre-rotation. Fig. 8b shows the peeling reaction forces obtained for the three spatula models. In contrast to the previous beam model, the new beam model behaves very similarly to the solid model; the reaction force increases almost linearly for displacements smaller than 120   L   0   . For   w   b   ≥ 120   L   0   , only a small part of the spatula pad adheres to the substrate. Here, the new beam model is slightly softer as the reaction force is smaller. The differences at the end of the detachment process are due to the fact that a beam theory is not applicable for the tip of the spatula pad. The solid model detaches earlier at   w   b   = 184   L   0   , when approx. 10% of the spatula pad remain attached to the substrate. For the beam model, approx. 6% of the pad adhere to the substrate at full detachment (   w   b   = 205.5   L   0   ). We therefore adjust the size of the adhesive pad for the beam model according to Section 4.3.1. Then, both the maximum force and the prescribed displacement at full detachment agree very well for both models, see Fig. 8b and Table 6 . Regarding the beam model of Sauer [8], the peeling reaction force is significantly larger, see Fig. 8b and Table 6. We can conclude that, in contrast to the previous beam model, the reduced beam model compares well with the 3D continuum model.  We now consider four different states of the peeling process, which are also marked as black diamonds in Fig. 8a and b:        1. Shaft rotation by   ψ   b   = 26 ° ( θ   |   S = 0   = 31 ° ): location of the system instability.    2. Shaft rotation by   ψ   b   = 55 ° ( θ   |   S = 0   = 60 ° ): start of vertical peeling.    3. Vertical displacement by   w   b   = 60    L   0   : at θ   |   S = 0   = 60 ° .    4. Vertical displacement by   w   b   = 120    L   0   : at θ   |   S = 0   = 60 ° .          Fig. 9 a and b shows the contact traction and moment as well as the components of the force resultant, S , for the four configurations.  The peeling front of the spatula pad becomes apparent as a sharp spike in the contact traction and moment (where   T   c   < 0 and   M   c   > 0 ). The remaining part of the pad (where   T   c   > 0 and   M   c   < 0 ) is pressed into the substrate due to the bending resistance of the spatula. Fig. 10 shows the corresponding spatula deformations for both the beam model and the 3D solid model.  The stress shown for the solid model is the first invariant   I   1   = tr  σ normalized by Young׳s modulus E . For the beam model we have visualized the stress (   σ   1   +   σ   2   ) / E , with  (82)    σ   1   =   N   A   +   M   I   ·   H   2    and    σ   2   = −   1   W    min (   T   c   , 0 ) ,   here σ 1 is the usual normal stress for beams due to axial forces and bending. The term σ 2 contains the adhesive traction at the lower pad surface. Although it is not accounted for in beam theory, it can indicate the current position of the peeling front. As one can see in Fig. 10, both the spatula deformation and the internal stresses, tr  σ and σ 1, are very close for the two models. In addition, the peeling front occurs at the same location. This shows that the beam model is capable of capturing the peeling behavior of the spatula accurately even though it contains 90-times less degrees of freedom. Note that a more comprehensive study, discussing vertical peeling of a spatula for different pre-rotations, can be found in [11] for the 3D solid model.  This section investigates the influence of both the shear flexibility of the beam and the bending moment,   M   c   , caused by adhesion, see Eq. (27). For this purpose, we study the peeling processes discussed in Sections 4.3.1 and 4.3.2 for  (1) a large shear modulus ( G → ∞ ) and  the assumption that the contact moment is negligible,   M   c   = 0 .  We note that the assumption   GA   s   → ∞ leads to the Bernoulli beam formulation. Here, we increase G by the factor 1000. Fig. 11 shows the bending moment and peeling force for the two modified formulations compared to the original beam formulation. Neglecting the contact moment,   M   c   , results in smaller values for the applied peeling moment, M (   ψ   b   ) , and peeling force, P (   w   b   ) . This is also seen in Table 7 . In this case the spatula detaches earlier from the substrate than for the original model.  The influence of the shear flexibility becomes most apparent for large spatula deformations, see e.g.   ψ   b   = 29 ° in Fig. 11a. Nevertheless, spatula peeling is mainly characterized by axial and bending deformation. The results show that both quantities affect the peeling behavior of the spatula. Combined together, they lead to a symmetric finite element tangent matrix, k , which may accelerate the solution of the linear system (77).  Finally, we study the detachment behavior of the spatula for horizontal peeling. The base of the spatula shaft, rotated by   ψ   b   = 55 ° , is now loaded by a prescribed horizontal displacement in the positive and negative X-direction, u   |   S = 0   =   u   rot   +   u   b   and ψ   |   S = 0   =   ψ   b   . In the previous examples, friction had been omitted as it does not play any significant role for vertical loading [11]. For horizontal loading, however, the peeling behavior depends strongly on the friction behavior between the pad and the substrate. To model tangential debonding we consider the cohesive zone formulation discussed in Section 2.3.2. The parameters F 0 and g 0 are chosen such that, regarding the vertical direction, the cohesive zone model shows a peeling behavior similar to the van der Waals model. Here, the maximum adhesion force and the total contact energy should agree for both models. This yields  (83)    F   0   = −  1 W  T (    r   0   /   5   6    )  and    g   0   =     w   adh       F   0    exp ( 1 )   ,   where the work of adhesion,   w   adh   , is specified in Section 3.6. This choice results in a cohesive zone model that behaves almost identically to the van der Waals model during vertical peeling (where the tangential contact forces absent in the van der Waals model play no role). This is shown in Fig. 12 a. In Fig. 12b and c, the reaction force due to horizontal peeling is shown. The peeling behavior of the spatula depends strongly on the peeling direction. This is in agreement with the experimental observations of Autumn et al. [16]. Fig. 13 shows the deformed beam for different horizontal displacements. When the spatula is moved to the left, the adhesive spatula pad is pressed into the substrate, which causes large reaction forces, see Fig. 12b. For displacements in the positive X-direction, the pad curls up, which decreases the remaining contact area significantly. For this reason, the maximum reaction force is much smaller than for vertical peeling. Considering E=2GPa and   L   0   = 1  nm , the horizontal detachment forces are   P   max , l   ≈ 300  nN and   P   max , r   ≈ 6  nN , a difference of 50.   CONCLUSION   This paper presents a model for thin film peeling that is based on the geometrically exact beam formulation of Reissner [6], which is essentially a nonlinear version of the Timoshenko beam accounting for finite elongation, finite bending and finite shearing of the beam. For the description of the peeling forces, two different adhesion formulations are considered: (1) Bulk adhesion, e.g. van der Waals adhesion and (2) surface adhesion, e.g. cohesive zone models. In both cases, the peeling forces induce a significant bending moment within the beam that is not considered in the previous formulation of Sauer [8]. For shear deformable beams, the bending moment is important for consistency, as the stiffness matrix becomes unsymmetric otherwise. Also, this bending moment can become quite large, as shown in [9]. The new beam formulation is validated both against analytical peeling models and existing 2D and 3D solid FE models. Compared to the latter, the new formulation allows a major reduction in the computational complexity, while remaining remarkably accurate. This is shown by several examples examining the mechanical behavior of gecko spatulae. The high efficiency of the new model is a major advantage in the context of multiscale modeling of adhesion and in the context of optimization of adhesive microstructures [17,18]. Both these applications are currently under further investigation by the authors. The current computational results are based on piecewise linear interpolation. Further accuracy gains are expected with the use of high-order, continuously differentiable interpolation such as provided by Hermite or NURBS-based interpolation. In order to study the 3D peeling behavior of adhesive strips for an arbitrary direction, the beam model can be extended by considering a three-dimensional beam formulation, e.g. [19–21].   ACKNOWLEDGMENTS   The authors are grateful to the German Research Foundation (DFG) for supporting this research under project SA1822/5-1 and GSC 111.  In the computational framework, ill-conditioning of the contact stiffness matrix can be avoided by regularizing   T   c   and   M   c   for small distances, r , where the strip and the substrate repel each other strongly. If the distance of the lower beam surface to the substrate is larger than a certain distance,   r   reg   , the term     T   ^     c   is computed from Eq. (22). For smaller distances, we use linear extrapolation  (84)      T   ˜     c   ≔ {         T   ^     c   ,     r   1   >   r   reg   ,       T   c   reg   +   K   c   reg   (   r   1   −   r   reg   ) ,     r   1   ≤   r   reg   ,       where   T   c   reg   and   K   c   reg   are the traction and its derivative w.r.t. r, evaluated at the distance   r   reg   ,  (85)    T   c   reg   = T (   r   reg   ) − T (   r   reg   + H ( S ) cos  ψ ) ,      (86)    K   c   reg   = − [   b   c   (   r   reg   ) −   b   c   (   r   reg   + H ( S ) cos  ψ ) ] .   The functions T(r) and   b   c   ( r ) are given by Eqs. (23) and (18). This approach can be considered as a penalty method, which is a frequently used method to treat penetration in computational contact mechanics. A reasonable choice for the linearization distance is   r   reg   =   r   eq   , see Remark 2 in Section 2.3.1. The contact moment   M   c   can be regularized in the same manner.  The internal force tangent is assembled from the elemental stiffness matrices  (87)    k   int   =          k   int   e   ,    k   int   e   =   ∑   I = 1   n     ∑   J = 1   n     k   IJ   e   .   For the stiffness contribution, considering the nodes I and J in finite element Ω  e , we have  (88)    k   IJ   e   =   ∫     L   e       B   I   T     DB   J    d S +   ∫     L   e       Q   T   ( θ )   C   IJ   Q ( θ )  d S ,   where the first part is referred to as material stiffness and the second part as geometric stiffness. The terms D and   B   I   are obtained from Eqs. (11) and (51). The matrix   C   IJ   is defined as  (89)    C   IJ   ≔ [     0   0   −   N   I   ′     N   J   V     0   0     N   I   ′     N   J   N     −   N   I     N   J   ′   V     N   I     N   J   ′   N   −   N   I     N   J   α     ] ,   using the abbreviation  (90)  α = (   u   loc   ′   + cos  ψ ) N + (   w   loc   ′   − sin  ψ ) V .   In the equations above, N and V are the axial force and shear force acting on the deformed cross section, i.e. in the local directions,   u   loc   and   w   loc   . For an efficient FE implementation, the terms appearing in   k   IJ   e   should be multiplied out. This gives for the second term  (91)    Q   T   ( θ )   C   IJ   Q ( θ ) = [     0   0   −   N   I   ′     N   J     V   glo       0   0     N   I   ′     N   J     N   glo       −   N   I     N   J   ′     V   glo       N   I     N   J   ′     N   glo     −   N   I     N   J   α     ] .   The terms   N   glo   and   V   glo   can be understood as the axial and shear force acting in the global directions, i.e. along u and w. They are given by  (92)    N   glo   = N  cos  θ − V  sin  θ ,    V   glo   = N  sin  θ + V  cos  θ .       Remarks:  1. In analogy to the strain operator matrix, see Eq. (53), the elemental stiffness matrix can be expressed w.r.t. the local reference system  (93)    k   IJ   e   =   ∫     L   e       Q   T   ( Θ )   B   Loc  I   T     DB   Loc  J   Q ( Θ )  d S +   ∫     L   e       Q   T   ( Θ )   C   Loc  IJ   Q ( Θ )  d S ,   which is identical to Eq. (88). Here, we define the matrix   C   Loc  IJ   as  (94)    C   Loc  IJ   ≔ [     0   0   −   N   I   ′     N   J     V   Loc       0   0       N   I   ′     N   J     N   Loc       −   N   I     N   J   ′     V   Loc       N   I     N   J   ′     N   Loc     −   N   I     N   J     α   Loc       ] ,   using the abbreviation  (95)    α   Loc   = ( 1 +   u   Loc   ′   )   N   Loc   +   w   Loc   ′     V   Loc     and the forces   N   Loc   and   V   Loc   w.r.t. the directions   u   Loc   and   w   Loc      (96)    N   Loc   = N  cos  ψ − V  sin  ψ ,    V   Loc   = N  sin  ψ + V  cos  ψ .      Following Remark 4 in Section 3.2, the global degrees of freedom are interpolated after rotating them into the local reference system. For the strain operator matrix at node I thus holds   B   I   =   B   Loc  I   Q (   Θ   I   ) . The rotation matrices in Eq. (93) can then be moved outside the integral  (97)    k   IJ   e   =   Q   T   (   Θ   I   ) [    ∫     L   e       B   Loc  I   T     DB   Loc  J    d S +   ∫     L   e       C   Loc  IJ    d S  ] Q (   Θ   J   ) .   If we split   C   Loc  IJ   into an axial and a shear part,   C   Loc  IJ   = N   G   IJ   N   + V   G   IJ   V   , we obtain the formulation of Wriggers [7].  This section discusses the derivatives     T   ^     c   ′   ,   T   c   ⁎ ′   ,   T   d   ′   , and   T   d   ⁎ ′   required for the tangent matrix for bulk adhesion, see Section 3.3.1. From definition (21) follows that d   r   1   = d   r   M   and d   r   2   = d   r   M   . We thus obtain  (98)      T   ^     c   ′   =   ∂ T (   r   1   )   ∂   r   1     −   ∂ T (   r   2   )   ∂   r   2     ,    T   c   ⁎ ′   =   ∂   T   ⁎   (   r   1   )   ∂   r   1     −   ∂   T   ⁎   (   r   2   )   ∂   r   2     ,   and, considering Eqs. (23) and (30),  (99)    ∂ T ( r )   ∂ r   = −     A   H     2 π   r   0   4     [    1   5     (      r   0     r    )   10   −   (      r   0     r    )   4    ] ,    ∂   T   ⁎   ( r )   ∂ r   =   r     r   0        ∂ T ( r )   ∂ r   .   The remaining derivatives,   T   d   ′   and   T   d   ⁎ ′   , are determined analogously. For the derivative of the contact moment w.r.t. the position in current configuration we have  (100)    ∂   M   c     ∂ u   = [     T   ^     c   +   r   M       T   ^     c   ′   −   r   0     T   c   ⁎ ′   ]    tan  ψ   cos  ψ      n   p   T   .   According to Eqs. (22), (29), (98) and (99), the last two terms in the bracket are composed of  (101)    r   M       T   ^     c   ′   −   r   0     T   c   ⁎ ′   =   r   M   [    ∂ T (   r   1   )   ∂   r   1     −   ∂ T (   r   2   )   ∂   r   2      ] − [    r   1     ∂ T (   r   1   )   ∂   r   1     −   r   2     ∂ T (   r   2   )   ∂   r   2      ] =   H   2    cos  ψ   T   d   ′   .   This gives  (102)    ∂   M   c     ∂ u   = [      T   ^     c   +   H   2    cos  ψ   T   d   ′    ]   tan  ψ   cos  ψ     n   p   T   =   [    ∂   T   c     ∂ ψ    ]   T   .   From Eqs. (64) and (66) then follows that the elemental contact stiffness matrix,   k   c   e   , is symmetric.  The mass matrix that is required to solve the eigenvalue problem (81) is assembled from the elemental mass matrices  (103)  m =          m   e   ,    m   e   =   ρ   0     ∫     L   e       N   e   T   A   N   e    d S ,   where   N   e   is the shape function matrix, and ρ 0 is the beam density in initial configuration, which is assumed to be constant over S. The tensor A is given by A = diag  [ A ,  A ,  I ] .  We assume in the following that the shear stress within the structure varies only along the height, i.e. τ = τ ( Y ) . The shear area can then be obtained by solving  (104)    1   2       V   2       GA   s     =   1   2   ∫     τ   2   ( Y )   G    d A ,  τ ( Y ) =   VS ( Y )   IW ( Y )   ,   where V is the shear force resultant, I the second moment of area w.r.t. the beam axis, W(Y) the beam width, and S(Y) the static moment of the partial area up to Y , S ( Y ) = ∫ η W ( η )  d η . In the study of gecko spatulae in Section 4 we consider   A   s   = 5 / 6 A , which is reasonable as the cross section of the spatula pad resembles a rectangle if we neglect the pad rim, see Fig. 5. Besides, shearing effects are less significant than bending and elongation: comparing the eigenmodes by assuming either rectangular or circular cross sections for the shear areas the relative errors of the first ten natural frequencies are less than 0.81%.   REFERENCES", "highlights": "A nonlinear beam formulation is developed that is suitable to describe adhesion and debonding of thin films. The formulation is based on a shear-flexible, geometrically exact beam theory that allows for large beam deformations. The theory incorporates several aspects that have not been considered in previous theories before. Two different adhesion mechanisms are considered here: adhesion by body forces and adhesion by surface tractions. Corresponding examples are van der Waals adhesion and cohesive zone models. Both mechanisms induce a bending moment within the beam that can play an important role in adhesion and debonding of thin films. The new beam model is discretized within a nonlinear finite element formulation. It is shown that the new formulation leads to a symmetric stiffness matrix for both adhesion mechanisms. The new formulation is used to study the peeling behavior of a gecko spatula. It is shown that the beam model is capable of capturing the main features of spatula peeling accurately, while being much more efficient than 3D solid models."}