{"id": "S0168874X14001541", "article": "MAIN-TITLE An enhanced bridging domain method for linking atomistic and continuum domains   HIGHLIGHTS          The performance of bridging domain method is numerically verified.      A technique is developed to enhance the performance of bridging domain method.      The total displacement field is decomposing into fine and coarse scale fields.      The equations of motion of fine scale oscillations are derived.      The fine scales are removed by inserting a damping term in their equations of motion.          KEYPHRASES   Concurrent multiscale methods  Molecular dynamics  Continuum mechanics  Spurious wave reflections   Molecular dynamics simulations provide vast amount of information about material behavior at nanoscale. They have been particularly used to study how defects such as cracks, grain boundaries or dislocations affect macroscale processes such as elasticity or plasticity. However, the high computational costs associated with atomistic simulations limit their applicability to systems made of limited number of atoms. Coupled atomistic-continuum methods have been introduced as a remedy to this limitation. In the coupled methods, full atomistic resolution is maintained where deformations are highly inhomogeneous (e.g., at the vicinity of defects) and continuum models are used elsewhere [1–16]. The challenge lies in appropriate gluing of atomistic and continuum zones such that the atomistic region behaves as if the entire domain is atomistic. To achieve this objective, the effects of the atomistic-continuum interface should be minimized. In static problems ghost forces can be generated at the coupling interface [17] and a number of techniques have been developed to overcome this issue [9,11]. In dynamic problems an additional difficulty related to the passage of the propagating wave from atomistic to continuum across the interface is encountered; the change of the constitutive equations from inherently nonlocal atomistic to local continuum along with the change of the resolution from atomistic to continuum lead to spurious wave reflection at the interface. Since in the coupling methods atomistic zone usually has a small size, the spuriously reflected wave can quickly increase the temperature of atomistic zone, whereby destroys the simulation.  To avoid the spurious wave reflections, the interface between the atomistic and continuum should be such that coarse scale information (low frequency waves) can be accurately transmitted in both directions, whereas the fine scale oscillations which cannot be transmitted into the continuum zone should be eliminated at the interface. Several such interfaces have been developed in the past, among those are coarse-grained molecular dynamics (CGMD) method [4,5], macroscopic-atomistic-ab initio dynamics (MAAD) method [6,7], bridging scale method (BSM) [8,18], bridging domain method (BDM) [9,10], concurrent AtC coupling method [11,19], embedded statistical coupling method (ESCM) [12] and heterogeneous multiscale method (HMM) [20,21]. Reviews on concurrent atomistic-continuum multiscale methods can be found in [22–25].  Belytschko et al. [9,10] developed a bridging domain method (BDM) to couple continuum mechanics with molecular models. Bridging domain method lies in the category of overlapping domain decomposition coupling methods, or Arlequin method, which has been developed earlier by Ben Dhia [26–28]. This method has been used for modeling cracks and defects in graphene and carbon nanotubes [9,10,29,30] and has been combined with extended finite element method (XFEM) [31] to study crack propagation and dislocation emission in nanomaterials [32,33]. More recently, BDM applications are extended to multiscale analysis at finite temperature [34,35].  In the bridging domain method, continuum and atomistic domains overlap in a bridging (handshaking) domain where a weight function is used to partition the atomistic and continuum energy. In the overlapping domain, the positions of atoms and nodes are not necessarily coincident and the compatibility between atomistic and continuum domain is imposed by Lagrange multipliers. This allows to use a uniform mesh in the entire domain and removes the need for mesh refinement in the overlapping region.  In this paper, we first numerically show that the type of the discretization of Lagrange multipliers and the time integration step size significantly impact the success of BDM method in suppressing spurious reflections. Then, we present a new technique to enhance the performance of BDM and to alleviate the effects of the two aforementioned factors. In this method, the total displacement field of atoms located in the overlapping zone is decomposed into a fine and a coarse scale displacement field. The fine scale displacements corresponds to the oscillations which cannot be resolved by the finite element mesh and need to be damped. The elimination of fine scale oscillations is accomplished by deriving their equations of motion and inserting a damping term into their equations of motion.  The outline of this paper is as follows. In Section 2, we review the bridging domain method. In Section 3, we numerically study the performance of the BDM method and will provide the motivation of the proposed enhancement. The formulation of the new enhancement is presented in Section 4. The effectiveness of the method in removing spurious reflections and in modeling crack propagations will be investigated using numerical examples in Section 5. Some conclusions are made in Section 6.  In the bridging domain method (BDM), the domain Ω is composed of an atomistic subdomain,   Ω   A   , and a continuum subdomain,   Ω   C   , which overlap in a bridging or handshaking subdomain,   Ω   B   =   Ω   A   ⋂   Ω   C   , as shown in Fig. 1 . The edges of the atomistic and continuum subdomains in the bridging subdomain are denoted by   Γ   A   and   Γ   C   , respectively. In this paper, the superscripts ‘A’, ‘C’, and ‘B’ identify the variables associated with the atomistic, continuum, and bridging subdomains respectively. Accordingly,   Ω   0   A   ,   Ω   0   C   , and   Ω   0   B   denote the atomistic, continuum, and bridging subdomains in the initial configuration, respectively, where the subscript 0 refers to quantities defined at t=0. We denote the material coordinates by X or X  i , i = 1 , … ,   n   d   in component notation, where n  d is the number of spatial dimensions, and the current coordinates by x . We use subscripts I and J to refer to FE-nodes, and α and β to refer to atoms. The displacement of atom α is denoted by   d   α   (or   d   i α   in component form). The continuum subdomain is spatially discretized by a finite element (FE) mesh and its displacement field is approximated by  (1)    u   i   ( X , t ) =   ∑   J ∈ S     N   J   ( X )   u   iJ   ( t ) ,   where S is a set of finite element nodes, N  J is the FE shape function of node J and u  iJ is the ith displacement component of node J.  In the bridging domain method, the total Hamiltonian of the entire domain is obtained by adding up the Hamiltonian of the continuum and atomistic domains. To avoid double counting in the overlapping domain, the Hamiltonian of continuum and atomistic domains are weighted by a scaling factor ϑ ( X ) defined as  (2)  ϑ ( X ) = {     0   in  (   Ω   0   C   −   Ω   0   B   )     [ 0 , 1 ]   in    Ω   0   B       1   in  (   Ω   0   A   −   Ω   0   B   )       In our numerical calculations, we use a linear scaling factor defined as [10]   (3)  ϑ ( X ) =   ∥ X −   X   p   ∥   ∥   X   q   −   X   p   ∥     where   X   p   is the orthogonal projection of X onto   Γ   A   and   X   q   is the intersection point of line X  p X and   Γ   C   . The total Hamiltonian of the domain is given by  (4)  H ( u , d , λ ) =   H   C   ( u ) +   H   A   ( d ) +   G   B   ( u , d , λ )   where   H   C   is the continuum domain Hamiltonian,   H   A   is Hamiltonian from the atomistic domain, and G  B is the Hamiltonian associated with the Lagrange multiplier constraint that imposes displacement compatibility of the atomistic and continuum domain at the overlapping domain.  The contribution of the continuum domain in the total Hamiltonian is given by  (5)    H   C   =   ∑   I , J ∈ S     ∫     Ω   0   C     ( 1 − ϑ )     p   iI   C     p   iJ   C     N   I     N   J     2   ρ   0     d Ω +   ∫     Ω   0   C     ( 1 − ϑ )   W   C   ( F )  d Ω ,   where   p   iI   C   is the ith component of the linear momentum of node I, ρ 0 is the initial density of the continuum domain, W  C is the internal energy (strain energy) density and   F   ij   = ∂   x   i   / ∂   X   j   is the deformation gradient. The Hamiltonian of the atomistic domain is  (6)    H   A   =   ∑   α ∈ M   (    ϑ   α       p   i α   A     p   i α   A     2   m   α   A     +   ∑   β ∈ M > α     ϑ   α β     V   α β    )   where M is the set of all atoms,   p   i α   A   is the ith component of the linear momentum of atom α,   m   α   A   is the mass of atom α,   V   α β   = V (   r   α β   ) is the potential of the bond between atoms α and β which is a function of the bond length of two atoms (i.e.   r   α β   ),   ϑ   α   = ϑ (   X   α   ) and   ϑ   α β   = ( ϑ (   X   α   ) + ϑ (   X   β   ) ) / 2 .  The compatibility of deformation between atomistic and continuum domain in the overlapping zone can be imposed in different ways [9,10,36,37]. For example, the compatibility of deformations can be obtained by requiring displacement of the atoms conform to the continuum subdomain displacement field at the location of atoms [10]   (7)    ∑   I ∈ S     N   I α     u   iI   −   d   i α   = 0 ,  ∀ α ∈ M .   The compatibility of deformation can also be obtained by requiring the atoms velocities match with the continuum velocity at the atoms location. In this case, the constraint on velocity is given by  (8)    ∑   I ∈ S     N   I α       u   ̇     iI   −     d   ̇     i α   = 0 ,  ∀ α ∈ M ,   where     d   ̇     i α   and     u   ̇     iI   are the ith component of the velocity of atom α and finite element node I, respectively. The Lagrange multiplier constraints corresponding to Eqs. (7) and (8) are given by  (9a)    G   B   =   ∑   α ∈ M     λ   i α   (    ∑   I ∈ S     N   I α     u   iI   −   d   i α    ) ,      (9b)    G   B   =   ∑   α ∈ M     λ   i α   (    ∑   I ∈ S     N   I α       u   ̇     iI   −     d   ̇     i α    ) ,   where   λ   i α   is the Lagrange multiplier associated with the constraint in the ith degree of freedom of atom α. Lagrange multipliers can be approximated using any λ-mesh which satisfies the LBB condition  (10)  λ ( X , t ) =   ∑   K ∈   S   λ       N   K   λ   ( X )   λ   K   ( t )   where   S   λ   is the set of λ-mesh nodes,   N   K   λ   denotes the shape functions associating with the λ-mesh and   λ   K   are the λ-mesh nodal value.  Total Lagrangian of the system can be obtained from Legendre transformation of Hamiltonian, from which the equations of motion (EOM) of the system can be obtained as  (11)    M   α   A       d   ¨     i α   = −   (   f   i α   int   )   A   +   (   f   i α   G   )   A   ,  ∀ α ∈ M      (12)    M   I   C       u   ¨     iI   = −   (   f   iI   int   )   C   +   (   f   iI   G   )   C   ,  ∀ I ∈ S   where     d   ¨     i α   and     u   ¨     iI   are the ith components of the accelerations of atom α and FE-node I respectively, and  (13)    M   α   A   =   ϑ   α     m   α   A   ,      (14)    (   f   i α   int   )   A   =   ϑ   α β     ∑   β ∈ M     ∂   V   α β     ∂   d   i α     ,      (15)    (   f   i α   G   )   A   =   ∑   K ∈   S   λ       N   K α   λ     λ   iK   ,      (16)    M   I   C   =   ∑   J ∈ S     ∫     Ω   0   C     ( 1 − ϑ )   ρ   0     N   I     N   J    d Ω ,      (17)    (   f   iI   int   )   C   =   ∫     Ω   0   C     ( 1 − ϑ )   ∂   N   I     ∂   X   j       P   ji    d Ω ,      (18)    (   f   iI   G   )   C   = −   ∑   α ∈ M     ∑   K ∈   S   λ       N   K α   λ     N   I α     λ   iK   ,   where P is the nominal stress tensor, and   M   I   C   is a row-sum lumped mass matrix.  The Lagrange multipliers are obtained by enforcing  (19)    ∂ H   ∂   λ   iK     = 0 ,  ∀ K ∈   S   λ   ,   which leads to  (20)    ∑   α ∈ M      ∑   I ∈ S     N   K α   λ     N   I α     u   iI   −   ∑   α ∈ M     N   K α   λ     d   i α   = 0 ,  ∀ K ∈   S   λ   .      Since Eqs. (11) and (12) are coupled with Eq. (20), it is not possible to simultaneously update both the displacements and Lagrange multipliers. Therefore, we employ a predictor-corrector velocity Verlet algorithm to update the atomistic and continuum displacement and velocity fields. In the velocity Verlet algorithm, the acceleration field is obtained using central difference method  (21)      d   ¨     i α   n   =   1     ( Δ t )   2     (   d   i α   n + 1   − 2   d   i α   n   +   d   i α   n − 1   )      (22)      u   ¨     iI   n   =   1     ( Δ t )   2     (   u   iI   n + 1   − 2   u   iI   n   +   u   iI   n − 1   )   in which Δ t is the time-step size. By substituting Eqs. (21) and (22) into Eqs. (11) and (12), respectively, the displacement fields at step n+1 can be calculated as  (23)    d   i α   n + 1   =   (   d   i α   n + 1   )   pre   −     ( Δ t )   2       M   α   A       ∑   K ∈   S   λ       N   K α   λ     λ   iK        (24)    u   iI   n + 1   =   (   u   iI   n + 1   )   pre   +     ( Δ t )   2       M   I   C       ∑   α ∈ M      ∑   K ∈   S   λ       N   K α   λ     N   I α     λ   iK     in which the predicted displacements are  (25)    (   d   i α   n + 1   )   pre   = −     ( Δ t )   2       M   α   A       (   f   i α   int   )   A   + 2   d   i α   n   −   d   i α   n − 1   ,      (26)    (   u   iI   n + 1   )   pre   = −     ( Δ t )   2       M   I   C       (   f   iI   int   )   C   + 2   u   iI   n   −   u   iI   n − 1   .   Therefore; predicted displacements are obtained by ignoring Lagrange multipliers. The predicted displacements are used to find the Lagrange multipliers. To find Lagrange multipliers we use predicted displacements from Eqs. (23) and (24) into Eq. (20)   (27)    ∑   L ∈   S   λ       A   KL     λ   iL   =   ∑   α ∈ M     ∑   I ∈ S     N   K α   λ     N   I α     (   u   iI   n + 1   )   pre   −   ∑   α ∈ M     N   K α   λ     (   d   i α   n + 1   )   pre     where A  KL is called consistent constraint matrix and is defined as  (28)    A   KL   =   ∑   α ∈ M      ∑   I ∈ S     ∑   β ∈ M       ( Δ t )   2       M   I   C       N   K α   λ     N   L β   λ     N   I α     N   I β     u   iI   −   ∑   α ∈ M       ( Δ t )   2       M   α   A       N   K α   λ     N   L α   λ   ,  ∀ K ,  L ∈   S   λ     An essential step in the bridging domain method is to use diagonalized constraint matrix A  K instead of consistent constraint matrix [38]. The diagonalized constraint matrix is obtained from the consistent matrix as  (29)    A   K   =   ∑   L ∈   S   λ       A   KL   .   Although the diagonalization step might seem arbitrary at first, however it is shown in Ref. [38], and will be shown in Section 3, this step is quite essential in eliminating spurious wave reflections, and a consistent constraint matrix cannot remove the spurious reflections.  Our predictor-corrector algorithm can be summarized as follows: (1) we update the MD and FE displacement and velocity fields without considering the Lagrange multipliers, i.e. by ignoring   (   f   i α   G   )   A   and   (   f   i α   G   )   C   in Eqs. (11) and (12). The displacement field obtained at this stage is called “predicted displacement field”. (2) The predicted displacements will be used in Eq. (20) to find the Lagrange multipliers. (3) After finding the Lagrange multipliers, the predicted atomistic and finite element fields will be corrected by considering the Lagrange multiplier forces in Eqs. (11) and (12). These steps can be repeated until the displacement fields and Lagrange multipliers ( d , u and λ ) converge.  In this section, we discuss two issues associated with standard bridging domain method which motivated its enhancement with the proposed technique.  In the bridging domain method the compatibility of displacements between atomistic and continuum domains in the overlapping domain is enforced using Lagrange multipliers, as described in Section 2. Lagrange multipliers can be discretized using any λ-mesh which satisfies the LBB condition. However, two forms of discretization are more common: (1) the Lagrange multiplier field is discretized to the atomistic spacing i.e. each atom in the bridging subdomain coincides with a λ-node. In this form the Lagrange multipliers are approximated as  (30)  λ ( X , t ) =   ∑   α ∈ B     λ   α   δ ( X −   X   α   ) ,   where B is the set of atoms in the overlapping domain, and δ ( • ) is the Dirac delta function. This form of approximation imposes a strict displacement compatibility between atomistic and continuum and is the form we will refer to as ‘BDM-strict’ throughout this paper, (2) Lagrange multipliers are discretized by the same mesh as the FE-mesh i.e. each FE-node in the bridging subdomain coincides a λ-node. This form imposes a weaker compatibility between atomistic and continuum and is the form we will refer to as ‘BDM-weak’. In the BDM-weak the λ-shape function of each λ-node is the same as the corresponding FE-node shape function  (31)    N   K   λ   ( X ) =   N     I   K     ( X ) ,  ∀ K ∈   S   λ     where I  K is the FE-node which coincides with the K-th node in the λ-mesh.  BDM-strict is more efficient in removing spurious wave reflections [10] and is the form which is often preferable. However, to enforce strict compatibility λ-mesh should be as fine as the atomistic distance. This can significantly increase the degrees of freedom associated with Lagrange multipliers which in turn can lead to a higher computational cost. Furthermore, when discontinuities are available in the overlapping zone, the displacement compatibility should be enforced weakly to allow crack surface relaxation [32]. Since the weak compatibility is not as efficient as strict compatibility in removing the spurious wave reflections, in this paper, we propose a method to enhance the performance of weak compatibility to match or supersede the performance of strict compatibility.  In this section, we investigate how integration time step affects the performance of consistent and diagonalized constraint matrix in eliminating spurious wave reflections in a one-dimensional problem. For this purpose we study a 1D domain consisting of 292 atoms in the pure molecular dynamics zone (i.e.   Ω   A   −   Ω   B   ) and 60 finite elements of length h = 8   r   0   in the continuum domain. The length of overlapping subdomain is 4h. The Lennard–Jones interatomic potential is used to describe the nearest neighbor atoms interaction  (32)  V (   r   α β   ) = 4 ϵ [    (    σ     r   α β      )   12   −   (    σ     r   α β      )   6    ] ,  ∀ α ,  β ∈ M   in which   r   α β   is the distance between atoms α and β, and ϵ and σ are material specific input parameters. Here, we use atom mass   m   a   = 1  amu , ϵ = 0.2  eV and σ = 0.11  nm . This set of Lennard–Jones parameter leads to an equilibrium bond length of   r   0   = 0.135  nm . The constitutive equations of the continuum domain are obtained via the Cauchy–Born rule using the quasicontinuum approach [1].  The following initial displacements and velocities are applied to the atoms in the MD zone [38]:  (33a)  u ( X , t ) =   a   1   (  1 + cos (    2 π     N   c     r   0     ( X − ct ) + π  )  ) (  1 +   a   2    cos (    π   2   r   0     X  )  ) ,  X ≤   N   c     r   0        (33b)  v ( X , t ) =   2 π   a   1   c     N   c     r   0      sin (    2 π     N   c     r   0     ( X − ct ) + π  ) (  1 +   a   2    cos (    π   2   r   0     X  )  ) ,  X ≤   N   c     r   0        (33c)  u ( X , 0 ) = v ( X , 0 ) = 0 ,  X >   N   c     r   0     in which   a   1   = 3 ×   10   − 4    nm , a 2=0.3, N  c =120, and c=37.28nm/ps is the wave speed of a wave with infinite wavelength. The initial displacement field of the domain is shown in Fig. 2 . The problem is solved using both diagonalized and consistent constraint matrix employing a small ( Δ t = 0.00025  ps) and a large ( Δ t = 0.002  ps) integration time step. Since the time it takes for a wave to propagate one atomic spacing is Δ   t   0   = r / c = 0.0036  ps , the large integration time step used in this example is in the same order as Δ   t   0   , while the small integration time step is two order of magnitude less than Δ   t   0   . To obtain the reference solution, and for the sake of comparison, the problem is also solved using full MD description for the entire domain. The snapshots of the simulation results at t=2ps are depicted in Fig. 3 . The snapshots of Fig. 3a and b show that consistent constraint matrix is not very successful in eliminating spurious reflections of high frequency waves into the MD domain using either large or small integration time steps. These results are in agreement with those reported by [38]. In contrast, the efficiency of diagonalized constraint matrix in damping out the high frequency components of the wave depends on the integration time step. Snapshot of Fig. 3c and d indicates that when larger integration time step is used, the diagonalized constraint matrix can suppress the wave reflections, however when smaller integration time step is used, the diagonalized constraint matrix is not capable of eliminating spurious wave reflections. Hence, reducing the size of the integration time steps deteriorates the performance of the method. This is in contrast with our expectation of obtaining a higher accuracy when a smaller integration time step is used.  The problem is more studied by investigating the variation of the Hamiltonian of the system over time. The Hamiltonian of the entire domain along with the Hamiltonian of the atomistic and continuum subdomains are shown in Fig. 4 . If the waves travel out of the atomistic zone, i.e. spurious reflections do not occur, the Hamiltonian of the atomistic zone, i.e.   Ω   A   −   Ω   B   , should go to zero. The plots of Fig. 4a and b show that when consistent constraint matrix is employed, the Hamiltonian of the entire system remains constant and the Hamiltonian of atomistic zone does not go to zero. These indicate that no component of the wave is damped, hence spurious reflection is not eliminated and high frequency components of the wave are trapped in the atomistic zone. These are in agreement with the snapshots presented in Fig. 3a and b.  The Hamiltonians obtained using diagonalized constraint matrix are shown in Fig. 4c and d. Plots of Fig. 4c show that when diagonalized constraint matrix with larger integration time step is used, the Hamiltonian of the atomistic zone goes to zero after about 1.6ps. Therefore, no wave component is trapped in the atomistic zone. The wave coarse components have traveled into the continuum domain and the high frequency components are eliminated, as is shown in Fig. 3c. The plots of Fig. 4b show that when the integration time step size is reduced, the initial oscillations of Hamiltonian seen in Fig. 4b are removed. However, the Hamiltonian of atomistic zone does not go to zero, indicating that spurious wave reflection of high frequency waves is not prevented.  The plots of Fig. 4c and d show that by reducing the integration time step the performance of the diagonalized constraint matrix becomes similar to the performance of the consistent constraint matrix, i.e. high frequency waves which cannot travel into continuum subdomain spuriously reflect back into the atomistic zone, hence the Hamiltonian of atomistic zone never goes to zero. The deterioration of the performance by reduction of integration time step size is not desirable because large integration time steps can lead to large oscillations in system energy which can significantly reduce the computational accuracy.  To resolve the two above-mentioned issues, we propose an enhanced bridging domain method (EBDM). Although the proposed enhancement can be applied to both weak and strict compatibility, in this paper we apply the enhancement to the weak compatibility form. Using numerical examples we show the effectiveness of the proposed method.  The basic idea of our proposed method is to decompose the total displacement of the atoms located in the overlapping zone into fine and coarse scale components. The fine scale oscillations corresponds to high frequency oscillations which cannot pass into the finite element zone, and will spuriously reflect back if they are not damped out. To remove spurious reflections, the fine scale oscillations need to be removed. For this purpose, we obtain the equations of motion of fine scale oscillations and modify it to include a damping term.  The decomposition of atomistic displacement field into coarse and fine scales was first proposed by Liu et al. [8,39] in developing bridging scale method. This idea was later used to develop other multiscale methods such as perfectly matched multiscale method [40]. More recently, Sadeghirad and Tabarraei [14] used this idea to develop a multiscale technique which can effectively remove spurious reflections. In this section, we apply the technique developed in Ref. [14] to BDM. We first derive the equations off motion of fine scale oscillations in the BDM formulation and present a numerical algorithm for the implementation of the proposed enhancement in the BDM framework.  In the enhanced bridging domain method (EBDM), the total displacement field of atoms located in the overlapping zone is decomposed into a fine and a coarse scale displacement field  (34)    d   i α   =   (   d   i α   )   coarse   +   (   d   i α   )   fine   ,  ∀ α ∈   M   B   ,   where   d   i α   is the total displacement of atom α in the ith direction, and   (   d   i α   )   coarse   and   (   d   i α   )   fine   are its coarse and fine components, respectively. We correspond the coarse scale field to the oscillations which can be resolved by the continuum mesh and smoothly pass into the continuum zone without difficulty. Therefore, the continuum displacement field can be used to constitute the coarse scale part of the displacement field. Using standard finite element interpolation, the coarse scale displacement field of atoms can then be approximated as  (35)    (   d   i α   )   coarse   =   u   i   (   X   α   ) =   ∑   I ∈   S   B       N   I α     u   iI   ,  ∀ α ∈   M   B     By substituting Eq. (35) in (34), the fine scale component of the displacement field is obtained  (36)    (   d   i α   )   fine   =   d   i α   −   ∑   I ∈   S   B       N   I α       u   ¨     iI   ,  ∀ α ∈   M   B   .   The fine scale accelerations are obtained by taking the time derivatives of Eq. (37) twice  (37)    (     d   ¨     i α   )   fine   =     d   ¨     i α   −   ∑   I ∈   S   B       N   I α       u   ¨     iI   ,  ∀ α ∈   M   B   ,   Multiplying Eq. (37) with atoms mass yields  (38)    M   α     (     d   ¨     i α   )   fine   =   M   α       d   ¨     i α   −   ∑   I ∈   S   B       N   I α     M   α       u   ¨     iI     Using Eqs. (11) and (12) in (38) gives  (39)    M   α   A     (     d   ¨     i α   )   fine   =   (   f   i α   A   )   fine   ,  ∀ α ∈   M   B     where  (40)    (   f   i α   A   )   fine   =   M   α   A   [      (   f   i α   int   )   A   +   (   f   i α   G   )   A       M   α   A     −   ∑   I ∈   S   B       N   I α       (   f   iI   int   )   C   +   (   f   iI   G   )   C       M   I   C      ] .   This is the equation of motion of fine scale oscillations. The fine scale displacements cannot be resolved by the continuum mesh and should be eliminated. This is accomplished by adding a viscous damping term to (38)   (41)    M   α   A     (     d   ¨     i α   )   fine   =   (     f   ¯     i α   A   )   fine   −   M   α   A     C   α   A     (     d   ̇     i α   )   fine   ,   where   C   α   A   is the damping coefficient. Using viscous damping, a damping force proportional to fine velocity of the atom is applied to the fine motion of each atom. The selection of an appropriate damping coefficient is described in Section 4.3.  Assume that displacements are known at time step n and we intend to proceed to time step n+1. For this purpose, first the equations of Section 2.3 are used to find the total atomic and finite element displacements at step n+1. After the total displacement fields are found, the technique proposed in this paper is applied only to the atoms located in the overlapping zone. Since, these atoms compose a small fraction of the total atoms of the domain, the additional computational cost introduced by this extra step is negligible.  The velocity Verlet algorithm can be used to integrate Eq. (41) in time  (42a)    (   d   i α   n + 1   )   fine   =   (   d   i α   n   )   fine   + Δ t   (     d   ̇     i α   n   )   fine   +    1   2    Δ   t   2     (     d   ¨     i α   n   )   fine        (42b)    (     d   ̇     i α   n + 1 / 2   )   fine   =   (     d   ̇     i α   n   )   fine   +    1   2    Δ t   (     d   ¨     i α   n   )   fine        (42c)    (     d   ¨     i α   n + 1   )   fine   =   1     M   α       (   f   i α   n + 1   )   fine   −   C   α     (     d   ̇     i α   n + 1 / 2   )   fine        (42d)    (     d   ̇     i α   n + 1   )   fine   =   (     d   ̇     i α   n + 1 / 2   )   fine   +    1   2    Δ t   (     d   ¨     i α   n + 1   )   fine     After calculating the fine scale displacements, the total atomic displacements are obtained by adding the coarse and fine scale components together  (43)    d   i α   n + 1   =   (   d   i α   n + 1   )   fine   +   ∑   I ∈   S   B       N   I α     u   iI   n + 1   ,  ∀ α ∈   M   B   .   This gives the total atomic displacement after the elimination of fine scale oscillations.  The choice of the damping coefficient plays an important role in the success of the method in reducing spurious wave reflections. This necessitates some considerations to be taken into account when the damping coefficient is chosen. Application of the damping term can change the band structure of the overlapping subdomain which in turn can increase the spurious wave reflections. More specifically, the damping can increase the spurious reflections at the interface of bridging domain and pure atomistic zone (i.e.   Ω   A   −   Ω   B   ). To overcome this issue, the damping should not be applied suddenly, instead the damping should gradually increases from zero at   Γ   C   to a maximum value at   Γ   A   (see Fig. 1). Although different forms of damping function can be constructed which satisfy this condition, however in this paper, by getting insights from the semi-empirical damping function proposed by Collino and Tsogka [41] we approximate the damping coefficients using a parabolic equation in this form  (44)    C   α   A   =   C   ¯     c     L   B       ( 1 − ϑ ( X ) )   2   ,  ∀ α ∈   M   B   .   In Eq. (44) c is the wave speed,   L   B   is the width of the bridging subdomain, ϑ ( X ) is the linear weight function of Eq. (2), and   C   ¯   is a user-defined parameter. Using this approximation, very little spurious reflections are developed near   Γ   C   , and the fine scale displacements are effectively eliminated. A small value of   C   ¯   = 30 will lead to inefficient damping, whereas if   C   ¯   = 30 is too large, numerical instability will occur. In this paper, based on our experience in solving an extended number of numerical examples, we adopt a value of   C   ¯   = 30 in the numerical simulations presented in the next section.  We solve one- and two-dimensional examples to investigate the performance of the proposed enhancements. The problems are solved numerically using BDM-strict, BDM-weak and the proposed enhance bridging domain method (EBDM). Diagonalized constraint matrix is used to solve all the problems. All the numerical simulations are conducted at an absolute zero temperature and the reference solution of all the problems are obtained by using a fully atomistic description of the entire domain.  The first problem solved in this section is the one-dimensional problem presented in Section 3. The initial boundary conditions presented in Eq. (33) are applied to the atomistic zone. A Lennard–Jones potential with the same material parameters of Section 3 is used to consider the interaction between atoms. To study the effect of time integration step size on the performance of the method, this problem is solved using three different time steps. The effect of overlapping length on eliminating spurious reflections is studied by solving the problem using three different overlapping lengths of size n  b h, with   n   b   = 1 , 2 , 4 . Also, we solve the problem using both displacement constraint of Eq. (7) and the velocity constraint of Eq. (8).  The snapshots of the wave propagation obtained using a time step size of Δ t = 0.002  ps at t = 2  ps are shown in Fig. 5 . These snapshots show that BDM-weak is not capable in removing spurious reflections, whereas both BDM-strict and EBDM are able to remove spurious reflections.  The total Hamiltonian of the atomistic zone versus time obtained using displacement and velocity constraints are shown in Figs. 6 and 7  , respectively. For the sake of comparison, the results obtained from a full MD simulation are also presented. Since the initial waves are traveling out of the atomistic zone, the Hamiltonian of the pure atomistic zone should go to zero. This can be seen in the plots of Fig. 6a obtained using full MD simulations.  The results obtained from strict and weak BDM are shown in Figs. 6b–g and 7b–g. These plots show that, as expected, strict compatibility is more successful in eliminating spurious wave reflections than weak compatibility. These plots also confirm that regardless of the size of the overlapping domain, standard BDM methods are more successful in removing spurious reflections when the integration time step is large. An important observation can be made by comparing results presented in Fig. 6b–d with those presented in Fig. 7b–d. These plots indicate that when velocity constraint is used, the size of integration time step does not influence the performance of standard BDM methods as severely and adversely as when displacement constraint is used.  The results obtained using the proposed enhanced bridging domain method are presented in Figs. 6h–j and 7h–j. These plots show that EBDM is more efficient than both strict and weak-BDM method in eliminating spurious reflections. The enhancement in the performance is more significant when the overlapping length size is small (n  b =1). Furthermore, these plots indicate that our enhancement removes the adverse effect of reduction in the size of time step; by reducing the time step size the performance of EBDM improves, showing the same exact trend as is observed in the results obtained from full MD simulations.  The effectiveness of the proposed method in modeling crack propagation is investigated by simulating growth of a crack located at the middle of a two-dimensional domain which is under uniaxial tensile loading. The atomistic subdomain is made of a triangular lattice which corresponds to the [111] plane of an FCC crystal. The interatomic interactions are modeled using the Lennard–Jones interatomic potential presented in Eq. (32). Only nearest neighbor atoms are used in the evaluation of interatomic potentials. For this problem, we use ϵ=0.467eV and σ=0.2296nm which leads to an equilibrium bond length of r 0=0.2577nm of the triangular lattice. An atom mass of m  a =64amu is used in the simulations. The initial geometry and boundary conditions of the domain are shown in Fig. 9. The entire domain dimensions are 63.02nm×60.49nm and the initial crack length is 10nm. A linearly rising velocity ramp followed by a plateau (Fig. 8 ) is applied to the upper and lower edges of the continuum domain. The two side edges of the domain are traction free. The effect of overlapping width on the performance of the method is studied by solving the problem using two overlapping size of length L  B =1.78nm and L  B =7.06nm as are shown in Fig. 9 .  The variation in total Hamiltonian of the domain versus time is shown in Fig. 10 . The graphs of Fig. 10 show that the Hamiltonian of the system obtained from EBDM is in close agreement with the full MD simulations using both small or large overlapping subdomain. However, when standard weak or strict bridging domain methods are used, the Hamiltonian of the system will approach the full MD results only when the size of the overlapping domain is large.  The number of broken bonds of the pure MD zone versus time is shown in Fig. 11 . It can be observed that when the overlapping width is small, standard BDM methods vastly overestimate the number of broken bonds. However, the number of broken bonds obtained from EBDM is in agreement with full MD results using both small and large overlapping size.  We further compare the performance of the techniques by investigating the crack path obtained from each method. The crack growth paths obtained using small overlapping length are schematically shown in Fig. 12 . This figure clearly shows that when full MD or EBDM method are used, the initial crack grows self-similar (coplanar) from the initial crack. However, when standard BMD methods are employed to model crack growth, the initial crack does not grow, instead atomic bonds break at the interface of continuum and overlapping zone, leading to the generation of new cracks along   Γ   A   . The new cracks then grow along   Γ   A   to the side edges of the domain. By increasing the size of overlapping zone, the crack growth path obtained from standard BDM approaches that of pure MD, however this example clearly shows that EBDM is more efficient in modeling problems involving discontinuities.  In the previous example, crack growth under uniaxial tensile test was studied. In this example we examine the capability of the method in modeling crack propagation under mixed mode loading. For this purpose we consider a cracked domain under mixed tensile-shear loading.  The initial geometry and boundary conditions of the problem are shown in Fig. 13 . The domain dimensions are 32.41nm×60.50nm and the initial crack length is 5.0nm. A tensile and shear loading act simultaneously at the top and bottom edges of the domain. The velocity function shown in Fig. 8 is used to prescribe both tensile and shear components of the external loading. The side edges of the domain remain traction free. The same lattice structure and interatomic potential used for the example of Section 5.2 are used to solve this problem.  Total Hamiltonian of the pure MD zone versus time for the edge crack examples is shown in Fig. 14 . These plots show that when the overlapping width is large all the results are in agreement with full MD. However, for smaller overlapping domain, only the Hamiltonian obtained from EBDM is in agreement with the Hamiltonian of full MD. The number of broken bonds versus time obtained from different methods is shown in Fig. 15 . These plots also show that standard BDM results are in agreement with full MD only when the overlapping length is large, whereas EBDM results match with the full MD results even when the overlapping length is small.  The crack propagation path obtained from all the simulations are shown in Fig. 16a and b. These figures clearly show that if the overlapping width L  B is small, only EBDM is able to predict the crack path correctly. On the other hand, when overlapping width is small, not only the crack paths obtained from BDM-strict and BDM-weak do not coincide with the MD result, but also atom bonds along the top and bottom of the MD zone are also breaking. Therefore, standard BDM methods are capable of predicting the correct crack path only when the overlapping length is large. These results clearly demonstrate the superior efficiency of the enhanced bridging domain method (EBDM) proposed in this paper with respect to the standard bridging domain method.   CONCLUSIONS   In this paper, we investigated the performance of standard bridging domain method as a function of overlapping length size, the form of Lagrange multipliers discretization (strict versus weak compatibility), the type of constraint matrix (consistent versus diagonalized), the integration time step size, and the type of constraint between atomistic and continuum domain in the overlapping zone (displacement versus velocity constraint). Our numerical simulations indicate that  • by increasing the width of overlapping zone, the performance of bridging domain method improves,  strict compatibility is more efficient than weak compatibility in removing spurious reflections,  performance of diagonalized constraint matrix in removing the spurious reflections is significantly better than consistent constraint matrix,  by reducing the size of time step the capability of standard BDM in eliminating spurious reflections reduces,  velocity constraint is less sensitive to time integration step size and is the form of constraint which should be used.  The key contribution of the paper is proposing a new technique to enhance the performance of bridging domain method in eliminating the spurious wave reflections at the interface of atomistic and continuum domain. In our proposed enhancement the overlapping zone plays two important roles: (a) it glues the continuum domain to atomistic domain, and (b) it is used as a damping zone which damps the high frequency waves that cannot travel into the continuum domain. To damp the high frequency waves, we decomposed the total displacement field of atoms located within the overlapping zone into a fine and coarse scale. The fine scale oscillations correspond to the small wavelength (high frequency) components of the wave and need to be eliminated. To damp the fine scale oscillations, we included a viscous damping term in their equations of motion.  Our numerical results showed that the proposed enhancement significantly improves the capability of the bridging domain method in removing the spurious reflections. In contrast to the standard bridging domain methods, by reducing the time step size, the performance of enhanced bridging domain method improves. Also, the numerical results obtained from one and two-dimensional problems indicate that the proposed technique is capable in eliminating spurious reflections using a much smaller overlapping length than those required by the standard BDM.   ACKNOWLEDGEMENTS   The first two authors gratefully acknowledge the support from the University of North Carolina at Charlotte through the start up package and Grant no. 1-11206. The two anonymous reviewers are gratefully acknowledged for their constructive comments.   REFERENCES", "highlights": "Bridging domain method (BDM) is a multiscale method which couples molecular dynamics (MD) with finite element simulations. In this paper, using numerical study we show that time integration step size and the discretization of Lagrange multipliers can highly impact the capability of BDM in removing spurious reflections. We present a technique to enhance the performance of bridging domain method and to alleviate the effects of the two aforementioned factors on the BDM. In our technique, the total displacement field of the atoms located in the overlapping zone is decomposed into a coarse and a fine field. The equations of motion of fine scale oscillations are first obtained and then modified to include a damping term. The damping condition effectively filters out and removes the fine scale oscillations that cannot pass into the continuum domain; hence eliminates the spurious wave reflections. Using numerical examples, we show that the proposed enhancement significantly improves the performance of bridging domain method. This is specially significant when discontinuities such as cracks are present in the domain or when the integration time step is small."}