{"id": "S0168874X15001821", "article": "MAIN-TITLE Effects of surface roughness on micro deep drawing of circular cups with consideration of size effects   HIGHLIGHTS          The new FE model considers both surface roughness and size effects for micro deep drawing of circular cups.      The new FE model provides more accuracy results than normal models when compared with experimental results.      Surface roughness affects the springback, the drawability and the cups’ quality obviously in micro deep drawing.          KEYPHRASES   Micro deep drawing  Surface roughness  Size effects  Voronoi  Cup quality   Driven by the urgent requirement on the miniaturised products that can bear harsh working environments, such as small or tiny devices, micro metal products have been required. Accordingly various metal micro forming methods have been developed. Moreover, micro forming has drawn increasing attention due to its advantages, such as the potential of mass production, the capacity to fabricate 3D products with a high aspect ratio and the power of (near) net producing [1,2]. However, micro forming is a budding technology compared to well-developed silicon based micro manufacturing technologies for Micro-Electro-Mechanical Systems (MEMS) products [3]. Several obstacles relating to tiny sizes need to be overcome to fulfil the superiority of micro forming processes. Once scaled down to a micro scale, influences of different impact factors in micro forming change from that in normal forming processes, and some ignorable factors in macro forming become obvious and significant [1,4–7]. One typical phenomenon is the change of material properties at the micro scale. The decrease of flow stress with small sample sizes has been observed and corresponding theories, such as the surface layer model and the modified surface layer model [8,9], have been developed as explanations. Additionally, modifications to the traditional material models, such as the Swift model and the Hall–Petch model [10,11], have been conducted to fit the strain–stress relationship in the micro scale. However, those developed or modified models can partly explain size effects and none of them can present deformation with size effects on the micro scale. Another phenomenon is the increase of data scatter of the material properties at the micro scale, which has been explained by the ratio of grain size to sample feature size. A large ratio meant that deformation behaviour was determined by a few grains and therefore, randomness was increased resulting in significant data scatter [12]. Thus, a finite element (FE) model that considers size effects on the micro scale is required.  Compared to the material’s intrinsic properties, influences of non-intrinsic properties also change in the micro scale. Surface roughness, a non-intrinsic property, though being very slight, can be relatively large compared to the minute sizes of micro products. Hence, surface roughness can be considered as a part of the geometry and affects the micro forming process and then the products, whereas the research on surface roughness has mainly focused on the friction fields [13–15]. Corresponding models describing the change of friction coefficient, such as the open and closed lubricant pockets model and the normal pressure based dynamic friction coefficient model [13,16], have been developed. Consequently, the influence of surface roughness is primarily expressed by the friction coefficient in the normal micro forming FE models. However, effects of roughness on the forming process and products quality cannot be fully exhibited, although size effects on friction have been considered in those models. Moreover, a real surface topography or a simplified rough surface was introduced into FE models, and these models could exhibit detailed surface roughness information [17]. Nonetheless, the meshes based on this complex surface topography were of tetrahedron or triangular meshes. As a result, forming simulation could barely be conducted due to the large quantity and poor quality of meshes in these models. Therefore, a FE model that considers influences of the surface roughness from a geometry viewpoint and counts friction in the micro scale is highly needed.  In this study, micro deep drawing (MDD) of circular cups was chosen as the research objective as the cup-like micro products have been widely applied. A voronoi model that considers material size effects was generated. Furthermore, the surface roughness of the blank was considered and represented by thickness distribution in this voronoi model. Springback was also simulated after micro deep drawing calculation. Consequently, effects of roughness on the micro deep drawing process and the drawn cups were studied.  A normal deep drawing FE model was firstly developed as a fundamental model in LS-DYNA. Fig. 1 displays (a) the fundamental deep drawing model and (b) its geometry sketch. There were a punch, a die, a blank holder and a blank which was the only deformable part in this model. One quarter of the machine was modelled to accelerate computational speed. Accordingly, symmetrical boundaries were applied on the symmetrical lines of the blank. Moreover, all the parts were modelled on shell elements, and the blank was meshed with high quality quadrilateral meshes through carefully allocating mesh seeds on each line of the blank. These high quality quadrilateral meshes are beneficial for forming simulation with great deformation. Additionally, the blank applied a fully integration elemental formula while others were assigned a default elemental formula. Seven integration points through thickness direction were employed to accurately capture thickness direction stress–strain distribution and provide accurate and adequate information for subsequent springback simulation. Regarding the friction, a surface-to-surface forming contact algorithm specialised for metal forming simulation was applied. Further, a constant friction coefficient was utilised and its value was tested by a Universal Tribometer from ©Rtec Instruments. A 3-parameter-Barlat material model was employed for the blank with a thickness of 50µm [18], while all the other parts were of a rigid material model. The parameters of each blank material model were tested 10 times using repeated tensile tests. According to the plane stress assumption of the material model, a plane anisotropy index (the R-value), defined as the instantaneous strain ratio of width to thickness (Eq. (1)), was utilised to update thickness. Moreover, a yield stress criterion, defined as Eq. (2), was employed for the blank.  (1)   R =     d W   d ε   / W     d T   d ε   / T         (2)   Φ = a   |   K   1   +   K   2   |  m  + a   |   K   1   −   K   2   |  m  + c   | 2   K   2   |  m  = 2   σ   Y   m         (3)     K   1    =      σ   x    +   h    σ   y      2          (4)     K   2    =      (      σ   x    −   h    σ   y      2     )   2    +    p   2     τ   xy   2        where   σ   Y   is the yield stress,   σ   x   and   σ   y   are stress along x and y directions respectively,   τ   xy   is the shear stress, a, c, h and p are the material parameters which can be obtained by Eqs. (5)–(8). Moreover, p can be searched by iterations of Eq. (8) at the condition of  ϕ = 45 °  . For isotropic material, a=c=h=p=1. Further, M=8 for face centred cubic (FCC) material.  (5)   a   = 2 − 2        R   00      1 +    R   00         R   90      1 +    R   90            (6)   c   = 2 −   a       (7)   h   =        R   00      1 +    R   00          1 +   R    90       R   90            (8)   g  ( p )  =   2 m  σ Y m     (   ∂ Φ   ∂  σ x    +   ∂ Φ   ∂  σ y    )   σ ϕ    − 1 −  R 45  = 0    where   R   ϕ   is the R value at angle of  ϕ  .  This model employed normal material model for the blank and therefore cannot represent any size effects. Furthermore, the blank had a constant thickness, thus surface roughness and its influences cannot be revealed.  As the basic model cannot consider any size effects, a voronoi model was then developed. The voronoi tessellation is a special spatial partition where each voronoi cell has its own space and does not overlap the other cells. This partition is comparable to crystal microstructure of metals. Therefore, the basic idea of this voronoi model is dividing the blank into small regions according to the voronoi tessellation where each region has similar shape and size to grains on the blank and assigning individual material properties to each region [19]. Hence, the voronoi model can represent the blank on a grain scale and include size effects through adjusting distribution of small regions with different material properties. To generate the voronoi FE model, a group of voronoi generating seeds with the same number of grains on the blank were randomly distributed on the blank area. Due to the relationship between the random generating seeds and the voronoi structure, the initial voronoi tessellations were irregular and far from the blank microstructure. As the metal was annealed and its grains were equiaxed, a constant density function was introduced to generate a centroid voronoi where voronoi cells are of similar shape and size. Furthermore, a Laplacian optimisation algorithm was adopted to further optimise the geometry of this centroid voronoi structure. Therefore, short lines and small faces were eliminated. Finally the optimised centroid voronoi was mapped onto the meshed blank and each shell element on the blank was reassigned its part ID index. Consequently, the meshes belonging to one voronoi cell were identified, and then individual mechanical properties were attached to these elements. Although the same material model, the 3-parameter-Barlat model, was used, meshes in different voronoi cell parts had different material parameters. The whole blank model thus had different properties at different areas. Furthermore, the material parameters covered the whole range of material properties from the repeated tensile tests and individual grain’s properties randomly lay in this material properties range. Moreover, for simplification, all the voronoi cells were randomly classified into five groups and each group, defined as one independent part in LS-DYNA, had similar number of voronoi cells. Each voronoi cell part had different material properties and a unique response to a given deformation resulting separate strain. Consequently, strain and stress distribution were affected by each grain part on the blank. Moreover, as each voronoi cell was similar to the grains on the blank, this voronoi model can represent the blank at a grain scale reflecting the material size effects. Fig. 2 displays the voronoi structures and their corresponding FE models with average grain sizes of 10, 20 and 40µm respectively.  The voronoi structure was generated and its geometry information was stored in MATLAB. Subsequently, the blank meshes’ information was read into MATLAB from a ‘k’ document which is the LS-DYNA executable document. By comparing elements and voronoi cells geometrical information, each element’s ID information was reassigned and exported to the same ‘k’ document by a MATLAB programme. Therefore, the voronoi model of the blank was built and ready for calculation. This voronoi model considered the material size effects but not the surface roughness. Therefore, the roughness introduced phenomena were not well presented.  As the roughness asperity heights are relatively large compared to the thickness of the blank, these asperities can be a part of the thickness. Therefore, the thickness distribution was used to represent surface roughness in this study. Each voronoi tessellation owning a distinct thickness can then represent a rough surface on a grain scale. Moreover, as the voronoi cells were randomly arranged, five separate thickness values for the voronoi cells groups were able to characterise the surface roughness from a statistic viewpoint. Furthermore, the FE model could satisfy detailed roughness parameters, for example, the arithmetic average height (Ra ), due to the interlaced distribution of cells in each group.  Four surface roughness parameters, the arithmetic average the height (Ra ), the root mean square roughness (Rq ), the skewness (Rsk ) and the kurtosis (Rku ) [20], were firstly utilised to characterise roughness and build equations. Additionally, one asperity value was set as the weighted mean value of the other four asperity values (Eq. (9)). Therefore, five equations were established and all five asperity values in this model can be solved. As the selected roughness parameters are based on lines, they need to be extended to areas. Firstly, the Ra , shown as Eq. (10), was extended through width direction, as shown in Eq. (11). Consequently, Ra based on area (Eq. (12)) can be obtained and its discretisation form, Eq. (13), was utilised for numerical calculation. All the other surface roughness parameters were modified as that of Ra . Eqs. (14)–(16) show the numerical forms of Rq , Rsk and Rku respectively.  (9)     Z   5    =     ∑     s   i     Z   i       ∑     s   i            (10)    R a  =  1 l   ∫ 0 l   |  Z ( x )  |  dx       (11)    R a  =  1 l   1 w   ∫ 0 w   ∫ 0 l   |  Z ( x , y )  |  dx  dy       (12)     R   a    =    1    S     ∮    |   Z   (   s   )   |   ds         (13)     R   a    =     ∑     s   i    |    Z   i    −     ∑     s   i     Z   i       ∑     s   i       |      ∑     s   i            (14)     R   q    =       ∑     s   i     (    Z   i    −     ∑     s   i     Z   i       ∑     s   i       )   2       ∑     s   i              (15)     R   sk    =    1     R   q   3      [     ∑     s   i     (    Z   i    −     ∑     s   i     Z   i       ∑     s   i       )   3       ∑     s   i       ]        (16)     R   sk    =    1     R   q   4      [     ∑     s   i     (    Z   i    −     ∑     s   i     Z   i       ∑     s   i       )   4       ∑     s   i       ]     where l is the sampling length, w is the sampling width, Z is the height of peaks or valleys, Z  i is the average asperity height of an individual voronoi cell   s   i   ,  S =   ∑     s   i    is the total sampling area, and   s   i   is the area of an individual cell.  Actual surface roughness was measured by a laser-assisted high-resolution digital microscope (VK-X1000/X2000 series from ©KEYENCE) and listed in Table 1. As roughness parameters were the mean value for three repeated measurements, it is possible that the roughness equations are unsolvable for the exact solution. Therefore, they were solved in MATLAB iteratively and a group of approximate solutions within tolerable errors could be found. Moreover, Rp and Rv , the highest peak and lowest valley heights of a surface, were used to limit the searching range of the numerical solution. As the normalised blank thickness was 50µm, the actual thicknesses (T  i ) in the simulation model were therefore the sum of the normalised blank thickness and roughness asperity height (Eq. (17)). Thickness values of each group of voronoi cells were shown in Fig. 3(d). Due to the errors in iterations being quite small, these thickness values can be used in the simulation embodying the real surface roughness. Fig. 3 exhibits the initial thickness distribution of each blank model.  (17)     T   i    = 50 +    Z   i         Shell thickness is important for the surface-to-surface forming contact algorithm specialised in LS-DYNA as it affects contact force and friction. A penalty contact method was applied to load contact force and the contact force (the penalty force) was calculated from the penetration distance between two contact faces (Eq. (19)). Moreover, the penetration distance is relative to the blank thickness, shown in Eq. (18). Due to the surface roughness (the shell thickness in the models), the penetration distance at a local area was different, and therefore the contact force was various for the nodes in a local area as illustrated in Fig. 4. Consequently, the friction at a different node was different. While for models with constant blank thickness, the penetration distance was the same for all nodes in a local area due to a constant shell thickness and therefore the contact forces were the same for these nodes. Although constant friction coefficient was used, friction force at different nodes at a local area can be unequal due to the uneven contact force. Therefore, friction conditions on the micro-scale can be presented in the new models.  (18)   l   =    n   i    (    ξ   c    ,    η   c    )   ∙   [   t   −   r   (    ξ   c    ,    η   c    )   ]   < 0       (19)    f s  = − l ∙  k i  ∙  n i        (20)    k i  =    f  s i    K i   A i    max  ( shell  diagonal  )      where l is the penetration distance,   n   i   is the normal vector at the ith node, t is the half thickness projected to the normal of tool surface, r is the vertical distance between a node on the blank to the tool surface,   f   s   is the penalty force (contact force),  k i  is the stiffness factor of master face,  f  s i   is the contact stiffness factor,  K i  is the contact element modulus, and   A   i   is the elemental area.  The voronoi model with variable thickness considered the material size effects and presented precise friction conditions for nodes in different voronoi cells. Furthermore, roughness influences on drawing process and drawn cups were included as surface asperities were considered as one part of geometry. Therefore this model considers more details in micro deep drawing and can offer precise results.  After micro deep drawing simulation, only the drawn cup was employed for a following springback simulation. The material model, the elemental information and the parts arrangements were the same as that in the deep drawing models while the solver was changed from explicit to implicit solver in LS-DYNA. The thickness and strain–stress information at the end of the drawing simulation was also included in the springback models. As seven integration points were employed, the thickness and strain–stress information were accurate and adequate for springback simulation. Furthermore, two points on the symmetrical edges were fixed according to the symmetrical boundary conditions to limit the rigid movement of the cup. Consequently, the residual stress can be released gradually in a few calculation steps. Dynamic step adjustment and artificial stability were added to improve calculation. As voronoi models were still used in the springback simulation, size effects on springback behaviour can be presented. Furthermore, effects of roughness on the springback could be observed as well.  The necessary experiments were conducted for the modelling and verifying the simulation results. Firstly, the raw SUS304 sheets with a thickness of 50µm were heated at different temperatures (975, 1050 and 1100°C) in an argon gas protection atmosphere for 2min respectively. Therefore, the grains on the sheets were of equiaxed crystals, and their average grain sizes were 10, 20 and 40µm with increasing temperatures. Based on their microstructures, the voronoi models were developed. Moreover, according to the heat treatment temperatures and the average grain sizes, all sheets were classified as materials 1, 2 and 3 respectively.  Next, the micro tensile tests were conducted. To take size effects into account, the tensile test samples were scaled down and, therefore, the width of the samples was only one millimetre. Ten tests were repeated for each material group. Fig. 5 displays (a) the geometry of micro tensile test samples, and (b) the strain–stress curves from the tensile tests.  To obtain the surface roughness information, the sheets of all material groups were tested by a high-resolution laser-assisted digital microscope (VK-X1000/X2000 series from ©KEYENCE). A 3D digital image was generated by a series of images at sequential focusing heights, and then a virtual surface was fitted according to the observed 3D image. Finally, the surface roughness parameters were calculated from the projection of the 3D image onto the virtual surface. Thus the surface roughness information can be separated from the geometry of the samples.  The Universal Tribometer from ©Rtec Instruments was used to test the friction coefficient. A piece of SUS304 sheet was firstly fixed on a testing disk, and then installed into the Tribometer platform. For accurate friction coefficient tests, the same material of the punch and the die was chosen as the friction pair in the Tribometer. Moreover, a similar relative speed of the blank during the drawing process is transferred to the rotation speed in the friction tests. The friction coefficient was therefore obtained from the mean values of the repeated friction tests.  The micro deep drawing machine had the same size as that in Fig. 1(b), and the sheets were drawn into cups. During the drawing process, the drawing force was recorded and exported to a computer for further analysis. The same digital microscope was used to observe the drawn cups. Similarly, the 3D image was generated and the cups were coloured according to the height information. Therefore, the drawn cups mouth can be easily identified and measured. Fig. 6 shows the drawn cups with different materials.   RESULTS AND DISCUSSION   For convenience, the basic model, the voronoi model with a constant blank thickness and the voronoi model considering roughness were named as model I, II and Ш respectively. As the SUS304 sheets were heated at three different temperatures (975, 1050 and 1100°C), the sheets were classified as materials 1, 2 and 3 correspondingly. Therefore, a given simulation model with a specified material can be expressed by a Roman number and an Arabic number, for example, ‘II 3’ meaning voronoi model with a constant blank thickness (model II) using 1100°C heated SUS304 sheets (material 3).  Due to the difficulty in measuring springback, a springback judgement, an average power of displacement before and after springback of each node (Eq. (21)), was defined to approximate the total springback behaviour quantitatively.  (21)     J   s    =     ∑    (    d   ix   2    +    d   iy   2    +    d   iz   2    )      n       where   J   s   is the springback judgement, di is the displacement of node i and n is the total number of the nodes on the cup.    Fig. 7 displays the springback judgement for each simulation model and material. The overall springback in the voronoi models was higher than that of the common models without considering size effects or surface roughness. Due to the introduction of the voronoi model, the blank had different properties at different areas. The weak and thin areas on the blank undertaken the same stress had great strain due to their low flow resistance. Therefore, the stored strain energy was high for the voronoi models and the largest for the voronoi models considering surface roughness among all the simulation models. Moreover, the unevenness of material properties and thickness distribution on the blank intensified the unevenness of strain–stress distribution on the blank. After springback, all the residual stress–strain stored in the blank was released and therefore, the voronoi models accounting the surface roughness underwent the greatest springback. The voronoi models with a constant thickness owning less unevenness had smaller springback amount than the models considering surface roughness, while the normal models had the smallest springback amount.  The diameter of the drawn cup mouth after springback was chosen to evaluate the accuracy of the simulation. Firstly, the nodes’ coordinates of the cup were exported from springback simulation results and the nodes at the top were identified according to their Z coordinates. Secondly, these selected nodes were fitted by a circle in MATLAB using a second-order polynomial equation to obtain the diameter of the fitted circle. Finally, the drawn cups in experiments were observed under the same microscope to that for surface roughness measurement. The diameter was determined as the mean value of the maximum and minimum diameters of the top layer on the cup. Fig. 6 displays the drawn cups coloured according to cup height in experiments as it is easy to identify the mouth of the cup. Furthermore, the mean value of three repeated measurements was utilised as the final experimental result. Fig. 6(d) shows the diameters of each simulation and experimental condition. Voronoi models considering surface rough had closer diameter values to the experimental results than the other two kinds of models. Furthermore, diameters of the three simulation models had a decreasing trend for a given material. Because of the weak areas on the blank with low flow resistance, they coordinated the overall deformation and strain–stress development. Therefore, the compression strain on the top of the cup, where the compression is the largest on the blank, was easy to transfer to the adjacent area. Therefore, the springback on the top of cup, the extending deformation of the cup mouth, was small due to the reduced compression strain. The roughness represented by the thickness differences further reduced the diameter due to the introduced thin areas with low flow stress. Consequently, the diameter of cup mouth in the model III was the smallest of all simulation models. Furthermore, with low flow stress, materials 2 and 3 had smaller cup mouth diameters than that of material 1 for each simulation model. This can also be explained by the compression transferring. Low flow stress material has low flow resistance and is easy to transfer strain. Therefore, the great compress at the top of cup was transferred to the neighbouring areas on the blank resulting in a tiny amount of outwards springback and consequently small cup mouth diameter. Although all the simulation results were higher than the experimental results, the differences were small and acceptable. These differences come from the underestimation of the inner diameter of the cup mouth in experiments. One face of the blank at the out edge area of the blank was contacted with the die for all drawing process while the other side was contacted with the blank holder for only the initial time of the drawing process and then was free for the later drawing period. The different friction condition on each side of the blank at the blank edge area caused an unclear inner edge of the cup mouth which introduced the error in measuring the inner diameter of the cup mouth.  As minimum thickness determines the success of a drawing, the minimum thickness of each simulation case was compared in Fig. 8. The voronoi models had decreased minimum thickness for each material group and the uneven thickness distribution further reduced the minimum thickness. As the thin and weak areas on the blank underwent further thickness direction strain due to the low flow resistance, the minimum thickness in the model III was the smallest, while that of the model I was the largest among all simulation models. Thus the drawability was overestimated if the surface roughness and material size effects were ignored. With low flow stress, strain and stress are easy to transfer from one element to subsequent element. Therefore, strain distribution in the models II and III for the material 3 was smoother than that of the other two material groups, and thus it was more difficult for strain localisation. Accordingly, models II and III in material group 3 had higher minimum thickness on the drawn cups than that in the other two material groups. By contrast, the normal model, ignoring size effects and surface roughness, had an inverse trend to that of models II and III. With high flow stress, the strain distribution in model I was smoother than that of the other two models, as it overlooked the strain localisation introduced by the size effects and surface roughness. Consequently, normal models with high flow stress material presented by the large minimum thickness.  To further judge the quality of the cups, variance of the thickness distribution that describes the deviation of the shell element thickness to their mean thickness (Eq. (22)) was selected. Large variance means great thickness unevenness and consequently poor cup quality. Fig. 8 indicates that voronoi models decreased the unevenness and rough surface further diminished the thickness unevenness. The weak and thin areas on the blank acted as deformation buffering and coordinated the deformation on the blank. Therefore, the thickness distribution tended to be smooth. The contact force also influenced thickness evenness as the thin elements bore smaller contact forces while the thick elements undertaken high contact forces at a local area. These contact forces flattened the thickness distribution and led to a smaller thickness variance of model III than that of model II. Additionally, with high flow stress and long elongation, models with material 1 had smaller thickness variance than the models using the other two materials. That is because that good material properties mean high ability to flat the stress–strain during the drawing process leading to an even thickness distribution.  (22)   D   =     ∑     (   t   −    t  ̅   )   2       n      where D is the variance of thickness of the drawn cup, n is the total number of elements, t is the thickness of an element and   t  ̅  is the average thickness of all elements on the cup.  Shape accuracy is another important factor for the micro-products quality. The drawn cup’s nodes information from springback simulation results was therefore exported for shape accuracy analysis. A distortion between cup’s surface and a reference surface was defined as the shape accuracy judgement. A high distortion value means poor shape accuracy. Accordingly, the distortion between the inner cup surface and the punch surface was defined as an inner distortion of the drawn cups, while the distortion between the outer cup surface and a virtual surface that was a surface offset 50μm outwards the punch surface was defined as the outer distortion of the cups. As the initial blank thickness was 50μm, the virtual surface was offset by 50μm based on an idea that the ideal drawn cup should have the same thickness to the initial blank thickness. Based on the cup’s geometry, all the cup’s nodes were classified into three segments and each segment had its particular calculation method of shape distortion judgement. Fig. 9(a) illustrated the classification of the nodes and the basic sizes of the reference surfaces. In the part I area, the reference surfaces were horizontal and therefore height difference was selected as the judgement. In parts II and III, the radial differences in the spherical and cylindrical coordinates were chosen as the judgements, respectively. Given the thickness unevenness, the thickness at each node was included for shape accuracy calculation. The nodes’ coordinates and thickness information was firstly exported to Excel and then all the nodes were sorted based on the Z-coordinate and subsequently the cylindrical radial. Therefore, all nodes belonging to the three parts can be divided. Eqs. (23)–(25) list the calculation method for inner shape distortion, whereas Eqs. (26)–(28) list the equations for outer shape distortion. Moreover, the mean value of all nodes’ absolute distortion (Eq. (32)) was utilised as the judgement of shape accuracy.  (23)     d   I   in    =    z   b    −    z   p    −      t   i      2          (24)     d   II   in    =    R   b    −    R   p    −      t   i      2          (25)     d   III   in    =    r   b    −    r   p    −      t   i      2          (26)     d   I   out    =    z   b    −    z   v    +      t   i      2          (27)     d   II   out    =    R   b    −    R   v    +      t   i      2          (28)     d   III   out    =    r   b    −    r   v    +      t   i      2          (29)     R   b    =      (    r   b    −    r   c    )   2    +    (    z   n    −    z   c    )   2           (30)     r   b    =      x   n   2    +    y   n   2           (31)     r   c    = 100        (32)   s   =     ∑   |  d  |     n      where   d   a   b   is the judgement in the part a (a=I, II or III) compared to the reference surface b (b=in or out) of the cup, x, y and z are the node’s coordinates, t is the node’s thickness,   R   b   is the spherical radius,   r   b   is cylindrical radius,   r   c   is the radius of horizontal part of the punch, n is the total number of nodes and s is the shape accuracy judgement.  For all simulation conditions, the average inner shape distortion was lower than that of the outer shape distortion. Further, the maximum and minimum inner shape distortion values were smaller than that of the outer shape distortion. During the micro deep drawing simulation, the inner cup surface that contacts with the punch surface bore stricter restriction than that of the outer cup surface due to that the gap between the die and the punch is larger than the blank thickness. Furthermore, at the bottom part of the cup the outer surface was almost free of limitation whereas at the top part of the cup, both inner and outer cup surface undertook similar constraint due to the thickening of the blank causing the blank contacting with both the punch and the die surfaces. Therefore, the outer cup surface had greater shape distortion than that of the inner cup surface, in terms of the average, the maximum and the minimum shape distortion values.  Further, models employing materials 2 and 3 presented low maximum and mean shape distortion values, due to that the materials had low flow stress and were relatively soft. With small deformation resistance, these materials are easy to follow the shape of the punch and their thickness distributions are smooth. This led to low average and maximum shape distortion when using the two materials.  Generally, the voronoi models had smaller mean shape distortion values than the normal simulation models. The weak areas on the blank coordinated the deformation and made the blank grasping the shape of the punch. Moreover, with low thickness variance at the end of drawing simulation, model II had smaller average shape distortion than the normal simulation models. The thin areas in the model III further adjusted the deformation and thickness distribution. Therefore, it resulted in the smallest mean shape distortion among all simulation models. Furthermore, the thin elements had small contact forces while the thick elements had high contact forces in a local area. These forces adjusted the shell elements to fit their contacting surfaces (tool surfaces) and led to smaller mean shape distortion in model III than that in model II with constant thickness.  As the maximum drawing force combined with the ultimate tensile strength can be used to predict the drawability, the maximum drawing force was compared in Fig. 10.  As the material parameters in voronoi models were from the tensile tests while that used in the normal models was the mean value of those tensile tests results, the drawing forces for each simulation model in each material group were close. Although different areas on the blank had different material properties in the voronoi models, their overall effects on drawing force were balanced resulting a close value to that in the normal models. Furthermore, the thickness differences impacted on the contact force and then the friction force which is an important part of drawing force. However, there were both thin and thick areas on the blank and their opposite effects on the friction force were neutralised. Additionally, the maximum drawing force in the models using material 1 with high flow stress was higher than the models using the other two materials. That is because that the tensile strength of material 1 was higher than that of materials 2 and 3. Moreover, the slight differences between experimental and simulation results were acceptable. This may come from the tolerance in tensile tests results and the friction coefficients employed in the simulation models to the real situations.   CONCLUSIONS   The new FE model that includes surface roughness information and considers size effects was successfully developed. The effects of surface roughness and the influences of size effects on the micro deep drawing were studied based on SUS304 sheets.  Simulation results of the new models were close to the experimental results in terms of the diameters of cup mouths and the maximum drawing forces. However, variance of material properties on the blank in the voronoi models increased the overall springback and the surface roughness additionally enlarged the springback behaviours. Furthermore, weak areas introduced by the voronoi models reduced the minimum thickness and the surface roughness further decreased the minimum thickness of the drawn cups. By contrast, thickness evenness was increased in the voronoi models and further improved in the voronoi models considering surface roughness. Moreover, models accounting both size effects and surface roughness presented the best shape accuracy, while shape accuracy in the normal models was the worst.  Models using material 1 with high flow stress amplified the overall springback amount, the diameters of the cup mouths, the average shape distortion and the maximum drawing forces. Although the high flow stress of the blank decreased the thickness variance, its influence on the minimum thickness for different simulation models was converse. For normal models, high flow stress meant large minimum thickness, whereas it reduced the minimum thickness in the models reflecting size effects and surface roughness.   ACKNOWLEDGEMENTS   The first author thanks greatly for the finical support from the Chinese Scholar Council (CSC 201206160011) and the International Postgraduate Tuition Award (IPTA) from the University of Wollongong. This study is also supported by Australian Research Council (ARC) Future Fellowship Project and Japan Society for Promotion of Science (JSPS) Invitation Fellowship project.   REFERENCES", "highlights": "Surface roughness, compared with tiny sizes of micro products, can be relatively large and has significant influences on micro forming processes and products’ quality. In this study, a voronoi finite element model that considers size effects of material was developed. Next the surface roughness information was assigned to this voronoi model through different elemental thickness distributions. Furthermore, springback simulation was conducted for the micro deep drawn circular cups. Simulation results demonstrate that the surface roughness with consideration of size effects has significant influences on the overall springback, the drawability represented by the minimum thickness and products’ quality regarding thickness evenness and shape accuracy. This study also shows that the results from the new models are close to the experimental results concerning the diameter of cup mouth and the maximum drawing force. The developed model for the micro deep drawing is accurate and beneficial for the development of micro deep drawing process."}