{"id": "S0168874X15001882", "article": "MAIN-TITLE A FE model updating method for the simulation of the assembly process of large and lightweight aeronautical structures   HIGHLIGHTS          We propose a model updating process to improve the quality of a finite element model (mass and stiffness parameters).      The method is applied to highly flexible structures.      A measurement technology used to acquire the experimental data in the absence of any information on the actual weightless and load-free structure is proposed.      The updating method is based on the concept of error in the constitutive relation.      The method is illustrated and validated on two examples.          KEYPHRASES   Model updating  Assembly  Tolerancing  Inverse problem   Tolerancing methods for flexible parts have been the subject of research for more than ten years. These investigations have been motivated by the need to reduce the manufacturing constraints which affect flexible and often statically indeterminate structures. Indeed, the tolerancing techniques used in industry today are based on the rigid body assumption. However, lightweight and rigid structures, especially in the aeronautic industry, are usually obtained by assembling many “simple” elements, such as metal plates or composite shells stiffened with beams. These simple elements are highly flexible in at least one spatial direction and they tend to deform under their own weight due to their slenderness. The hyperstatic nature of these assemblies also leads to deformation during the manufacturing process, which is in contradiction with the rigid body assumption. Improvements in tolerancing methods for flexible parts [1,2] can be sought in three key areas: the quality of the mechanical and geometrical models, the types of simulation tools used, and the quality of the statistical information and probabilistic models. A recent work [3] pinpointed the impact of the types of mechanical models used and of their quality on the reliability of the results of flexible tolerancing studies using sensitivity methods. Unfortunately, this work also showed that it is difficult to obtain a consistent calculation model from a CAD model of the parts or of the assembly. The models thus created present weaknesses in the mass and stiffness distributions. Indeed, the many simplifying assumptions inherent in the finite element modeling of a structure preclude the development of a model which is consistent with only a knowledge of the materials being used. While the final geometry of the structure can be described accurately using CAD, its conversion into a finite element model requires one to simplify some details, or to use a refined mesh (and, consequently, a large number of degrees of freedom), or even to idealize the geometry of the part in order to use structural elements (beams or shells). Moreover, due again to the need to limit the size of the computational model, the boundary conditions and the connections between the elements (through bolts, clamps, welding spots) may be taken into account incorrectly or modeled too crudely (backlash-free connections and friction). These simplifications all lead to the same result: a model whose predictions are not accurate enough (and which sometimes are even far from reality). Therefore, it is necessary to introduce a model updating procedure in order to improve the quality of these models.  Classical model updating methods have been proposed for dynamics problems. Indeed, experimental modal analysis produces a wealth of information concerning the distribution of damping, mass and stiffness in the structure. These methods are based on the minimization of a cost function which represents the “distance” between the experimental data and the response of the numerical model. This approach presents two difficulties: first, the choice of the most relevant cost function, and, second, the minimization itself, which often requires regularization. A review of model updating methods including many different types of cost functions and input, which is still up-to-date, can be found in [4]. A more recent approach can be found in [5]. Minimization and regularization techniques are covered in [6] and [7]. Altogether, the most common parametric methods are the input residuals method [8], the output residuals method [9], and the constitutive relation error method [10].  While many updating methods use dynamic data, only a few are based on static data, and these do not address the updating of the mass properties. In this paper, we undertake to update a model׳s stiffness and mass properties using static measurements carried out on the assembly line. These measurements are expected to be taken using the tools which are normally found on the assembly line, such as handling tools, control tools, and assembly tools. One may be required to equip these tools with new sensors (especially stress sensors), but this does not necessarily present a problem. Our objective is to propose a new method in order to use these simple measurements to update the model׳s mass parameters.  The model updating procedure must be carried out rapidly during the assembly process to avoid slowing down the assembly line. Therefore, it is necessary to keep the global computation cost at a minimum. This can be done using either of two possible approaches. The first approach consists in reducing the computation cost associated with the evaluation of the cost function for a given set of structural parameters. In order to do that, one can build a surrogate model prior to the updating process, as proposed, e.g., in [11,12]. In [13], a PGD-reduced model is used for a rapid evaluation of the constitutive relation error. The second approach, which was recently proposed in [14] and [15], undertakes to reduce the computation cost associated with the evaluation of the gradient and/or the Hessian. In [16] both approaches were used simultaneously: the response of the structure was approximated using a PGD-reduced model and, thus, the cost function based on a simple least-squares norm and its gradient could be evaluated very inexpensively.  This paper takes the second approach. We will discuss an updating method based on the error in constitutive relation and attempt to reduce the computation time by optimizing the calculation of both the Hessian and the gradient of the cost function.  The paper is structured as follows. First, in Section 2.1, we present the measurement technology we used to acquire the experimental data in the absence of any information on the actual weightless and load-free structure. Then, in Section 2.2, we propose a cost function based on the constitutive relation error in order to update the mass and stiffness structural parameters. In Section 2.5, in order to minimize that function, we propose to use a gradient method or a Newton method. In both cases, we show that both the gradient and the Hessian of the cost function can be evaluated analytically. Section 3 presents examples of applications. The first example consists in a simple three-plate structure in which each plate is associated with a set of stiffness and density parameters. The performance of our model updating method is assessed by comparison with simulated experimental data. The second example is a more complex assembly which is representative of the aeronautical structures the method is intended for. It is composed of a cylindrical skin and a floor reinforced by several stiffeners. The main objective of this example is to pinpoint the drastic reduction in computation time brought about by our proposed minimization strategy compared to a more classical numerical gradient estimation.  The model updating method we developed is a two-step procedure. The first step consists in updating the stiffness properties of the structure. Once the stiffness is known, the second step proceeds with updating the mass properties. Throughout these two steps, the displacements and/or the forces at certain points of the structure are assumed to be known thanks to measurements taken on the assembly line. Both updating steps involve the minimization of a cost function according to the constitutive relation error concept. Table 1 presents the notations which will be used in the paper.  The measurement of the displacements presents two difficulties: the measurement systems which are available on the assembly lines often measure positions rather than displacements, and the weightless “free” shape of the actual parts is unknown. Therefore, the displacements due to gravity cannot be measured in only one step. We propose a method for obtaining displacements based on three series of measurements. A first set of two series of measurements with two different loading cases is used to readjust the stiffness parameters, as shown in Eq. (3). Then a second set of two series of measurements with two different orientations relative to gravity is used to readjust the mass parameters. A series of measurements can be common to the two pairs, as can be easily shown using Eq. (6).  Let {    p   0    } denote the (unknown) position vector of the points of the actual weightless, unloaded structure. All data will be expressed in the coordinate system of the structure.  If one considers a first set of measured positions {    p   1    } under loads {    b   1    } and gravity {    G   1    } , and a second set of measured positions {    p   2    } under loads {    b   2    } and the same gravity {    G   1    } , one can express the displacements {    U   1    } and {    U   2    } as:  (1)  {     {    U   1    } = {    p   1   −   p   0    } ⇒ [  K  ] {    U   1    } = {    b   1    } + [  M  ] {    G   1    }     {    U   2    } = {    p   2   −   p   0    } ⇒ [  K  ] {    U   2    } = {    b   2    } + [  M  ] {    G   1    }          Since the structure is assumed to behave linearly, the displacement field {    U   K    } in the absence of gravity is:  (2)  {    U   K    } = {    U   1    } − {    U   2    } = {    p   1   −   p   2    }   which can be calculated by solving the linear system:  (3)  [  K  ] {    U   K    } = {    b   1    } − {    b   2    }      Similarly, the displacement field obtained under loads {    b   1    } identical to {    p   1    } , but with a different orientation with respect to gravity {    G   3    } is:  (4)  {    U   3    } = {    p   3   −   p   0    } ⇒ [  K  ] {    U   3    } = {    b   1    } + [  M  ] {    G   3    }   where {    p   3    } denotes the third set of measured positions.  The displacement field {    U   M    } due to the weight alone is:  (5)  {    U   M    } = {    U   1    } − {    U   3    } = {    p   1   −   p   3    }   which can be calculated by solving the linear system:  (6)  [  K  ] {    U   M    } = [  M  ] {    G   1   −   G   3    }      Eqs. (3) and (6) show that the stiffness and mass properties can be updated using the three sets of measurements {    p   1    } , {    p   2    } and {    p   3    } in the absence of any information concerning the actual weightless and load-free structure. However, the orientation of the structure with respect to gravity must be known.  As indicated in [14], the solution of the finite element static problem is also the solution of the minimization problem:   Find the kinematically admissible field  { U }  and the statically admissible field  { V }  which minimize the Constitutive Relation Error (CRE):  (7)    e   CRE   2   =   {  U − V  }   T   [  K  ] {  U − V  }      In order to update the finite element model taking into account the experimental data, we introduce an error in the measurements:  (8)    e   m   2   =   (  [  R  ] { U } − {   U   ˜   }  )   T   [    G   u    ] (  [  R  ] { U } − {   U   ˜   }  )   In this expression,  •   {    U   ˜    } is the vector of the measured displacements;    [  R  ] is a matrix used to extract the degrees of freedom corresponding to the measured quantities from the full finite element displacement vector.  Then, by adding this error (8) to the CRE (7), we obtain the modified constitutive relation error:  (9)    η   2   = ( 1 − r )   e   CRE   2   + r .   C   0     e   m   2     where C 0 is used to balance the equation and r is a parameter which can be used to adjust the relative influence of the terms.  In previous studies using the concept of error in the constitutive relation, different choices have been made to define a matrix [    G   u    ] which gives an energetic sense to the second term of the modified error . In [17], [    G   u    ] is the identity matrix multiplied by a stiffness constant. This solution can be easily implemented but the stiffness constant has to be tuned in order to ensure that both terms of the error have an equivalent weight. It also possible to use the reduction of matrix [  K  ] at the measured degrees of freedom, which is equivalent to calculating [  R  ] [  K  ]   [  R  ]   T   . In this case, the magnitude of the terms on the matrix diagonal is automatically correct but, as for the first solution, interactions among the nodes are lost. To take into account this valuable information, Ref. [18] proposes to define [    G   u    ] by condensing the stiffness matrix [  K  ] at the measured nodes. We will use this technique in the examples presented in Section 3.  For a given set of structural parameters (mass and stiffness), the objective is to find the kinematically admissible {  U  } and the statically admissible {  V  } which minimize η 2. The kinematic constraint [  C  ] {  U  } = {    U   d    } and the static equilibrium equation [  K  ] {  V  } = {  F  } are taken into account by introducing Lagrange multipliers. The stationarity of the Lagrangian  (10)    L   0   =   η   2   +   {    λ   s    }   T   ( [  K  ] {  V  } − {  F  } ) +   {    λ   c    }   T   ( [  C  ] {  U  } − {    U   d    } )   leads to the following set of equations:  (11)    ∂   L   0     ∂ U   = 2 ( 1 − r ) [  K  ] {  U − V  } + 2 . r .   C   0     [  R  ]   T   [    G   u    ] {  [  R  ] U −   U   ˜    } +   [  C  ]   T   {    λ   c    } = { 0 }      (12)    ∂   L   0     ∂ V   = − 2 ⁎ ( 1 − r ) [  K  ] {  U − V  } + [  K  ] {    λ   s    } = { 0 }      (13)    ∂   L   0     ∂   λ   c     = [  C  ] {  U  } − {    U   d    } = { 0 }      (14)    ∂   L   0     ∂   λ   s     = [  K  ] {  V  } − {  F  } = { 0 }      The linear system can be partially solved by substituting {  F  } for [  K  ] {  V  } in Eq. (11):  (15)  (  2 ( 1 − r ) [  K  ] + 2 . r .   C   0     [  R  ]   T   [    G   u    ] [  R  ]  ) {  U  } +   [  C  ]   T   {    λ   c    } = {  F  } + 2 . r .   C   0     [  R  ]   T   [    G   u    ] {    U   ˜    }      (16)  [  C  ] {  U  } = {    U   d    }      (17)  [  K  ] {  V  } = {  F  }   The use of a standard finite element code requires the elimination of rigid body movements, which boils down to imposing kinematic boundary conditions on fields {  V  } . Therefore, in order to simplify the model, we choose to apply the same kinematic constraints to both fields {  U  } and {  V  } . Thus, the Lagrangian becomes:  (18)  L =   η   2   +   {    λ   s    }   T   ( [  K  ] {  V  } − {  F  } ) +   {    λ   cv    }   T   ( [  C  ] {  V  } − {    U   d    } ) +   {    λ   cu    }   T   ( [  C  ] {  U  } − {    U   d    } )      The minimization of this new Lagrangian leads to the linear systems:  (19)    [  A  ]   U   {     U       λ   cu       } =   {  b  }   U        (20)    [  A  ]   V   {     V       λ   cv       } =   {  b  }   V     with:  (21)    [  A  ]   U   = [     2 ( 1 − r ) [  K  ] + 2 . r .   C   0     [  R  ]   T   [    G   u    ] [  R  ]     [  C  ]   T       [  C  ]   0     ]    [  A  ]   V   = [     [  K  ]     [  C  ]   T       [  C  ]   0     ]      (22)    {  b  }   U   = {     2 ( 1 − r ) F       U   d       } + 2 . r .   C   0   {       [  R  ]   T   [    G   u    ] {    U   ˜    }     0     }    {  b  }   V   = {     F       U   d       }      The updating process consists in finding a set of structural parameters which minimizes the cost function η 2. We set out to perform this minimization using a gradient or Newton algorithm. This involves the calculation of the first, and possibly the second, derivatives of η 2 with respect to the parameters being updated. These derivatives could be calculated numerically, but that would lead to high computation costs. We prefer to estimate the derivatives analytically. This analytical estimation of derivatives of the constitutive relation error has been first introduced for dynamic problems in [19] and then for static problems in [14]. The expression of analytical derivatives depends on the formulation of the error in the constitutive relation but this expression is general and does not depend on the finite element model (element type and number of elements).  In the context of our study, one can observe that, with {  U  } and {  V  } satisfying the kinematic and static constraints,   η   2   ( {  U  } , {  V  } ) = L ( {  U  } , {  V  } ) . Therefore, the first derivative of η 2 with respect to structural parameter c  i is:  (23)    d   η   2       dc   i     =   dL     dc   i     =   ∂ L   ∂ {  U  }     d {  U  }     dc   i     +   ∂ L   ∂ {  V  }     d {  V  }     dc   i     +   ∂ L   ∂   c   i          Since the set of the displacement fields ( {  U  } , {  V  } ) is a solution of the minimization problem, the Lagrangian is stationary:  (24)    ∂ L   ∂ {  U  }   =   ∂ L   ∂ {  V  }   = {  0  }      Therefore, instead of calculating the derivatives of η 2, one needs to calculate only the partial derivatives of the Lagrangian:  (25)    d   η   2       dc   i     =   ∂ L   ∂   c   i          Assuming that matrix [    G   u    ] is chosen at the beginning of the updating process and is independent of the updated parameters, the first derivative of the cost function η 2 with respect to a stiffness parameter   c   i   =   c   i   K   is:  (26)    d   η   2       dc   i   K     = ( 1 − r )   {  U − V  }   T     ∂ [  K  ]   ∂   c   i   K     {  U + V  }   Under the same assumption, the expression of the first derivative of the cost function η 2 with respect to a mass parameter   c   i   =   c   i   M   is:  (27)    d   η   2       dc   i   M     = − 2 ( 1 − r )   {  U − V  }   T     ∂ [  M  ]   ∂   c   i   M     {  G  }      Similarly, the Hessian [  H  ] of the cost function η 2 can be expressed as:  (28)    H   ij   =     d   2     η   2       dc   j     dc   i     =   d     dc   j     (    d   η   2       dc   i      ) =   d     dc   j     (    ∂ L   ∂   c   i      )   Expanding that expression leads to:  (29)    H   ij   =   d     dc   j     (    ∂ L   ∂   c   i      ) =   ∂   ∂ {  U  }   (    ∂ L   ∂   c   i      ) ·   d {  U  }     dc   j     +   ∂   ∂ {  V  }   (    ∂ L   ∂   c   i      ) ·   d {  V  }     dc   j     +   ∂   ∂   c   j     (    ∂ L   ∂   c   i      )   In order to calculate the derivatives of {  U  } and {  V  } with respect to parameter c  i , one uses linear system (19):  (30)    [  A  ]   U   {     U       λ   cu       } =   {  b  }   U     The derivation of this expression with respect to c  i leads to a new linear system:  (31)    [  A  ]   U   ·   d     dc   j     {     U       λ   c       } =   d   {  b  }   U       dc   j     −   d   [  A  ]   U       dc   j     · {     U       λ   cu       }   This system can be solved easily because matrix   [  A  ]   U   has already been factorized to solve (19). Similarly, the derivative of {  V  } with respect to c  i is calculated using (20).  If the stiffness matrix and the mass matrix are linearly dependent on structural parameter c  i , the second derivatives of the Lagrangian with respect to c  i are zero. This is the case if c  i represents a Young׳s modulus or a density:  (32)    ∂   ∂   c   j   K     (    ∂ L   ∂   c   i   K      ) =   ∂   ∂   c   j   M     (    ∂ L   ∂   c   i   M      ) = 0  …  ∀ i , j   With this assumption, if c  i represents a stiffness parameter, the expression of a term of the Hessian matrix is:  (33)    H   ij   K   =   d     dc   j   K     (    ∂ L   ∂   c   i   K      ) = − 2 ( 1 − r )   ∂ [  K  ]   ∂   c   i   K     {  U  } · (    [  A  ]   U   − 1     d   [  A  ]   U       dc   j   K     · {     U       λ   cu       }  ) + 2 ( 1 − r )   ∂ [  K  ]   ∂   c   i   K     {  V  } · (    [  A  ]   V   − 1     d   [  A  ]   V       dc   j   K     · {     V       λ   cv       }  )   If c  i represents a mass parameter, one has:  (34)    H   ij   M   =   d     dc   j   M     (    ∂ L   ∂   c   i   M      ) = − 2 ( 1 − r )   ∂ [  M  ]   ∂   c   i   M     {  G  } · (    [  A  ]   U   − 1     d   {  b  }   U       dc   j   M      ) + 2 ( 1 − r )   ∂ [  M  ]   ∂   c   i   M     {  G  } · (    [  A  ]   V   − 1     d   {  b  }   V       dc   j   M      )   The full expressions of the derivatives involved in Expressions (33) and (34) are given below:  (35)    d   [  A  ]   U       dc   j   K     = [     2 ( 1 − r )   ∂ K   ∂   c   i   K       0     0   0     ] ;    d   {  b  }   U       dc   j   K     = {  0  } ;    d   [  A  ]   V       dc   j   K     = [       ∂ K   ∂   c   i   K       0     0   0     ] ;   d   {  b  }   V       dc   j   K     = {  0  }      (36)    d   {  b  }   U       dc   j   M     = {     2 ( 1 − r )   ∂ M   ∂   c   j   M     G     0     } ;    d   [  A  ]   U       dc   j   M     = [  0  ] ;    d   {  b  }   V       dc   j   M     = {       ∂ M   ∂   c   j   M     G     0     } ;    d   [  A  ]   V       dc   j   M     = [  0  ]      Let us now highlight some properties of the mass updating method when the chosen updated mass parameters are densities.  Eqs. (34) and (36) show that the Hessian of the cost function is independent of the mass parameters. Therefore, the cost function is a quadratic expression of the mass parameters.  The solution of Eq. (37) is the exact solution of the minimization problem. Therefore, the resolution of the minimization problem does not require an iterative strategy:  (37)  [  H (     c   ̲      M     0   )  ] · (     c   ̲      M     0   −     c   ̲     M   ) = −   ∇   ̲     η   2   (     c   ̲      M     0   )      The independence of the Hessian with respect to the updated parameters leads to another noteworthy property. Let {   U   ˜   + δ   U   ˜   } denote the measured noisy displacement ( { δ   U   ˜   } being the noise) and let us look at { δ U } , the difference between the noisy ( {   U   ⁎   } ) and noiseless ( {  U  } ) kinematically admissible solutions. According to Eq. (19),  (38)    [  A  ]   U   {       U   ⁎         λ   cu       } = {     2 ( 1 − r ) F       U   d       } + 2 . r .   C   0   {       [  R  ]   T   [    G   u    ] {    U   ˜   + δ   U   ˜    }     0     }      This can be written as { U + δ U } , with:  (39)    [  A  ]   U   {     δ U       λ   cu       } = 2 . r .   C   0   {       [  R  ]   T   [    G   u    ] {  δ   U   ˜    }     0     }   Thus, the difference { δ U } between kinematically admissible solutions depends linearly on the noise. Then, thanks to Eqs. (27) and (34), one can see that with noisy measurements the gradient   ∇   ̲     η   2   alone depends on {  U  } and, thus, on { δ U } . Therefore, 37 can be rewritten as:  (40)  [  H (     c   ̲      M     0   )  ] · (     c   ̲      M     0   −     c   ̲     M   ) = −   ∇   ̲     η   2   (     c   ̲      M     0   , { U + δ U } )      (41)  [  H (     c   ̲      M     0   )  ] ·     δ c   ̲     M   =   ∇   ̲     η   2   (     c   ̲      M     0   , { δ U } )      The errors in the mass parameters due to noise     δ c   ̲     M   depend linearly on the measurement noise.  Our proposed method was applied to two examples. The first example is quite simple: the structure consists of a plate which is reinforced by two stiffeners modeled by two plates. We used the Mindlin–Reissner theory (which takes transverse shear into account) and quadrilateral shell elements. The main plate was fixed by restraining the displacement DOFs at its four corners, and a normal force was applied at the center.  The material properties and thickness of each plate are described in Table 2 . We will use this example simply to validate the various algorithms and minimization methods used (Fig. 1 ).  The second example is a simplified model of an aircraft fuselage section (Fig. 2 ), which is a common aeronautical structure. The section consists of a cylindrical skin reinforced by three circular stiffeners, and a floor reinforced by three longitudinal stiffeners plus three transverse stiffeners.  The skin and the floor were also meshed with quadrilateral shell elements using Mindlin–Reissner׳s theory again. In this case, however, the stiffeners were represented by Euler–Bernoulli beam elements. The material and geometrical properties of each component are described in Table 3 . We will use this example to compare the efficiency of several minimization methods.  For each example, experimental data were simulated using a finite element model. A highly refined model was used for the second example. We assumed that the loading was perfectly known. In addition, the three displacement components were measured at each measured point.   Fig. 3 shows the evolution of the three Young׳s moduli and the three densities throughout the stiffness and mass optimization. The updating was carried out using a gradient method based on a numerical estimation of the gradient with updating of matrix [    G   u    ] . The measurements were assumed to be noiseless. The results show that all the updated parameters tended toward the corresponding values used to simulate the measured quantities.   Fig. 4 shows the evolution of the four Young׳s moduli E 1, E 2, E 3 and E 4 throughout the updating process using a Newton minimization method with optimum steps. The results of the calculations for densities ρ 1, ρ 2, ρ 3 and ρ 4 are given in Table 4 . The measurements were assumed to be noiseless.   Fig. 5 shows the evolutions of the Young׳s modulus of the skin throughout the model updating process using different minimization algorithms:  • a gradient method based on an analytical estimation of the gradient of η 2;  a gradient method based on a numerical estimation of the gradient of η 2;  a gradient method based on a numerical estimation of the gradient with updating of matrix [    G   u    ] ;  a Newton method.  As shown in Fig. 5 and Table 5 , the Newton algorithm was the most efficient of the algorithms tested. Despite an iteration time which was twice that of the analytical gradient method due to the calculation of the Hessian matrix, the convergence time was cut in half thanks to a number of iterations to convergence which was four times smaller.  In order to analyze the robustness of our updating method, we studied the sensitivity of the updated parameters to measurement noise. Then we multiplied the simulated measurements by a Gaussian white noise to create virtual noisy measurements. For each noisy measurement thus created, the mean of the Gaussian white noise was set to 1 and the standard deviation to one quarter of the noise level. In other words, a 10% noise level corresponded to 0.025 standard deviation, and approximately 95% of the measurements at each point were within ±5% of the noiseless measurements.   Fig. 6 shows the evolution of the errors in the parameters as a function of the noise level. The parameter errors ξ  i are defined as relative errors, such as   ξ   i   = |   c   i   ( {  U  } ) −   c   i   ( {   U   ⁎   } ) | /   c   i   ( {  U  } ) . As could be expected thanks to Eq. (41), the evolutions of the errors in the mass parameters were linear. However, the mass parameters are noise sensitive: in this example, a 1% noise level leads to more than 10% error in the skin׳s density. This means that if the measurement accuracy is of the order of one hundredth of a millimeter, the measured displacements must be of the order of one millimeter to achieve 10% accuracy for the parameters. This may be possible for the structures studied. Finally, contrary to the mass parameters, the stiffness parameters (i.e. the Young׳s moduli) are not sensitive to noise.  In this paper, we first showed how the mass and stiffness properties of a lightweight and flexible structure can be updated using three sets of position measurements despite the absence of any information on the actual weightless and load-free structure. We also proposed a cost function to be minimized based on the concept of constitutive relation error developed for static problems. The minimization algorithm we used is based on a descent method, and we showed that the gradient and the Hessian of the cost function can be computed very quickly. Finally, we proposed two sample applications. The first application showed that the proposed method leads to a good estimate of the structural parameters. The second application showed that the analytical estimation of the gradient and Hessian is efficient compared to classical numerical estimation.  As a continuation of this work, we can now try to estimate the quality of the updated models. This can be done quickly at the end of the updating process by means of a Newton method. Indeed, the calculation of the Hessian also enables one to calculate second-order Taylor expansions, which can lead to approximate information such as confidence intervals of the updated parameters, and parameter correlations or influence.  Another means of expanding on this work would be to try to reduce the computation time of the cost function as well. One could think of using a reduced model such as a PGD model.   REFERENCES", "highlights": "In the context of the assembly of large aeronautical structures, the flexibility of the parts often leads to the nonconformity of the assembly or, at least, requires additional time-consuming operations. In order to deal with this problem, one must take this flexibility into account during the tolerancing process.Investigations of a non-rigid-body tolerancing process have shown that a robust model is necessary in order to achieve satisfactory predictability. It was also found that the finite element model used, based on a simplified geometry, was not accurate enough. The approach proposed in this paper to obtain an accurate tolerancing process consists in updating the stiffness and mass properties of the FE model based on measurements taken on the assembly line during the assembly process. The objective is to take these measurements using only tools which are available on the chain (such as manipulation or control tools). This implies that only static strength and displacement information can be used. This is achieved through a clever measurement methodology and a model updating method based on the constitutive relation error."}