{"id": "S0168874X15001869", "article": "MAIN-TITLE Derivation of the exact stiffness matrix of shear-deformable multi-layered beam element in partial interaction   HIGHLIGHTS          Shear-deformable multi-layered beams in partial interaction.      Solution strategy of the coupled governing differential equations.      Derivation of the exact finite element model.      Shear-deformable model versus the shear-rigid model.      Influence of shear-connection stiffness and the span-to-depth ratio on the overall structural response.          KEYPHRASES   Multi-layered beam  Interlayer slips  Shear-flexibility  Exact stiffness  Finite elements   The analysis of members consisting of semi-rigidly connected layers is complicated due to the partial transfer of shear force at the interface. Over the years, there has been a great deal of research conducted on elastic two-layered composite beams in partial interaction. The first contribution is commonly attributed to Newmark et al. [1] who investigated the behavior of a two-layered beam considering that both layers are elastic and deform according to the Eurler–Bernoulli kinematics. In their paper, a closed-form solution is provided for a simply supported elastic composite beam. Since then, numerous analytical models were developed to study different aspects of the behavior of two-layered composite beams in more complicated situations. To investigate the behavior of elastic two-layered beam, several analytical formulations were proposed [2–10]. Significant development beyond that available from Newmark et al.׳s paper [1] has been made in [9] by considering Timoshenko׳s kinematic assumptions for both layers. Besides these analytical works, several numerical models, mostly FE formulations have been developed to investigate the nonlinear behavior of both Bernoulli and Timoshenko two-layered beams with interlayer slip [11–22]. Most of the papers on layered beams in partial interaction are restricted to the case of two-layered beams and, multi-layered beams have received less attention. Chui and Barclay [23] and Schnabl et al. [24] proposed an exact analytical model for the case of three-layered members where the thickness as well as the material of the individual layers is arbitrary. Sousa et al. [25] developed an analytical solution for statically determinate multi-layered beams with the assumption that the cross-section rotation of each layer is the same although Timoshenko׳s kinematic is considered (cross-section rotations are the same for Bernoulli multi-layered beam). The governing equations describing the behavior of such multi-layered beam consist of a coupled system of differential equations in which the slips are considered as the primary variables. Skec et al. [26] proposed mathematical models with analytical solutions for the analysis of linear elastic Reissner multi-layered beams. The models take into account the interlayer slip and uplift of the adjacent layers, different material properties, independent transverse shear deformations, and different boundary conditions for each layer. Ranzi [27] proposed two types of displacement-based finite elements to evaluate locking problems in partial interaction of multi-layered beam based on Euler–Bernoulli kinematics. For classical polynomial shape functions, it is shown that elements without internal node suffer from the curvature locking problems. On the contrary, adding an internal node remove locking problems, improve the representation of the axial displacement of each layer and better characterizes the partial interaction behavior of multi-layered beam.  A formulation based on the exact stiffness matrix offers the possibility of generating a locking-free model. These elements are highly attractive due to their precision, computational efficiency and mesh independency. Heinisuo [28] proposed a finite element formulation using exact stiffness matrix for uniform, straight, linearly elastic beams with two faces and one core and with three symmetric faces and two identical cores. Based on the analytical solution given in [25], Sousa [29] derived the exact flexibility matrix for partially connected multi-layered beams with the assumption that both transverse displacement and rotation are the same for all layers. The model is based on the derivation of flexibility matrix obtained from a statically determinate coordinate system.  The purpose of this paper is to present a new exact FE formulation for the analysis of shear-deformable multi-layered beams in partial interaction based on the exact stiffness matrix derived from the governing equations of the problem. The features of the formulation presented in this paper are as follows: (i) longitudinal partial interaction of the layers is considered which provides a general description of the stresses and strains in the layers; (ii) different rotations of cross-sections of each layer are considered; (iii) exact stiffness matrix is used which provide accurate and stable results. The present model provides, therefore, an efficient tool for linear elastic analysis of shear-deformable multi-layered beam with arbitrary support and loading conditions. The rest of the paper is organized as follows. In Section 2, the field equations for a shear-deformable multi-layered beam in partial interaction are presented. The governing equations of the problem are derived in Section 3. In Section 4, the full analytical solution of the coupled differential governing equations is provided, regardless of the loading and the nature of the boundary conditions (support and end force). Special care has been taken while dealing with the constants of integration. The exact expression for the stiffness matrix is deduced for a generic shear-deformable multi-layered beam element in Section 5. Numerical examples are presented in Section 6 in order to assess the performance of the formulation and to support the conclusions drawn in Section 7.  The field equations describing the geometrically linear behavior of an elastic multi-layered beam with n + 1 layers in partial interaction are briefly outlined in this section. The following assumptions are commonly accepted in the model to be discussed in this paper:  • connected members are made out of elastic, homogenous and isotropic materials;  the cross-sections of all components remain plane but not orthogonal to beam axis after deformation;  adjacent layers are connected at their interfaces where relative slips can develop;  transverse displacement v is assumed to be the same for all layers;  discretely located shear connectors are regarded as continuous.  With the above assumptions, the layer has independent cross-section rotation and curvature, see Fig. 1 . Kinematic equations relating the displacement components (   u   i   , v ,   θ   i   ) to the corresponding strain components (   ϵ   i   ,   θ   i   ,   κ   i   ) are as follows:  (1)    ϵ   i   = ∂   u   i        (2)    θ   i   = ∂ v −   γ   i        (3)    κ   i   = ∂   θ   i     where  •   ∂ • = d • / d x ;    i = 1 , 2 , … , n + 1 ;   ϵ  i and u  i are the axial strain and the longitudinal displacement at the centroid of layer i, respectively;   γ  i is the shear strain of layer i;   v is the transverse displacement;   θ  i and κ  i are the cross-section rotation and the curvature (flexural deformation) of layer i, respectively; and   t  i and b  i are the distances from the layer axis i to its top and bottom surfaces, respectively.  The interlayer slip corresponds to the difference between axial displacements of adjacent layers at their connected interface which is expressed as:  (4)    g   i   =   u   i + 1   −   u   i   −   b   i      θ   i   −   t   i + 1      θ   i + 1   ,  i = 1 , 2 , … , n      The equilibrium equations are derived by considering the free body diagram of a differential element d x located at an arbitrary point x on a multi-layered beam, see Fig. 2 . The shear connector connecting the adjacent layers “i” and “ i + 1 ” transmits the longitudinal shear flow   D     sc   i     . The equilibrium conditions result in the following set of equations:  (5)  ∂   N   i   −   D     sc   i − 1     +   D     sc   i     = 0      (6)  ∂   M   i   +   T   i   +   t   i      D     sc   i − 1     +   b   i      D     sc   i     = 0      (7)    ∑   j = 1   n + 1   ∂   T   j   +   p   y   = 0      (8)  T =   ∑   j = 1   n + 1     T   j     where  •   i = 1 , 2 , … , n + 1 ;   N  i : normal force acting on layer “i”;   M  i : bending moments acting on layer “i”;   T  i : shear force acting on layer “i”;   T: total shear force; and      D     sc   i     : shear stress at connected interface between layer “i” and “ i + 1 ” (   D     sc   0     = 0 ;    D     sc   n + 1     = 0 ) .  The generalized stress–strain relationships are simply obtained by integrating the appropriate uniaxial constitutive model over each cross-section. For a linear elastic material, these relationships lead to the following set of equations:  (9)    N   i   =   ∫     A   i     σ  d   A   i   =   ( EA )   i      ϵ   i        (10)    M   i   = −   ∫     A   i     y  σ  d   A   i   =   ( EI )   i      κ   i        (11)    T   i   =   ∫     A   i     τ  d   A   i   =   ( GA )   i      γ   i     where •    i = 1 , 2 , … , n + 1 ;        ( EA )   i   =   E   i      A   i   is the axial stiffness of layer “i”;      ( EI )   i   =   E   i      I   i   is the flexural stiffness of layer “i”; and      ( GA )   i   =   G   i      A   i   is the shear stiffness of layer “i”.  The relationships introduced in Section 2 are now combined to derive the equations governing the behavior of shear-deformable multi-layered beam in partial interaction. Combining the kinematic relations (Eqs. (1) and (2)) with the elastic behavior equations (9)–(12) and inserting the outcome into the equilibrium equations (5)–(8) produce the following set of differential equations:  (13)    ∂   2     u   i   =   1     ( EA )   i     (    k     sc   i − 1        g   i − 1   −   k     sc   i        g   i    ) ,  i = 1 , 2 , … , n + 1      (14)    ∂   2     θ   i   = −   1     ( EI )   i     (    t   i      k     sc   i − 1        g   i − 1   +   b   i      k     sc   i        g   i    ) −     ( GA )   i       ( EI )   i        γ   i   ,  i = 1 , 2 , … , n + 1      (15)    ∂   3   v = −   T     ( EI )   0     −   ∑   j = 1   n       h   j       ( EI )   0       k     sc   j        g   j   +   ∑   j = 1   n + 1       ( EI )   j       ( EI )   0       ∂   2     γ   j     where   ( EI )   0   =   ∑   j = 1   n + 1      E   j      I   j   and h  j is the distance between the reference axes of adjacent layers j and j + 1 . Taking the derivative of the slip distribution equation (4) and making use of Eqs. (13) and (14), one arrives at the following equation:  (16)    ∂   2     g   i   =   β   i      k     sc   i − 1        g   i − 1   +   α   i      k     sc   i        g   i   +   β   i + 1     k     sc   i + 1        g   i + 1   +     b   i     ( GA )   i       ( EI )   i        γ   i   +     t   i + 1     ( GA )   i + 1       ( EI )   i + 1        γ   i + 1     in which  (17)    α   i   =   1     ( EA )   i     +   1     ( EA )   i + 1     +     b   i   2       ( EI )   i     +     t   i + 1   2       ( EI )   i + 1          (18)    β   i   = −   1     ( EA )   i     +     t   i      b   i       ( EI )   i       The above differential equations can be cast in a compact form as follows:  (19)    ∂   2     g   t   =   A   t      g   t   +   A   s      g   s   +   H   t     T     ( EI )   n + 1       where  (20)    H   t   =   [     0  0  ⋯  0   ︷     n − 1      t   n + 1   ]   T        (21)    g   t   =   [   g   1      g   2    ⋯    g   n   ]   T        (22)    g   s   =   [   γ   1      γ   2    ⋯    γ   n   ]   T           A   t   = [       k     sc   1        α   1       k     sc   2        β   2     0   ⋯   0   0       k     sc   1        β   2       k     sc   2        α   2       k     sc   3        β   3     ⋯   0   0     0     k     sc   2        β   3       k     sc   3        α   3     ⋱   0   0     ⋮   ⋮   ⋱   ⋱   ⋱   ⋮     0   0   0   ⋱     k     sc   n − 1        α   n − 1       k     sc   n        β   n       0   0   0   ⋯     k     sc   n − 1        β   n       k     sc   n        α   n       ]   and  (24)    A   s   = [          h   1     ( GA )   1       ( EI )   1             h   2     ( GA )   2       ( EI )   2        0   ⋯   0   0     0        h   1     ( GA )   1       ( EI )   1             h   2     ( GA )   2       ( EI )   2        ⋱   0   0     ⋮   ⋱   ⋱   ⋱   ⋱   ⋮     0   0   0   ⋯        h   n − 1     ( GA )   n − 1       ( EI )   n − 1             h   n     ( GA )   n       ( EI )   n          −      h   n + 1     ( GA )   1       ( EI )   n + 1        −      h   n + 1     ( GA )   2       ( EI )   n + 1        −      h   n + 1     ( GA )   3       ( EI )   n + 1        ⋯   −      h   n + 1      ( GA )   n − 1       ( EI )   n + 1             h   n     ( GA )   n       ( EI )   n      −      h   n + 1     ( GA )   n       ( EI )   n + 1          ]      Next, we derive a second system of differential equations by eliminating the shear deformation of the ( n + 1 ) th layer. We start by considering equilibrium equations (6) for i=k and i = n + 1 with k = 1 , … , n . Then, we use the constitutive relations (Eqs. (10)–(12)) to eliminate the internal forces and the longitudinal shear stresses from these two equilibrium equations. Taking the derivative of the cross-section rotation in equation (2) and inserting the outcome into Eq. (3), we obtain the expression of the curvature as a function of the transverse displacement and the shear deformation. The latter is inserted into the equilibrium equations (6) (for i = k and i = n + 1 ) from which the transverse displacement is eliminated as unknown by subtracting the kth equilibrium equation from the ( n + 1 ) th. Finally, γ n+1 is expressed in terms of γ  k using Eqs. (8) and (11), and the following differential equation is obtained  (25)    ∂   2     γ   k   +   ∑   j = 1   n       ( GA )   j       ( GA )   n + 1       ∂   2     γ   j   =     t   k       ( EI )   k       k     sc   k − 1        g   k − 1   +     b   k       ( EI )   k       k     sc   k        g   k   −     t   n + 1       ( EI )   n + 1       k     sc   n        g   n   +     ( GA )   k       ( EI )   k       γ   k   +   ∑   j = 1   n       ( GA )   j       ( EI )   n + 1        γ   j   −   T     ( EI )   n + 1       which can be written in the following matrix form:  (26)    ∂   2     g   s   =   B   − 1      R   t      g   t   +   B   − 1      R   s      g   s   −   B   − 1    I    T     ( EI )   n + 1       where  (27)  B = [     1 +      ( GA )   1       ( GA )   n + 1             ( GA )   2       ( GA )   n + 1        ⋯        ( GA )   n       ( GA )   n + 1               ( GA )   1       ( GA )   n + 1        1 +      ( GA )   2       ( GA )   n + 1        ⋯        ( GA )   n       ( GA )   n + 1          ⋮   ⋮   ⋱   ⋮          ( GA )   1       ( GA )   n + 1             ( GA )   2       ( GA )   n + 1        ⋯   1 +      ( GA )   n       ( GA )   n + 1          ]      (28)    R   t   = [          b   1      k     sc   1         ( EI )   1        0   ⋯    0   −      t   n + 1      k     sc   n         ( EI )   n + 1               t   2      k     sc   1         ( EI )   2             b   2      k     sc   2         ( EI )   2        0   ⋯   0   −      t   n + 1      k     sc   n         ( EI )   n + 1          0        t   3      k     sc   2         ( EI )   3             b   3      k     sc   3         ( EI )   3        ⋯   0   −      t   n + 1      k     sc   n         ( EI )   n + 1          ⋮   ⋮   ⋱   ⋱   ⋮   ⋮     0   0   0   ⋱        b   n − 1      k     sc   n − 1         ( EI )   n − 1        −      t   n + 1      k     sc   n         ( EI )   n + 1          0   0   0   ⋯        t   n      k     sc   n − 1         ( EI )   n             b   n      k     sc   n         ( EI )   n      −      t   n + 1      k     sc   n         ( EI )   n + 1          ]      (29)    R   s   = [          ( GA )   1       ( EI )   1      +      ( GA )   1       ( EI )   n + 1             ( GA )   2       ( EI )   n + 1        ⋯        ( GA )   n       ( EI )   n + 1               ( GA )   1       ( EI )   n + 1             ( GA )   2       ( EI )   2      +      ( GA )   2       ( EI )   n + 1        ⋯        ( GA )   n       ( EI )   n + 1          ⋮   ⋮   ⋱   ⋮          ( GA )   1       ( EI )   n + 1             ( GA )   2       ( EI )   n + 1        ⋯        ( GA )   n       ( EI )   n      +      ( GA )   n       ( EI )   n + 1          ]      (30)  I =   [ 1  1  ⋯  1 ]   T     Combining Eq. (19) with Eq. (26), one arrives at the following coupled second-order system of differential equations:  (31)    ∂   2   g − A  g = H   T     ( EI )   n + 1       where  (32)  g =   [   g   t   T      g   s   T   ]   T        (33)  A = [       A   t       A   s         B   − 1      R   t       B   − 1      R   s       ]      (34)  H = [       H   t       −   B   − 1    I     ]   A diagonalization of the matrix A will uncouple the above system of differential equations (31) and produce a set of 2n second-order ordinary equations. Let   A   v   and   A   λ   be the matrix collecting unit eigenvectors and eigenvalues of A, respectively. Then, the following relationship holds:  (35)    A   λ   =   A   v   − 1    A    A   v   .   Subsequently, we insert the vector g obtained by pre-multiplying the vector   g   ˜   by the matrix   A   v      (36)  g =   A   v     g   ˜     into Eq. (31) and make use of Eq. (35) to produce an uncoupled differential equation system:  (37)    ∂   2     g   ˜   −   A   λ      g   ˜   =   H   ¯     T     ( EI )   n + 1       where   H   ¯   =   A   v   − 1   H . By denoting     H   ¯     i   the component “i” of vector   H   ¯   , one arrives at a set of ordinary differential equations in terms of 2n variables (     g   k     ˜   ) :  (38)    ∂   2       g   ˜     i   −   λ   i        g   ˜     i   =     H   ¯     i     T     ( EI )   n + 1     ,  i = 1 , 2 , … , 2 n   where λ  i is the eigenvalue of the matrix A.  In this section, we provide the analytical solution of the governing equations for the general case of flexible interface connection that is 0 <   k   sck   < ∞ . The governing differential equation involves the single unknown variable vector   g   ˜   . It is worth to point out that the exact solution of the governing differential equations (38) requires the distribution of the shear force T(x) to be known. In order to simplify the development of the solution, we assume that the externally distributed load applied to the element is constant. As a result, the distribution of shear force must be linear to ensure the overall transverse equilibrium:  (39)  T ( x ) = −   p   y    x +   C   4 n + 6     where   C   4 n + 6   is the shear force on the left-hand side of the beam and is considered to be a constant of integration. All kinematic variables can be determined once the expression of     g   ˜     i   is found by solving the differential equations (Eq. (38)). Let P  i (x) be the particular solution for non-homogeneous differential equation (Eq. (38)). Hence, the general solution of Eq. (38) is given by •  For   λ   i   > 0    (40)      g   ˜     i   =     C   ˜     2 i − 1     e       λ   i     x   +     C   ˜     2 i     e   −     λ   i     x   +   P   i   ( x ) ,  i = 1 , 2 , … , 2 n      For   λ   i   < 0    (41)      g   ˜     i   =   C   2 i − 1   cos   −   λ   i     x +   C   2 i   sin   −   λ   i     x +   P   i   ( x ) ,  i = 1 , 2 , … , 2 n      For   λ   i   = 0    (42)      g   ˜     i   =   C   2 i − 1   +   C   2 i    x +   P   i   ( x ) ,  i = 1 , 2 , … , 2 n      All     g   ˜     i   are collected in a vector so the analytical solution can be written in a matrix form as follows:  (45)    g   ˜   =   X     g   ˜     C +   Z     g   ˜       with  (46)    g   ˜   =   [       g   ˜     1         g   ˜     2   ⋯     g   ˜     2 n     ]   T     and  (47)  C =   [   C   1      C   2    ⋯    C   4 n + 6   ]   T     The coefficients   C   1 , … , 4 n + 6   are constants of integration that will be determined by enforcing the kinematic boundary conditions at both beam ends. The components of matrix   X     g   ˜     and   Z     g   ˜     involve the eigenvalues of A and the external load p  y . In case A is positive definite i.e.   λ   i   > 0 , we obtain the following expression for   X     g   ˜     and   Z     g   ˜     :  (48)    X     g   ˜     = [       e       λ   1     ( x − L )       e   −     λ   1     x     0   0   ⋯   0   0   0   0   0   0   0      −     H   ¯     1       λ   1     ( EI )   n + 1          0   0     e       λ   2     ( x − L )       e   −     λ   2     x     ⋯   0   0   0   0   0   0   0      −     H   ¯     2       λ   2     ( EI )   n + 1          ⋮   ⋮   ⋮   ⋮   ⋱   ⋮   ⋮   ⋮   ⋮   ⋮   ⋮   ⋮   ⋮     0   0   0   0   ⋯     e       λ   2 n     ( x − L )       e   −     λ   2 n     x     0   0   0   0   0      −     H   ¯     n       λ   2 n     ( EI )   n + 1          ]   and  (49)    Z     g   ˜     =     p   y    x     ( EI )   n + 1       [         H   ¯     1       λ   1              H   ¯     2       λ   2       ⋯         H   ¯     2 n       λ   2 n       ]   T     Having at hand the analytical expression for     g   ˜     i   , it is straightforward to derive the slip distributions g  i and shear deformations γ  i . Substituting Eq. (44) into Eq. (36), one gets  (50)  g =   X   g   C +   Z   g     in which  (51)    X   g   =   A   v      X     g   ˜        Z   g   =   A   v      Z     g   ˜       The vector   Z   g   and the matrix   X   g   are decomposed into two sub-vectors and two sub-matrices, respectively, in order to separate the slip distribution g  i from the shear deformation distribution. The first bloc collects the slip distribution g  i and the second one gathers the shear deformation γ  i :  (52)    g   t   =   X   gt   C +   Z   gt        (53)    g   s   =   X   gs   C +   Z   gs     where   X   g   =   [   X   gt   T      X   gs   T   ]   T   and   Z   g   =   [   Z   gt   T      Z   gs   T   ]   T   with   X   gt   =   [   X     g   1     T      X     g   2     T   ⋯    X     g   n     T   ]   T   ,   Z   gt   =   [   Z     g   1        Z     g   2      ⋯    Z     g   n     ]   T   ,   X   gs   =   [   X     γ   1     T      X     γ   2     T    ⋯    X     γ   n     T   ]   T   and   Z   gs   =   [   Z     γ   1        Z     γ   2      ⋯    Z     γ   n     ]   T   . The shear deformation distribution of ( n + 1 ) th layer can be determined by combining Eqs. (8) and (11) with Eq. (53):  (54)    γ   n + 1   =   X     γ   n + 1      C +   Z     γ   n + 1       where  (55)    X     γ   n + 1     = −   1     ( GA )   n + 1       ∑   j = 1   n     ( GA )   j      X     γ   j     +     I   4 n + 6       ( GA )   n + 1          (56)    Z     γ   n + 1     = −   1     ( GA )   n + 1       ∑   j = 1   n     ( GA )   j      Z     γ   j     −     p   y    x     ( GA )   n + 1          We use the differential equations expressing the cross-section displacements of each layer and their derivatives as a function of the interlayer slips, the shear deformations and the second derivative of the shear deformation that have been derived in Section 3 to determine the displacement fields. By back substituting the above expressions of the slip distribution and shear deformation distribution (Eqs. (52)–(53)) into Eqs. (13) and (15), the analytical expressions for the displacement v and u  i   ( i = 1 , 2 , … , n + 1 ) can be obtained. Making use of the kinematic relationships (Eqs. (2) and (3), the analytical expressions for cross-section rotation and curvature can be established. All these kinematic variables depend on 4 n + 6 constants of integration.  Combining Eqs. (52)–(54) with Eq. (39) and performing three successive integrations of the outcome give the distribution of vertical displacement as follows:  (57)  v =   X   v   C +   Z   v     where  (58)    X   v   = ∫ (  ∫ (  ∫ (  −     I   4 n + 6       ( EI )   0     −   ∑   j = 1   n       h   j       ( EI )   0       k     sc   j        X     g   j     +   ∑   j = 1   n + 1       ( EI )   j       ( EI )   0        ∂   2     X     γ   j      ) d x  ) d x  ) d x +   I   4 n + 1       x   2     2   +   I   4 n + 2    x +   I   4 n + 3        (59)    Z   v   = ∫ (  ∫ (  ∫ (      p   y    x     ( EI )   0     −   ∑   j = 1   n       h   j       ( EI )   0       k     sc   j        Z     g   j     +   ∑   j = 1   n + 1       ( EI )   j       ( EI )   0        ∂   2     Z     γ   j      ) d x  ) d x  ) d x      (60)    I   4 n + 1   = [      0  0  ⋯  0   ︷     4 n   1  0  0  0  0  0  ]      (61)    I   4 n + 2   = [ 0  0  ⋯  0  0  1  0  0  0  0 ]      (62)    I   4 n + 3   = [ 0  0  ⋯  0  0  0  1  0  0  0 ]      (63)    I   4 n + 4   = [ 0  0  ⋯  0  0  0  0  1  0  0 ]      (64)    I   4 n + 5   = [ 0  0  ⋯  0  0  0  0  0  1  0 ]      (65)    I   4 n + 6   = [ 0  0  ⋯  0  0  0  0  0  0  1 ]   The expression of the cross-section rotation distribution for each layer is obtained by taking the derivative of the transverse displacement and subtracting the shear deformation distribution according to Eq. (4):  (66)    θ   i   =   X     θ   i      C +   Z     θ   i     ,  i = 1 , 2 , … , n + 1   The expression of the curvature distribution for each layer is obtained by taking the derivative of the cross-section rotation distribution according to Eq. (3):  (67)    κ   i   =   X     κ   i      C +   Z     κ   i     ,  i = 1 , 2 , … , n + 1   in which  (68)    X     θ   i     = ∂   X   v   −   X     γ   i     ,    Z     θ   i     = ∂   Z   v   −   Z     γ   i          (69)    X     κ   i     = ∂   X     θ   i     ,    Z     κ   i     = ∂   Z     θ   i       The axial displacement of the first layer can be determined by integrating twice the right-hand side of Eq. (13) for i=1. This gives  (70)    u   1   =   X     u   1     C +   Z     u   1       where  (71)    X     u   1     = −      k     sc   1         ( EA )   1       ∫ (  ∫   X     g   1      d x  ) d x + x   I   4 n + 4   +   I   4 n + 5        (72)    Z     u   1     = −      k     sc   1         ( EA )   1       ∫ (  ∫   Z     g   1      d x  ) d x   Once the axial displacement of the first layer is known, Eq. (4) is used to derive the axial displacement for the remaining layers. Indeed, at this stage we have 4 n + 6 constants of integration which correspond to the number of degrees of freedom. Consequently, the remaining kinematic variables must be determined by using the kinematic relations. Inserting Eqs. (52), (66) and (70) into Eq. (4) and solving consecutively for the axial displacement of layer i + 1 , one gets  (73)    u   i + 1   =   X     u   i + 1     C +   Z     u   i + 1     ,  i = 1 , 2 , … , n   where  (74)    X     u   i + 1     =   X     g   i     +   X     u   i     +   h   i      X     θ   i     +   h   i + 1      X     θ   i + 1          (75)    Z     u   i + 1     =   Z     g   i     +   Z     u   i     +   h   i      Z     θ   i     +   h   i + 1      Z     θ   i + 1          Once the displacement fields are defined, one can use the linear elastic relationship equations (9) and (10) to obtain the nodal forces  (76)    N   i   =   Y     N   i     C +   R     N   i     ,  i = 1 , 2 , … , n + 1      (77)    M   i   =   Y     M   i     C +   R     M   i     ,  i = 1 , 2 , … , n + 1      (78)  T =   Y   T   C +   R   T     where  (79)    Y     N   i     =   ( EA )   i   ∂   X     u   i     ,    R     N   i     =   ( EA )     s   i     ∂   Z     us   i     ,  i = 1 , 2 , … , n + 1      (80)    Y     M   i     =   ( EI )   i      X     κ   i     ,    R     M   i     =   ( EI )   i     Z     κ   i     ,  i = 1 , 2 , … , n + 1      (81)    Y   T   =   I   4 n + 6   ,    R   T   = −   p   y    x      The direct stiffness method is used to derive the exact stiffness of the multi-layered beam with n + 1 layers. It can be obtained starting from the general expressions of the internal force and displacement fields. Let a multi-layered beam element of length L be considered. Since the same transverse displacement is assumed, this element has ( 4 n + 6 ) degrees of freedom. Applying the kinematic boundary conditions at x=0 and x=L leads to the relationship between the vector of constants of integration C and the vector of nodal displacements q:  (82)  q = X  C + Z   where  (83)  q =   [   u   1 , 0    ⋯    u   n + 1 , 0      v   0      θ   1 , 0    ⋯    θ   n + 1 , 0      u   1 , L    ⋯    u   n + 1 , L      v   L      θ   1 , L    ⋯    θ   n + 1 , L   ]   T        (84)  X =   [   X     u   1   , 0    ⋯    X     θ   n + 1   , 0      X     u   1   , L    ⋯    X     θ   n + 1   , L   ]   T        (85)  Z =   [   Z     u   1   , 0    ⋯    Z     θ   n + 1   , 0      Z     u   1   , L    ⋯    Z     θ   n + 1   , L   ]   T     The nodal displacements being independent, see Fig. 3 , the matrix X is invertible. Thus, the constants C  i are obtained as a function of the nodal displacements q  i .  (86)  C =   X   − 1   ( q − Z )   The nodal forces can be expressed in compact form as:  (87)  Q = Y  C + R   where  (88)  Q =   [ −   N   1 , 0    ⋯  −   M   n + 1 , 0      N   1 , L    ⋯    M   n + 1 , L   ]   T        (89)  Y =   [ −   Y     N   1   , 0    ⋯  −   Y     M   n + 1   , 0      Y     N   1   , L    ⋯    Y     M   n + 1   , L   ]   T        (90)  R =   [ −   R     N   1   , 0    ⋯  −   R     M   n + 1   , 0      R     N   1   , L    ⋯    R     M   n + 1   , L   ]   T     Inserting Eq. (86) into Eq. (87), one obtains:  (91)  K  q = Q +   Q   0     where  (92)  K = Y    X   − 1     represents the exact stiffness of the element and  (93)    Q   0   = K  Z − R   represents the nodal force due to the uniform external load p  y .  The purpose of this section is to assess the capabilities of the proposed formulation in reproducing the linear elastic behavior of shear-deformable multi-layered beams with interlayer slips and to investigate the influence of the shear connection stiffness, the cross-section shear deformability and the span-to-depth ratio on the mechanical response of the beams. To do so, the predictions of the exact finite element model for multi-layered beams with shear-rigid are compared against the results obtained with the present exact model. The investigation is carried out considering three examples: a simply supported four-layered beam, a two-span continuous three-layered beam and a dissymmetric continuous four-layered beam. The governing equations for deriving the exact stiffness matrix of shear-rigid multi-layered beam can be found in [29].  A simply supported four-layered beam of span L is analyzed with the proposed formulation. The beam consists of four identical connected layers with a total depth equal to H, see Fig. 4 . The elastic modulus is 8000  MPa and the Poisson coefficient is 0.3 for each layer. The shear correction factor is taken equal to 5 / 6 for all layer cross-sections. For this example, we assume that the shear connector stiffness (k  sc ) is identical for each slipping plane. The beam is modeled using two elements, which is the smallest number of elements needed for simply supported beam subjected to a concentrated load. It is worth mentioning that since the model is based on exact stiffness matrix, considering more elements does not improve the results. The effect of the shear flexibility on the mechanical response of the beam is analyzed by comparing the mechanical response obtained with the shear-flexible model (Timoshenko) against the corresponding response predicted by shear-rigid model (Bernoulli). In particular, the comparison is carried out in terms of the deflection underneath the load point (100 kN) at mid-span evaluated by means of the two above-mentioned models. Fig. 5 shows the mid-span deflections obtained with both models for different span-to-depth ratios (L/H) and shear connector stiffness (k  sc ). As expected, the deflection predicted by shear-flexible model is larger than the corresponding one evaluated according to shear-rigid model, for any value of the ratio L/H. Moreover, the deflection ratio tends to infinity when the span-to-depth ratio tends to zero, and to unity when span-to-depth ratio tends to infinity. In particular, the black dash line refers to the case of significantly high rigid connection with   k   sc   = 10  000  MPa (close to the full interaction curve which corresponds to the solid black line). The other curve representing partial interaction (   k   sc   = 1000  MPa ) monotonically reduces to the case of loose connection with   k   sc   = 1  MPa . It can be seen that partial interaction results in a reduction of the effect of shear flexibility of the connected members on the transverse displacement.  Further comparisons are also proposed in terms of end beam slips (see Fig. 6 between the 1st and 2nd layer (g 1), and between 2nd and 3rd layer (g 2), Fig. 7 ). It is worth mentioning that by symmetry, the interlayer slips g 1 and g 3 are equal in magnitude. As a result, only the distributions of g 1 and g 2 are discussed here. In particular, one can observe that the interlayer slip g 2 given by the shear-flexible model is smaller than the one given by shear-rigid model. Besides, the curves in Figs. 6 and 7 approach the asymptotic value of 1 for large value of L/H much more quickly than those represented in Fig. 5. This means that the transverse displacement is more affected by shear flexibility than interface slip, whose value is directly controlled by the interface stiffness k  sc considered in both shear-flexible and shear-rigid model for multi-layered beams in partial interaction. Since the interlayer slip basically depends on the shear connector stiffness, the influence of the shear deformations on the beam end slips is also contingent on k  sc and is more pronounced for low value of L/H. The geometry and the mechanical properties of the layers being identical, the interlayer slip ratios of both models are equal to unities for   k   sc   = 1  MPa which corresponds to what has been expected for the case without interaction. Fig. 8 shows the distributions of interlayer slip ratios in function of shear connector stiffness. One can observe that for notably low value of L/H, the distribution ratios vary significantly and they tend to asymptotic values for large value of k  sc .  The shear-flexible model which was successfully applied to the above simply supported four-layered beam is now used to simulate a two-span continuous three-layered beam. Only two elements are needed for the analysis. The geometric characteristics of the beam is shown in Fig. 9 where H is the total height of the section. The beam section is composed of two equal layers with 10cm wide and 20cm thick attached to the core of the same width and a depth of 40cm. The beam has two equal spans (L) and is subjected to a uniformly distributed load of 10kN/m. Like previous example, we analyze a three-layered beam with the same elastic modulus, Poisson coefficient and shear correction factor for each layer. Those values are respectively 8000MPa, 0.3 and 5/6. Moreover, the shear connector stiffness (k  sc ) for each slipping plane is considered to have the same value. The beam is analyzed using both shear-flexible and shear-rigid model. Fig. 10 represents the ratio of maximum deflection obtained with both models. In this case, the ratio is given as a function of the interface shear modulus k  sc for three different values of the length-to-depth ratio L/H. The curves illustrated in Fig. 10 confirm the important role played by the shear flexibility in the case of low L/H ratios and full connection. One can observe that the deflection ratio significantly increases, particularly for low L/H ratio, when the value of k  sc varies from 0.1 MPa (almost no interaction) to 105 MPa (nearly full interaction). Nevertheless, increasing the value of k  sc has little effect on the deflection ratio for large values of L/H.  Furthermore, comparison in terms of cross-section rotation at beam end is also performed. Due to symmetry, only cross-section rotations of the first and the second layers are presented (see, respectively, Figs. 11 and 12  ). Obviously, the rotation of each layer is the same for shear-rigid model (Bernoulli). Since the shear deformation is different for each layer, the cross-section rotations   θ   1   and   θ   2   are not the same for shear-flexible model. However, the influence of L/H ratio and k  sc on   θ   1 , 2   is similar.  Consider a 4-layered continuous beam with rectangular cross-section for each layer depicted in Fig. 13 . This problem was considered in [29] using exact flexibility matrix in which an equal cross-section rotation is assumed for all layers. A connection stiffness equal to 5MPa is used for each slipping plane. The elastic modulus for all layers is 50,000MPa, the Poisson coefficient is taken as 0.3 and the shear correction factor is assumed equal to unity. The results for the end slips and maximum bending moment are presented in Table 1 . It can be seen that there is a good agreement between the results of both models.  To further assess the present model, we consider more complex situation with a dissymmetric connection stiffness k  sc taken equal to 5MPa for the first interlayer, to 3MPa for the second interlayer and to 1MPa for the last slipping plane. The results of the analysis with 2 elements are reported in Table 2 . The connection being more flexible, the slips are larger compared to the previous case.  To evaluate the computing time, we perform the analysis with different number of elements. The analysis was run on the PC Machine with CPU @3.20GHz and 8Go RAM. The actual total computing time as a function of the number of elements is presented in Table 3 . We can see that the computing time of the FE analysis using the present exact stiffness matrix is within a second.   CONCLUSION   In this paper, the exact expression of the stiffness matrix for a shear-deformable multi-layered beam in partial interaction has been developed. This stiffness matrix is obtained from the closed-form solution of the governing equations of the problem consisting in a coupled system of differential equations where the slips and shear deformations are considered as primary variables. Particular care was given to the determination of the constants of integration. The proposed exact stiffness matrix can be used in a displacement-based procedure for the elastic analysis of shear-deformable multi-layered beams in partial interaction with arbitrary loading and support conditions. The influence of the shear flexibility and the partial interaction on the overall behavior of multi-layered beams has been investigated. A parametric analysis considering various values of the length-to-depth ratio and of the shear connection stiffness has been performed. It has been found that the transverse displacement is more affected by shear flexibility than the interface slip. It has been observed that the partial interaction results in a reduction of the shear flexibility effect on the transverse displacement. Moreover, the interlayer slip given by the shear-flexible beam element is not always larger than the one given by shear-rigid beam element. It has been shown that the computation time when using the present exact finite element is reasonable.   REFERENCES", "highlights": "This paper presents the exact finite element formulation for the analysis of partially connected shear-deformable multi-layered beams. Timoshenko׳s kinematic assumptions are considered for each layer or component, and the shear connection is modeled through a continuous relationship between the interface shear flow and the corresponding slip. The effect of possible transversal separation of the two adjacent layers has not been considered. The governing equations describing the behavior of a shear-deformable multi-layered beam in partial interaction consist of a set of coupled system of differential equations in which the primary variables are the slips and the shear deformations. This coupled system has been solved in closed form, and the “exact” stiffness matrix has been derived using the direct stiffness method. The latter has been implemented in a general displacement-based finite element code, and has been used to investigate the behavior of shear-deformable multi-layered beams. Both a simply supported and two continuous beams have been considered in order to assess the capability of the proposed formulation and to investigate the influence of the shear connection stiffness and span-to-depth ratios on mechanical responses of the beams. It has been found that the transverse displacement is more affected by shear flexibility than the interlayer slips."}