{"id": "S0168874X14000596", "article": "MAIN-TITLE Integrating a logarithmic-strain based hyperelastic formulation into a three-field mixed finite element formulation to deal with incompressibility in finite-strain elastoplasticity   HIGHLIGHTS          A three-field mixed finite element formulation in finite-strain is proposed.      It is based on an additive split of the logarithmic strain into elastic and plastic parts.      The developed formulation is easy, effective and generic.      Our approach was validated on both academic cases and on a complex industrial case.          KEYPHRASES   Incompressibility  Finite-strain  Mixed finite element method  Logarithmic strains   Over the past three decades, the development of finite element formulations capable of modeling large elastoplastic strains has received considerable attention. The earliest formulations, introduced in the 1970s, were rate-type formulations based on a hypoelastic stress–strain relationship [1–3]. The main drawback of this kind of formulations is that they introduce elastic dissipation. Despite that, they are still commonly used today. In the 1980s, Simo and co-workers [4–7] introduced a formulation based on hyperelastic constitutive formulations that does not exhibit elastic dissipation. Many researchers, such as Eterovic and Bathe [8] or Weber and Anand [9], developed some formulations that use a hyperelastic constitutive model based on the logarithmic strain tensor, also called the Hencky tensor. In these works, an additive decomposition of the elastic and plastic strains in the absence of rotations is assumed, which is a typical feature of the geometrically linear theory of plasticity. This provides a natural basis for a material-independent extension of constitutive structures from the geometrically linear to the nonlinear theory at finite-strain. More recently, Miehe et al. [10] developed a formulation for which the kinematic setting consists of a constitutive model in the logarithmic strain space that is preceded and followed by purely geometric processing. In such a way, the relationship between the large-strain and the small-strain setting is defined by purely geometric transformations. When modeling finite-strain elastoplastic processes by the finite element method, it is important to consider the nearly incompressible plastic behavior, which is typical of metals, for instance. It is well-known that the standard displacement-based finite element formulation performs poorly in quasi-incompressible situations, producing stiff solutions and oscillations of the stress field. Over the years, and particularly in the 1990s, different strategies were proposed to reduce or avoid volumetric locking and pressure oscillations in finite element solutions. Several methods to deal with incompressibility have been developed, such as under-integrated elements [11], Enhanced Assumed Strain (EAS) methods [12–14], B-bar and F-bar methods [15,16], or mixed formulations [17,18]. The mixed finite element method is robust and generic and it is a popular and efficient way to deal with incompressibility. Mixed elements for finite strains were first introduced by Simo et al. [19] and have been since developed by many authors [20,21]. In non-linear solid mechanics, the use of a two-field formulation is not convenient for many constitutive models [20,22]. For example when the plasticity criterion depends on the hydrostatic stress like in Rousselier or GTN laws [23,24], a two-field formulation based on displacement and pressure is not straightforward and differ from the chosen law. For this kind of laws, the use of a three-field formulation in which the unknowns are the displacement, the pressure and the volumetric strain fields, allows us to have a generic method. Furthermore, in the finite-strain framework, it is important to express these formulations in a way that makes the implementation of the constitutive laws simple. That is why the idea in this work is to adopt the model of Miehe et al. [10], and to adapt it to a three-field formulation.  This paper presents a robust non-linear mixed finite element procedure for the numerical analysis of finite-strain elastoplasticity, where the use of specific elements is considered to deal with plastic incompressibility. The Miehe׳s model, based on a logarithmic description of the strain tensor, is exposed in Section 2. A three-field mixed finite element formulation is then presented in Section 3. The extension of the finite-strain model to this three-field formulation is described in Section 4. Finally, some numerical simulations are presented in Section 5. The efficiency of the developed model is first shown through numerical tests. A case of industrial interest, for which under-integration technique fails, is then considered in order to assert the robustness of the presented approach.  In order to describe the finite-strain framework, a hyperelastic-based model developed by Miehe, Apel and Lambrecht is considered [10,25]. The kinematic framework consists of a constitutive model in the logarithmic strain space that is framed by purely geometric pre-processing and post-processing steps. This numerical approach of the material response computation can be split into three steps: a geometric pre-processing step in which the logarithmic strain tensor is defined, a second step to get its work-conjugate stresses computed from the constitutive model, and a third one to get back to classical tensors using geometric post-processing. Note that in the present work, Lagrangian tensors are considered.  This step consists in defining the logarithmic strain tensor, and the geometric transformations necessary to get it along with its associated stress tensor, from standard tensors. The logarithmic strain tensor E is defined by  (1)  E =    1   2     ln ( C )   with C the right Cauchy–Green strain tensor,  (2)  C =   F   T   F   where F is the deformation gradient tensor defined as the relative deformation of the medium from its initial state (position X ) to its current state (position x )  (3)    F   ij   =   ∂   x   i     ∂   X   j       Following Miehe׳s approach [10], an additive decomposition of the logarithmic strain is considered  (4)  E =   E   e   +   E   p     where   E   e   is referred as the elastic strain, and   E   p   as the plastic strain. It has been shown in Refs. [10,25,26] that this additive decomposition provides results close to those obtained by assuming Lee׳s multiplicative decomposition of the deformation gradient [27].      E   p   is assumed to be a function of the plastic metric tensors   G   p    [26] defined by  (5)    G   p   =   F   pT     F   p     and can be expressed as  (6)    E   p   =    1   2     ln (   G   p   )   Thus, the logarithmic strain tensor allows us to switch from multiplicative properties for the elastoplasticity in finite strain to the additive structure of the small strain theory. Furthermore, the plastic Jacobian denoted J  p is such that  (7)    J   p   ≔   det (   G   p   )   = exp [ tr (   E   p   ) ]   which gives  (8)  tr (   E   p   ) = ln (   J   p   )   Thus, it can be written that  (9)  det (   G   p   ) = 1 ⇔ tr (   E   p   ) = 0   Indeed, the multiplicative constraint on the determinant of the plastic metric is described by the additive constraint on the trace of the logarithmic plastic strain.  The model is based on the logarithmic strain tensor (1) and its work-conjugate stress tensor denoted T . In order to get the expression of T , in terms of standard tensors, the expended power is expressed as a function of the second Piola–Kirchhoff stress tensor S and the right Cauchy–Green strain tensor C    (10)  P ( t ) = S ( t ) :    1   2      C   ̇   ( t )   with  (11)    C   ̇   ( t ) =   ∂ C   ∂ t     and as a function of E and T    (12)  P ( t ) = T ( t ) :   E   ̇   ( t )   so that T can be expressed as [10]   (13)  T = S :   P   L   − 1     with  (14)    P   L   = 2   ∂ E   ∂ C     Thus, geometric relationships between the logarithmic strain tensor E and its work-conjugate stress tensor T with respectively, the right Cauchy–Green strain tensor, and the second Piola–Kirchhoff stress tensor, have been established.  Let us assume a constitutive model of plasticity that is written in the logarithmic strain space. From the logarithmic strain tensor E and the logarithmic plastic strain tensor   E   p   , calculated respectively by (1) and (6), and some hardening variables denoted α, the constitutive model provides the stress tensor T and the associated elastoplastic tangent modulus   E   ep      (15)  { E ,   E   p   , α } ⇒ Constitutive  model ⇒ { T ,   E   ep   }   The tangent modulus yields the rate of the stress T with respect to the rate of the logarithmic strain  (16)    T   ̇   =   E   ep   :   E   ̇     Note that, in the logarithmic strain space, the constitutive model has the same structure as models for small-strain plasticity. It is hence possible to adopt simply, for finite-strain elastoplasticity, the frame of constitutive models from the small-strain theory.  Once the stress tensor and the tangent modulus have been obtained in the logarithmic strain space, the last step consists in recovering the standard stress tensor, which is easier to handle, and its associated tangent modulus, by the application of the transformation rules introduced above. The second Piola–Kirchhoff stress tensor S is obtained from relation (13)   (17)  S = T :   P   L     and it can be shown that the associated tangent modulus which is such as  (18)    S   ̇   =   C   L   ep   :    1   2      C   ̇     may be written [10]   (19)    C   L   ep   =   (  2   ∂ E   ∂ C    )   T   :   E   ep   : (  2   ∂ E   ∂ C    ) + T : (  4     ∂   2   E   ∂   C   2      )   To summarize, the strain tensor C is first transformed into the logarithmic strain tensor E , for which the decomposition in elastic and plastic parts is additive. This property allows us to adopt a constitutive law from the small strain theory, and yields the stress tensor T and the tangent modulus   E   L   ep   in the logarithmic strain space, which are, eventually, transformed into the standard tensors S and   C   L   ep   .  The mixed finite element method is an efficient way to deal with incompressibility in solid or fluid mechanics. Let us recall that such mixed finite element formulation is used to ensure the finite element convergence and stability [15]. There exist different possible formulations, such as three-field formulations, involving displacements u , a strain-like variable θ, and pressure p, or two-field formulations involving only displacements and pressure [28–30]. The choice of variable combinations may depend on the form of the constitutive law employed. As explained in introduction, to be able to naturally deal with a plasticity criterion depending on the hydrostatic stress, the three-field formulations are preferred [18]. As the aim of this work is to develop a method as generic as possible, we decide to concentrate on a three-field formulation.  In order to establish the weak formulation, the deformation gradient F is enhanced by introducing a strain-like variable θ which allows us to measure the volume variation. This latter is weakly related to the Jacobian of the deformation gradient J [20]. Several relations are possible, among which  (20)  ln ( J ) = θ   In that case, the enhanced deformation gradient   F   ¯   can be expressed as  (21)    F   ¯   =   (    exp ( θ )   J    )   1 / 3   F   The enhanced right Cauchy–Green tensor   C   ¯   is then computed from  (22)    C   ¯   =     F   ¯     T     F   ¯     Note that, using this relation,  (23)    E   ¯   =    1   2     ln (     F   ¯     T     F   ¯   )   can be written as  (24)    E   ¯   = E +    1   3    ( θ − ln ( J ) ) 1   Denoting   ( . )   D   the deviatoric part of a tensor and 1 the second rank unit tensor, the enhanced logarithmic strain tensor can be expressed as  (25)    E   ¯   =   E   D   +   θ   3   1   Thus, with the choice of relation (20), θ corresponds to the spherical part of the enhanced logarithmic strain tensor   E   ¯    [21].  The Lagrangian multiplier p is introduced in order to enforce the relationship between θ and J (20). It is a third variable independent of the two others, which corresponds to the hydrostatic pressure. Thus, a variational form for the finite-strain problem is given on the initial domain Ω by [20]   (26)  Π ( u , p , θ ) =   ∫   Ω   [ W (   C   ¯   ) + p ( ln ( J ) − θ ) ]  d Ω −   W   ext     with W being the stored energy function expressed in terms of the enhanced right Cauchy–Green tensor, and W  ext the potential of external forces.  The weak formulation of the problem is obtained by looking for the saddle-point of the Lagrangian functional Π , which is characterized by the Euler–Lagrange optimality conditions  (27)  δ Π ( u , p , θ ) [ δ u , δ p , δ θ ] = 0   for all ( δ u , δ θ , δ p ) sufficiently regular vanishing on the domain boundary where u , θ and p are prescribed, denoted from here as admissible.  The second Piola–Kirchhoff stress   S   ¯   is derived from the potential W   (28)    S   ¯   = 2   ∂ W   ∂   C   ¯       and the variation of (26) leads to  (29)  δ Π ( u , p , θ ) =   ∫   Ω   [    1   2     S   ¯   : δ   C   ¯   + p (    δ J   J   − δ θ  )   + δ p ( ln ( J ) − θ )  ] d Ω − δ   W   ext   = 0      The variation of the displacement gradient with respect to the current configuration, δ L , is given by  (30)  δ L = δ   FF   − 1     Next, from the relation  (31)    ∂ J   ∂ F   = J   F   − T     which is established in [31], it can be shown that  (32)    δ J   J   = 1 : δ L   The variation of the enhanced right Cauchy–Green tensor is thus given by  (33)  δ   C   ¯   =   (    exp ( θ )   J    )   2 / 3   δ C +   2   3   (  δ θ −   δ J   J    )   C   ¯     where  (34)  δ C =   F   T   ( δ L + δ   L   T   ) F   Using relation (32), it can then be written  (35)  δ   C   ¯   =     F   ¯     T   ( δ   L   D   + δ     L   D     T   +    2   3    δ θ 1 )   F   ¯     Using relations (32) and (35), the variation of the Lagrangian (29) may be expressed as  (36)  δ Π ( u , p , θ ) =   ∫   Ω   [  (     τ   ¯     D   + p 1 ) : δ L + δ θ (    1   3   1 :   τ   ¯   − p  )  ] d Ω +   ∫   Ω   [ δ p (  ln  J − θ )  ] d Ω − δ   W   ext   = 0   where the enhanced Kirchhoff stress is given by  (37)    τ   ¯   =   F   ¯      S   ¯        F   ¯     T     Thus, the variation of the Lagrangian with respect to the displacement field u , the strain variable θ and the pressure p can be respectively written, for any admissible virtual fields  (38)    δ   u   Π =   ∫   Ω   (     τ   ¯     D   + p 1 ) : δ L  d Ω − δ   W   ext   = 0      (39)    δ   p   Π =   ∫   Ω   δ p ( ln ( J ) − θ )  d Ω = 0      (40)    δ   θ   Π =   ∫   Ω   δ θ (    1   3   1 :   τ   ¯   − p  ) d Ω = 0   Note that (40) represents the weak formulation of the pressure constitutive equation ( p = tr (   τ   ¯   ) / 3 ) and (39), the one of the kinematic relation between J and θ (20).  To solve these equations, the mixed finite element method is used. The continuous spaces are approximated with discrete spaces, in which the approximated solutions (   u   h   ,   p   h   ,   θ   h   ) are searched [15]. Domain Ω is discretized by the mesh   T   h   (  Ω  ) . The three discretized fields can be written as  (41)    u   h   =   ∑   k = 1   nbnodes     ∑   i = 1   dim     e   i     N   k   u     U   ki        (42)    p   h   =   ∑   k = 1   nbnodes     N   k   p     P   k        (43)    θ   h   =   ∑   k = 1   nbnodes     N   k   θ     Θ   k     where dim is the space dimension, and   e   i   is the ith vector of the canonical basis of the space   R   dim   . N  u   k , N  p   k and   N   k   θ   denote the shape functions for respectively displacement, pressure and strain variable fields, and U , P and Θ are the nodal variables.  The variation of the corresponding Eulerian gradient δ   L   h   is computed from  (44)  δ   L     h   ij     =   ∑   k = 1   nbnodes   δ   U   ki     B   kj     where B is the shape function gradient matrix defined on each element Ω  e by  (45)      B   ij     |   Ω   e     =   ∂     N   i   u     |   Ω   e       ∂   x   j          The discretization of (38)–(40) allows us to express the residuals which are sums over elements. The ( i , k )th component of the displacement residual, the kth component of the pressure and strain variable residuals can be written, respectively, on each element Ω  e    (46)    R   ik   u   =   ∫     Ω   e     (     τ   ¯     ij   D   +   P   m     N   m   p     δ   ij   )   B   kj    d   Ω   e        (47)    R   k   p   =   ∫     Ω   e       N   k   p   ( ln ( J ) −   Θ   m     N   m   θ   )  d   Ω   e        (48)    R   k   θ   =   ∫     Ω   e       N   k   θ   (    1   3    tr (   τ   ¯   ) −   P   m     N   m   p    ) d   Ω   e     with δ  ij being the Kronecker delta symbol.  Due to the non-linearities, the resolution of a such problem requires the use of an appropriate incremental/iterative procedure as the Newton–Raphson method. For instance, to build the tangent matrix it is necessary to linearize the variation of the Lagrangian δ Π  (36).  Using the fact that  (49)  Δ   F   ¯   = (    1   3    Δ θ 1 + Δ   L   D   )   F   ¯     and after some algebraic manipulations, the linearization of (38) may be written  (50)  Δ (   δ   u   Π ) = −   ∫   Ω   (     τ   ¯     D   + p 1 ) : ( Δ L δ L )  d Ω +   ∫   Ω     2   3   δ L :     τ   ¯     D   Δ θ  d Ω +   ∫   Ω     τ   ¯   : [   ( δ   L   D   )   T   Δ   L   D   + Δ   L   D   δ   L   D   ]  d Ω +   ∫   Ω   Δ p 1 : δ L  d Ω +   ∫   Ω     2   3   Δ θ δ L :   D   D   : 1  d Ω +   ∫   Ω   2 δ L :   (   D   D   )   D   : Δ L  d Ω   where Δ L , Δ θ and Δ p denote incremental quantities and the fourth-order tensor D is defined by  (51)  D =   F   ¯      F   ¯     ∂   S   ¯     ∂   C   ¯          F   ¯     T       F   ¯     T     The tensors   (   D   D   )   D   and   D   D   are respectively defined by  (52)    (   D   D   )   D   =   I   d     DI   d   ,    D   D   =   I   d   D   with  (53)    I   d   = I −    1   3    1 ⊗   1   T     and I the fourth rank unit tensor. Furthermore, it can be easily shown that the linearization of the two additional variational equations (39) and (40) leads to  (54)  Δ (   δ   p   Π ) =   ∫   Ω   δ p [ 1 : Δ L − Δ θ ]  d Ω      (55)  Δ (   δ   θ   Π ) =   ∫   Ω     2   9   δ θ Δ θ ( tr (   τ   ¯   ) + 1 : D : 1 )  d Ω +   ∫   Ω     2   3   δ θ   τ   ¯   : Δ   L   D    d Ω +   ∫   Ω     2   3   δ θ ( 1 : D ) : Δ   L   D    d Ω −   ∫   Ω   δ θ Δ p  d Ω   Thus, the system of linear equations to be solved for the ( i + 1 )th equilibrium iteration of the ( n + 1 )th time step is  (56)    (       K   uu       K   up       K   u θ         K   pu       K   pp       K   p θ         K   θ u       K   θ p       K   θ θ       )   ( n + 1 , i )     (     Δ U     Δ P     Δ Θ     )   ( n + 1 , i + 1 )   =   (       R   u         R   p         R   θ       )   ( n + 1 , i )     where the tangent terms are expressed as  (57)    K   inlm   uu   =   ∫   Ω   [  −   B   nj     B   mk   (     τ   ¯     ik   D   + p   δ   ik   )   δ   lj   +   2   9    tr (   τ   ¯   )   δ   lk     δ   ij    ] d Ω +   ∫   Ω     B   nj     B   mk   [      τ   ¯     lj     δ   ki   +     τ   ¯     jk     δ   li   −   2   3       τ   ¯     lk     δ   ij   −   2   3       τ   ¯     ij     δ   lk    ] d Ω + 2   ∫   Ω     B   nj     (   D   ijlk   D   )   D     B   mk    d Ω      (58)    K   inr   u θ   =   ∫   Ω     2   3     N   r   θ   (   B   nj       τ   ¯     ij   D   +   B   nj     D   ijkl   D     δ   kl   )  d Ω      (59)    K   ins   up   =   ∫   Ω     N   s   p     B   nj     δ   ij    d Ω      (60)    K   rin   θ u   =   ∫   Ω   [    2   3     N   r   θ   (     τ   ¯     ij   D   +   δ   kl     D   klij   D   )   B   nj    ] d Ω      (61)    K   rs   θ p   = −   ∫   Ω     N   r   θ     N   s   p    d Ω      (62)    K   sr   p θ   = −   ∫   Ω     N   r   θ     N   s   p    d Ω      (63)    K   sin   pu   =   ∫   Ω     N   s   p     B   nj     δ   ij    d Ω      (64)    K   rt   θ θ   =   ∫   Ω     N   r   θ     N   t   θ   ( tr (   τ   ¯   ) +   δ   ij     D   ijkl     δ   kl   )  d Ω      (65)    K   pp   = 0   with B being the shape function gradient matrix previously defined in (45).  In the two-field formulation framework, the variation of the Lagrangian (36) with respect to the displacement field u and the pressure p is reduced to  (66)    δ   u   Π =   ∫   Ω   (     τ   ¯     D   + p 1 ) : δ L  d Ω − δ   W   ext   = 0      (67)    δ   p   Π =   ∫   Ω   δ p (  ln ( J ) −   p   κ    ) d Ω = 0   with κ the bulk modulus and with  (68)  ln ( J ) = tr ( E ) = tr (   E   e   ) + tr (   E   p   )   Eq. (67) is true only if, on one hand, Hooke׳s elastic relation is assumed and if, on the other hand, ln ( J ) corresponds to the elastic part of the strain  (69)  ln ( J ) = tr (   E   e   ) ⇔ tr (   E   p   ) = 0   which means that the plasticity behavior is volume-preserving.  Let us notice that the three-field formulation presented here differs slightly from the one developed by Taylor [18,20]. The difference is the choice of the relation enforced between the Jacobian and the strain-like variable (20). Indeed Taylor chose to impose J = θ . It can also be reminded that the present work is developed in an industrial framework, and the main applications are simulations of problems encountered in the power plants (repair of pipes, rolling expansion, etc.). The applications considered are very sensitive and it is necessary to have accurate results. That is why this aspect takes priority over the computation time. Thus, we need to consider elements with an interpolation for the pressure field which is at least linear. Furthermore, a quadratic interpolation for the displacement field is chosen in order to get a better convergence.  The goal of this work is to extend the finite-strain model described in the first section, to the three-field mixed finite element formulation, which is generic. The main interest of using this model is its capability to adopt the same framework as in small strain theory, concerning the constitutive law implementation.  We consider a finite increment of time [   t   n   ,   t   n + 1   ] , and assume that all the variables are known at t  n . For the ith equilibrium iteration of the Newton–Raphson algorithm, the fields   u   ( n , i )   ,   p   ( n , i )   and   θ   ( n , i )   and its increments Δ   u   ( n , i )   , Δ   p   ( n , i )   and Δ   θ   ( n , i )   are known and both the deformation gradient   F   ( n , i )   and the enhanced deformation gradient     F   ¯     ( n , i )   can be easily calculated from Eq. (21)   (70)    F   ( n , i )   = 1 +   ∇   x   (   u   ( n , i )   ) ,      F   ¯     ( n , i )   =   (    exp (   θ   ( n , i )   )     J   ( n , i )      )   1 / 3     F   ( n , i )     with   J   ( n , i )   being the Jacobian of the transformation at iteration i.  Furthermore, from the displacement increment Δ   u   ( n , i )   , the deformation gradient increment Δ   F   ( n , i )   can be calculated, and the enhanced deformation gradient increment Δ     F   ¯     ( n , i )   can be deduced  (71)  Δ   F   ( n , i )   =   ∇   x   ( Δ   u   ( n , i )   ) ,  Δ     F   ¯     ( n , i )   = (    1   3    Δ   θ   ( n , i )   1 + Δ     L   ( n , i )     D   )     F   ¯     ( n , i )     with Δ   L   ( n , i )   = Δ   FF   − 1   .  From the enhanced deformation gradient, an enhanced logarithmic strain tensor     E   ¯     ( n , i )   is calculated as in Eq. (1), which corresponds to the geometric pre-processing step (see Section 2.1)  (72)      E   ¯     ( n , i )   =    1   2     ln (     C   ¯     ( n , i )   )   with     C   ¯     ( n , i )   being the enhanced right Cauchy–Green strain tensor. In the same manner, its increment Δ     E   ¯     ( n , i )   can be calculated from Δ   F   ( n , i )   .  The work-conjugated stress tensor     T   ¯     ( n , i )   is defined as in (13)   (73)      T   ¯     ( n , i )   =     S   ¯     ( n , i )   :   (     P   ¯     L   − 1   )   ( n , i )     with  (74)    (     P   ¯     L   − 1   )   ( n , i )   = 2   ∂     E   ¯     ( n , i )     ∂     C   ¯     ( n , i )       For details about the calculation of     P   ¯     L   − 1   , it can be referred to [10].  The constitutive model with a small-strain structure is then called to obtain, as in (15), the enhanced stress tensor at   t   n + 1   ,     T   ¯     ( n + 1 , i )   , and the associated elastoplastic tangent moduli   (     E   ¯     ep   )   ( n + 1 , i )   which is such as  (75)        T   ¯     ̇     ( n + 1 , i )   =   (     E   ¯     ep   )   ( n + 1 , i )   :       E   ¯     ̇     ( n + 1 , i )     For this, the enhanced logarithmic strain tensor     E   ¯     ( n , i )   , its increment Δ     E   ¯     ( n , i )   , its plastic part, some hardening variables, and the enhanced stress tensor     T   ¯     ( n , i )   are required. This corresponds to the second step of the model described in Section 2.2.  Using the geometric transformations described in Section 2.3, the enhanced second Piola–Kirchhoff stress tensor     S   ¯     ( n + 1 , i )   and the associated tangent modulus   (     C   ¯     L   ep   )   ( n + 1 , i )   which is such as  (76)      S   ¯     ( n + 1 , i )   =   (     C   ¯     L   ep   )   ( n + 1 , i )   :    1   2        C   ¯     ( n + 1 , i )     are obtained at   t   n + 1   . These variables can then be respectively injected in (37) and (51), so that the tangent matrix and the residuals (46), (48), (47) can then be calculated at the ( i + 1 ) th equilibrium iteration of the ( n + 1 ) th time step. The tangent system (56) can now be solved in order to get   ( Δ U , Δ P , Δ Θ )   ( n + 1 , i + 1 )   .  According to the Newton–Raphson method, the variables are then updated  (77)    ( U , P , Θ )   ( n + 1 , i + 1 )   =   ( U , P , Θ )   ( n + 1 , i )   +   ( Δ U , Δ P , Δ Θ )   T ( n + 1 , i + 1 )     The convergence is then checked; if the residuals   (   R   u   ,   R   p   ,   R   θ   )   T ( n + 1 , i )   are small enough,   ( U , P , Θ )   ( n + 1 , i + 1 )   is set to be   ( U , P , Θ )   ( n + 1 )   . Else, new iterations are necessary until the convergence criterion is checked. A brief summary of the algorithm is presented in Table 1 .  The formulation presented in previous sections is illustrated below in some benchmark problems. Performance of the method in plastic incompressibility is tested considering 3D tetrahedral meshes. Firstly, numerical examples are presented in order to compare the results of the developed elements with those of displacement-based elements. Moreover, we use constitutive laws which allow us to compare results from the three-field formulation with those from the two-field formulation obtained by eliminating the strain-like variable. An industrial application is then presented, to evaluate the robustness of the method. Computations are performed with the industrial finite element code Code_Aster which is developed by EDF R&D [32].  This problem has been used by many authors [16,13,33] to test finite element formulations under combined bending and shear. A nonlinear extension of the well-known Cook׳s plane strain problem is considered, as presented in [34]. Its extension to finite-strain plasticity was proposed by Simo and Armero [35] and has then been studied by other authors. A tapered panel is clamped on one side and subjected to a uniform shear load of f = 0.3125  N /   mm   2   on the opposite side. The geometry, loading and boundary conditions are given in Fig. 1 (a). Plane strain conditions are assumed. We consider a J2-finite-strain model as described in [34]. The elastic part of the material constitutive law is governed by a modified Neo-Hookean model, and its plastic part by nonlinear isotropic hardening rule with an associative flow rule based on the Von Mises yield criterion, defined in terms of the yield stress in uniaxial tension by  (78)    σ   y   = 0.715 − 0.265  exp ( − 16.93   e   p   ) +     2   3     0.12924   e   p     with e  p being the equivalent plastic strain.  The material parameters are those used in the study by Simo and Armero, that is a bulk modulus of κ = 164.21  MPa , and a shear modulus of μ = 60.1938  MPa . The quantity of interest is the vertical displacement of the top right corner of the plate (point A) as presented in Fig. 1(a). Its convergence as a function of the number of elements per side, for structured mesh (Fig. 1(b)), is usually used as a criterion in investigating performance. The results are shown in Fig. 2 , for several finite element formulations. Were considered the proposed formulation with quadratic interpolation for the displacement field and linear for both pressure and strain variable fields, referred to as P2/P1/P1, and with quadratic interpolation for displacements and pressure fields and linear for the strain variable fields, referred to as P2/P2/P1. Were also considered the two-field formulation, with quadratic elements for displacements and linear for pressure, referred to as P2/P1, and linear and quadratic displacement-based elements.  We observe, as expected, that P1 element suffers from severe locking, even for fine meshes. The other elements seem to converge and to have the same behavior concerning the displacement for this example.  The benchmark proposed here consists of a cube specimen as represented in Fig. 3 . The loading condition consists of a prescribed normal stress of 1000Pa in the vertical direction on the plane { z = 10 } . A no-slip condition is considered on plane { z = 0 } . On the plane y = 0 , dy=0 is imposed and on the plane x=0, dx=0 is imposed. Young׳s modulus is E=200GPa and the Poisson׳s ratio is ν = 0.3 . A perfectly plastic model is assumed, considering a yield stress   σ   Y   = 150  MPa . The distribution of the trace of the stress is compared at Gauss points for P2/P1/P1, P2/P2/P1 elements, and for linear and quadratic displacement-based elements in Fig. 4 .  As expected, the displacement-based formulation [15], both with linear (Fig. 4(a)) and quadratic elements (Fig. 4(b)), is not stable and present spurious oscillations of the stress trace. A three-field approach makes these oscillations disappear, as shown in Fig. 4(c) and (d), for both P2/P1/P1 or P2/P2/P1 elements.  However, further analysis, as observed in Fig. 5 , shows that the P2/P2/P1 formulation is not stable regarding the Lagrange multiplier field p. This instability can be explained by considering the mixed finite element corresponding to the two-field formulation obtained by condensing the strain variable in the three-field formulation. Indeed, this element is quadratic both in displacement and pressure (P2/P2 element). It is well known [15] that this element does not fulfill the Ladyjenskaia–Brezzi–Babuska (LBB) stability condition. Consequently, the P2/P2/P1 element which is based on it cannot be stable, as shown in Fig. 5(b). In the following, this element will no longer be considered.  A sphere with inner radius   r   i   = 0.2  mm and outer radius   r   o   = 1  mm is subjected to an internal normal stress of 1MPa (Fig. 6 ). In order to reduce the computation cost, only a quarter of the sphere has been modeled in an axisymmetrical frame. The material considered is taken as elastoplastic perfectly plastic. The plastic flow is associated with the Von Mises criterion, with a yield stress   σ   Y   = 150  MPa . Young׳s modulus is taken as E=200GPa and the Poisson׳s ratio ν = 0.3 .  In the case where the entire sphere has reached a plastic state, an analytical expression of the hydrostatic stress can be obtained. Indeed, when the plastic zone reaches the outer side, the outer radius of the deformed sphere can be written  (79)    r   od   =   r   o    exp [      σ   Y     3   (    1   2 μ   +   2   3 κ    )  ]   with κ being the bulk modulus and μ the shear modulus.  It can be shown that in that case, the volume change may be expressed as  (80)  f ( r ) =   2   σ   Y     3 κ   + 1 −   1 − 4     σ   Y     κ    ln (    r     r   od      )     with r being the distance from the center in the deformed configuration.  The trace of the Cauchy stress tensor σ = τ / J is then  (81)  tr ( σ ) ( r ) = 3 κ f ( r )   Note that the magnitude of plastic deformations reaches 11%. The L2-error of hydrostatic pressure is computed for several structured triangle meshes with several number of elements. The coarser mesh has five elements per side. This mesh has been refined by doubling the number of elements per side to get a mesh of ten elements per side (50 elements) and so on until getting a mesh of 12,800 elements.  The L2-(absolute) error on the hydrostatic pressure is plotted in Fig. 7 with respect to the number of elements, in order to evaluate the convergence of the P2, P2/P1 and P2/P1/P1 elements. It can be observed that the P2/P1/P1 element and the P2/P1 element give the same results, and when using these elements, the error is the smallest. With the P2 element, the error is significant even with fine meshes.  The goal of the present study is to estimate the lifetime in creep of an inlet valve of a thermal power station made of 15CDV-9-10 steel submitted to a constant internal pressure and a temperature ranging from 475 to 565°C. This valve has a crack. In order to prevent any propagation, the crack is removed by scouring a small region around, leaving a smooth trench in the place of the crack. The material is thermo-elasto-visco-plastic with isotropic hardening and follows Lemaitre׳s law. Denoting   E   v   the viscous portion of the strain, it can be written  (82)      E   ̇     v   = g (   T   eq   , λ )   3   2       T   D       T   eq       with   T   eq   being the equivalent plastic stress, λ the cumulated viscous strain and   T   D   the deviatoric part of the stress tensor.  In the case of Lemaitre׳s law, the plasticity criterion g may be expressed as  (83)  g (   σ   eq   , λ ) =   (    1   K       σ   eq       λ   1 / m      )   n   ,  with    1   K   ≥ 0 ,    1   m   ≥ 0 ,  n > 0   In this application, these values have been chosen such as n=5.9835 and 1 / m = 0 . 1 / K is expressed as a function of temperature, going from a value of 1.399×10−10 for a temperature of 450°C to 4.334×10−10 for a temperature of 570°C.  For further details about this law, we refer to [36]. Magnitude of the plastic deformations reaches 20%. Fig. 8 represents the geometry of the valve and the unstructured mesh of tetrahedra used in the computations (229,503 nodes for 151,528 elements), with the scour area surrounded.  At the scour area, there are some oscillations on the pressure values, due to incompressibility, even with under-integrated elements [11], as shown in Fig. 9 . Fig. 10 shows the results for the P2/P1/P1 element. It can be observed that there is no oscillations on the pressure values, and the distribution is smooth. Furthermore, the values of the hydrostatic pressure (Fig. 10(a)) and the Lagrangian multiplier p (Fig. 10(b)) are very close, which guarantees the quality of the element; remind that in the three-field formulation presented above, the equality between these two quantities is weakly prescribed (40).   CONCLUSIONS   A robust and efficient non-linear mixed finite element procedure for the numerical analysis of finite-strain elastoplasticity has been presented. A finite-strain model based on the logarithmic strain tensor and its work-conjugate stress tensor has been extended to a three-field formulation, which allows a generic formulation to be obtained. The presented finite-strain model and finite element formulation have the advantages of allowing an easy extension of constitutive laws from small-strain theory and are relatively easy to implement. It results in an extended finite-strain model, which is robust, and able to take into account the plastic incompressibility constraint intrinsically. The importance of the choice of the interpolation order of the different fields has been shown through an example, and it was shown that the P2/P1/P1 element (quadratic interpolation for the displacement field, linear interpolation for both pressure and strain variable fields) is stable contrary to the P2/P2/P1 element (with a quadratic interpolation for the pressure field). Furthermore, the examples presented above have illustrated the performance and the accuracy of the proposed element, even in a case where the widely used under-integrated elements failed.   REFERENCES", "highlights": "This paper deals with the treatment of incompressibility in solid mechanics in finite-strain elastoplasticity. A finite-strain model proposed by Miehe, Apel and Lambrecht, which is based on a logarithmic strain measure and its work-conjugate stress tensor is chosen. Its main interest is that it allows for the adoption of standard constitutive models established in a small-strain framework. This model is extended to take into account the plastic incompressibility constraint intrinsically. In that purpose, an extension of this model to a three-field mixed finite element formulation is proposed, involving displacements, a strain variable and pressure as nodal variables with respect to standard finite element. Numerical examples of finite-strain problems are presented to assess the performance of the formulation. To conclude, an industrial case for which the classical under-integrated elements fail is considered."}