{"id": "S0168874X14001553", "article": "MAIN-TITLE Interval finite element analysis and reliability-based optimization of coupled structural-acoustic system with uncertain parameters   HIGHLIGHTS          Uncertainties in both physical parameters and boundary conditions are considered.      Modified Taylor series is proposed to predict the ranges of matrices and vectors.      Higher order terms of the Neumann expansion are retained in MIPPM.      Uncertain optimization model is presented based on interval satisfaction degree.          KEYPHRASES   Coupled structural-acoustic system  Interval parameter perturbation finite element method  Modified Neumann expansion  Reliability-based optimization   In recent years, with the increase of people׳s awareness of environment and requirement for comfort, research on acoustic behavior inside the cabin is becoming a challenging problem for the lager complex structures such as cars, boats and airplanes. Therefore, predicting and improving the acoustic performance in terms of numerical simulation at the design stage has a very important significance. In many engineering situations, the noise induced by the coupling between the fluid and the structure is often encountered. The coupled structural-acoustic problem incorporates the mutual influence between the thin structure and acoustic field when the feedback of the acoustic fluid on the structure cannot be ignored [1]. The analytical solutions of the coupled structural-acoustic problem exist only for the simple shapes, while for the real-life problem, the numerical techniques become more practical, which can be grouped into two categories: deterministic approaches [2–4] and statistical analysis [5]. The deterministic approaches, such as the finite element method (FEM), boundary element method (BEM) and infinite element method (IEM), are concentrated towards the structural and acoustic response in the low-frequency range. In the high-frequency range, the response is very sensitive to small changes in the model, and thus the statistical energy analysis (SEA), introduced by Lyon and Maidanik in the 1960s [6], places great emphasis on the high-frequency response analysis by using time and space statistical information. In the last two decades, design of structural and acoustic systems that reduces noise and vibration through optimization has become very important. Hinton and Rao [7] applied shape optimization techniques to obtain optimal shell geometry and thickness distribution with the objective of a maximized fundamental frequency of structures. Marburg [8] described the noise transfer function including structural harmonic analysis, acoustic influence coefficients and their coupling, and proposed the well-known semianalytic calculation of harmonic displacement sensitivities. In the literature [9], a topology optimization based approach was proposed to study the optimal configuration of stiffeners for the interior sound reduction.  Traditional acoustic analysis has been conducted under the assumption that the physical properties and boundary conditions are deterministic. But in the actual engineering, due to the model inaccuracies, physical imperfections and system complexities, uncertainties in material properties, geometric dimensions and boundary conditions are unavoidable, which will lead to the uncertainty of the acoustic field. Popular approaches for these uncertain problems are probabilistic methods, where the probability density functions are defined unambiguously. Allen and Vlahopoulos [10] combined boundary element methods and finite element methods with stochastic analysis to calculate noise radiated from a structure subjected to random excitation. Chen et al. [11] developed the computing technique for the acoustic pressure spectral density and its sensitivity of coupled structural–acoustic systems subjected to stochastic excitation. James and Dowling [12,13] investigated the methods to quantify the uncertainties to determine the probability density functions of the sound pressure amplitude in the acoustic domain. For the probabilistic methods, a great amount of statistical information is required to construct the precise probability distribution functions of uncertain parameters. Unfortunately, for many engineering problems, it is often too difficult or costly to collect enough information about the uncertainty.  In order to overcome the shortcomings of probabilistic methods, some non-probabilistic approaches such as convex model and interval analysis have achieved widespread attention to deal with the uncertain problems without sufficient information [14,15]. Neumaier [16] investigated the hypercube approximation for the united solution set of the interval equations by the Gaussian elimination scheme, which will be extremely conservative due to a large number of elimination operations [17]. If the monotonicity of function was guaranteed, the exact response intervals can be obtained by the vertex method using all possible combinations of the interval parameters [18]. However, the computational effort of this method increases exponentially with the increase in the number of uncertain parameters. Compared with above interval approaches, the interval perturbation finite element method, proposed by Qiu et al. [19,20], has been widely applied in the structural response analysis thanks to its simplicity and efficiency [21]. On this basis, Xia and Yu developed the interval and subinterval perturbation methods to predict the acoustic field with uncertain-but-bounded parameters [22,23]. Up to now, research on interval uncertain problems is mainly concentrated in the structural field, while the application of interval approaches in the acoustic domain is still unexplored enough [24].  Hence, establishing effective numerical methods and optimization models for the structural-acoustic system with interval parameters has great significance both in theory and engineering. Firstly, finite element equations suitable to coupled structural-acoustic system are briefly presented. Subsequently in the next section, considering higher order terms, a modified parameter perturbation method is proposed to approximately predict the response intervals in the frequency domain. In Section 4, the new model and algorithm of interval reliability optimization are proposed based on the satisfaction degree of interval. A 3D car numerical example is given for verification in Section 5, and we conclude the paper with a brief discussion at last.  For a structural-acoustic system with the flexible boundary structure as shown in Fig. 1, in the frequency domain, the interior acoustic steady-state pressure p is governed by the Helmholtz equation  (1)    ∇  2  p +   (   ω c   )  2  p = 0   where   ∇  2  denotes the Laplace operator; ω is the angular frequency and c stands for the speed of sound.  For the interior acoustic field bounded by Γ, boundary conditions are usually grouped into three sets: the Dirichlet condition, Neumann condition and Robin condition.  (2)   p =   p   w    o n    Γ   D       ∂ p   ∂ n   = ρ   ω  2    u   n    o n    Γ   N       ∂ p   ∂ n   = − j ρ ω   A   n   p  o n    Γ   R      where n is the exterior unit-normal vector; ρ is the density of fluid in acoustic field; u  n is the normal displacement of the wall structure on the Neumann boundary; A  n is the admittance coefficient that models the acoustic damping of the Robin boundary; j =   − 1   is an imaginary unit.  Based on the work of Ohayon and Soize [25], we can obtain the following weak form by multiplying the Helmholtz equation with a weighting function δp   (3)   ∫ Ω    (    ∇  2  p +   (   ω c   )  2  p  )  δ p d Ω  −  ∫    Γ   N       (    ∂ p   ∂ n   − ρ   ω  2    u   n    )  δ p d Γ  −  ∫    Γ   R       (    ∂ p   ∂ n   + j ρ ω   A   n   p  )  δ p d Γ  = 0      In the standard finite element analysis, coupled structural-acoustic system is discretized to the isoparametric hexahedral elements. Based on the Lagrange interpolation shape functions, one can gain the following acoustic dynamic equilibrium equation  (4)  (   K  a  + j ω   C  a  −   ω  2    M  a  ) P = ρ   ω  2  S   U  s    where K  a , C  a , M  a and S stand for the global acoustic stiffness matrix, damping matrix, mass matrix and coupled matrix; P is the acoustic pressure vector and U  s is the displacement vector of the structure.  Similarly, considering the reaction on the structure made by interior acoustic field, the structural displacement can be predicted by calculating the finite element equation  (5)  (   K  s  + j ω   C  s  −   ω  2    M  s  )   U  s  =   F  s  +   F  a    where K  s , C  s and M  s represent the structural system stiffness matrix, damping matrix and mass matrix, respectively; F  s denotes the external load vector applied to the structure, while F  a stands for the generalized load vector made by the acoustic pressure.  Based on the principle of virtual work, the equivalent force vector made by interior acoustic field on the structure can be expressed as  (6)    F  a  =   S  T  P      Combining Eq. (4) with Eq. (5), the dynamic equilibrium equation of the coupled structural-acoustic system can be denoted as  (7)  −   ω  2  MU + j ω CU + KU = F   where  (8)      M =  [        M  s     0      ρ   M   c o u p l e         M  a       ]   C =  [        C  s     0     0      C  a       ]   U =  {        U  s       P     }   F =  {        F  s       0     }        K =  [        K  s        K   c o u p l e        0      K  a       ]     M   c o u p l e   = S  (   K   c o u p l e   ) = −   S  T           Due to the limitations of production and measurement error, uncertainties in acoustic medium, material properties and applied loads are all taken into account. In this paper, the uncertainties whose lower and upper bounds can be determined by the limited information are quantitatively described as the interval parameters and assumed to belong to an uncertain-but-bounded parameter vector as follows  (9)  α ∈   α  I  = [  α ̲  ,  α ¯  ] =   (   α   i   I   )   m   =   ( [    α ̲    i   ,    α ¯    i   ] )   m   =   (   α   i   c   + Δ   α   i   δ )   m   =   α  c  + Δ α δ  i = 1 , 2 , ⋯ , m   where    α ̲    i   and    α ¯    i   are the lower and upper bounds;   α   i   c   = (    α ¯    i   +    α ̲    i   ) / 2 and Δ   α   i   = (    α ¯    i   −    α ̲    i   ) / 2 are called the midpoint and the radius, respectively; the transition parameter δ denotes a fixed interval, i.e. δ=[−1,1].  Therefore, the coefficient matrices M,C,K and load vector F in Eq. (7) become interval matrices and vector with respect to the interval parameter vector α  I . In order to simplify the analysis process, the coupled structural-acoustic FEM equation with interval parameters can be expressed as  (10)  Z (   α  I  ) U (   α  I  ) = F (   α  I  )   where the equivalent interval coefficient matrix Z (   α  I  ) can be denoted as  (11)  Z (   α  I  ) = −   ω  2  M (   α  I  ) + j ω C (   α  I  ) + K (   α  I  )      Theoretical solution set of Eq. (10) is defined as  (12)  Ω = { U ( α ) | Z ( α ) U ( α ) = F ( α )  α ∈   α  I  }   where Ω has a complicated region. Directly solving Eq. (12) cannot be implemented in practice. In interval mathematics, to solve Eq. (12) is synonymous to capture a multi-dimensional rectangle   U  I  = [  U ̲  ,  U ¯  ] , which contains above theoretical solution set Ω. Thus, Eq. (10) can be rewritten as  (13)  Z (   α  I  )   U  I  = F (   α  I  )      As we know, the first-order Taylor expansion for the linear function is accurate. Its accuracy for the non-linear function is also acceptable if the ranges of the interval parameters are narrow enough. However, the interval expansion problem becomes so serious that the accuracy is not acceptable if the interval parameters are not narrow enough or a large number of uncertain parameters exist. Based on the work of Chen et al. [26], in this section we will present a modified Taylor expansion and a modified parameter perturbation method where higher order terms are retained.  By using the rail generation method of approximate surface, the non-linear interval coefficient matrix Z (   α  I  ) can be approximately expressed as  (14)  Z (   α  I  ) = Z (   α   1   ,   α   2   , .. . ,   α   m   ) =  ∑  i = 1  m    Z ˜  (   α   i   I   )  − ( m − 1 ) ⋅ Z (   α  c  )   where  (15)   Z ˜  (   α   i   I   ) = Z (   α   1   c   , .. . ,   α   i − 1   c   ,   α   i   I   ,   α   i + 1   c   .. . ,   α   m   c   )  i = 1 , 2 , .. . , m      Expand the unitary matrix  Z ˜  (   α   j   I   ) at the midpoint of   α   j   I   , ignore the higher order terms and obtain the approximate expression of the interval coefficient matrix Z (   α  I  ) .  (16)  Z (   α  I  ) =  [   ∑  j = 1  m    Z ˜  (   α   j   c   )  − ( m − 1 ) ⋅ Z (   α  c  )  ]  +  [   ∑  j = 1  m     ∂  Z ˜  (   α   j   c   )   ∂   α   j     Δ   α   j   I     ]  =   Z  c  + Δ   Z  I    where  (17)    Z  c  =  ∑  i = 1  m    Z ˜  (   α   i   c   )  − ( m − 1 ) ⋅ Z (   α  c  )  Δ   Z  I  =  ∑  i = 1  m     ∂  Z ˜  (   α   i   c   )   ∂   α   i     Δ   α   i   I    =  ∑  i = 1  m     ∂  Z ˜  (   α   i   c   )   ∂   α   i     Δ   α   i     δ   i         Similarly, interval parameter vector F (   α  I  ) can be rewritten as  (18)  F (   α  I  ) =  [   ∑  i = 1  m    F ˜  (   α   i   c   )  − ( m − 1 ) ⋅ F (   α  c  )  ]  +  [   ∑  i = 1  m     ∂  F ˜  (   α   i   c   )   ∂   α   i     Δ   α   i   I     ]  =   F  c  + Δ   F  I    where  (19)    F  c  =  ∑  i = 1  m    F ˜  (   α   i   c   )  − ( m − 1 ) ⋅ F (   α  c  )  Δ   F  I  =  ∑  i = 1  m     ∂  F ˜  (   α   i   c   )   ∂   α   i      Δ   α   i   I    =  ∑  i = 1  m     ∂  F ˜  (   α   i   c   )   ∂   α   i     Δ   α   i     δ   i         In terms of above modified first-order Taylor series, we can quickly determine the interval characteristics of the non-linear coefficient matrix and vector, and restrain the interval expansion in a certain extent.  By substituting above two denotations (16) and (18) into Eq. (13) and pre-multiplying both sides with   (   Z  c  + Δ   Z  I  )   − 1   , we can obtain  (20)    U  I  =   U  c  + Δ   U  I  =   (   Z  c  + Δ   Z  I  )   − 1   (   F  c  + Δ   F  I  )      If the spectral radius of   (   Z  c  )   − 1   Δ Z is less than 1,   (   Z  c  + Δ   Z  I  )   − 1   can be expanded by the Neumann series  (21)    (   Z  c  + Δ   Z  I  )   − 1   =   (   Z  c  )   − 1   +   (   Z  c  )   − 1    ∑  r = 1  ∞     ( − Δ   Z  I    (   Z  c  )   − 1   )  r        In the traditional first-order interval parameter perturbation method (FIPPM) [19], only the first-order terms are employed. By substituting Eq. (21) into Eq. (20), we can derive the following expression without considering the higher order terms  (22)    U  c  =   (   Z  c  )   − 1     F  c       (23)  Δ   U  I  =   (   Z  c  )   − 1   ( Δ   F  I  − Δ   Z  I    (   Z  c  )   − 1     F  c  ) =   (   Z  c  )   − 1    [   ∑  i = 1  m   (    ∂  F ˜  (   α   i   c   )   ∂   α   i     −   ∂  Z ˜  (   α   i   c   )   ∂   α   i       (   Z  c  )   − 1     F  c   )  Δ   α   i     δ   i    ]  = Δ U ⋅ δ      Based on the monotony of Δ   U  I  with respect to δ  i , the deviation radius Δ U can be easily calculated by  (24)  Δ U =  ∑  i = 1  m   |    (   Z  c  )   − 1    (    ∂  F ˜  (   α   i   c   )   ∂   α   i     −   ∂  Z ˜  (   α   i   c   )   ∂   α   i       (   Z  c  )   − 1     F  c   )  Δ   α   i    |    where | • | denotes the absolute value.  The upper and lower bounds of the response interval calculated by FIPPM can be expressed as  (25)   U ¯  =   U  c  + Δ U   U ̲  =   U  c  − Δ U      In order to improve the computing accuracy, a modified interval parameter perturbation method (MIPPM) is proposed to predict the response ranges.  Resorting to Eq. (17), the term   Σ   r = 1   ∞     ( − Δ   Z  I    (   Z  c  )   − 1   )  r  in Eq. (21) can be rewritten as  (26)   ∑  r = 1  ∞     ( − Δ   Z  I    (   Z  c  )   − 1   )  r   =  ∑  r = 1  ∞     (  −  ∑  i = 1  m     ∂  Z ˜  (   α   i   c   )   ∂   α   i     Δ   α   i   I      (   Z  c  )   − 1    )  r   =  ∑  r = 1  ∞     (  −  ∑  i = 1  m   Δ   α   i   I     Z   i     )  r     where   Z   i   = ( ∂  Z ˜  (   α   i   c   ) / ∂   α   i   )   (   Z  c  )   − 1   is a simplified expression. For different value of r, the terms in summation sign can be rewritten in the following explicit forms  (27)       (  −  ∑  i = 1  m   Δ   α   i   I     Z   i     )   r = 1   = −  ∑  i = 1  m   Δ   α   i   I     Z   i          (  −  ∑  i = 1  m   Δ   α   i   I     Z   i     )   r = 2   =  ∑  i = 1  m     ( Δ   α   i   I     Z   i   )  2   +  ∑      i , j = 1       ¬ i = j      m   Δ   α   i   I   Δ   α   j   I     Z   i     Z   j          (  −  ∑  i = 1  m   Δ   α   i   I     Z   i     )   r = 3   = −  ∑  i = 1  m     ( Δ   α   i   I     Z   i   )  3   +  ∑      i , j , k = 1       ¬ i = j = k      m   Δ   α   i   I   Δ   α   j   I   Δ   α   k   I     Z   i     Z   j     Z   k        ..... .      where the expression ¬ i = j stands for the any combination except i=j.  By substituting Eqs. (26) and (27) into Eq. (21), one gets  (28)    (   Z  c  + Δ   Z  I  )   − 1   =   (   Z  c  )   − 1   +   (   Z  c  )   − 1    ∑  i = 1  m    ∑  r = 1  ∞     ( − Δ   α   i   I     Z   i   )  r    +   (   Z  c  )   − 1    ∑      i , j = 1       ¬ i = j      m   Δ   α   i   I   Δ   α   j   I     Z   i     Z   j    + .. .      If the condition | | Δ   α   i     Z   i   | | < 1 is satisfied, the series   Σ   r = 1   ∞     ( − Δ   α   i   I     Z   i   )  r  is convergent. Then the inversion of the interval matrix can be approximated by retaining only the first two terms  (29)    (   Z  c  + Δ   Z  I  )   − 1   ≈   (   Z  c  )   − 1   +   (   Z  c  )   − 1    ∑  i = 1  m    ∑  r = 1  ∞     ( − Δ   α   i   I     Z   i   )  r    =   (   Z  c  )   − 1   +   (   Z  c  )   − 1    ∑  i = 1  m     − Δ   α   i   I     Z   i     I + Δ   α   i   I     Z   i      =   (   Z  c  )   − 1   +   (   Z  c  )   − 1    ∑  i = 1  m     E   i   I      where  E i I  = − Δ  α i I   Z i  / ( I + Δ  α i I   Z i  ) .  Based on the interval algorithms, it is easy to get the formulas of median and radius about interval matrix   E   i   I      (30)    E   i   c   =  1 2   (    Δ   α   i     Z   i     I − Δ   α   i     Z   i     −   Δ   α   i     Z   i     I + Δ   α   i     Z   i      )   Δ   E   i   =  1 2   |    Δ   α   i     Z   i     I − Δ   α   i     Z   i     +   Δ   α   i     Z   i     I + Δ   α   i     Z   i      |       By substituting Eqs. (29) and (30) into Eq. (20), we can derive  (31)    U  c  + Δ   U  I  =   (   Z  c  )   − 1     F  c  +  ∑  i = 1  m     (   Z  c  )   − 1     E   i   c     F  c   +   (   Z  c  )   − 1   Δ   F  I  +  ∑  i = 1  m     (   Z  c  )   − 1   Δ   E   i   I     F  c   +  ∑  i = 1  m     (   Z  c  )   − 1     E   i   c   Δ   F  I   +  ∑  i = 1  m     (   Z  c  )   − 1   Δ   E   i   I   Δ   F  I        Neglecting the higher order cross small terms, following equations can be derived  (32)    U  c  =   (   Z  c  )   − 1    [  I +  ∑  i = 1  m     E   i   c     ]    F  c       (33)  Δ   U  I  =   (   Z  c  )   − 1    [  Δ   F  I  +  ∑  i = 1  m   Δ   E   i   I     F  c   +  ∑  i = 1  m     E   i   c   Δ   F  I    ]       Based on Eq. (19), Eq. (33) can be rewritten as  (34)  Δ   U  I  =   (   Z  c  )   − 1    [   ∑  j = 1  m     ∂  F ˜  (   α   j   c   )   ∂   α   j     Δ   α   j     δ   j    +  ∑  i = 1  m   Δ   E   i     F  c    δ     e   i      +  ∑  i = 1  m     E   i   c    ∑  j = 1  m     ∂  F ˜  (   α   j   c   )   ∂   α   j     Δ   α   j     δ   j      ]  =   (   Z  c  )   − 1    {   ∑  i = 1  m   Δ   E   i     F  c    δ     e   i      +  ∑  j = 1  m    [    ∂  F ˜  (   α   j   c   )   ∂   α   j     +  ∑  i = 1  m     E   i   c     ∂  F ˜  (   α   j   c   )   ∂   α   j       ]  Δ   α   j     δ   j     }  = Δ U ⋅ δ      If   δ     e   i     and   δ   j   are considered as independent from each other, it is obvious that Δ   U  I  is a linear monotonic function with respect to   δ     e   i     and   δ   j   . Hence, the radius Δ U can be expressed as  (35)  Δ U =  ∑  i = 1  m   |   (   Z  c  )   − 1   Δ   E   i     F  c  |  +  ∑  j = 1  m   |    (   Z  c  )   − 1    [    ∂  F ˜  (   α   j   c   )   ∂   α   j     +  ∑  i = 1  m     E   i   c     ∂  F ˜  (   α   j   c   )   ∂   α   j       ]  Δ   α   j    |       Therefore, the upper and lower bounds of the coupled response interval can be calculated by  (36)   U ¯  =   U  c  + Δ U   U ̲  =   U  c  − Δ U      Compared with FIPPM where only first-order terms are considered, it is obvious that the interval matrix inverse in MIPPM is calculated by retaining part of higher order terms in Neumann series. Therefore, the proposed MIPPM can obtain more accurate response bounds, and it provides a powerful tool for the interval reliability optimization in the next section.  The core concept of reliability represents a probability by which a component part, equipment, or system will satisfactorily perform its intended function under given circumstances [27]. In the traditional probabilistic reliability, the quality function Y is considered as a random variable with respect to the random uncertain parameters  (37)  Y = g ( α ) = g (   α   1   ,   α   2   , .. . ,   α   m   )      Given the probability density function   p   Y   ( y ) , the probabilistic reliability R can be calculated by the following integral:  (38)  R = P r o b ( Y > 0 ) =  ∫  g ( α ) > 0      p   Y   ( y ) d y    where Prob denotes the probability.  If the uncertain parameters are described as an interval vector   α  I  , the original quality function Y = g ( α ) will be replaced by its interval function   Y  I  = g (   α  I  ) . In this case, the non-probabilistic reliability R can be redefined as the possibility that the interval constraint   Y  I  > 0 is satisfied [14]   (39)  R = P o s s (   Y  I  > 0 ) = P o s s ( g (   α  I  ) > 0 )   where Poss represents the possibility.  Based on the work of Liu and Da [28], a definition of the satisfaction degree is introduced to represents the possibility that one interval is larger or smaller than another. For two interval numbers a  I and b  I , there are six positional cases as shown in Fig. 2, and thus the satisfaction degree P o s s (   a  I  >   b  I  ) can be calculated by  (40)  P o s s (   a  I  >   b  I  ) =   max ( 0 , l e n ( a ) + l e n ( b ) −  max ( 0 ,  b ¯  −  a ̲  ) )   l e n ( a ) + l e n ( b )     where len stands for the length of an interval number  (41)  l e n ( a ) =  a ¯  −  a ̲   l e n ( b ) =  b ¯  −  b ̲       When the interval number b  I is degenerated into a real number b, the previous satisfaction degree P o s s (   a  I  > b ) can be rewritten as  (42)  P o s s (   a  I  > b ) =   max ( 0 , l e n ( a ) −  max ( 0 , b −  a ̲  ) )   l e n ( a )        This sorting method based on satisfaction degree of interval provides a useful tool for the calculation of interval reliability in Eq. (39).  It is well-known that large structures such as cars, boats and airplanes have strict requirements of acoustic behaviors inside the cabin. Traditional acoustic optimizations have been carried out on the premise that system parameters were treated as deterministic values, and the general optimization model can be formulated as follows  (43)       min  x   f ( x )     s . t .    g   i   ( x ) ≤ 0  i = 1 , 2 , ⋯ n      where x =   (   x   i   )   k   is a k-dimensional design vector; f(x) stands for the objective function, while   g   i   ( x ) denotes the ith constraint condition; n is the total number of the constraints.  Considering the unavoidable uncertainties in the optimization problem, some constraints are made to be satisfied with a predetermined confidence level and the uncertain constraints are transformed into the deterministic ones [29]. Therefore, the following uncertain optimization model will be yielded if given the confidence level  (44)       min  x   f ( x , α )     s . t .  P o s s (   g   j   ( x , α ) ≤ 0 ) ≥   η   j    j = 1 , 2 , ⋯ n      where Poss denotes the possibility that the constraint   g   j   ( x , α ) ≤ 0 is satisfied;   η   j   is the reliability index standing for the given confidence level of the jth constraint.  Similarly, if intervals variables   α  I  are used to quantitatively describe uncertainties, the constraint function   g   j   ( x , α ) will be replaced by its interval function   g   j   I   ( x ,   α  I  ) . According to the satisfaction degree of interval as shown in Eq. (40), the possibility P o s s (   g   j   I   ( x ,   α  I  ) ≤ 0 ) can be calculated by the following formula  (45)  P o s s (   g   j   I   ( x ,   α  I  ) ≤ 0 ) =  {     1    if        g ¯    j   ( x ,   α  I  ) ≤ 0       −      g ̲    j   ( x ,   α  I  )      g ¯    j   ( x ,   α  I  ) −    g ̲    j   ( x ,   α  I  )       if        g ̲    j   ( x ,   α  I  ) ≤ 0 ≤    g ¯    j   ( x ,   α  I  )      0    if        g ̲    j   ( x ,   α  I  ) ≥ 0         where  (46)     g ¯    j   ( x ,   α  I  ) =   max   α ∈   α  I      g   j   ( x , α )     g ̲    j   ( x ,   α  I  ) =   min   α ∈   α  I      g   j   ( x , α )   are the upper bound and lower bound of the interval function   g   j   I   ( x ,   α  I  ) , respectively.  If Eq. (44) is treated as an optimization model with respect to the design variables x and Eq. (46) is treated as another optimization model with respect to the interval parameters α  I , the original reliability-based optimization problem is transformed into a nested optimization model by using the satisfaction degree as shown in Eq. (45) to represent the non-probabilistic reliability. The outer-layer optimization is used to capture the optimal values of design variables, while the aim of inner-layer optimization is to predict the upper and lower bounds of interval constraints as shown in Eq. (46). Based on the proposed MIPPM, the response ranges can be quickly obtained and meanwhile the tedious inner-layer optimization can be avoided. Therefore, the nested optimization problem is converted into a conventional single-layer one, greatly improving the efficiency of optimization calculation.  Consider a complex coupled structural-acoustic system of a 3D car model as shown in Fig. 3. The structure and acoustic cavity are discretized by 710 quadrilateral elements and 2150 hexahedral elements, respectively. A unit normal harmonic excitation is imposed on the central point at the roof, and the remaining vertices are set to be fixed. Considering the unpredictability of the environment temperature, the density of air and the acoustic speed surrounding the acoustic cavity are treated as uncertain-but-bounded parameters. The density of air ranges from 1.125kg/m3–1.325kg/m3, and the acoustic speed ranges from 330m/s–350m/s. Besides the fluid medium, the properties of different structural materials are listed in Table 1. Due to the material heterogeneity and measurement error, the structural material properties are all uncertain and supposed to have a 5% perturbation nearby their normal values. The amplitude of the harmonic excitation fluctuates between 0.95N and 1.05N.  Simulations for the 3D structural-acoustic system are carried out by Matlab R2012 on a 3.00GHz Petium(R) 4 CPU computer. Under the assumption that the physical properties and external load are deterministic, the first-order characteristic frequency locates at 78Hz. Thus, we choose 68–88Hz as the target frequency range in the numerical example. Besides, one node near the ear of driver is selected as the observation point. For the eleven selected frequencies, the lower bound (LB) and upper bound (UB) of the sound pressure amplitude at the observation point calculated by Monte Carlo method (abbreviated as MCM), FIPPM and MIPPM are listed in Table 2. The response ranges obtained by MCM with 106 samples are used as referenced results for validating the accuracy of the proposed method, and the relative errors of FIPPM and MIPPM are also listed in the table. From the comparison between the relative errors, it can be observed that the accuracy of MIPPM in which the higher order terms are retained is much higher than the accuracy of FIPPM where only the first-order perturbation terms are considered. Computational cost is another index to evaluate the performances of numerical methods. From the computational execution time listed in Table 2, we can see that the execution time of MIPPM is much shorter than that of MCM but is a little longer than that of FIPPM, and the exceeded time is implemented to approximate higher order terms. Compared with the improvement in accuracy, the increase of computational effort is deemed acceptable. Compared with MCM, the numerical results calculated by MIPPM are completely reliable and greatly reduce the huge computational cost of MCM.  In the subsequent acoustic optimization problem, we choose the average sound pressure level in the frequency range from 68Hz–88Hz nearby the first-order characteristic frequency as the noise index of the car. Thicknesses of the front glass, rear glass, roof and steel structure are assigned to be the design variables x =   (   T   1   , .. . ,   T   4   )  T  . The total mass is minimized with the constraint that the noise index at the observation point is not exceeding 60.0dB. Considering the interval uncertainties in parameters, we can establish the following reliability-based optimization model  (47)       min  x   M a s s ( x ,   α  c  )     s . t .  P o s s  {    L   p − a v e   (   α  I  , x ) =  1  11    ∑  i = 1   11      L   p   (   α  I  , x ,   ω   i   )  ≤ 60.0  d B  }  ≥ η     2.0  mm ≤   T   i   ≤ 10.0  mm  i = 1 , 2 , 3 , 4      where   L   p − a v e   stands for the average sound pressure level; η is the reliability index.  In the traditional optimization, it allows for uncertainty in the design process. The concept of safety factor is introduced to provide a design margin over the theoretical design capacity. Based on this method, the optimization model can be expressed as  (48)       min  x   M a s s ( x ,   α  c  )     s . t .    L   p − a v e   (   α  c  , x ) =  1  11    ∑  i = 1   11      L   p   (   α  c  , x ,   ω   i   )  ≤   60.0 d B  β      2.0  mm ≤   T   i   ≤ 10.0  mm  i = 1 , 2 , 3 , 4      where β stands for the safety factor. A factor of one means that the constraint is at the allowable limit, while a higher safety factor means a more conservative design.  Based on MIPPM, the acoustic response bounds can be efficiently predicted and the original nested optimization problem is transformed into a single-layer one, which can be easily solved by the adaptive simulated annealing algorithm in Isight. Given the reliability index η = 0.8 , the convergence is reached after 40 iterations in the feasible region and the iterative curves are plotted in   Figs. 4–6. The mean structural mass receives significantly reduction from 283.18kg to 240.28kg as shown in Fig. 5. Besides, the iterative curve in Fig. 6 illustrates that when the reliability index is set to be less than 1, the upper bound of the sound pressure level is allowed appropriately beyond the constraint of 60.0dB. The conclusion is consistent with the definition of the interval satisfaction degree as shown in Eq. (40).  Similarly, for different reliability indices, the optimal results are listed in Table 3. By comparing the results with the traditional deterministic optimization, in which the safety factor is set to be β=1.1, we can observe that the proposed uncertain optimization method can gain a better effect of mass reduction. Besides, comparison between the optimal values with different reliability indices further demonstrates the conclusion that to obtain a higher reliability, expending a certain objective function is required.   CONCLUSIONS   By combining the interval theory with finite element method, this paper proposes a modified interval parameter perturbation method and a reliability-based optimization model to design the coupled structural-acoustic system with interval parameters. The uncertainties in material properties and boundary conditions are all fully considered, which makes the calculation more objective. Interval characters of the non-linear coefficient matrix and vector can be efficiently determined based on the modified Taylor series. By contrast with the traditional FIPPM, the interval matrix inverse in MIPPM is conducted by a modified Neumann series in which part of higher order terms are retained. Thus, the MIPPM can obtain more accurate response bounds and greatly reduce the huge computational cost of Monte Carlo simulation. Given full consideration to uncertain parameters in the model-establishing phase, the proposed reliability-based optimization technology can capture better design results compared with traditional deterministic optimization. Besides, application of MIPPM eliminates the nested optimization and greatly improves the computing efficiency. Numerical results on a complex 3D car model fully validate the feasibility and superiority of the proposed model and method to deal with the coupled structural-acoustic system with interval uncertainties in both physical parameters and boundary conditions. However, it should be noted that the additional computational burden to calculate matrix inverses is the disadvantage of MIPPM, especially for the case with a large number of uncertain parameters.   ACKNOWLEDGMENTS   The project is supported by the Defense Industrial Technology Development Program (No.JCKY2013601B), National Natural Science Foundation of China (No.11002013) and 111 Project (No.B07009).   REFERENCES", "highlights": "A modified interval parameter perturbation finite element method (MIPPM) and a reliability-based optimization model are proposed for the coupled structural-acoustic field prediction and structural design with uncertainties in both the physical parameters and boundary conditions. Interval variables are used to quantitatively describe all the uncertain parameters with limited information. The interval matrix and vector are expanded by the modified Taylor series. Compared with the traditional perturbation method, the proposed MIPPM can yield more accurate ranges of the uncertain structural-acoustic field, in which the higher order terms of Neumann series are employed to approximate the interval matrix inverse. The reliability idea is introduced to establish an interval optimization model relying on the satisfaction degree of interval. The uncertain constraints can be transformed into deterministic ones if given the confidence level. The proposed MIPPM is used to predict the intervals of the constraints, and whereby eliminate the optimization nesting. Numerical results about a 3D car are given to demonstrate the feasibility and efficiency of the proposed model and algorithm."}