{"id": "S0168874X13001340", "article": "MAIN-TITLE A robust finite element approach for large deformation elastoplastic plane-strain problems   HIGHLIGHTS          Remeshing is achieved using the enhanced Spring Analogy Method.      State variable remapping is accomplished through the RBF interpolation scheme.      We achieved very large deformation/penetration simulations of plane-strain elastoplastic problems.      Obtained numerical results are in good agreement with limit analysis solutions.          KEYPHRASES   FEM  ALE  Spring analogy method  Radial basis functions  Indentation  Penetration   Large deformation solid mechanics problems are frequently encountered in various fields of engineering, such as annealing, mechanical response of flexible materials (e.g. rubber, biological tissues), and offshore geotechnics. In many cases, analysis of such problems assuming small deformations not only produces inaccurate results but even entirely invalid solutions. Finite element (FE) analyses of large deformation problems often rely on one of the following three approaches: total Lagrangian (TL), updated Lagrangian (UL) and, more recently, arbitrary Lagrangian–Eulerian (ALE). In the TL approach, large deformations are taken into account by employing either the first or the second Piola–Kirchhoff stress tensors along with their work-conjugate strain measures, i.e. the deformation gradient strain tensor or the Green–Lagrange strain tensor, respectively (instead of the Cauchy stress and strain tensors used in small strain analyses). The finite element mesh retains its original undeformed configuration, i.e. the coordinates of the nodes are not updated as the continuum deforms during the analysis [1,2]. In the UL approach, the coordinates of the nodes are updated in each solution increment, while the use of Cauchy stress and strain tensors is combined with a frame indifferent representation of stress rates, such as the Jaumann stress rate.  As the node locations are updated in the UL approach, elements become increasingly distorted. At a certain point in the analysis, the distortion of the elements may become so excessive that severe numerical instabilities are encountered or the FE analysis aborts due to negative element Jacobian. This is particularly true for problems involving plastic deformations. The ALE method was proposed aiming to overcome the aforementioned difficulties rising from element distortion [3–5]. In simple terms, an ALE analysis employing the versatile split-operator technique is executed by performing successive UL increments (Lagrangian step) followed by an Eulerian step. In the Eulerian step, the FE mesh is reconfigured either by moving nodes to positions that render the element distortion minimal, or by generating a completely new mesh (using for example Delaunay triangulation). After remeshing, the values of the state variables (stresses and any internal material variables) at the quadrature points of the new mesh need to be determined based on those at the quadrature points of the old mesh, a procedure that is usually referred to as ‘remapping.’ An Eulerian step may be performed after each UL step or after a certain number of UL steps.  Due to its ability to handle problems involving strongly non-linear materials, the ALE approach has become very popular in recent years, particularly in the field of geotechnical engineering. Among the first to use ALE were van den Berg et al. [6], who simulated cone penetration in a cohesive-frictional material that follows the Drucker–Prager failure criterion. Hu and Randolph [7] developed a version of the ALE method that has been proven particularly robust. The method is called RITSS (remeshing and interpolation technique with small strain) and has been successfully used for the solution of a number of geotechnical problems such as cone penetration in clay [8], penetration of shallow footings, skirted foundations and spudcan foundations in soft cohesive soil [9–12], penetration of full-flow penetrometers (T-bar penetrometer, ball penetrometer) in clay modeled as a strain-softening and rate-dependent Tresca material [13,14]. In RITSS, the Lagrangian step involves conventional small strain computations instead of an UL formulation, while remeshing is accomplished using Delaunay triangulation. Moreover, the RITTS method has also been extended to three-dimensional problems by Yu et al. [15], who analyzed the penetration of circular and square footings in clay.  Susila and Hryciw [16] simulated cone penetration in sand using the ALE approach available in the commercial FE code ABAQUS/Explicit, which solves the equations of motion instead of the equations of static equilibrium. The sand was modeled as a purely frictional elastic–perfectly plastic material obeying the Drucker–Prager failure criterion. The ALE remeshing in ABAQUS is done by relocating the nodes based on various mesh smoothing schemes, thus, preserving the total element number and connectivity between old and new mesh. ABAQUS/Explicit was also used by Kellezi and Stromann [17] and Liyanapathirana [18] for the analysis of spudcan foundations and cone penetration, respectively, in sand (Drucker–Prager failure criterion) and clay (von Mises failure criterion). Nazem et al. [19] and Sheng et al. [20] demonstrated the superior performance and accuracy of the ALE method over TL and UL methods by performing analyses of footings on clay using a Tresca elastic–perfectly plastic model and the more advanced Modified Cam Clay model. Moreover, they simulated cone penetration in cohesive-frictional soil modeled as a Mohr–Coulomb elastic–perfectly plastic material. Unlike RITSS, the ALE approach in [19] uses a remeshing scheme that preserves the total element number and connectivity between old and new mesh. Their remeshing procedure relocates the nodes lying along given boundary segments so that the nodes are properly distanced from each other in the updated mesh. Then, the position of the nodes inside the analysis domain is determined by a linear elastic analysis, in which the boundary node relocation vectors are applied as prescribed displacements.  The effectiveness of various formulations of the Eulerian step of the decoupled ALE approach in the analysis of large deformation elasto-plastic problems has been investigated in a recent comparative study by the authors [21]. Among them, a formulation proposed by the authors demonstrated very promising performance and is therefore further elaborated and presented in detail in the present work. Moreover, this paper explores the effectiveness and robustness of the proposed formulation in accurately simulating deep penetration problems. In this Eulerian step formulation, remeshing is done using the Spring Analogy Method (SAM) of Farhat et al. [22], thus, preserving the total element number and connectivity between old and new mesh. The SAM has been extensively used for remeshing fluid domains in the field of fluid mechanics and particularly aeronautics. The SAM-based remeshing is complemented by a node relocation scheme for the boundary nodes that preserves the computed boundary geometry, while ensuring a good node distribution along the boundary. With respect to remapping of the state variables, this study incorporates the Radial Basis Point Interpolation Functions (RBPIFs) scheme, which is a projection methodology that is frequently used in meshless methods [23]. To our best knowledge, SAM remeshing and RBPIF interpolation have not been used before by others in the context of finite element simulation of large deformation elastoplastic problems in solid mechanics.  The goal of this paper is to make a complete and detailed presentation and evaluation of the aforementioned Eulerian formulation, which has been described only in brief in [21]. In this respect, detailed descriptions are given in Section 2 for the adopted numerical methods and algorithms, as well as any necessary adjustments and modifications to them. An extensive numerical assessment of the performance of the proposed methodology is demonstrated in Section 3 through analysis of two plane-strain boundary value problems: strip footing penetration (at the free surface and pre-embedded) and infinite cylinder lateral push into an elastic–perfectly plastic continuum following the Tresca and the Mohr–Coulomb yield criteria for several combinations of friction angle and dilatancy angle values. The methodology is tested under demanding analysis conditions, seeking to achieve penetrations several times the width of the penetrating body while using fine meshes, as opposed to the coarse meshes employed in the comparative study presented in [21]. Moreover, in this paper, the obtained FE/ALE analysis results are compared with rigorous closed form solutions and limit analysis solutions reported in the technical literature in order to examine the accuracy of the ALE procedure.  The non-linear FE analysis is divided into increments of pseudo-time Δ t and a Lagrangian step is performed for each increment. The UL approach is adopted for the Lagrangian step of the proposed ALE formulation. In the UL formulation, all static and kinematic variables refer to the last calculated (current) geometrical configuration of the deformable body in equilibrium, while all geometrical non-linearity effects due to large displacements, rotations and strains are taken into account. Herein, a brief summary of the UL approach is given.  In the FEM context, the strong form of the static equilibrium for a continuum can be replaced by an equivalent principle of virtual work. Based on variational principles, the virtual work equation for a deformable body of volume   V       t   at the current configuration, bounded by surface   S       t   reads [1]   (1)     ∫      V       t     δ   ϵ   ij      S       t + Δ t    dV =   R       t + Δ t   ,   where δ   ϵ   ij    ( = 1 / 2 ( δ   u   i , j   + δ   u   j , i   + δ   u   k , i   δ   u   k , j   ) ) is the variation of the Green–Lagrange strain tensor and   S   ij      t + Δ t   is the second Piola–Kirchoff stress tensor at time t + Δ t . The corresponding virtual work of external forces is given by  (2)    R       t + Δ t   =    ∫      V       t     δ   u   i      b   i      t + Δ t    dV +    ∫        S       t     T     δ   u   i        t   ¯     i      t + Δ t    dS ,   where   b   i      t + Δ t   ,     t   ¯     i      t + Δ t   are the body forces and prescribed tractions, respectively. In addition, δ   u   i   is an admissible displacement variation that is equal to zero on the part   S   U      t   of the boundary, where Dirichlet boundary conditions are prescribed (   S       t   =   S   U      t   ∪   S   T      t   ) .  In the formulation of the UL approach, the use of a frame indifferent (objective) stress rate is required. There are various types of objective stress rates used in continuum mechanics, being of the general form  (3)  d   σ   ij   ▿   =   C   ijkl    d   ε   kl   = d   σ   ij   − d     σ   ˘     ij   ,   where d   ε   ij    ( = 1 / 2 ( d   u   i , j   + d   u   j , i   ) ) is the Cauchy (infinitesimal) strain tensor increment, C  ijkl is the material stiffness fourth-order tensor related to Cauchy stresses   σ   ij   and ‘ d ( · ) ’ is the differential increment operator. Herein, we adopt the Jaumann stress rate of the Cauchy stress tensor, according to which  (4)  d     σ   ˘     ij   = d   ω   ik      σ   kj   +   σ   il    d   ω   jl   ,   with d   ω   ij   being the incremental form of the spin tensor. According to Nazem et al. [19], an UL formulation method based on the Jaumann objective rate outperforms the other alternatives (e.g. Truesdell objective rate) in terms of robustness and efficiency.  Linearization of virtual work equilibrium Eq. (1), after taking into consideration Eq. (3), gives [24]   (5)     ∫      V       t     δ   ε   ij      C   ijkl      t + Δ t      d ε   kl      t + Δ t    dV +    ∫      V       t     δ   η   ij      σ   ij      t + Δ t    dV +    ∫      V       t     δ   ε   ij      d   σ   ˘     ij      t + Δ t    dV  =   R       t + Δ t   −    ∫      V       t     δ   ε   ij      σ   ij      t + Δ t    dV ,   where δ   ε   ij   = 1 / 2 ( δ   u   i , j   + δ   u   j , i   ) and δ   η   ij   = 1 / 2 δ   u   k , i   δ   u   k , j   .  In order to numerically solve the non-linear equation (5), the Newton–Raphson (N–R) iterative solution scheme is employed by performing iterations in each analysis pseudo-time increment Δ t . Each iteration ‘ κ ’ (=1,2,…) contributes a change to the evaluated displacement field:   u   i   ( κ )     t + Δ t   =   u   i   ( κ − 1 )     t + Δ t   +   d u   i   ( κ )     t + Δ t   . At the beginning of the first iteration ( κ = 1 ) of the current analysis increment,   u   i   ( 0 )     t + Δ t   =   u   i      t   . Hence, Eq. (5) can be written as  (6)     ∫      V       t     δ   ε   ij      C   ijkl   ( κ − 1 )     t + Δ t      d ε   kl   ( κ )     t + Δ t    dV +    ∫      V       t     δ   η   ij      σ   ij   ( κ − 1 )     t + Δ t    dV  +    ∫      V       t     δ   ε   ij      σ   pj   ( κ − 1 )     t + Δ t      d ω   ip   ( κ )     t + Δ t    dV +    ∫      V       t     δ   ε   ij      σ   iq   ( κ − 1 )     t + Δ t      d ω   jq   ( κ )     t + Δ t    dV  =   R       t + Δ t   −    ∫      V       t     δ   ε   ij      σ   ij   ( κ − 1 )     t + Δ t    dV .      Considering a proper FE discretization, where unknown kernel quantities are interpolated via Lagrange polynomial bases, and substituting the element interpolations into Eq. (6), we may derive the following system of linear equations in matrix form, describing nodal force equilibrium:  (7)    K   T   ( κ − 1 )     t + Δ t   ·   d u    ( κ )     t + Δ t   =   R       t + Δ t   −   F    ( κ − 1 )     t + Δ t   .      At the end of the Lagrangian step, the coordinates of the nodes are updated based on the resulting incremental displacements   Δ u       t + Δ t    ( =   ∑   κ     d u    ( κ )     t + Δ t   ) . The global tangent stiffness matrix (tangent operator)   K   T   ( κ − 1 )     t + Δ t   , the external force vector   R       t + Δ t   and the internal force vector   F    ( κ − 1 )     t + Δ t   in Eq. (7) are given below:  (8)    K   T   ( κ − 1 )     t + Δ t   =   ∑   i , j      ∫      V    [ j ]     t       B   L   T     t   ·     C   ¯      ( κ − 1 )     t + Δ t   ·   B   L      t    dV +   ∑   i , j      ∫      V    [ j ]     t        B   NL   T     t   ·     σ   ^      ( κ − 1 )     t + Δ t   ·   B   NL      t    dV +   ∑   i , j      ∫      V    [ j ]     t        B   L   T     t   ·     σ   ˘      ( κ − 1 )     t + Δ t   ·   B   L      t    dV ,      (9)    R       t + Δ t   =   ∑   i , j      ∫      V    [ j ]     t        N       t   ·   b       t + Δ t    dV +   ∑   i , k      ∫      S   T   [ k ]     t       N       t   ·     t   ¯         t + Δ t    dS ,      (10)    F    ( κ − 1 )     t + Δ t   =   ∑   i , j      ∫      V    [ j ]     t       B   L   T     t   ·     σ   ¯      ( κ − 1 )     t + Δ t    dV ,   where     C   ¯      ( κ − 1 )     t + Δ t   is the material tangent stiffness matrix in Voigt form and     B   L   = [       N   , 1   ( i )     0     0     N   , 2   ( i )         N   , 2   ( i )       N   , 1   ( i )       ] ,    B   NL   = [       N   , 1   ( i )     0       N   , 2   ( i )     0     0     N   , 1   ( i )       0     N   , 2   ( i )       ] ,  N = [       N   ( i )     0     0     N   ( i )       ] ,         σ   ¯   = {       σ   11         σ   22         σ   12       } ,  b = {       b   1         b   2       } ,    t   ¯   = {         t   ¯     1           t   ¯     2       } ,         σ   ^   = [       σ   11       σ   12     0   0       σ   12       σ   22     0   0     0   0     σ   11       σ   12       0   0     σ   12       σ   22       ] ,    σ   ˘   = [     −   σ   11       σ   11     −   σ   12         σ   22     −   σ   22     −   σ   12       0   0   − (   σ   11   +   σ   22   ) / 2     ] .      The function   N   ( i )   corresponds to the Lagrange polynomial interpolation function of node “i” in the FE mesh, and   N   , ℓ   ( i )   ≡ ∂   N   ( i )   / ∂   x   ℓ      t   is its space derivative. The summation symbols in Eqs. (8)–(10) denote the assembly process of the above matrices and vectors, which is performed for all elements and nodes of the mesh, with “i” denoting node number, “j” the number of each one of the elements that node “i” belongs to and “k” the element number of elements lying on boundaries where natural boundary conditions are applied. The integrals involved are evaluated numerically using the Gauss–Legendre quadrature rule. The first integral on the left-hand side of Eq. (8) corresponds to the contribution of the material stiffness and the second one is called geometric stiffness, as a result of accounting for finite geometry changes.  The constitutive relations in elastoplastic analysis fulfill the following assumptions:  • The incremental strain tensor is taken as the superposition of elastic and plastic strains: d   ε   ij   = d   ε   ij   e   + d   ε   ij   p   , or equivalently in rate form:     ε   ̇     ij   =     ε   ̇     ij   e   +     ε   ̇     ij   p   .  The continuum obeys a yield criterion expressed by a yield surface equation f=0, which is a function of the Cauchy stress tensor and the internal material variables   κ   i   .  During yielding (the stress state is on the yield surface), it is required that the stress state must remain on the yield surface while plastic deformation occurs. This is also referred in the literature as the consistency condition:   f   ̇   = ( ∂ f / ∂   σ   ij   )     σ   ̇     ij   + ( ∂ f / ∂   κ   l   )     κ   ̇     l   .  The material follows a flow rule, according to which the direction of plastic strains is described by the relation     ε   ̇     ij   p   =   λ   ̇   ( ∂ g / ∂   σ   ij   ) , where   λ   ̇   is the plastic multiplier and g is the plastic potential function. The plastic multiplier takes positive values during yielding and is equal to zero when the material response is elastic (i.e. when the stress state is inside the domain encompassed by the yield surface).  The rates of the internal material variables are related to the plastic multiplier via: ( ∂ f / ∂   κ   i   )     κ   ̇     i   = −   λ   ̇   H , where H is a function of current stress and internal material variable values, called the plastic modulus. Hence, the internal material variable rates are given by     κ   ̇     i   = −   λ   ̇     HA   i   , where   A   i   = ( ∂ f / ∂   κ   i   ) / ( ∂ f / ∂   κ   j   ∂ f / ∂   κ   j   ) .  Based on the above, the Cauchy stress rate for an elastoplastic material is given by  (11)      σ   ̇     ij   =   C   ijkl       ε   ̇     kl   =   C   ijkl   e       ε   ̇     kl   −   λ   ̇     C   ijkl   e     ∂ g   ∂   σ   kl     ,   where the elastic material stiffness 4th-order tensor:  (12)    C   ijkl   e   = [ E ν / ( 1 − 2 ν ) ( 1 + ν ) ]   δ   ij     δ   kl   + [ E / 2 ( 1 + ν ) ] (   δ   ik     δ   jl   +   δ   il     δ   jk   ) .      Inserting Eq. (11) into the consistency equation, one obtains  (13)    λ   ̇   =   ( ∂ f / ∂   σ   ij   )   C   ijkl   e       ε   ̇     kl     ( ∂ f / ∂   σ   mn   )   C   mnpq   e   ( ∂ g / ∂   σ   pq   ) + H   .   As a result, the elastoplastic material stiffness tensor is evaluated as follows:  (14)    C   ijkl   =   C   ijkl   e   −     C   ijmn   e   ( ∂ f / ∂   σ   mn   )   C   klpq   e   ( ∂ g / ∂   σ   pq   )   ( ∂ f / ∂   σ   mn   )   C   mnpq   e   ( ∂ g / ∂   σ   pq   ) + H   .      The elastoplastic stress–strain rate equations (Eq. (11)) are integrated at each quadrature point using a semi-implicit Euler algorithm fitted with adaptive sub-incrementation and error control [25], which is summarized in Algorithm box 1. The scheme relies on an elastic predictor followed by an iterative plastic corrector according to the Cutting Plane Algorithm for returning to the yield surface [26] described in Algorithm box 2. The sub-incrementation and error control formulation is based on relative error estimates following the step-halving approach of Wissmann and Hauck [27] and Sloan and Booker [28], according to which the computations for each sub-increment of pseudo-time Δ t are repeated by dividing it into two sub-increments of Δ t / 2 , in order to get a second and more accurate stress estimate. If the relative error in the stress state is larger than a pre-defined stress error tolerance   TOL   σ   , the sub-increment is repeated after further reducing its size.  The stress integration algorithm starts by entering the current material state (   σ   ⁎   , κ ) at the quadrature point, as well as the strain increment Δ ε corresponding to the current Newton–Raphson iteration step. In the context of large deformation analysis, the integration of the stress–strain rate equations needs to be objective with respect to finite rotations. Herein, stress rate objectivity is achieved according to the Jaumann stress rate by transforming the stress tensor   σ   ij   before entering Algorithm 1 [29] as follows:  (15)    σ   ij   ⁎     t   =   R   ik      σ   kl      t      R   jl   ,   where   σ   ij   ⁎     t   is the rotationally transformed stress tensor that enters the stress–strain integration algorithm and R  ij is the transformation matrix based on the generalized mid-point algorithm [19,30]. Algorithm 1 Stress integration.        enter with   σ   ⁎   , κ , Δ ε ;     t=0; (pseudo-time)       Δ t = 1.0 ; (pseudo-time step)         σ       t ( = 0 )   =   σ   ⁎   ;        κ       t ( = 0 )   = κ ;     while  t < 1.0  do         σ    ( 1 )     t + Δ t   =   σ       t   + Δ t [     C   ˜     e   : Δ ε ] ;   κ    ( 1 )     t + Δ t   =   κ       t   ;     if  f (   σ    ( 1 )     t + Δ t   ) >   TOL   f    then  Algorithm 2 with input   σ    ( 1 )     t + Δ t   ,   κ    ( 1 )     t + Δ t   ;        σ       t + Δ t / 2   =   σ       t   + ( Δ t / 2 ) [     C   ˜     e   : Δ ε ] ;   κ       t + Δ t / 2   =   κ       t   ;     if  f (   σ       t + Δ t / 2   ) >   TOL   f    then Algorithm 2 with input   σ       t + Δ t / 2   ,   κ       t + Δ t / 2   ;        σ    ( 2 )     t + Δ t   =   σ       t + Δ t / 2   + ( Δ t / 2 ) [     C   ˜     e   : Δ ε ] ;   κ    ( 2 )     t + Δ t   =   κ       t + Δ t / 2   ;     if  f (   σ    ( 2 )     t + Δ t   ) >   TOL   f    then Algorithm 2 with input   σ    ( 2 )     t + Δ t   ,   κ    ( 2 )     t + Δ t   ;        R   err   = ∥   σ    ( 2 )     t + Δ t   −   σ    ( 1 )     t + Δ t     ∥   L 2   / ∥   σ    ( 2 )     t + Δ t     ∥   L 2   ;     if    R   err   >   TOL   σ    then        Δ   t   ¯   = Δ t × min ( 0.8 ,   TOL   σ   /   R   err   ) ;      if  Δ   t   ¯   < Δ   t   MIN    then  Δ   t   ¯   = Δ   t   MIN   ;      if  t + Δ   t   ¯   > 1.0  then  Δ t = 1.0 − t ; else  Δ t = Δ   t   ¯   ;     else        Δ   t   ¯   = Δ t × max ( 1.1 ,   TOL   σ   /   R   err   ) ;      if  Δ   t   ¯   < Δ   t   MIN    then  Δ   t   ¯   = Δ   t   MIN   ;      if  t + Δ   t   ¯   > 1.0  then  Δ t = 1.0 − t ; else  Δ t = Δ   t   ¯   ;         σ       t   =   σ    ( 2 )     t + Δ t   ;         κ       t   =   κ    ( 2 )     t + Δ t   ;       t = t + Δ t ;     end if     end while     return with   σ       t ( = 1 )   ,   κ       t ( = 1 )   ;        Cutting-plane return to the yield surface.       enter with σ , κ ;    while  f ( σ ) >   TOL   f    do       a = ∂ f ( σ ) / ∂ σ ;      b = ∂ g ( σ ) / ∂ σ ;      δ λ = f ( σ ) / [ a :     C   ˜     e   : b + H ] ;      σ = σ − δ λ     C   ˜     e   : b ;      κ = κ − δ λ H A ;    end while     return with σ , κ ;        The stress tolerance   TOL   σ   usually takes values within the range 10−5–10−2 [28]. In the present FE simulations,   TOL   σ   is set equal to 10−3 because it was observed that using a value of 10−4 in Algorithm 1 resulted in significantly increased runtimes, aggravating the already high computational cost of large deformation analysis without improving significantly the results. On the other hand, the yield surface error tolerance TOL  f in Algorithm 2 was found to have a little influence on the computational cost; hence, a stringent value of 10−9 is used herein. The minimum pseudo-time step Δ   t   MIN   is set equal to 10−3, meaning that maximum one thousand sub-increments can be performed within the single integration increment of the stress rate equations. Finally, it should be noted that, in the present study, the N–R iterative procedure for the solution of Eq. (7) employs a tangent operator (Eq. (8)) formed using the elastoplastic material stiffness 4th-order tensor (Eq. (14)) evaluated at the start of each N–R iterative procedure, corresponding to a continuum tangent operator (as opposed to an algorithmically consistent tangent operator [31]).  In large deformation analyses in geomechanics, it is observed that, using the UL approach alone, the mesh progressively develops severe distortion as the applied loading increases with time, thus, leading to numerical instabilities and accuracy degradation [7,19]. In order to tackle this problem and preserve the quality of the mesh in the deformed domain during the analysis, two main remeshing strategies have been proposed in the literature, as mentioned in the Introduction: (1) relocation of the nodes of the distorted mesh and (2) replacement of the distorted mesh with a completely new mesh. Herein, the former approach is adopted, which preserves element number and connectivity.  The present computational methodology involves remeshing at the end of each Lagrangian step, right after the updating of the nodal coordinates by adding the incremental displacement solution vector evaluated by Eq. (7). As in [19,32], the remeshing procedure consists of two steps: first relocating the boundary nodes and then relocating the domain nodes.  The boundary node relocation targets in redistributing the nodes along the boundary without altering its current geometry, i.e. the geometry resulting from the computations of the last Lagrangian step. This is particularly important for free boundaries that during the course of the analysis take random curved shapes. During a large deformation simulation, the distances between certain nodes along the boundary may decrease excessively, while – in other parts of the boundary – nodes may be too distant from each other. Such sharp non-uniformities in the node distribution along the boundary could reduce the efficiency of the following domain node relocation scheme in producing a mesh of adequate quality. Hence, the goal of boundary node relocation is to preserve a smooth gradation of the node location along a boundary curve by enforcing the boundary node “i” of a boundary curve to lie at a desired distance   δ   i   along the boundary (see Fig. 1 (a)). The distance   δ   i   is measured from one of the end-points of the boundary (“starting” boundary point), which are either corners of the discretized domain or points of application of external loading and, as such, cannot be relocated. This distance can be expressed as a fraction   α   i   of the current total length of the boundary curve δ (i.e.   α   i   =   δ   i   / δ ). The proposed relocation method is formulated and described herein for the case of quadratic elements, which are often used in elastoplastic FE simulations.  Following Nazem et al. [32], the geometry of the curved boundary is defined by a string of quadratic segments, corresponding to the edges of quadratic finite elements lying along the boundary. Let us assume a curved boundary formed by the edges of N/2 quadratic elements, i.e. by a string of three-node quadratic segments with length   S   m    ( m = 1 , 2 , … , N / 2 ) . On this boundary lie N+1 nodes numbered i=0,1,…,N, as shown in Fig. 1. Given that a quadratic finite element provides optimal accuracy when non-vertex nodes (i.e. the intermediate nodes of serendipity elements) lay at the middle of the corresponding element edge, only vertex nodes need to be relocated based on desired   α   i   values; the non-vertex nodes should be repositioned at equal curvilinear distances from the neighboring vertex nodes.  The simplest relocation approach for the vertex nodes ( i = 2 , 4 , … , N − 2 ) is to force   α   i   to be always equal to its initial value   α   i   ( 0 )   (i.e. the one evaluated at the beginning of the simulation), as done in [21]. However, boundaries that carry external loading tend to increase in length during the course of an analysis and, as a consequence, use of constant   α   i   results in ever increasing distances between boundary nodes. In many problems, the presence of small size elements in the vicinity of applied loading is crucial in achieving good numerical accuracy. In this paper, we improve the formulation presented in [21] by using an approach where   α   i   is re-evaluated continuously during the analysis so that a small element edge size is preserved near loaded regions, aiming at retaining good numerical accuracy during the entire analysis. Following this line, the ratio   α   i   ( k )   of the current (k-th) analysis increment is evaluated by  (16)    α   i   ( k )   =   α   i   ( 0 )    [  i / 2 − 1 + ( N − i / 2 )     δ   ( 0 )       δ   ( k )      ]  / ( N − 1 ) ,   where   δ   ( k )   and   δ   ( 0 )   are the current and the initial total length of the boundary, respectively. This equation preserves the length of the first element edge (i.e.   δ   1   ( k )   =   δ   1   ( 0 )   ) throughout the analysis, while   α   N   ( k )   =   α   N   ( 0 )   for the last (N-th) node. Hence, the numbering of the nodes along the boundary must start from the region where the mesh must remain fine (e.g. edge of a loaded region of the boundary or a region of stress concentration).  After determining   α   i   ( k )   , the desired distance of the vertex nodes from the “starting” point of the boundary is determined as   δ   i   ( k )   =   α   i   ( k )     δ   ( k )   . Non-vertex nodes ( i = 1 , 3 , … , N − 1 ) are forced to lie halfway its neighboring vertex nodes using   δ   i   ( k )   = (   δ   i − 1   ( k )   +   δ   i + 1   ( k )   ) / 2 .  Having evaluated the desired   δ   i   ( k )   , the new node position is determined by, first, finding which before-relocation boundary segment this point lies on and, then, evaluating the corresponding local coordinate ξ (where ξ ∈ [ − 1 , + 1 ] , see Fig. 1(a)). The length of a part of the curved segment S  m defined by two arbitrary points s and e lying within the segment can be evaluated from the following integral:  (17)    I   m   =   ∫     x   s       x   e     dS =   ∫     ξ   s       ξ   e     J  d ξ ,   where J is the Jacobian determinant and   ξ   s   ,   ξ   e   are the local coordinates of points   x   s   and   x   e   , respectively. The Jacobian determinant J is given by  (18)  J =     [    ∑   i = 0   2     x   ( i )   ( d   Φ   ( i )   / d ξ )  ]   2   +   [    ∑   i = 0   2     y   ( i )   ( d   Φ   ( i )   / d ξ )  ]   2     ,   where   x   ( i )   ,   y   ( i )    ( i = 0 , 1 , 2 ) are the global coordinates of the three nodes of the quadratic segment and   Φ   ( i )   are the corresponding 2nd-order Lagrange polynomials of the three-node line element shape functions. After algebraic manipulations, one can derive the following expression for the analytical evaluation of the integral of Eq. (17):  (19)    I   m   =   ∫     ξ   s       ξ   e       C   ξ   2   + D ξ + E    d ξ =   c   0   [ f (   ξ   e   ) g (   ξ   e   ) +   c   1    log ( f (   ξ   e   ) + g (   ξ   e   ) ) − f (   ξ   s   ) g (   ξ   s   ) −   c   1    log ( f (   ξ   s   ) + g (   ξ   s   ) ) ] ,   where   c   0   = 1 / 8   C   − 3 / 2   ,   c   1   = 4 CE −   D   2   , f ( ξ ) = 2   C ( C   ξ   2   + D ξ + E )   , g ( ξ ) = 2 C ξ + D , C =   B   1   2   +   B   2   2   , D = 2 (   A   1     B   1   +   A   2     B   2   ) , E =   A   1   2   +   A   2   2   ,   A   1   = 1 / 2 (   x   ( 2 )   −   x   ( 0 )   ) ,   A   2   = 1 / 2 (   y   ( 2 )   −   y   ( 0 )   ) ,   B   1   =   x   ( 2 )   +   x   ( 0 )   − 2   x   ( 1 )   ,   B   2   =   y   ( 2 )   +   y   ( 0 )   − 2   y   ( 1 )   .  Setting   ξ   s   = − 1 and   ξ   e   =+ 1 in Eq. (19), the current (before relocation) length of the segments S  m and the total curved boundary length   δ   ( k )   can be evaluated. Then, in order to find the   ξ   e   - value corresponding to the new (relocated) position of each node, we rely on the fact that each   δ   i   ( k )     ( =   δ   i − 1   ( k )   +   I   m   ( k )   ) is known and equal to   α   i   ( k )     δ   ( k )   . Hence, the unknown   ξ   e   is calculated using a root finding algorithm (such as the well-known Newton or secant methods) for the numerical solution of the non-linear equation (19), with   ξ   s   = − 1 . Because the segment that the relocated node lies on is not known a priori, the search for   ξ   e   starts from the segment of the boundary that the previous relocated node “ i − 1 ” lies. If the solver cannot find a root within [-1,1], then this node is not located in this segment and, thus, the computations are repeated for the next segment of the boundary, and so on, until an acceptable solution is found. It can be seen that the proposed formulation relies on local coordinates of isoparametric instead of the global cartesian coordinates. Using the local coordinates has the advantage that there is no need for any special treatment (e.g. [32]) in case, for a given segment, the horizontal global coordinate of a non-vertex node is either very close to that of a vertex node or outside the range of the corresponding coordinates of the two vertex nodes. Once the value of the local coordinate   ξ   e   is determined, the global coordinates of the relocated node can be computed via standard Lagrange polynomials interpolation. Finally, the virtual displacement vector Δ   u   rel   of each vertex node of the boundary due to its relocation is calculated and stored in memory by subtracting the before and after relocation position vectors. This virtual displacement is used subsequently in the remeshing algorithm for the relocation of the domain nodes.  The aspect ratio and the skewness of the finite elements tends to increase during the course of an elastoplastic deformation analysis, especially in regions of high shear strain concentration, such as shear bands. An ideal remeshing scheme would render triangular elements to equilateral triangles and quadrilateral elements to squares, thus, achieving maximum numerical accuracy. However, this is not practically possible and the purpose of the domain node relocation is to reduce the distortion and improve the geometric characteristics of the elements to the extent possible.  The second step of the remeshing procedure involves the relocation of the domain nodes using the Spring Analogy Method (SAM) enhanced with torsional springs that was proposed by Farhat et al. [22]. The enhanced SAM overcomes the problem of node-to-element interpenetration that the original SAM (which employs only linear springs) suffers from. This is a method that has been used successfully in computational fluid mechanics and in coupled problems (e.g. fluid–solid interaction) for remeshing fluid domains (e.g. [33–35]). The enhanced SAM in [22] assumes a network of fictitious linear and torsional springs that resembles a linear elastic pseudo-structure. Due to superposition, the stiffness matrix   K   S   of the pseudo-structure is taken as the sum of the corresponding stiffnesses of the linear and torsional springs, i.e.   K   S   =   K   LS   +   K   TS   . Assume a planar three-node element having counterclockwise node numbering. According to SAM, the planar element is substituted by linear springs placed along each element edge, while a torsional spring is attached at each vertex (see Fig. 2 (a)). The stiffness contribution of the linear springs is given by  (20)    K   LS   = [       K   ℓ   ( 01 )   +   K   ℓ   ( 20 )     −   K   ℓ   ( 01 )     −   K   ℓ   ( 20 )       −   K   ℓ   ( 01 )       K   ℓ   ( 01 )   +   K   ℓ   ( 12 )     −   K   ℓ   ( 12 )       −   K   ℓ   ( 20 )     −   K   ℓ   ( 12 )        K   ℓ   ( 12 )   +   K   ℓ   ( 20 )       ] ,   with each submatrix being defined as  (21)    K   ℓ   ( ij )   =  [     cos    θ   i   2     sin  2   θ   i   / 2     sin  2   θ   i   / 2   sin    θ   i   2       ]  /   ℓ   ij   ,   where   ℓ   ij   =     (   x   j   −   x   i   )   2   +   (   y   j   −   y   i   )   2     is the distance between nodes “i” (x  i ,y  i ) and “j” (x  j ,y  j ) and   θ   i   is the angle of the corresponding edge of vertex node “i” with the horizontal, as shown in Fig. 2(a). The corresponding stiffness contribution of the torsional springs is given by  (22)    K   TS   =   R   T   · [       C   0     0   0     0     C   1     0     0   0     C   2       ] · R ,   where   C   0   =   (   ℓ   01     ℓ   20   / 2 A )   2   ,   C   1   =   (   ℓ   12     ℓ   01   / 2 A )   2   ,   C   2   =   (   ℓ   20     ℓ   12   / 2 A )   2   are the stiffness coefficients of the torsional springs at nodes (0), (1), (2), respectively, and A is the triangular element area. The transformation matrix R is given by the following relationship:  (23)  R = [       β   02   −   β   01       α   01   −   α   02       β   01     −   α   01     −   β   02       α   02       −   β   10       α   10       β   10   −   β   12       α   12   −   α   10       β   12     −   α   12         β   20     −   α   20     −   β   21       α   21       β   21   −   β   20       α   20   −   α   21       ] ,   where   α   ij   = (   x   i   −   x   j   ) /   ℓ   ij   2   and   β   ij   = (   y   i   −   y   j   ) /   ℓ   ij   2   . For the derivation of the analytical expressions of the stiffness matrices of the fictitious springs, the reader is referred to [22].  After assembling the contributions from all triangles and, thus, determining the global stiffness matrix of the pseudo-structure, the new positions of the domain (inner) nodes is determined by simply solving the static equilibrium problem of the pseudo-structure. The incremental displacement of the boundary nodes resulting from the calculations of the Lagrangian step ( Δ u ) is superimposed to the motion of the nodes due to the boundary node relocation ( Δ   u   rel   ) . Then, the resultant motion is applied as prescribed displacement at the boundary of the elastic pseudo-structure, while the domain nodes are free. The nodal displacements resulting from the solution of the system of equations constitute the relocation displacement vectors for the domain nodes. It should be pointed that the present implementation of SAM uses incremental displacements and the deformed (current) geometry of the continuum instead of the total displacements and the undeformed (initial) geometry usually assumed in SAM [22,34]. This was done because, despite using the enhanced SAM with torsional springs, the problem of node-to-element interpenetration was still observed in simulations involving very deep penetrations when a total displacement – initial geometry approach is considered.  The SAM algorithm proposed by Farhat et al. [22] was designed for two-dimensional unstructured meshes that comprise 3-node triangular elements. However, in the present work, the FE mesh consists of second-order elements, namely 6-node triangular and 8-node quadrilateral elements, since they demonstrate superior performance compared to first-order ones. Application of the SAM to the case of quadratic elements requires these elements to be broken up to 3-node triangles. The breakup could be formed following two different strategies:  (i) Assume that each quadratic element comprises several nested 3-node triangular elements, i.e. a 6-node triangle of four 3-node triangles and an 8-node quadrilateral of six 3-node triangles.  (ii) Assume that each quadratic element is a first-order element by disregarding the element non-vertex nodes and, in the case of the 8-node quadrilateral, further split in two triangles, as shown in Fig. 2(b). After relocation of the vertex nodes using SAM, the non-vertex nodes are forced to lie in the middle of the element edges, which are assumed to be straight lines (except for edges belonging to curved boundaries).  The latter approach is chosen for this paper since, as revealed by trial simulations, this approach is superior to the former one for two reasons. First, neglecting the non-vertex nodes results in a pseudo-structure with fewer degrees of freedom and, thus, to a smaller computational cost. Furthermore, quadratic elements exhibit highest accuracy when their edges are straight with the non-vertex nodes being at their middle.  A quadrilateral element can be split in two triangular elements in two ways, each corresponding to one of the two diagonals. Herein, no special rule is followed regarding which diagonal to choose; it is done based on the sequence of the numbering of the nodes of the element. A more objective approach in forming a pseudo-structure from a mesh composed of quadrilateral finite elements is to split the elements in both ways, resulting in two separate pseudo-structures and, then, taking the average of the corresponding global stiffness matrices. However, we did not observe any improvement by implementing this approach.  After remeshing, the quadrature points of the “new” mesh have different Cartesian coordinates from those of the “old” mesh. Hence, the values of the state variables (e.g. stress and internal material variables) at the new quadrature points have to be determined based on the values at the old quadrature points. To this end, we have implemented the Radial Basis Point Interpolation Functions (RBPIFs) scheme [36,37] for the remapping of the state variables. This is a methodology that has been used successfully in the past in meshless methods [23,38–41] for interpolating unknown field variables.  Assume an arbitrary distribution of n points   r   ( j )   =   {   x   ( j )   ,   y   ( j )   }   T   (j=1,2,…,n; e.g. the quadrature points of the “old” mesh) in two-dimensional space, where the value of the field variable v is known. The RBPIF scheme interpolates between the known values to estimate the unknown field variable value at a point s =   {   x   s   ,   y   s   }   T   (e.g.a quadrature point in the “new” mesh) using both a polynomial basis function p and a radial basis function b:  (24)  v ( s ) = p ( s ) · a ( s ) + b ( s ) · c ( s ) ,   where a and c are unknown coefficient vectors of size m and n, respectively. The components of vector p are monomials built by the Pascal triangle and defined as  (25a)  p ( y ) =   { 1    x   s      y   s   }   T    for  m = 3 ,      (25b)  p ( y ) =   { 1    x   s      y   s      x   s     y   s   }   T    for  m = 4 ,   corresponding to linear and bi-linear polynomial basis, respectively.  In order to guarantee uniqueness on the achieved interpolation, the following equation must be satisfied:  (26)  p ( s ) · c ( s ) = 0 .   The unknown coefficients a and c in Eq. (24) are determined by enforcing the interpolation to pass through all n points where the field value v is known. Thus, Eqs. (24) and (26) can be combined as  (27)  [     B   P       P   T     0     ] · {     c     a     } = {     v     0     } ⇔ G · {     c     a     } = {     v     0     } ,   where v =   {   v   ( 1 )   …   v   ( n )   }   T   is a vector of the known field quantities   v   ( l )   , while matrices B and P have the form   B = [       b   1   (   r   ( 1 )   )     b   2   (   r   ( 1 )   )   …     b   n   (   r   ( 1 )   )       b   1   (   r   ( 2 )   )     b   2   (   r   ( 2 )   )   …     b   n   (   r   ( 2 )   )     ⋮   ⋮    ⋮       b   1   (   r   ( n )   )     b   2   (   r   ( n )   )   …     b   n   (   r   ( n )   )     ] ,  P = [ p (   r   ( 1 )   )  …  p (   r   ( n )   ) ] .      In the present work, the following multiquadrics radial basis function is used:  (28)    b   i   (   r   ( j )   ) =   (   d   i   2   +   R   2   )   0.5   ,   where d  i is the Euclidean distance between points   r   ( i )   and   r   ( j )   , and R is a shape parameter equal to the minimum distance between the pairs of points: ( s ,   r   ( 1 )   ) , … , ( s ,   r   ( n )   )  [40].  Determining a and c via Eq. (27) and considering the radial basis function of Eq. (28), the interpolation scheme represented by Eq. (24) can be written as  (29)  v ( s ) = {   b   T   ( s )    p   T   ( s ) } ·   G   − 1   ( s ,   r   ( j )   ) · {     v     0     } =   ∑   j = 1   n   ϑ ( s ,   r   ( j )   ) v (   r   ( j )   ) ,   where the interpolation functions are defined by  (30)  ϑ ( s ,   r   ( j )   ) =   ∑   i = 1   n     b   i   ( s )   G   ij   − 1   ( s ,   r   ( i )   ) +   ∑   ℓ = 1   m     p   ℓ   ( s )   G   ( n + ℓ ) j   − 1   ( s ,   r   ( ℓ )   ) .   In the proposed formulation, the n points are the quadrature points of the element of the “old” mesh that the new quadrature point lies in. Since fine incrementation is required for an elastoplastic deformation analysis to be accurate (displacement increments are small compared to the element size), this element is expected to be the same element as in the new mesh (same element number and connectivity), with the difference that its position and geometry have slightly changed. In this study, 6-node and 8-node plane-strain elements are considered for the FE grid, having three and four quadrature points, respectively (i.e. reduced integration). Linear polynomial basis is considered for the triangular elements, while bi-linear is used for the quadrilateral elements. This is reminiscent of the polynomial interpolation of the Unique Element Method employed by Hu and Randolph [7]. Nonetheless, combining the polynomial basis functions with radial basis functions results in a smoother interpolation that puts more weight on the old quadrature points closest to the new quadrature point. This allows for more reliable interpolations that are free of unwanted oscillations in the load–displacement response of the analyzed mechanical system, as shown in the following section.  Two representative plane-strain problems are investigated within this section, in order to assess the efficiency, robustness and accuracy of the proposed FE procedure to simulate large deformation analysis problems in geomechanics. For the purposes of the development of the proposed ALE formulation, a FE program was coded in C++ based on the available open-source numerical libraries libMesh [42], PETSc [43], ParMETIS [44] and MPICH2.  The first example considers a rough rigid strip footing (punch indentation problem) penetrating in elastoplastic soil, which is assumed to be weightless (no gravitational forces are applied to the FE model). Analyses were performed for a footing starting from the free surface (Fig. 3 (a)) and for a footing pre-embedded at certain depth D below the free surface (Fig. 3(b)). In the latter case, the vertical walls of the trench where the footing is placed are unsupported. Due to symmetry, only the right half of the problem geometry is considered and proper boundary conditions are applied to the symmetry plane. The footing half width B is taken equal to 0.5m, while the rest of the dimensions of the analyzed domain and the boundary conditions applied are depicted in Fig. 3 as a function of B. The footing has infinitesimal thickness and, consequently, the walls of the “trench” generated during penetration are free and do not interact with the footing.  The soil is assumed to behave as an elastic–perfectly plastic continuum, following either the Tresca yield criterion  (31)  f =     J   2      cos  θ − c = 0 ,   or the Mohr–Coulomb (M–C) yield criterion  (32)  f =     J   2     ( cos  θ − 1 /   3    sin  θ  sin  ϕ ) + (   I   1   / 3 )  sin  ϕ − c  cos  ϕ = 0 ,   where J 2 is the second invariant of the deviatoric Cauchy stress tensor, I 1 is the first invariant of the Cauchy stress tensor, θ is the Lode's theta, while c and ϕ are the strength parameters called cohesion and friction angle, respectively. In order to avoid numerical difficulties due to gradient singularities, the corners of the yield surfaces described by Eqs. (31) and (32) in the deviatoric plane are rounded according to Sloan and Booker [45]. With respect to the plastic potential function, an associated flow rule (f=g) is assumed in the case of a Tresca material. For a material following the M–C failure criterion, the plastic potential surface has the following form:  (33)  g =     J   2     ( cos  θ − 1 /   3    sin  θ  sin  ψ ) + (   I   1   / 3 )  sin  ψ − c  cos  ψ = 0 ,   where ψ is a material parameter called dilatancy angle. For ψ = ϕ , Eq. (33) becomes identical to Eq. (32) and, thus, the material follows an associated flow rule.   Fig. 4 shows the FE meshes for the analyses of footing penetration, consisting of 6-node triangular elements. Along the footing-soil contact, ten elements are placed, with their size decreasing towards the edge of the footing. The FE grids were constructed with the aid of the open-source mesh generator Gmsh [46]. All simulations were carried out up to final penetration of 10m (20B) by applying a prescribed vertical displacement increment at the nodes corresponding to the footing-soil contact of the order of 0.0005B. To simulate a perfectly rough footing–soil interface, the horizontal displacement of these nodes is fixed to zero.  Three different simulations of penetration in a Tresca material were performed: an analysis of a footing starting its penetration from the free surface (surface footing) and two analyses of pre-embedded footing with ratios of initial embedment D to the footing half-width B equal to 10 and 14, respectively. The material parameters used for these analyses are shear modulus μ = 10  MPa , Poisson's ratio ν = 0.499 (i.e. nearly incompressible material), and cohesion c=100kPa ( μ / c = 100 ) . Fig. 5 shows the normalized vertical reaction R at the footing base (across half-width) as a function of the normalized penetration from large deformation analyses, as well as from the corresponding conventional small-deformation analyses. The resulting load–displacement curves are smooth and free of unwanted oscillations, indicating the numerical stability of the proposed combination of remeshing and remapping schemes.  As expected, the small deformation analysis of the surface footing reaches a well-defined limit load (where the curve becomes horizontal) with only 0.4B of vertical footing displacement w. The value of the limit load R  lim is 5.42cB, which is approximately 5% larger than the exact analytical solution of ( π + 2 ) cB = 5.14 cB obtained by Prandtl [47] using the method of characteristics. A better numerical accuracy could have been achieved simply by further increasing the mesh density. Up to this stage, the large deformation analysis curve follows closely that of the small deformation analysis. However, beyond this point, the large deformation analysis exhibits a continuous increase in the reaction load R. This is a result of the increase of the penetration depth and the built-up of embedment, a fact that is ignored in the small deformation analysis.   Fig. 5 also plots the results from the recently proposed incremental limit analysis method by da Silva et al. [48], which accounts for large deformations. da Silva et al. [48] analyzed the problem of footing penetration from the free surface assuming a rigid-perfectly plastic continuum obeying the Tresca yield criterion. It can be observed that the curve of the present ALE analysis follows closely the limit analysis curve, especially at large penetration depths. The difference between the two curves may be attributed to the numerical errors of the ALE simulation and to the fact that the ALE simulation takes into account the elastic deformation of the continuum, while the limit analysis computations assume a rigid-perfectly plastic solid.  As the footing penetrates deeper into the soil, the material mass lying above the current footing base level increases. Up to approximately 13B of penetration, this leads to a progressive enlargement of the failure mechanism, as depicted by the contours of incremental displacement magnitude shown in Fig. 6 . At w ≈ 13 B , the failure mechanism changes from the classical bearing capacity mechanism extending up to the free surface [47] to a local mechanism that emerges at the side walls of the trench generated by the penetrating footing, as seen in Fig. 6(d). This local mechanism is similar (but not identical) to the deep bearing capacity mechanism considered by Meyerhof [49]. The limit load value for this local mechanism is equal to ( 2 π + 2 ) cB = 8.28 cB based on the method of characteristics [49]. The curves from both ALE and incremental limit analysis cross the ( 2 π + 2 ) cB limit load value by Meyerhof. This is because the Meyerhof analysis assumes a vertical trench wall. On the contrary, in both ALE/FE analysis and incremental limit analysis, the geometry of the free boundary changes continuously as a result of the penetration and, consequently, the trench wall exhibits a slight bulge that progressively increases (but with decreasing rate). Despite the increasing deformation of the trench wall, both ALE and limit analysis curves tend towards a limiting (steady state) value of approximately 9.2cB (see Fig. 5).  As expected, the analyses with pre-embedded footing require less footing penetration w for developing the local failure mechanism, as seen in Fig. 7 for a footing with initial embedment equal to 10B=5m. Consequently, the curving of both the trench wall and the top free surface is smaller in these analyses than in the surface footing penetration analysis. As a result, the load–displacement curves of ALE finite element analyses, as well as of small deformation analysis, approach a limiting reaction value very close to the Meyerhof solution [49]. For example, the difference for the ALE analysis with initial embedment depth 5m is of the order of 4%, while the corresponding value from the small deformation analysis is 1.5%.  Simulations of footing penetration starting from the free surface were also conducted for the case of a continuum obeying the M–C failure criterion, assuming the following material parameters: shear modulus μ = 10  MPa , Poisson's ratio ν = 0.3 , cohesion c=20kPa. Two sets of analyses were performed, one for ϕ = 30 ° and one for ϕ = 40 ° , with the dilatancy angle varying from ψ = ϕ to ψ = 0 in each set. Figs. 8 and 9  show the normalized vertical reaction R at the footing base (across half-width) as a function of the normalized penetration from analyses with ϕ = 30 ° and 40°, respectively. From the FE results, it is evident that the penetration resistance decreases with decreasing ψ , a fact that is consistent with the observation from bearing capacity analyses assuming small deformations [50]. From Figs. 10 and 11  , it is evident that the failure mechanism extends in a much smaller region for the case of ψ = 10 ° , ϕ = 30 ° than for the case of associated flow rule. It is also interesting to note that, unlike the simulations of penetration in Tresca material, the failure mechanism is always of bearing capacity type and no local mechanism develops during the course of the analysis.  The load–displacement response from the analyses with and a non-associated flow rule ( ψ < ϕ ) exhibits significant numerical oscillations. These become more intense as ψ decreases. However, this is expected, since similar FE analyses of bearing capacity problems assuming small deformations also show intense oscillations in the load–displacement curves [50]. The oscillations observed in analyses with ψ < ϕ (Fig. 8) are due to the apparent softening exhibited inside the shear bands forming the collapse mechanism, despite ϕ being always constant. This is because a M–C material with non-associated flow rule ceases to obey Drucker's stability postulate [51]. The analysis with ϕ = 30 ° and an associated flow rule ( ψ = ϕ ) exhibits the largest penetration resistance and a smooth load–displacement response with only mild oscillations, which are more visible towards the final stage of the simulation (w=15B–20B). In addition, the oscillations are more intense in the case of ϕ = 40 ° and an associated flow rule (Fig. 9). However, small deformation bearing capacity analyses with associated flow rule [50] are completely free of numerical oscillations. Hence, the oscillations observed in the ALE analyses with ψ = ϕ are a consequence of the successive remeshing and remapping steps. This fact combined with the absence of numerical oscillations in the previously presented Tresca ALE analyses implies that the proposed Eulerian approach is slightly less efficient in the case of a material with a pressure-dependent strength, such as M–C.  The target penetration depth of 20B was achieved in all simulations, except those with ϕ = 40 ° and ψ = 30 ° , 40°, which terminated prematurely at 10B and 4.5B, respectively, due to non-convergence of the Newton–Raphson iterative procedure. The reason for the failure of the simulations to proceed further was predominantly due to unrealistically intense heave of the free surface due to the high material dilatancy causing significant element distortion and skewness. This hinders the remapping algorithm from effectively interpolating the stress field, thus, giving rise to numerical errors that build up and result in the failure of the Newton–Raphson solution scheme. However, this does not limit the applicability of the proposed formulation regarding the simulation of practical problems. This is because it is well established that real soils exhibit a highly non-associative flow rule, since their dilatancy angle is much smaller than the corresponding friction angle [50], and dilation angles larger than 25° are highly unrealistic. The ALE analyses with small (realistic) dilatancy angle values have no trouble reaching the target penetration depth, despite the intense shear banding and localization that develops inside the continuum mass. This demonstrates the robustness of the proposed remapping scheme in interpolating the stress field despite the intense stress gradients across the shear bands.  The second example concerns an infinite cylindrical inclusion pushed laterally (i.e. perpendicular to its axis) inside an elastoplastic continuum following the Tresca yield criterion. The geometry and boundary conditions of this plane-strain problem are shown in Fig. 12 (a). The cylinder has diameter D=1m and is assumed to be perfectly rigid. Throughout the boundary of the continuum both degrees of freedom are fixed, except along the left boundary (plane of symmetry) where only the horizontal degree of freedom is restrained. The movement of the inclusion is simulated by applying prescribed downward displacement at the nodes lying on the inclusion perimeter. The other degree of freedom at these nodes is fixed in order to simulate fully rough, fully bonded interface conditions at the inclusion perimeter. The mesh consists of 8-node quadrilateral and 6-node triangular elements (Fig. 12(b)). The cohesion c is set equal to 100kPa and the Poisson's ratio ν is set equal to 0.499. Analyses are performed for two different values of the ratio μ / c , namely 100 and 1000.  This specific problem is not truly a large deformation problem. This is because the geometry of the boundaries, both outer and inner, does not change during the course of the analysis (this would not have been the case if the material was allowed to debond and slip at the inclusion perimeter). As a result, the inclusion and the surrounding continuum reach early on a steady state, which is maintained indefinitely provided that the outer boundaries are placed sufficiently far from the inclusion so that they do not interact with it. The purpose of considering this problem in the present paper is to assess the performance of the remapping scheme. A well performing ALE procedure is expected not to accumulate numerical errors due to the remapping step.  There is a rigorous analytical solution for the problem at hand. Using the method of characteristics, Randolph and Houlsby [52] determined that the limit (steady state) load is equal to 11.94cD. Fig. 13 shows the load–displacement curves resulting from the large deformation FE analyses for the two μ / c ratios considered. It can be seen that both analyses reach the same limit load, which remains constant until their termination at displacement w=1D and is 5.8% higher than the exact limit load value of 11.94cD. Furthermore, Fig. 14 presents the contour plots of the incremental maximum shear strain   γ   max   resulting from the ALE analyses, revealing the geometry of the failure mechanism. The mechanism, which has the form of a circular lobe, is in full agreement with the mechanism predicted by the method of characteristics. In Fig. 14, it can also be seen that the remeshing scheme based on SAM manages to preserve almost perfectly the initial undistorted shape of the elements in the vicinity of the inclusion throughout the analysis. It can be observed that, unlike the footing penetration simulations, the shape and size of the failure mechanism remains constant throughout the analysis. This is indicative of the fact that the problem as formulated does not warrant a large deformation methodology. Yet, the fact that the limit load and failure mechanism geometry remains constant demonstrates the robustness of the Eulerian step of the proposed ALE formulation. Should the successive Eulerian steps generated significant numerical errors due to the remapping procedure, the limit load would not have remained constant. Moreover, there would potentially be differences in the load–displacement response between the ALE analyses with different material stiffnesses. This is because any inaccuracies due to the projection of the stress state from the old to the new mesh would have been larger in the analysis with the soft material ( μ / c = 100 ) than with the stiff one ( μ / c = 1000 ) , since the mesh deformation before full development of the failure mechanism is more pronounced in the former case.   CONCLUSIONS   A formulation for the Eulerian step of the decoupled Arbitrary Lagrangian–Eulerian approach has been presented for the analysis of planar elastoplastic large deformation problems. In this formulation, remeshing is accomplished by relocating the nodes of the distorted mesh using the enhanced Spring Analogy Method [22]. This method has been modified so that it can be applied to meshes consisting of second order quadrilateral elements. To increase the efficiency of SAM, a boundary node relocation scheme is employed, which ensures an adequately dense node distribution along the boundary in regions of load application or strain concentration. The remapping (projection) of the state variables from the quadrature points of the old mesh (before relocation) to those of the new mesh (after relocation) is achieved through the Radial Basis Point Interpolation Functions scheme [37]. Simulations of footing penetration in soil modeled as an elastic–perfectly plastic continuum following the Tresca yield criterion demonstrated that very large penetrations (at least 10 times the footing width) can be accomplished without numerical difficulties and loss of accuracy using the present formulation. The same is true for penetration in a continuum following the Mohr–Coulomb failure criterion, except for the cases of high friction angle combined with (unrealistically) high dilatancy angle. To our best knowledge, such large footing penetrations have not been demonstrated before in elastoplastic FE/ALE simulations. The numerical results obtained from the large deformation FE analyses are in very good agreement with limit analysis solutions. Furthermore, simulations of an infinite cylinder pushed laterally in a Tresca continuum indicate that no errors are accumulated due to the successive remeshing and remapping schemes used in the Eulerian step of the ALE finite element procedure.   ACKNOWLEDGMENTS   The authors would like to acknowledge the University of Cyprus for the support of this work, under the research project SLOSTAPILES.   REFERENCES", "highlights": "This paper presents a decoupled Arbitrary Lagrangian–Eulerian (ALE) approach for the large deformation analysis of plane-strain elastoplastic problems. In this decoupled approach, the Eulerian step consists of first remeshing the deformed continuum and then remapping the state variables at the new quadrature points. Remeshing is performed without altering the element topology of the original mesh with the aid of the Spring Analogy Method enhanced with torsional springs. Before remeshing, nodes at free boundaries are relocated using an analytical approach, in order to preserve a good node distribution throughout the analysis. State variable remapping is achieved through the Radial Basis Point Interpolation Functions scheme. Large deformation elastoplastic analyses of two plane strain example problems are conducted using the presented ALE approach to test its robustness and effectiveness. The continuum is modeled as a Tresca or Mohr–Coulomb elastic–perfectly plastic material, while the meshes consist of second-order finite elements. The numerical results demonstrate that the present methodology is capable of predicting with adequate accuracy the load–displacement response even in analyses involving very large translations of the loaded boundary."}