{"id": "S0168874X13001996", "article": "MAIN-TITLE A finite element model to simulate long-term behavior of prestressed concrete girders   HIGHLIGHTS          A method for time-dependent analysis of prestressed concrete girders is developed.      The effects of creep, shrinkage of concrete and tendon relaxation are considered.      The interaction between different time-dependent effects is considered.          KEYPHRASES   Creep  Finite element  Prestressed concrete  Relaxation  Time-dependent analysis   For a prestressed concrete structure under sustained loads, the section stress and strain are subject to change with time due to time-dependent effects resulting from creep and shrinkage of concrete and relaxation of prestressing tendons [1]. If the structure is statically indeterminate, the time-dependent effects will also result in redistribution of moments in addition to the stress redistribution in cross sections [2]. The inevitable loss of the long-term workability and performance of prestressed concrete structures at service conditions is a primary concern for researchers and engineers.  The theoretical simulation of long-term behavior of prestressed concrete structures is not an easy task. One of the challenges is to model accurately and efficiently the creep effect, since creep of concrete is associated with the history of the applied stress. A number of methods have been developed to simulate the creep behavior of concrete members [3,4]. Utilization of the effective modulus is known to be the simplest method for a creep analysis [5]. This method may produce satisfactory results when the aging effects are negligible, but it will lead to an overestimation of the creep when the aging effects are present. Most of the available models were based on the age-adjusted effective modulus method (AEMM) by introducing an aging coefficient in the effective modulus [6–8]. The values of the aging coefficient are often taken from tables or charts and, therefore, AEMM is a simplified method rather than a refined method. Another challenge is to model accurately the relaxation of prestressing tendons, taking into account the interaction between different time-dependent effects. Commonly, this interaction is considered approximately by using a relaxation reduction coefficient obtained from tables or charts [1,9]. Although several refined numerical methods have recently been developed to model the concrete creep and/or tendon relaxation [10,11], few of these methods have been applied to continuous concrete members.  This paper presents a rigorous numerical method for time-dependent analysis of bonded prestressed concrete girders at service loads, taking into account concrete creep, concrete shrinkage and steel tendon relaxation. The finite element method is formulated based on the layered Euler–Bernoulli beam theory combined with rational models for concrete creep and tendon relaxation. The proposed method of analysis can be applied to the prediction of long-term behavior of both simply support and continuous girders. Several numerical examples are given to illustrate the reliability and applicability of the proposed model.  Since this study concerns the time-dependent analysis of prestressed concrete girders at service loads, the following simplifications of the instantaneous constitutive laws of materials may be made.  The concrete in compression at service conditions is assumed to be within the elastic range. The concrete in tension is assumed to be linear elastic prior to cracking, followed by linear tension stiffening behavior, as indicated by  (1a)    σ   c   =   E   c     ε   c    f o r    ε   c   ≤   ε   c r        (1b)    σ   c   =   f   t    [  1 −     ε   c   −   ε   c r       ε   t u   −   ε   c r      ]   f o r    ε   c r   <   ε   c   ≤   ε   t u     where f  t is the concrete tensile strength; E  c is the modulus of elasticity of concrete;   ε   c r   =   f   t   /   E   c   ; and ε  tu is the ultimate concrete tensile strain. When the concrete strain is greater than ε  tu , the tensile stress is equal to zero. Both the reinforcing and prestressing steel may be considered to be linear elastic at service conditions.  At service conditions, creep can be considered to be proportional to the applied stress. Therefore, the creep strain   ε   c   c r   ( t ) under sustained stress is given by  (2)    ε   c   c r   ( t ) =   σ   c   ( τ ) C ( t , τ )   where   σ   c   ( τ ) is the concrete stress at age τ; and C ( t , τ ) is the creep compliance, defined as the creep strain at age t caused by a unit stress applied at age τ.  When the applied stress is subject to a gradual change with time, which is generally true in practical applications, the creep strain due to the applied stress is calculated by applying the principle of superposition as follows:  (3)    ε   c   c r   ( t ) =   σ   c   (   t   0   ) C ( t ,   t   0   ) +  ∫    t   0    t   C ( t , τ )   ∂   σ   c   ( τ )   ∂ τ    d τ    where t 0 is the age at which the initial stress is applied. This equation indicates that creep is associated with the history of the applied stress.  The time is divided into a number of small intervals to apply an incremental method. Generally, the stresses for each element at various time have to be stored for integrating Eq. (3). However, this may have some limitations in application to large structures. To overcome this problem, the following Dirichlet series creep compliance, initially proposed by Zienkiewicz and Watson [12], is adopted in the present study:  (4)  C ( t , τ ) =  ∑  k = 1  m     ϕ   k   ( τ ) [ 1 −   e   −   r   k   ( t − τ )   ]    where m,   ϕ   k   ( τ ) and   r   k   are the empirical parameters to be determined by experimental data.  By utilizing the above creep compliance, the creep strain increment at time interval Δ   t   n   ( =   t   n   −   t   n − 1   ), Δ   ε   c   c r   , is given by [13]   (5)  Δ   ε   c   c r   =   ε   c   c r   (   t   n   ) −   ε   c   c r   (   t   n − 1   ) =  ∑  k = 1  m   ( 1 −   e   −   r   k   Δ   t   n     )   ω   k n    + C (   t   n   ,   t   n − 1 / 2   ) Δ   σ   n     in which t  n−1/2 represents the middle time between time t  n−1 and time t  n ; Δ   σ   n   is the stress increment at time interval Δ   t   n   ;   ω   k n   is obtained from the following recursive formula:  (6a)    ω   k n   =   ω   k ( n − 1 )     e   −   r   k   Δ   t   n − 1     + Δ   σ   n − 1     ϕ   k   (   t   ( n − 1 ) − 1 / 2   )   e   −   r   k   Δ   t   n − 1   / 2        (6b)    ω   k 1   =   σ   c   (   t   0   )   ϕ   k   (   t   0   )   From Eqs. (5) and (6), it can be seen that, instead of recording the entire stress history, only the value of   ω   k ( n − 1 )   needs to be stored, thus ensuring an efficient creep analysis.  Shrinkage of concrete is defined as the volume change which is independent of the imposed stress. Therefore, the shrinkage strain can be conveniently calculated using the available shrinkage models proposed by the codes or by the investigators. According to Mode Code 2010 [14], the shrinkage strain is calculated from  (7)    ε   c   s h   ( t ) =   ε   c a s   ( t ) +   ε   c d s   ( t −   t   s   )   in which   ε   c a s   ( t ) and   ε   c d s   ( t −   t   s   ) are the autogenous shrinkage and the drying shrinkage, respectively. They are expressed as follows:  (8a)    ε   c a s   ( t ) =   ε   c a s 0     β   a s   ( t )      (8b)    ε   c d s   ( t −   t   s   ) =   ε   c d s 0     β   R H     β   d s   ( t −   t   s   )      (9a)    ε   c a s 0   = −   α   a s     (      f   c m   / 10   6 +   f   c m   / 10    )   2.5   ×   10   − 6        (9b)    β   a s   ( t ) = 1 −   e   − 0.2  t         (9c)    ε   c d s 0   = [ ( 220 + 110   α   d s 1   )   e   −   α   d s 2     f   c m     ] ×   10   − 6        (9d)    β   d s   ( t −   t   s   ) =   (    t −   t   s     0.035   h  2  + ( t −   t   s   )    )   0.5     where   α   d s 1   and   α   d s 2   are the coefficients depending on the type of cement; f  cm is the mean concrete compressive strength at the age of 28 days;   β   R H   is the coefficient depending on the relative humidity of the ambient atmosphere; h is the notional size of member; (t–t  s ) is the duration of drying.  The shrinkage strain increment, Δ   ε   c   s h   , at time interval Δ   t   n   is given by  (10)  Δ   ε   c   s h   =   ε   c   s h   (   t   n   ) −   ε   c   s h   (   t   n − 1   ) =   ε   c a s 0   [   β   a s   (   t   n   ) −   β   a s   (   t   n − 1   ) ] +   ε   c d s 0     β   R H   [   β   d s   (   t   n   −   t   s   ) −   β   d s   (   t   n − 1   −   t   s   ) ]      In this study, the relaxation of prestressing steel,   σ   p r   , is evaluated utilizing the equation proposed by Magura et al. [15]:  (11)      σ   p r       σ   p 0     = −   log ( τ −   t   0   )   10    (      σ   p 0       f   p y     − 0.55  )    in which (τ–t 0) is the time in hours after stressing;   σ   p 0   is the initial stress immediately after stressing; and   f   p y   is the yield stress of prestressing steel. The ratio of the yield stress to the ultimate tensile strength generally varies between 0.8 and 0.9, depending on the type of the prestressing steel.  It should be noted that the above relaxation equation is subject to the condition that the tendon length is kept constant and   σ   p 0   is the only applied stress. In prestressed concrete members, however, the applied stress would be influenced by some causes such as the prestress transfer, the load application, and the interaction between the creep and shrinkage of concrete and the relaxation of steel tendons. Therefore, the initial stress for computing the stress relaxation at each time interval should be appropriately adjusted according to the change of the tendon stress as a result of these causes. The procedure for computing the actual relaxation of prestressing steel is illustrated in Fig. 1. Denote by   σ   p 0 ( 1 )   the initial prestress at time t 0. At time t 1, the prestress varies from   σ   p 0 ( 1 )   to   σ   p 1   due to the tendon relaxation Δ   σ   p r 1   and also to other causes. Compute the fictitious initial prestress   σ   p 0 ( 2 )   using Eq. (11) such that   σ   p 0 ( 2 )   would be relaxed to   σ   p 1   from time t 0 to time t 1. Based on the fictitious initial prestress   σ   p 0 ( 2 )   , the tendon relaxation Δ   σ   p r 2   between time t 1 and time t 2 is then calculated utilizing Eq. (11). Continue the process, and the tendon relaxation Δ   σ   p r   at time interval Δ   t   n   is then calculated from  (12)  Δ   σ   p r   =   σ   p r   (   t   n   ) −   σ   p r   (   t   n − 1   ) = −     σ   p 0 ( n )     10    (      σ   p 0 ( n )       f   p y     − 0.55  )  [  log (   t   n   −   t   0   ) −  log (   t   n − 1   −   t   0   ) ]      The Euler–Bernoulli beam theory is adopted here to develop the finite element model for the time-dependent analysis of bonded prestressed concrete beams. It is an extension of a recently developed model for unbonded prestressed concrete beams [16], in which the contribution of unbonded prestressing was made by equivalent nodal loads and was not included in the stiffness matrix. For analysis of bonded prestressed beams, however, the contribution of bonded prestressing to the stiffness matrix must be considered because of the strain compatibility between the prestressing steel and the surround concrete. The present analysis is based on the following basic assumptions: (1) the beams have a longitudinal plane of symmetry and the applied loads are located on the plane of symmetry; (2) the beams are simply supported or continuous along the same longitudinal centroidal axis supported on rollers; (3) a plane section remains plane after deformations; (4) perfect bond exists between reinforcing steel and the surrounding concrete, as well as between prestressing steel and the surrounding concrete; (5) the effects of shear deformations are negligible; (6) the prestressing steel segment in each beam element is idealized to run parallel to the centroidal axis, with eccentricity equal to the mean value of the eccentricities at end nodes, as shown in Fig. 2.  Consider a two-nodal plane beam element with element properties to be described in the local coordinate system (x,y), as shown in Fig. 2. The origin and direction of the local coordinate system would change continuously with the member deformations. Each node has three degrees of freedom: axial displacement u, transverse displacement v, and rotation θ. Assuming that the axial displacement u and transverse displacement v within the element are a linear function and a cubic polynomial, respectively, these displacements can be expressed in terms of the element nodal displacements as follows:  (13a)  u =   N   1     u   1   +   N   4     u   2        (13b)  v =   N   2     v   1   +   N   3     θ   1   +   N   5     v   2   +   N   6     θ   2     in which N 1–N 6 are the shape functions;   N   1   = 1 − ξ ;   N   2   = 1 − 3   ξ  2  + 2   ξ  3  ;   N   3   = l ( ξ − 2   ξ  2  +   ξ  3  ) ;   N   4   = ξ ;   N   5   = 3   ξ  2  − 2   ξ  3  ;   N   6   = l ( −   ξ  2  +   ξ  3  ) ; ξ = x / l where l is the length of the beam element.  The axial strain ε at any fiber of a cross section is given by  (14)  ε =   ∂ u   ∂ x   +  1 2    (    ∂ v   ∂ x    )  2  − y     ∂  2  v   ∂   x  2         The element nodal displacement vector   u  e  may be written as follows:  (15)    u  e  =   {       u   1         v   1         θ   1         u   2         v   2         θ   2       }  T       Combining Eqs. (13)–(15), the incremental strain–displacement relationship for an element can be determined by  (16)  Δ ε = (   B   L   +   B   N   / 2 ) Δ   u  e    in which  (17a)    B   L   =  [      −  1 l       6    l  2    ( 1 − 2 ξ )      2 l  y ( 2 − 3 ξ )      1 l       6    l  2    ( − 1 + 2 ξ )      2 l  y ( 1 − 3 ξ )      ]       (17b)    B   N   = Δ   u   e T     J  T  J      (18)  J =  [     0     6 l  ( − ξ +   ξ  2  )     1 − 4 ξ + 3   ξ  2     0     6 l  ( ξ −   ξ  2  )     − 2 ξ + 3   ξ  2       ]       The incremental stress–strain relationship for concrete for Δ   t   n   is  (19)  Δ   σ   n   =   E   c   Δ   ε   c   m   =   E   c   ( Δ   ε   c   − Δ   ε   c   c r   − Δ   ε   c   s h   )   where E  c represents the tangent modulus for concrete; and Δ   ε   c   m   represents the mechanical strain increment. Substituting Eq. (5) into Eq. (19) and rearranging the equation yields  (20)  Δ   σ   n   =    E ¯    c   ( Δ   ε   c   −   η   n   − Δ   ε   c   s h   )   where  (21)     E ¯    c   =    E ¯    c   (   t   n − 1 / 2   ) =     E   c   (   t   n − 1 / 2   )   1 + C (   t   n   ,   t   n − 1 / 2   )   E   c   (   t   n − 1 / 2   )        (22)    η   n   =  ∑  k = 1  m   ( 1 −   e   −   r   k   Δ   t   n     )   ω   k n      The incremental stress–strain ( Δ   σ   s   − Δ   ε   s   ) relationship for reinforcing steel is  (23)  Δ   σ   s   =   E   s   Δ   ε   s     The incremental stress–strain ( Δ   σ   p   − Δ   ε   p   ) relationship for prestressing steel is  (24)  Δ   σ   p   =   E   p   Δ   ε   p   + Δ   σ   p r     In Eqs. (23) and (24), E  s and E  p are the tangent moduli for reinforcing and prestressing steel, respectively. Since the steel is generally within its elastic range at service conditions, the tangent modulus can be replaced by the elastic modulus.  The element nodal load vector   P  e  corresponding to the element nodal displacement vector is written as  (25)    P  e  =   {       N   1         V   1         M   1         N   2         V   2         M   2       }  T       By applying the virtual work principle, the incremental equilibrium equations for an element for Δ   t   n   can be obtained.  (26)  Δ   P  e  =  ∫ V     B   L   T   Δ σ  d V  +  ∫ V   σ   J  T  J  d V  Δ   u  e    where the integration is performed over the volume V of the beam element. The first term can be written in terms of the contributions of the respective materials as follows:  (27)   ∫ V     B   L   T   Δ σ  d V  =  ∫  V 1      B   L   T   Δ   σ   n    d ( V 1 )  +  ∫  V 2      B   L   T   Δ   σ   s    d ( V 2  ) +  ∫  V 3      B   L   T   Δ   σ   p    d ( V 3  )   in which V1, V2, and V3 represent the volumes of the concrete, reinforcing steel and prestressing steel, respectively.  Substituting Eqs. (19), (23) and (24) into Eq. (26) yields  (28)  Δ   P  e  +   ( Δ   P  e  )   c r   +   ( Δ   P  e  )   s h   +   ( Δ   P  e  )   p r   = (   K   1   e   +   K   2   e   ) Δ   u  e    where  (29a)    ( Δ   P  e  )   c r   =  ∫  V 1      B   L   T      E ¯    c     η   n    d ( V 1 )       (29b)    ( Δ   P  e  )   s h   =  ∫  V 1      B   L   T      E ¯    c    d ( V 1 )  Δ   ε   c   s h        (29c)    ( Δ   P  e  )   p r   = −  ∫  V 3      B   L   T   Δ   σ   p r    d ( V 3  )      (30a)    K   1   e   =  ∫  V 1      B   L   T      E ¯    c     B   L    d ( V 1 )  +  ∫  V 2      B   L   T     E   s     B   L    d ( V 2  ) +  ∫  V 3      B   L   T     E   p     B   L    d ( V 3  )      (30b)    K   2   e   =  ∫ V   σ   J  T  J  d V    in which   ( Δ   P   n   e   )   c r   ,   ( Δ   P   n   e   )   s h   and   ( Δ   P   n   e   )   p r   represent the equivalent nodal load increments due to concrete creep, concrete shrinkage and steel tendon relaxation, respectively;   K   1   e   is the material stiffness matrix and   K   2   e   is the geometric stiffness matrix. These matrices are explicitly expressed as follows:  (31a)    ( Δ   P  e  )   c r   =   {      −   ∑ i      E ¯    c i     A   c i     η   n i         0      ∑ i      E ¯    c i     A   c i     η   n i     y   c i          ∑ i      E ¯    c i     A   c i     η   n i        0     −   ∑ i      E ¯    c i     A   c i     η   n i     y   c i          }  T       (31b)    ( Δ   P  e  )   s h   = Δ   ε   c   s h     {      −   ∑ i      E ¯    c i     A   c i         0      ∑ i      E ¯    c i     A   c i     y   c i          ∑ i      E ¯    c i     A   c i        0     −   ∑ i      E ¯    c i     A   c i     y   c i          }  T       (31c)    ( Δ   P  e  )   p r   =   {       ∑ k   Δ   σ   p r k     A   p k        0     −   ∑ k   Δ   σ   p r k     A   p k     y   p k          −   ∑ k   Δ   σ   p r k     A   p k         0      ∑ k   Δ   σ   p r k     A   p k     y   p k         }  T       (32a)    K   1   e   =  [         d ¯    11   / l    0    −    d ¯    12   / l     −    d ¯    11   / l    0       d ¯    12   / l          12    d ¯    22   /   l  3      6    d ¯    22   /   l  2     0    − 12    d ¯    22   /   l  3      6    d ¯    22   /   l  2              4    d ¯    22   / l        d ¯    12   / l     − 6    d ¯    22   /   l  2      2    d ¯    22   / l                   d ¯    11   / l    0    −    d ¯    12   / l          Symmetry           12    d ¯    22   /   l  3      − 6    d ¯    22   /   l  2                       4    d ¯    22   / l      ]       (32b)    K   2   e   = N  [     0   0   0   0   0   0         6 / 5 l     1 / 10    0    − 6 / 5 l     1 / 10             2 l / 15    0    − 1 / 10     − l / 30               0   0   0         Symmetry           6 / 5 l     − 1 / 10                      2 l / 15      ]    where  (33a)     d ¯    11   =   ∑ i      E ¯    c i     A   c i     +   ∑ j     E   s j     A   s j     +   ∑ k     E   p k     A   p k          (33b)     d ¯    12   =   ∑ i      E ¯    c i     A   c i     y   c i     +   ∑ j     E   s j     A   s j     y   s j     +   ∑ k     E   p k     A   p k     y   p k          (33c)     d ¯    22   =   ∑ i      E ¯    c i     A   c i     y   c i   2     +   ∑ j     E   s j     A   s j     y   s j   2     +   ∑ k     E   p k     A   p k     y   p k   2          (34)  N =   ∑ i     σ   c i     A   c i     +   ∑ j     σ   s j     A   s j     +   ∑ k     σ   p k     A   p k       In Eqs. (31)–(34), A corresponds to the cross-sectional area; the summation symbol signifies that the element is subdivided into a number of layers to employ a layered approach; and the subscripts ci, sj and pk represent the ith concrete layer, jth reinforcing steel layer and kth prestressing steel layer, respectively.  The structure equilibrium equations are assembled in the global coordinate system, which is fixed in space, from contributions of all the beam elements. The nonlinear equilibrium equations are solved by an incremental method in combination with the Newton–Raphson iterative algorithm, that is, the incremental-iterative method. The iterative procedure for each increment involves four basic steps: form the current tangent stiffness matrix; solve the equilibrium equations; determine the current state for each element; and check the convergence. A computer program which implements the aforementioned solution procedure is developed. The numerical procedure is capable of predicting the long-term behavior of bonded prestressed concrete beams at service loads, taking into account concrete creep, concrete shrinkage and steel tendon relaxation. In the next section, some numerical examples are presented to demonstrate the reliability and applicability of the proposed method of analysis.  Three numerical examples are given. These include a comparison of numerical predictions with experimental results available in literature, an evaluation of long-term behavior of a simply-supported beam and an evaluation of moment redistribution in a continuous beam due to time-dependent effects.  A bonded post-tensioned concrete beam, tested by Breckenridge and Bugg [17], is analyzed in the present study to calibrate the proposed numerical model. The beam was simply supported over 12.2m span and was of I-shape cross section, as shown in Fig. 3(a). Two prestressing tendons, each of which is 28.58mm diameter high-strength steel bar, had a curved profile near the supports and were straight with constant eccentricities elsewhere. The reinforcing steel consisted of eight #3 bars. The tendons were tensioned to an initial prestressing force of 877kN and then anchored the beams at concrete age of 8 days. The beam was subjected to self-weight only, without live loads.  The concrete strength and elastic modulus at prestress transfer were 35.3MPa and 23.3GPa, respectively. The yield stress and elastic modulus of prestressing steel were 896MPa and 169GPa, respectively. The elastic modulus of reinforcing steel is taken as 200GPa. In the calculation of the shrinkage strain, only the drying shrinkage is considered in the present and following examples, and   ε   c d s 0   =366×10−6. The creep parameters m,   ϕ   k   ( τ ) and   r   k   and time-dependent modulus of elasticity   E   c   ( τ ) recommended by Zhu [13] for the preliminary design of large concrete dams were as follows: m=2;   ϕ   1   ( τ ) = 0.23 ( 1 + 9.2   τ   − 0.45   ) /   E   0   , r 1=0.3;   ϕ   2   ( τ ) = 0.52 ( 1 + 1.7   τ   − 0.45   ) /   E   0   , r 2=0.005;   E   c   ( τ ) =   E   0   ( 1 −   e   − 0.4   τ   0.34     ) , where E 0 is a constant, the value of which is 1.4 times the instantaneous modulus of elasticity at age of 28 days. In this analysis, however, some changes for the creep data are proposed: r 1=0.1; and in the expressions of   ϕ   1   ( τ ) and   ϕ   2   ( τ ) ,   E   0   is replaced by   E   c   ( τ ) .  In the finite element idealization, the concrete beam is discretized into 22 beam elements as shown in Fig. 3(b), and each element is subdivided into 15 concrete layers, 2 tendon layers and 3 reinforcing steel layers. Fig. 4 shows a comparison between the numerical and experimental results regarding the variation of midspan deflection with time after prestress transfer. It is seen that the analysis using Zhu creep data significantly underestimates the time-dependent deflection after a few days. By using the proposed creep data, the numerical predictions show a quite good agreement with the experimental results. Therefore, the proposed creep data may be reasonable for a time-dependent analysis of prestressed concrete girders, and they are also used in the following examples.  A simply-supported prestressed concrete beam of rectangular cross section, as shown in Fig. 5(a), is used to examine the time-dependent behavior. The beam is prestressed with a parabolic tendon with zero eccentricity at the end supports and a maximum eccentricity of 200mm at midspan. The tendon area is 1000mm2; the initial prestress is 1200MPa; the yield stress is 1581MPa; and the elastic modulus is 200GPa. The concrete strength at age of 28 days is 35MPa and other concrete parameters such as f  t and E  c are determined in terms of Eurocode 2 [18]. Two load cases are considered: P=0kN (no live loads) and P=60kN. It is assumed that both the prestress transfer and the application of live loads happen at day 28. In the finite element idealization, the beam is divided into 18 beam elements as shown in Fig. 5(b) and each element is subdivided into 10 concrete layers and 1 tendon layer.     Figs. 6 and 7 show the variations of some typical responses (deflection, curvature, axial shortening and prestress loss) with time for the beam without live loads and for the beam with live loads, respectively. The results are produced by considering three different time-dependent effects: (i) considering only concrete creep; (ii) considering only concrete creep and concrete shrinkage; and (iii) considering concrete creep, concrete shrinkage and tendon relaxation. Comparing the time-dependent responses due to concrete creep with and without concrete shrinkage, it is observed that the concrete shrinkage causes a decrease in the upward deflection and hogging curvature for the beam without live loads but an increase in the downward deflection and sagging curvature for the beam subjected to live loads. Also, the concrete shrinkage causes a remarkable increase in the axial shortening and prestress loss. In this analysis, at day 650 for the beam without live loads, the concrete shrinkage reduces the upward deflection and hogging curvature due to creep by 10.29% and 10.33%, respectively, while increases the axial shortening and prestress loss due to creep by 69.99% and 45.83%, respectively. On the other hand, at day 650 for the beam subjected to live loads, the concrete shrinkage increases the downward deflection, sagging curvature, axial shortening and prestress loss due to creep by 15.07%, 15.92%, 68.93% and 94.29%, respectively.  Comparing the time-dependent responses due to concrete creep and concrete shrinkage with and without tendons relaxation, it is seen that the tendon relaxation obviously reduces the upward deflection and hogging curvature for the beam without live loads but enhances obviously the downward deflection and sagging curvature for the beam subjected to live loads. In addition, the tendon relaxation slightly reduces the axial shortening but increases remarkably the prestress loss. In this analysis, at day 650 for the beam without live loads, the tendon relaxation reduces the upward deflection, hogging curvature and axial shortening due to concrete creep and concrete shrinkage by 23.87%, 24.1% and 5.33%, respectively, while increases the prestress loss due to concrete creep and concrete shrinkage by 55.62%. On the other hand, at day 650 for the beam subjected to live loads, the tendon relaxation increases the downward deflection, sagging curvature and prestress loss due to concrete creep and concrete shrinkage by 31.3%, 32.65% and 97.06%, respectively, while reduces the axial shortening due to concrete creep and concrete shrinkage by 5.12%.  To confirm the accuracy of the above results and to further verify the proposed model, the simply-supported beam illustrated in Fig. 5(a) is also analyzed using a general-purpose finite element program, ABAQUS, incorporated with user-defined subroutines. The beam is modeled using the Euler–Bernoulli beam element (B23), and the number and length for the elements are the same as the ones illustrated in Fig. 5(b). Two user-defined material subroutines (UMAT), one for creep and shrinkage of concrete and the other for steel tendon relaxation, are developed in terms of the previously described material time-dependent models and incorporated into the ABAQUS finite element program so as to enable a time-dependent analysis. Fig. 8(a) and (b) shows a comparison between the results (midspan deflection and axial shortening) computed using ABAQUS and the proposed model for the beam without and with live loads, respectively. Excellent agreement of the results can be observed from the figure.  For simply-supported girders, the time-dependent effects do not influence the bending moment although these effects cause stress redistribution in cross sections. For continuous girders, on the other hand, the time-dependent effects will result in redistribution of bending moments or support reactions due to the existence of redundant constraints. To confirm this statement, a two-span continuous prestressed concrete beam, as shown in Fig. 9(a), is used for the analysis. The prestressing tendon is assumed to have an idealized parabolic profile with eccentricities at the end support, midspan and center support of 0, 140 and 140mm, respectively. The live loads P=100kN. All of the material parameters are the same as those of the simply-support beam analyzed in Section 4.2. The continuous beam is idealized as 36 beam elements as shown in Fig. 9(b).     Figs. 10 and 11 illustrate the variation of support reactions and bending moments with time, respectively. It is seen that, when time passes, the reaction at the end support decreases while the reaction at the center support increases. As a consequence, the positive moment at midspan decreases while the negative moment at the center support increases. At day 650, the concrete shrinkage increases the loss of the end support reaction and midspan moment due to concrete creep by 76.23%, while the tendon relaxation increases the loss of the end support reaction and midspan moment due to concrete creep and concrete shrinkage by 88.11%.  In a continuous prestressed girder with non-concordant cables, the prestressing would produce secondary reactions and secondary moments. The variation of the secondary reaction at the end support with time is shown in Fig. 12. Because the tendon line is below its linearly transformed concordant line [19], the secondary reaction is positive at the end support, and correspondingly negative with twice the magnitude at the center support. As a result, the secondary moments in the beam are positive. It is seen that the secondary reaction decreases with time. At day 650, the concrete shrinkage increases the secondary reaction loss due to concrete creep by 56.49%, while the tendon relaxation increases the secondary reaction loss due to concrete creep and concrete shrinkage by 64.99%.   CONCLUSIONS   A numerical model has been developed to predict the long-term behavior of bonded prestressed concrete girders at service load conditions, taking into account the effects of creep and shrinkage of concrete and relaxation of steel tendons. The Euler–Bernoulli beam theory, together with the layered approach, was applied to the development of the finite element model. The finite element formulations were constructed using the updated Lagrangian approach. The equivalent nodal loads in the time-dependent equilibrium equations are composed of the contributions from external loads and three time-dependent effects, namely, concrete creep, concrete shrinkage and tendon relaxation. The stiffness matrix consists of two submatrices, namely, the material stiffness matrix and the geometric stiffness matrix. The proposed model is able to simulate effectively the time-dependent effects in prestressed concrete girders, taking into consideration the interaction between these effects.  The proposed model has been calibrated with the experimental results of a test beam available in literature. The numerical predictions using the modified Zhu creep data showed a good agreement with the experimental results. In addition, a simply-supported beam and a continuous beam were analyzed to examine the long-term behavior of the beams, taking into account different time-dependent effects. The results indicated that the time-dependent effects influence significantly the structural responses, including the deflection, curvature, axial shortening and prestress loss. The analysis also confirmed that the moments and secondary moments in a continuous beam vary with time due to time-dependent effects.  It should be noted that the results of the proposed time-dependent analysis are highly dependent on the material models described in Section 2. The empirical parameters used in these models are of critical importance to the accuracy of the analysis. Extensive experimental and numerical works should be carried out to calibrate the reliability of these parameters.   ACKNOWLEDGMENTS   This research is sponsored by FEDER funds through the program COMPETE – Programa Operacional Factores de Competitividade – and by national funds through FCT – Fundação para a Ciência e a Tecnologia –, under the project PEst-C/EME/UI0285/2013. The work presented in this paper has also been supported by FCT under Grant no. SFRH/BPD/66453/2009.   REFERENCES", "highlights": "The development of a finite element model for time-dependent analysis of bonded prestressed concrete girders at service conditions is presented. The effects of creep and shrinkage of concrete and relaxation of steel tendons are taken into account. The concrete creep is modeled based on the Dirichlet series creep compliance with efficiency in simulating the stress history. In addition, the interaction between different time-dependent effects is fully considered in the numerical procedure. The numerical method is formulated based on the layered Euler–Bernoulli beam theory. In the constructed incremental equilibrium equations, the equivalent nodal load increments consist of four components contributed by external loads, concrete creep, concrete shrinkage and tendon relaxation, while the stiffness matrix is composed of the material and geometric stiffness matrices. Numerical examples show that the proposed model can well predict the long-term behavior of prestressed concrete beams, and that the time-dependent effects have important influence on the structural behavior."}