{"id": "S0168874X14000948", "article": "MAIN-TITLE Finite element method for a nonlocal Timoshenko beam model   HIGHLIGHTS          A nonlocal Timoshenko beam with long-range volume forces and moments is investigated.      A consistent variational formulation of the nonlocal Timoshenko beam is presented.      From the variational formulation a finite element solution is derived.      Separate local and nonlocal stiffness matrices contribute to the global stiffness matrix.      Exact closed-form expressions can be derived for the nonlocal stiffness matrix.          KEYPHRASES   Nonlocal Timoshenko beam  Long-range interactions  Pure deformation modes  Variational formulation  Finite element method   The increasing importance of micro- and nano-technologies has recently drawn a considerable attention to the need of mathematical models capable of capturing the effects of microstructure and long-range intermolecular forces. For this purpose, a classical local continuum modeling has been proved soon inadequate owing to its inherent free-scale formulation, while molecular simulations, although may seem a most appropriate way to model microstructural effects, involve as a major drawback a considerable computational effort. For these reasons, and on account of the fact that even to build a molecular model some theoretical assumptions are still needed, researchers have preferred the formulation of “enriched” continua, i.e. continua where the effects of microstructure and long-range intermolecular forces are modeled, in an average sense, by introducing appropriate nonlocal terms. The preference accorded to the formulation of these “nonlocal continua” is motivated by the fact that conventional numerical solution methods can be applied, with considerable advantages for design and verification purposes.  Several well-established theories of nonlocal continua exist in the scientific literature: Eringen׳s integral theory [1,2], involving a stress–strain relation between the stress at a given point and the strain in the whole volume of the solid; gradient elasticity theories [3,4], with constitutive equations depending on the gradients of stresses or strains; the peridynamic theory [5], where long-range elementary forces depend on relative displacements between non-adjacent points; the micropolar “Cosserat” theory [6] and the couple-stress theory [7], according to which each material point is endowed with translational and rotational degrees of freedom, with resulting work-conjugate curvatures and couple stresses. Regarding micropolar or couple-stress theory, several interesting studies have explained, on a physical basis, their relation with microstructural effects, e.g. see those by Kro¨ner [8] and Lakes [9].  Among the various examples of nonlocal continua, nonlocal beam theories are of particular interest for applications in micro- and nano-technologies to model beamlike devices currently employed as sensors and actuators [10,11]. Because of small-size effects, the behavior of these devices deviates significantly from the theoretical predictions of the classical Euler–Bernoulli (EB) or Timoshenko (TM) beam theory, as disclosed by atomistic simulations [12] and experimental evidence on several materials, such as epoxy [13], polypropylene [14], graphite [15] and copper [16]. In general, linearly-elastic nonlocal beam models have been proposed, based on the classical continuum formulation of EB or TM beam theories. Dynamic and static responses have been investigated.  Several nonlocal beam models have been built using Eringen׳s integral theory [1,2]. Formulations with Eringen׳s law for both normal stress and shear stress have been presented by Lu et al. [17] for nonlocal EB and TM beam models, by Reddy [18] and Aydogdu [19] for alternative higher-order nonlocal beam models. In these studies, the motion equations have been derived by direct replacement of Eringen׳s stress laws in the bending moment and shear stress resultants [17], or by the principle of virtual displacements [18,19].  There exist also several nonlocal beam models built by using nonlocal theories alternative to Eringen׳s integral theory. For instance, nonlocal EB beam models have been built by Kong et al. [20] using a modified couple stress theory, and by Zhang et al. [21] using a so-called hybrid approach, which involves a strain energy functional depending on local and nonlocal curvatures. Nonlocal TM beam models have been built by Wang et al. [22] in conjunction with the gradient elasticity theory presented by Lam et al. [13], and by Ma et al. [23] based on a modified couple stress theory. In all these studies, the motion equations have been derived by Hamilton׳s principle [20–23]. Very recently, nonlocal EB and TM beam models have been proposed by Pradhan [24] and Yang and Lim [25] based on the stress gradient elasticity theory, the former by a weak formulation of the motion equations [24], and the latter by Hamilton’s principle [25]. In particular, Yang and Lim [25] have used a strain energy density with a nonlocal normal stress expressed in terms of higher-order derivatives of the normal strain and, as a result, higher-order derivatives of the nonlocal bending moment are involved in the motion equations and boundary conditions (B.C.). The study by Yang and Lim [25] is of particular interest because shows that, if the motion equations and the pertinent B.C. are not derived by a consistent variational framework and in particular by Hamilton’s principle, but by a direct replacement of the nonlocal stress resultants (nonlocal bending moment and nonlocal shear) into the classical beam motion equations, some inconsistencies may arise in terms of equilibrium and B.C., which lead to incorrect softening effects in the bending stiffness and natural frequencies. These conclusions have been drawn for both EB and TM beam models.  Many studies have focused on the static response of nonlocal beam models. For instance, Challamel and Wang [26], McFarland and Colton [14], Lam et al. [13], Park and Gao [27], Chen and Feng [28] have proposed nonlocal EB beam models, using a gradient elasticity theory and an integral elasticity theory with a constitutive relation combining local and nonlocal curvatures [26], a micropolar elasticity constitutive law [14], a general strain gradient elasticity theory [13], a modified couple stress theory [27], a strain gradient theory and a couple stress theory [28].  Regarding the solution procedures, in some cases exact analytical static responses [27] or exact analytical eigenfunctions for the computation of the natural frequencies [25] have been derived. Approximate solutions for nonlocal beam models based on Eringen’s integral theory have been obtained by the differential quadrature method [29] and by the finite difference (FD) method [30]. However, finite element (FE) solutions have been preferably sought, for the effectiveness in handling complex geometries, material properties and loading conditions. Examples of FE solutions for nonlocal beam models based on Eringen’s integral theory in the studies by Friswell et al. [31], Adhikari et al. [32], Eltaher et al. [33], for nonlocal beam models based on the stress gradient elasticity theory can be found in the studies by Pradhan [24] and Phadikar and Pradhan [34].  Recently, the authors have proposed a nonlocal TM beam model built on a mechanical basis. The key idea is to model nonlocal effects as volume forces and moments, mutually exerted by non-adjacent beam segments, that contribute to the equilibrium of a beam segment along with the local stress resultants [35]. Elastic long-range volume forces/moments have been considered: they are linearly depending, through suitable attenuation functions governing the space decay of the nonlocal effects, on the product of the volumes of the interacting beam segments and on generalized measures of their relative motion. These generalized measures are the pure beam deformation modes derived by Fuchs [36,37], i.e. a “pure axial” symmetric mode, a “pure bending” symmetric mode and a “pure shear” asymmetric mode. Numerical solutions have been obtained by a standard FD method [35]. This nonlocal TM beam model can be cast within the more general framework of a mechanically-based nonlocal continuum proposed by the authors, with nonlocal effects depending on the relative motion between non-adjacent volumes [38–45].  In the paper by Di Paola et al. [35], the motion equations of the nonlocal TM beam model have been derived by including the long-range volume forces/moments in the standard equilibrium equations of a beam segment. However some issues were not tackled, as for instance a reformulation of the model within a consistent variational approach, which is of crucial importance as observed by Yang and Lim [25], and the implementation of an efficient numerical solution. It is evident in fact that a FD solution, used in Ref. [35] to illustrate the key features of the model, is not generally used by engineers, for some inherent difficulties in handling the B.C. and for the high computational effort involved with a refinement of the grid. Such issues will be addressed in this work.  The paper will focus on the static response of the nonlocal TM beam model. A variational formulation will be derived, involving a consistent total elastic potential energy functional expressed in terms of separate local and nonlocal terms. Hence, the variational formulation will be used to derive FE equilibrium equations, following a general approach devised for the mechanically-based nonlocal continua proposed by the authors [46]. In particular, the global stiffness matrix will be derived as the sum of a local stiffness matrix, built by a standard assemblage of the classical element stiffness matrices, and a nonlocal stiffness matrix built by summing component matrices, each involving the stiffness of the long-range interactions between a couple of FEs. Using the standard polynomial shape functions of the two-node TM beam element, it will be shown that exact closed-form expressions can be derived for every element of the nonlocal stiffness matrix, for typical attenuation functions of the nonlocal effects.  The paper is organized as follows. Upon summarizing the basic equations of the nonlocal TM beam model in Section 2, the variational formulation will be illustrated in Section 3. The FE solution and numerical applications for different parameters will be presented in Sections 4 and 5, respectively. Further, in Section 5 it will be shown that the nonlocal TM beam model captures very well some experimental data on micro-beams [13].  For later convenience, this section recalls the fundamental equations of the nonlocal TM beam model presented in Ref. [35].    Fig. 1 shows a beam of arbitrary cross section, referred to a Cartesian orthogonal system O(xyz), where O is the centroid of the cross section, x the longitudinal centroidal axis, y and z the principal axes of the cross section.  The kinematic model of the classical TM beam theory is used, with the following relations between strains and displacements/rotation of the cross section:  (1a-e)  ε ( x ) =   d u ( x )   d x   ;  χ ( x ) = −   d φ ( x )   d x   ;  γ ( x ) =   d v ( x )   d x   − φ ( x ) ; u ( x ) =    u ( x )  v ( x )  φ ( x )   T  ;   ζ ( x ) =    ε ( x )  γ ( x )  χ ( x )   T       Hence, the fundamental assumption is that any beam segment is acted upon by local stress resultants exerted by the adjacent beam segments, by long-range resultants exerted by all the non-adjacent beam segments, and by the external forces, as shown in Fig. 2.  Local stress resultants   N   ( l )   ( x ) ,   M   ( l )   ( x ) and   T   ( l )   ( x ) are built in agreement with the classical TM beam theory, based on the following relations:  (2a-c)   s  ( l )   =  D ⁎  ζ ( x ) ;   s  ( l )   =    N  ( l )   ( x )   M  ( l )   ( x )   T  ( l )   ( x )   ;   D ⁎  = D i a g    E ⁎  A   E ⁎  I   G ⁎   K s  A        In Eq. (2),    N  ( l )   ( x ) =  ∫ A   σ x  ( l )   ( x , y , z ) d A ,  M  ( l )   ( x ) =  ∫ A   σ x  ( l )   ( x , y , z ) z d A , and   T  ( l )   ( x ) =  ∫ A   τ  x z   ( l )   ( x , y , z ) d A ,   being  σ x  ( l )   ( x , y , z ) and  τ  x z   ( l )   ( x , y , z ) the Cauchy normal and shear stresses on the cross section (superscript “ (l) ” stands for “local”). Also, I is the moment of inertia, A is the area of the cross section,  E ⁎  =  β 1  E  and   G ⁎  =  β 1  G where E is Young’s modulus, G is the shear modulus, Ks is the shear correction factor and β 1 is a dimensionless coefficient, 0 ≤   β   1   ≤ 1 , weighing the amount of local effects [39,41,47,48].  Long-range resultants   R   x   (   x   i   ) ,   R   z   (   x   i   ) and   R   φ   (   x   i   ) are built by modeling nonlocal effects as elastic long-range volume axial forces, transverse forces and moments, which are mutually exerted by non-adjacent beam segments and counteract their relative motion, as shown in Fig. 3. They are given as  (3a)    R   x   (   x   i   ) =  ∑  k = 0 , k ≠ i   N − 1      r   x   (   x   i   ,   ξ   k   )       (3b)    R   z   (   x   i   ) =  ∑  k = 0 , k ≠ i   N − 1      r   z   (   x   i   ,   ξ   k   )       (3c)    R   φ   (   x   i   ) =  ∑  k = 0 , k ≠ i   N − 1      r   φ   (   x   i   ,   ξ   k   )  =  ∑  k = 0 , k ≠ i   N − 1      r   φ φ   (   x   i   ,   ξ   k   ) +   r   φ z   (   x   i   ,   ξ   k   )    where x =   x   i   and x =   ξ   k   are the abscissas of beam volumes Δ V (   x   i   ) = A Δ x and Δ V (   ξ   k   ) = A Δ x (   x   i   = i Δ x for i = 0 , 1 , .. . N − 1 ). Terms on the r.h.s. of Eq. (3a)–(3c) are linearly-depending on the product of the volumes of the interacting beam segments and on generalized measures of their relative motion, namely the pure “pure axial”, “pure bending” and “pure shear” deformations singled out by Fuchs [36,37]. That is, in Eq. (3a)    r   x   (   x   i   ,   ξ   k   ) is given as  (4a,b)    r   x   (   x   i   ,   ξ   k   ) =   q   x   (   x   i   ,   ξ   k   ) Δ V (   x   i   ) Δ V (   ξ   k   )    q   x   (   x   i   ,   ξ   k   ) =   g   x   (   x   i   ,   ξ   k   ) η (   x   i   ,   ξ   k   )      (5)  η (   x   i   ,   ξ   k   ) = u (   ξ   k   ) − u (   x   i   )   where η (   x   i   ,   ξ   k   ) is the pure axial deformation [36,37]. In Eq. (3c),   r   φ φ   (   x   i   ,   ξ   k   ) is given as  (6a,b)    r   φ φ   (   x   i   ,   ξ   k   ) =   q   φ φ   (   x   i   ,   ξ   k   ) Δ V (   x   i   ) Δ V (   ξ   k   )    q   φ φ   (   x   i   ,   ξ   k   ) =   g   φ   (   x   i   ,   ξ   k   ) θ (   x   i   ,   ξ   k   )      (7)  θ (   x   i   ,   ξ   k   ) = φ (   ξ   k   ) − φ (   x   i   )   where θ (   x   i   ,   ξ   k   ) is the pure bending deformation [36,37]. In Eqs. (3b) and (3c),   r   z   (   x   i   ,   ξ   k   ) and   r   φ z   (   x   i   ,   ξ   k   ) are given as  (8a,b)    r   z   (   x   i   ,   ξ   k   ) =   q   z   (   x   i   ,   ξ   k   ) Δ V (   x   i   ) Δ V (   ξ   k   )    q   z   (   x   i   ,   ξ   k   ) = 2   sgn (   ξ   k   −   x   i   )   |   x   i   −   ξ   k   |     g   z   (   x   i   ,   ξ   k   ) ψ (   x   i   ,   ξ   k   )      (9a,b)    r   φ z   (   x   i   ,   ξ   k   ) =   q   φ z   (   x   i   ,   ξ   k   ) Δ V (   x   i   ) Δ V (   ξ   k   )    q   φ z   (   x   i   ,   ξ   k   ) =   g   z   (   x   i   ,   ξ   k   ) ψ (   x   i   ,   ξ   k   )      (10)  ψ (   x   i   ,   ξ   k   ) =  [    v (   ξ   k   ) − v (   x   i   )     ξ   k   −   x   i     − φ (   ξ   k   )  ]  +  [    v (   ξ   k   ) − v (   x   i   )     ξ   k   −   x   i     − φ (   x   i   )  ]    where ψ (   x   i   ,   ξ   k   ) is the pure shear deformation [36,37]. Also, in Eqs. (4b)–(6b)–(8b)–(9b),   g   s   ( x , ξ ) with s = x , z , φ are the attenuation functions governing the spatial decay of the long-range interactions. They must be taken as positive and symmetric with respect to the arguments x and ξ, to ensure that the long-range resultants have a restoring nature and mutual, according to Newton’s third law. More comments on these aspects can be found in Ref. [35].  Upon enforcing the equilibrium of the beam segment in Fig. 2, and taking the limit Δ x → 0 the following integro-differential equilibrium equations are obtained:  (11a)    E  ⁎  A     d  2  u ( x )   d   x  2    +   F   x   ( x ) +   A  2   ∫ 0 L     q   x   ( x , ξ ) d ξ  = 0      (11b)    K   s     G  ⁎  A  [      d  2  v ( x )   d   x  2    −   d φ ( x )   d x    ]  +   F   z   ( x ) +   A  2   ∫ 0 L     q   z   ( x , ξ ) d ξ  = 0      (11c)    E  ⁎  I     d  2  φ ( x )   d   x  2    +   K   s     G  ⁎  A  [    d v ( x )   d x   − φ ( x )  ]  +   A  2   ∫ 0 L     q   φ φ   ( x , ξ ) d ξ  +   A  2   ∫ 0 L     q   φ z   ( x , ξ ) d ξ  = 0   where L is the beam length. The mechanical and kinematic B.C. are  (12a,b)       E  ⁎  A     d  2  u ( x )   d   x  2     |   x =   x   i     = ∓   N   i    or  u (   x   i   ) =   u   i        (12c,d)       K   s     G  ⁎  A  [    d v ( x )   d x   − φ ( x )  ]   |   x =   x   i     = ∓   T   i    or  v (   x   i   ) =   v   i        (12e,f)   E ⁎  I   d φ ( x )   d x    |  x =  x i    = ∓  M i   or  φ (  x i  ) =  φ i    where u  i , v  i and φ  i (i=0,L) are prescribed displacements/rotations at the beam ends   x   0   = 0 and   x   L   = L , while N  i , M  i and T  i (i=0, L) are the external forces/moments acting at the beam ends (taken as positive according to the positive sign conventions for u ( x ) , v ( x ) and φ(x), see Fig. 1). Eq. (12c)–(d) shows that the mechanical B.C. coincide with those of the local theory. This can be proved considering that, in the equilibrium equations of the beam volumes at the beam ends, the long-range resultants are infinitesimal of higher order with respect to the local stress resultants (e.g. see Di Paola et al. [38]).  Comments on the mechanical interpretation of the nonlocal TM beam model can be found in the paper by Di Paola et al. [35] and are omitted for brevity. However, a few comments are in order on some generalizations that have been introduced here, in the analytical form of the long-range volume forces/moments, with respect to that presented in Ref. [35].  In Ref. [35], the analytical form of the volume forces/moments has been built based on the definition given by Fuchs [37] of the self-equilibrated stress resultants that arise, at the end of a TM beam, as a result of the pure beam deformation modes. For this reason, the distance between the interacting volume elements is involved (see Eqs. (12), (14), (16) and (17) in Ref. [35]). In this paper, in recognition of the fact that the only mandatory requirements on the analytical form of the long-range volume forces/moments are that the third Newton’s law is fulfilled and that the volume forces/moments are self-equilibrated restoring forces, the volume forces/moments have been given the more general analytical expressions (4a), (6a) and (8a)–(9a), which include, as a particular case, the analytical form adopted in Ref. [35]. For this, it is sufficient to replace the attenuation functions   g   s   ( x , ξ ) , s = x , z , φ , by  g x  ( x , ξ )  E ⁎  A / |  x i  −  ξ k  | ,  g z  ( x , ξ ) 3 μ  E ⁎  I / | x − ξ | and  g φ  ( x , ξ )  E ⁎  I / | x − ξ | , respectively, being μ = 1 / ( 1 + 12 c ) with c =  E ⁎  I / (  G ⁎   K s  A  L 2  ) .  Further, it is pointed out that the analytical form of the long-range volume forces/moments in Ref. [35] involved the local axial and flexural stiffness (see E ⁎ A in Eq. (12), E ⁎ I in Eqs. (14), (16) and (17) in Ref. [35]). In this paper, following the key ideas of typical nonlocal continua in the literature, where nonlocal terms are governed by appropriate parameters not necessarily related to the local ones, for more generality no mandatory dependence on local parameters is introduced in the analytical form of the long-range volume forces/moments, and the parameters governing the long-range interactions are the parameters of the attenuation functions   g   s   ( x , ξ ) , with s = x , z , φ , as shown in Eqs. (4b), (6b), (8b) and (9b). It can be recognized, however, that there is no difficulty to introduce in the long-range resultants of this paper a dependence on the local parameters (for instance, parameter C =   E  ⁎  I could be set in the attenuation function (51) used in the numerical applications that follow, see Section 5), and a definitive choice on the best option to adopt shall be made, in general, based on experimental evidence. An example of parameters selection to fit experimental data will be given in Section 5.  Differences between the nonlocal TM beam model of this paper and the previous one proposed by the authors in Ref. [41] have been extensively discussed in Appendix A of Ref. [35]. It is worth recalling that the two models rely on different assumptions on the elastic long-range interactions, that are modeled as elementary forces mutually exerted by elementary volumes in the model of Ref. [41], and as forces/moments exchanged by beam segments in the model of this paper. As a result of these different assumptions, it can be shown that the model of this paper provides the following capabilities [35]: for beams with arbitrary cross section, nonlocal axial and flexural responses are uncoupled; for beams with doubly-symmetric cross section, nonlocal bending effects and nonlocal shear effects can be considered separately, as may be requested in some applications; in addition, for the model of this paper no preliminary numerical integration is required to derive the long-range resultants in Eq. (3), with considerable advantages in terms of computational effort.  In this section, the nonlocal TM beam model will be given a consistent variational framework. For this, the first step is to write the work done by the volume forces/moments in the following form, taking the limits Δ x , Δ ξ → 0    (13)   lim  Δ x , Δ ξ → 0    ∑  i = 0   N − 1    R T  (  x i  ) u (  x i  ) =  lim  Δ x , Δ ξ → 0    A 2   ∑  i = 0   N − 1    ∑  k = 0 , k ≠ i   N − 1     q ~  T  (  x i  ,  ξ k  ) u (  x i  ) Δ x Δ ξ =  A 2   ∫ 0 L   ∫ 0 L    q ~  T  ( x , ξ ) u ( x ) d x d ξ   where Δ V (   x   i   ) = A Δ x , Δ V ( ξ ) = A Δ ξ and  (14a,b)  R (  x i  ) =     R x  (  x i  )   R z  (  x i  )   R φ  (  x i  )   T    q ~  ( x , ξ ) =     q x  ( x , ξ )   q z  ( x , ξ )   q φ  ( x , ξ )   T       Because of the symmetry of the attenuation functions   g   s   ( x , ξ ) , with s = x , z , φ , the work done by the volume forces/moments can be recast as follows:  (15)   ∫ 0 L   ∫ 0 L    q ~  T  ( x , ξ ) u ( x ) d x d ξ = −  1 2   ∫ 0 L   ∫ 0 L   q T  ( x , ξ ) e ( x , ξ ) d x d ξ   where q ( x , ξ ) and e ( x , ξ ) are the vectors collecting the (specific) long-range volume forces/moments (4b)–(6b)–(9b) and pure beam deformations (5)–(7)–(10), respectively:  (16a,b)  q ( x , ξ ) =     q x  ( x )   q  φ φ   ( x , ξ )   q  φ z   ( x , ξ )   T   e ( x , ξ ) =    η ( x , ξ )  θ ( x , ξ )  ψ ( x , ξ )   T       Between vectors q ( x , ξ ) and e ( x , ξ ) the following constitutive relations hold, written for later convenience in matrix form:  (17)  q ( x , ξ ) = G ( x , ξ ) e ( x , ξ )   where G ( x , ξ ) is a diagonal matrix depending on the attenuation functions   g   s   ( x , ξ ) , with s = x , z , φ , given by  (18)  G ( x , ξ ) = D i a g    g x  ( x , ξ )   g φ  ( x , ξ )  2 sgn ( ξ − x )  g z  ( x , ξ ) / | x − ξ |        Eq. (15) can be demonstrated following similar derivations by the authors in Ref. [39], and full mathematical details are omitted for brevity.  Eq. (15) is the crucial equation for the sought variational formulation. Following in fact a previous study by the authors [39], consider the work identity  (19)   ∫ 0 L    F ¯  T  ( x ) u ( x ) d x +   F ¯  0 T   u 0  +   F ¯  L T   u L  +  A 2   ∫ 0 L   ∫ 0 L    q ~  T  ( x , ξ ) u ( x ) d x d ξ =  ∫ 0 L  (  s  ( l )   (   x ) )   T   ζ ( x ) d x   where  (20a-c)   F ¯  ( x ) =   [   F   x   ( x )    F   z   ( x )  0 ]  T      F ¯    i   =   [   N   i      T   i      M   i   ]  T  ,    u   i   =   [   u   i      v   i      φ   i   ]  T  ;  i = 0 , L      Taking into account Eqs. (15) and (19) can be rewritten as  (21)   ∫ 0 L    F ¯  T  ( x ) u ( x ) d x +   F ¯  0 T   u 0  +   F ¯  L T   u L  =  ∫ 0 L  (  s  ( l )   (   x ) )   T   ζ ( x ) d x +   A 2  2   ∫ 0 L   ∫ 0 L   q T  ( x , ξ ) e ( x , ξ ) d x d ξ      Based on Eq. (21) the following mechanically-consistent elastic potential energy function can be introduced  (22)  Φ ( ζ ( x ) , e ( x , ξ ) ) =  Φ  ( l )   ( ζ ( x ) ) +  Φ  ( n l )   ( e ( x , ξ ) ) = =  ∫ 0 L   ϕ  ( l )   ( ζ ( x ) ) d x +  1 2   ∫ 0 L   ∫ 0 L   ϕ  ( n l )   ( e ( x , ξ ) ) d x d ξ =  1 2   ∫ 0 L  ( ζ (   x ) )   T   D ⁎ ζ ( x ) d x +  1 4   ∫ 0 L   ∫ 0 L   e T  ( x , ξ ) G ( x , ξ ) e ( x , ξ ) d x d ξ      The first term   Φ   ( l )   ( ζ ( x ) ) in Eq. (22) is the local elastic potential energy associated with the local stress resultants, the second term   Φ   ( n l )   ( e ( x , ξ ) ) is the elastic potential energy associated with the long-range volume forces/moments, where the contributions of the axial, bending and shear deformation modes are clearly distinguishable. In Eq. (22),   ϕ   ( l )   ( ζ ( x ) ) and   ϕ   ( n l )   ( e ( x , ξ ) ) are the local and nonlocal elastic potential energies per unit length, and it can readily be recognized that differentiating   ϕ   ( l )   ( ζ ( x ) ) and   ϕ   ( n l )   ( e ( x , ξ ) ) with respect to the pertinent state variables leads to the constitutive Eqs. (2a) and (17), i.e.  (23)   s  ( l )   ( x ) =   ∂  ϕ  ( l )     ∂ ζ   =  D ⁎  ζ ( x ) ;  q ( x , ξ ) =   ∂  ϕ  ( n l )     ∂ e   = G ( x , ξ ) e ( x , ξ ) .      Introducing the external work W ( u ( x ) ) as  (24)  W ( u ( x ) ) =  ∫ 0 L      F ¯   T  ( x ) u ( x ) d x  +    F ¯    0   T     u   0   +    F ¯    L   T     u   L   ,   the following total elastic potential energy functional can be defined  (25)  Π ( u ( x ) , ζ ( x ) , e ( x , ξ ) ) = Φ ( ζ ( x ) , e ( x , ξ ) ) − W ( u ( x ) )      By applying standard rules of variational calculus and performing integration by parts, it can be seen that the Euler–Lagrange equations and the associated natural B.C. derived from the total elastic potential energy functional (25) coincide with the equilibrium equations (11) and the mechanical B.C. in Eq. (12), introduced in Section 3 on a mechanical basis. This result demonstrates the variational consistency of the proposed nonlocal TM beam model. In this regard, it is remarkable that the local nature of the mechanical B.C. in Eq. (12) can be derived also on a variational basis.  Following a standard approach of the FE method, consider a mesh with n disjointed elements along the beam axis, as shown in Fig. 4. Points shared by adjacent elements are defined as mesh nodes;    x ^    i   and    x ^    i + 1   represent the abscissas of the nodes of the ith element, with    x ^    1   = 0 and    x ^    n + 1   = L (symbol “ ^ ” is introduced to avoid confusion with abscissas x  i ’s used in Section 2); l denotes the length of the ith element. The displacement field within the ith element is given the following form  (26)    u   i   ( x ) =   N   i   ( x )   d   i    i = 1 , 2 , .. . , n   where   u   i   ( x ) is the vector of displacements u ( x ) , Eq. (1d), within the ith element, d  i is the vector of the unknown nodal displacements of the ith element, i.e.  (27)    d   i   =   [   u   ( i ) 1      v   ( i ) 1      φ   ( i ) 1      u   ( i ) 2      v   ( i ) 2      φ   ( i ) 2   ]  T       In Eq. (27), subscript “(i)” indicates the ith element, while subscripts 1–2 the first and the second node of the element, as shown in Fig. 4. In Eq. (26),   N   i   ( x ) is the matrix collecting the shape functions. In this paper, they are taken as the standard 1st order and 3rd order polynomial shape functions of the two-node TM beam element [50], for the axial and flexural response respectively. That is, the elements of   N   i   ( x ) are  (28)   N i T  ( x ) =         x ^   i + 1   − x  l    0   0     0     ( l −  y i  ) (  l 2  ( 1 + 12 Ω ) + ( l − 2  y i  )  y i  )    l 3  ( 1 + 12 Ω )       6  y i  ( − l +  y i  )    l 3  ( 1 + 12 Ω )       0     ( l −  y i  ) ( l + 6 l Ω −  y i  )  y i     l 2  ( 1 + 12 Ω )       ( l + 12 l Ω − 3  y i  ) ( l −  y i  )    l 2  ( 1 + 12 Ω )         y i  l    0   0     0      y i  ( 12  l 2  Ω + 3 l  y i  − 2  y i 2  )    l 3  ( 1 + 12 Ω )       6 ( l −  y i  )  y i     l 3  ( 1 + 12 Ω )       0   −   ( l −  y i  )  y i  ( 6 l Ω +  y i  )    l 2  ( 1 + 12 Ω )        y i  ( 2 l ( − 1 + 6 Ω ) + 3  y i  )    l 2  ( 1 + 12 Ω )         where   y   i   = x −    x ^    i   and Ω =  E ⁎  I / (  G ⁎   K s  A  l 2  ) , (l is the length of the ith element).  Upon replacing Eq. (26) for the displacement functions in Eq. (22), it is possible to define the quote part of elastic potential energy associated with the ith element, given as  (29)   Φ i  =  d i T     ∫   x ^  i    x ^   i + 1    (  B i  (   x ) )   T   D ⁎  B i  ( x ) d x    d i  +   A 2  4   ∑  j = 1  n   ∫   x ^  i    x ^   i + 1     ∫   x ^  j    x ^   j + 1    (  e  i j   ( x ,   ξ ) )   T   G ( x , ξ )  e  i j   ( x , ξ ) d ξ d x   where x varies within the ith element,    x ^    i   ≤ x ≤    x ^    i + 1   , and ξ varies within the jth element,    x ^    j   ≤ ξ ≤    x ^    j + 1   ; further, d V ( x ) = A d x and d V ( ξ ) = A d ξ for the differential volumes within the ith and jth elements. The first term on the r.h.s. of Eq. (29) is the classical local term, where D* is the constitutive matrix given by Eq. (2c), while   B   i   ( x ) is a 6×6 matrix with elements given as  (30)    B   i   T   ( x ) =  [      −  1 l     0   0     0      6 ( − 2   l  2  Ω − l   y   i   +   y   i   2   )     l  3  ( 1 + 12 Ω )       −   6 ( l − 2   y   i   )     l  3  ( 1 + 12 Ω )        0        l  2  ( 1 + 6 Ω ) − 4 ( l + 3 l Ω )   y   i   + 3   y   i   2       l  2  ( 1 + 12 Ω )         − 4 ( l + 3 l Ω ) + 6   y   i       l  2  ( 1 + 12 Ω )          1 l     0   0     0      6 ( 2   l  2  Ω + ( l −   y   i   )   y   i   )     l  3  ( 1 + 12 Ω )         6 ( l − 2   y   i   )     l  3  ( 1 + 12 Ω )        0      − 6   l  2  Ω + 2 l ( − 1 + 6 Ω )   y   i   + 3   y   i   2       l  2  ( 1 + 12 Ω )         2 ( l ( − 1 + 6 Ω ) + 3   y   i   )     l  2  ( 1 + 12 Ω )        ]       In the second term on the r.h.s. of Eq. (29), the single integral  (31)    A 2  4   ∫   x ^  i    x ^   i + 1     ∫   x ^  j    x ^   j + 1    (  e  i j   ( x ,   ξ ) )   T   G ( x , ξ )  e  i j   ( x , ξ ) d ξ d x   represents the elastic potential energy associated with the long-range interactions between the differential volumes d V ( x ) inside the ith element (    x ^    i   ≤ x ≤    x ^    i + 1   ) , and the differential volumes d V ( ξ ) inside the jth element (    x ^    j   ≤ ξ ≤    x ^    j + 1   ) , with vector   e   i j   ( x , ξ ) given as  (32)    e   i j   ( x , ξ ) =   [   η   i j   ( x , ξ )    θ   i j   ( x , ξ )    ψ   i j   ( x , ξ ) ]  T       In Eq. (32),  (33a)    η   i j   ( x , ξ ) =   N   j   ( u )   ( ξ )   d   j   −   N   i   ( u )   ( x )   d   i        (33b)    θ   i j   ( x , ξ ) =   N   j   ( φ )   ( ξ )   d   j   −   N   i   ( φ )   ( x )   d   i        (33c)    ψ   i j   ( x , ξ ) = 2     N   j   ( v )   ( ξ )   d   j   −   N   i   ( v )   ( x )   d   i     ξ − x   −   N   j   ( φ )   ( ξ )   d   j   −   N   i   ( φ )   ( x )   d   i        In Eq. (33), d  j and d  i are the vectors of nodal displacements of the jth and ith elements, while   N   i   ( u )   ,   N   i   ( v )   and   N   i   ( φ )   are row vectors of the shape functions matrix N  i , i.e.  (34a)   N i  ( u ) T   ( x ) =  1 l        x ^   i + 1   − x     0     0      y i      0     0          (34b)   N i  ( v ) T   ( x ) =  1   l 3  ( 1 + 12 Ω )       0     ( l −  y i  ) (  l 2  ( 1 + 12 Ω ) + ( l − 2  y i  )  y i  )     l ( l −  y i  ) ( l + 6 l Ω −  y i  )  y i      0      y i  ( 12  l 2  Ω + 3 l  y i  − 2  y i 2  )     − l ( l −  y i  )  y i  ( 6 l Ω +  y i  )          (34c)   N i  ( φ ) T   ( x ) =  1   l 3  ( 1 + 12 Ω )       0     6  y i  ( − l +  y i  )     l ( l + 12 l Ω − 3  y i  ) ( l −  y i  )     0     6 ( l −  y i  )  y i      l  y i  ( 2 l ( − 1 + 6 Ω ) + 3  y i  )          Hence, the summation over j = 1 , 2 , .. . , n on the r.h.s. of Eq. (29) yields the elastic potential energy associated with the long-range interactions between the differential volumes d V ( x ) inside the ith element, and all the differential volumes d V ( ξ ) along the beam axis. Likewise, the quote parts of external work and kinetic energy associated with the ith FE are given as  (35)   W i  = (    ∫   x ^  i    x ^   i + 1      F ¯  T   N i  ( x ) d x   )  d i  +  δ  i 1     F ¯  0 T   N i  ( 0 )  d i  +  δ  i n     F ¯  L T   N i  ( L )  d i       In Eq. (35),   δ   i 1   and   δ   i n   are Kronecker’s deltas, introduced to ensure that the second and third terms on the r.h.s. of Eq. (35) are nonzero only when the ith element is the first or the last of the mesh, because   δ   i 1   = 1 for i=1 and   δ   i 1   = 0 for i≠1,   δ   i n   = 1 for i=n and   δ   i 1   = 0 for i≠n. As a result, functional Π in Eq. (25) takes the approximate form  (36)  Π ≈  ∑  i = 1  n     Φ   i   −   W   i         At this stage, upon introducing vector d =     u 1    v 1    φ 1    u 2    v 2    φ 2  ... .  u  n + 1     v  n + 1     φ  n + 1      T   collecting the displacements of all nodes of the mesh, the nodal displacements of the ith element are written as  (37)    d   i   =   C   i   d   where C  i is the connectivity matrix. Upon replacing Eq. (37) for d  i in Eq. (29), and taking account of Eq. (32) for   e   i j   ( x , ξ ) , the quote part of elastic potential energy associated with the ith element is  (38)    Φ   i   =  1 2    d  T  (   K   i   ( l )   +   K   i   ( n l )   ) d   where  (39)   K i  ( l )   =  ∫   x ^  i    x ^   i + 1    (  B i  ( x )   C   i   ) T   D  B i  ( x )  C i  d x   and  (40)    K   i   ( n l )   =   K   i   ( n l , η )   +   K   i   ( n l , θ )   +   K   i   ( n l , ψ )        In Eq. (40),  (41a-c)   K i  ( n l , η )   =  ∑  j = 1  n   K  i j   ( n l , η )   ;   K i  ( n l , θ )   =  ∑  j = 1  n   K  i j   ( n l , θ )   ;   K i  ( n l , ψ )   =  ∑  j = 1  n   K  i j   ( n l , ψ )     where  (42)   K  i j   ( n l , η )   =   A 2  2   ∫   x ^  i    x ^   i + 1     ∫   x ^  j    x ^   j + 1    (  N j  ( u )   ( ξ )  C j  d −  N i  ( u )   ( x )  C i    d )   T   G ( x , ξ )  (  N j  ( u )   ( ξ )  C j  d −  N i  ( u )   ( x )  C i  d ) d ξ d x      (43)   K  i j   ( n l , θ )   =   A 2  2   ∫   x ^  i    x ^   i + 1     ∫   x ^  j    x ^   j + 1    (  N j  ( φ )   ( ξ )  C j  d −  N i  ( φ )   ( x )   C i     d )   T   G ( x , ξ ) (  N j  ( φ )   ( ξ )  C j  d −  N i  ( φ )   ( x )  C i  d ) d ξ d x      (44)   K  i j   ( n l , ψ )   =   A 2  2   ∫   x ^  i    x ^   i + 1     ∫   x ^  j    x ^   j + 1       2    N j  ( v )   ( ξ )  C j  d −  N i  ( v )   ( x )  C i  d   ξ − x   −  N j  ( φ )   ( ξ )  C j  d −  N i  ( φ )   ( x )  C i  d )    T   G ( x , ξ )   2    N j  ( v )   ( ξ )  C j  d −  N i  ( v )   ( x )  C i  d   ξ − x   −  N j  ( φ )   ( ξ )  C j  d −  N i  ( φ )   ( x )  C i  d   d ξ d x      Notice that   K   i j   ( n l , η )   ,   K   i j   ( n l , θ )   ,   K   i j   ( n l , ψ )   include the nonlocal stiffness contributions due to the long-range interactions between the ith and the jth element of the mesh. The size is 3(n+1)×3(n+1), i.e. the same size of the global stiffness matrix.  Further, the quote part of external work associated with the ith element is  (45)    W   i   =   (   F   i   )  T  d   where  (46)   F i  =  ∫   x ^  i    x ^   i + 1      (  N i  ( x )   C   i   )   T    F ¯  ( x ) d x +  δ  i 1     (  N i  ( 0 )   C   i   )   T     F ¯  0  +  δ  i n     (  N i  ( L )   C   i   )   T     F ¯  L       Based on Eq. (38) for   Φ   i   and Eq. (45) for W  i , functional Π in Eq. (36) reads  (47)  Π = Π ( d ) ≈  1 2    d  T  (   K   ( l )   +   K   ( n l )   ) d −   F  T  d   where  (48)  F =  ∑  i = 1  n     F   i         (49a,b)   K  ( l )   =  ∑  i = 1  n    K ¯  i  ( l )   ;      K  ( n l )   =  ∑  i = 1  n   K i  ( n l )   =  ∑  j = 1  n   ∑  i = 1  n   K  i j   ( n l , η )   +  K  i j   ( n l , θ )   +  K  i j   ( n l , ψ )        Enforcing the stationary condition of functional Π in Eq. (47) leads to the following motion equations  (50)  (   K   ( l )   +   K   ( n l )   ) d = F      A few remarks on the so-derived FE formulation are in order. The local stiffness matrix K (l) coincides with the stiffness matrix of the two-node TM beam element with 1st and 3rd order polynomial shape functions for the axial and flexural responses respectively, as long as β 1=1 in the local constitutive Eq. (2a). The nonlocal stiffness matrix K (nl) is a fully populated, symmetric and positive-definite matrix. Positive-definition follows from the fact that the nonlocal TM beam model fulfills the Drucker stability principle over the whole beam axis, exactly as similar elastic continua with volume long-range interactions proposed by the authors [38].  To evaluate the elements of the nonlocal stiffness matrix K (nl) the integrals in Eqs. (42)–(44) shall generally be solved. The analytical form of the integrand functions involves the 1st and 3rd order polynomial shape functions and the attenuation functions of the long-range interactions. In Appendix A it will be shown that these integrals can be solved exactly for attenuation functions typically used in nonlocal continua, such as the exponential function or the power law function [31,38,44,49]. This is a very remarkable result, which allows a straightforward implementation of the FE method.  The numerical applications focus on the flexural response. First, to illustrate the behavior of the nonlocal TM beam model, the theoretical response of simply-supported and cantilever epoxy micro-beams with rectangular cross section will be presented. Hence, it will be shown that the nonlocal TM beam model can capture the experimental static response of a cantilever epoxy micro-beam with rectangular cross section subjected to a tip load, as reported by Lam et al. [13].  It will be assumed that pure bending and shear behaviors are governed by the same attenuation functions, i.e.   g   s   ( x , ξ ) = g ( x , ξ ) , s = x , z , φ . They will be given the following exponential form:  (51)  g ( x , ξ ) =  C    h  2    exp ( − | x − ξ | / λ )   where λ is an internal length. The larger is the internal length λ, the wider is the so-called influence distance, i.e. the maximum distance beyond which the attenuation functions and therefore the nonlocal effects become negligible. Further, in the local constitutive Eq. (2a)    β   1   = 1 is selected. As a result of this choice of β 1, the nonlocal solution will tend to the solution obtained by the classical local TM theory, as λ → 0 in g ( x , ξ ) given by Eq. (51).  Epoxy micro-beams with the following material properties are considered: Young’s modulus E = 1.40  GPa , Poisson’s coefficient ν = 0.35 , Ks =5/6 for rectangular cross section. The nonlocal parameters C and λ in Eq. (51) are set on a theoretical basis, in order to enhance nonlocal effects and assess how they affect the response. Specifically, C =   10   11    N    m   − 6   and different values of the internal length λ are considered.  The numerical solution is found by the FE method of Section 4. Numerical results will be obtained with a increasing number of elements, evaluating the terms nonlocal stiffness matrix K (nl) by the closed-form solutions in Appendix A.  A simply-supported epoxy micro-beam with rectangular cross section is considered; L=300μm, b=30μm and h=15μm are length, width and thickness of the cross section. A uniformly distributed load p=1Nm−1 is assumed.    Fig. 5 shows the ratio of the midpoint deflection v ( L / 2 ) =   v   max   to the corresponding classical local one   v   ( l )   ( L / 2 ) =   v   max   ( l )   , for different values of the internal length λ. It can be seen that the nonlocal deflection is smaller than the local counterpart. This stiffening effect can be explained by considering that the nonlocal model is a displacement-based model, where the elastic long-range interactions counteract the relative motion between non-adjacent beam segments; as such, they provide additional stiffness with respect to the stiffness of the classical local TM terms (β 1=1 has been set in Eq. (2a)). Fig. 5 also shows that the larger is the internal length λ, the smaller is the nonlocal deflection: in fact a larger internal length λ corresponds to a larger amount of mutually interacting non-adjacent beam segments, with a consequent stiffening of the solution.  To have a further insight into the response of the nonlocal TM beam model, Fig. 6 shows the nonlocal deflection to local deflection ratio,   v   max   /   v   max   ( l )   , versus the thickness to length ratio, h/L, for fixed values of L and b, i.e. L=300μm, b=30μm, different values of thickness h and internal length λ (10μm and 30μm). For a given value of λ, the smaller is h, the smaller is the ratio   v   max   /   v   max   ( l )   , i.e. the nonlocal effects become more significant and, consequently, the deviation from the corresponding classical local TM beam response. Again, such a behavior can be explained in recognition of the fact that the nonlocal TM beam model is displacement based: for L=cost and b=cost the deformability of the beam increases as h decreases, with a consequent increasing relative motion between the beam segments that produces an increasing “weight” of the nonlocal terms with respect to that of the local ones. Further, it can be noticed that larger deviations from the classical local response are encountered, as expected, for increasing values of the internal length λ. It is interesting to point out that the stiffening effect shown in Fig. 6, for L=cost and b=cost and decreasing h is predicted by other nonlocal theories [25].  Additional comments on the behavior of the proposed model can be made based on Fig. 7, which shows the nonlocal deflection to local deflection ratio,   v   max   /   v   max   ( l )   , versus the beam thickness, h, for fixed values of the ratio L/h=10, b=30μm, and different values of the internal length λ (10μm and 30μm). It can be seen that the smaller is h (i.e. the smaller is also L, being L/h=cost), the smaller is the nonlocal deflection, i.e. the nonlocal effects are more significant. Such a behavior, for a given value of the internal length λ, can be expected in consideration of the fact that L decreases with h (L/h=cost): as the beam becomes shorter while the internal length λ is fixed, each beam segment interacts with a relatively increasing number of beam segments (i.e., relatively to the total number of interacting beam segments) and, as a consequence, the “weight” of the nonlocal terms does increase with respect to that of the local ones. It can also be noted that larger deviations from the classical local response are encountered, as in Fig. 6, for increasing values of the internal length λ. It is interesting to point out that the stiffening effects shown in Fig. 7, for L/h=cost, b=cost, and decreasing h are generally considered in agreement with experimental evidence on small-size stiffening effects in several materials [13,14].  Results in Figs. 5–7 are obtained with n=10, n=20 and n=30 FEs. The solutions with n=20 and n=30 FEs are very close. A further refinement of the mesh does not lead to noticeable differences with respect to the solutions with n=30 FEs. It is important to remark that the FE solution with n=30 FEs coincides with a FD solution with N≥800 grid points, which can readily be implemented as explained by Di Paola et al. [35]. However, the FE solution is significantly less time consuming, because the closed-form expressions in Appendix A can be used to evaluate the elements of the nonlocal stiffness matrix K (nl).  A final remark concerns the fact that, for some values of thickness to length ratio h/L in Fig. 6, and thickness h in Fig. 7, the ratio   v   max   /   v   max   ( l )   is greater than 1 when n=10 FEs are used. This result shall be attributed only to the fact that n=10 FEs are not sufficient to compute an accurate nonlocal response, and not to softening effects with respect to the classical local solution. As explained earlier, the nonlocal TM beam model gives stiffer solutions than the corresponding local ones, when β 1=1 in Eq. (2a). This is confirmed by the FE solutions with n=20 and n=30 FEs, reported in Figs. 6 and 7.  For comparison, Figs. 5–7 include also the results obtained by the previous nonlocal TM beam model proposed by the authors in Ref. [41]. Because the beam cross section is doubly symmetric, the equilibrium equations are Eq. (38) of Ref. [41]; β 1=1 is selected for the local terms in Eq. (38) of Ref. [41], and the exponential function (51) of this paper is taken as attenuation function g ( x , ξ ) in Eq. (40) of Ref. [41], assuming in this case C=1023 (otherwise nonlocal effects would not be noticeable). Numerical solutions are built by the FD method. Fig. 5 shows that the solution obtained by the model of Ref. [41] is qualitatively similar to the solution obtained by the model of this paper, with stiffening effects explainable based on the considerations made earlier on the model of this paper: that is, the model of Ref. [41] is a displacement-based model and, because β 1=1 has been set in the local terms, the elastic long-range resultants in Eq. (38) of Ref. [41] yield stiffening effects with respect to the classical local solution. However, Figs. 6 and 7 show that some differences exist with respect to the model of this paper, because stiffening effects become gradually less as h decreases beyond a certain threshold, both for L=cost, b=cost in Fig. 6, and for L/h=cost, b=cost in Fig. 7. These results can be interpreted observing that, on one hand, the model of Ref. [41] is displacement based like the model of this paper and, as such, stiffening effects should increase for L=cost, b=cost and decreasing h in Fig. 6 (the deformability of the beam increases), and increase also for L/h=cost, b=cost and decreasing h in Fig. 7 (for L/h=cost, the beam shortens with decreasing h, while the internal length λ is fixed). On the other hand it shall be kept in mind that, in the model of Ref. [41], reducing the thickness h of the cross section affects amount and directions of the long-range elementary forces between elementary volumes (for instance, see Fig. 11 in Ref. [35]). Results in Figs. 6 and 7 are evidence that, as the thickness h decreases beyond a certain threshold, variations in amount and directions of the elementary long-range forces result indeed in a softening effect, and that such a softening gradually counteracts the stiffening effects due to the fact that the model is displacement based. It is then apparent that the model of Ref. [41] does not predict stiffening effects that always increase with a reducing size, as the model of this paper and alternative nonlocal theories in the literature [13,14,25].  A cantilever epoxy micro-beam with rectangular cross section is considered; L=300μm, b=30μm, h=15μm are taken for length, width and thickness of the cross section. It is assumed that the beam is subjected to a tip load P=100μN.      Figs. 8–10 show: (i) the ratio   v   max   /   v   max   ( l )   , where   v   max   = v ( L ) ,   v   max   ( l )   =   v   ( l )   ( L ) , for different values of internal length λ (Fig. 8); (ii) the ratio   v   max   /   v   max   ( l )   versus h/L (Fig. 9), for fixed values L=300μm, b=30μm, different values of thickness h and internal length λ (10μm and 30μm); (iii) the ratio   v   max   /   v   max   ( l )   versus h (Fig. 10), for fixed values of the ratio L/h=10, b=30μm and different values of internal length λ (10μm and 30μm). All the results appear in agreement with those obtained for a simply-supported beam. They can be explained based upon the same reasoning and, for this, further comments are omitted for brevity. It is worth remarking only that similar behaviors are predicted by alternative nonlocal theories and are generally considered in agreement with small-size stiffening effects in many materials [13,14,25].  In this case, results in Figs. 8–10 are obtained with n=1, n=20 and n=30 FEs. The three solutions cannot be distinguished, and no noticeable differences are encountered with a further refinement of the mesh. The same results can be obtained by the FD method with N≥800 grid points [35]. From the fact that even n=1 FE is sufficient to obtain an accurate result it may be inferred that, in this case, a 3rd order polynomial does give a very satisfactory prediction of the nonlocal response.  For comparison, Figs. 8–10 include the results obtained by the nonlocal TM beam model of Ref. [41], with same parameters/functions used in Section 5.1.1: that is, β 1=1 is set in Eq. (38) of Ref. [41], and Eq. (51) of this paper is taken as attenuation function g ( x , ξ ) in Eq. (40) of Ref. [41], assuming C=1023. Fig. 8 shows that the model of Ref. [41] predicts stiffening effects, in agreement with the model of this paper. However, considering the behavior for varying thickness h, it can be seen that stiffening effects diminish as h decreases beyond a certain threshold for L/h=cost, b=cost in Fig. 10, while stiffening effects always increase for L=cost, b=cost and decreasing h in Fig. 9. Results in Fig. 9 are evidence that, as the thickness h decreases, variations of amount and directions of the long-range elementary forces between elementary volumes do not yield, in this case, a softening effect capable of counteracting the stiffening effects due to the fact that the model is displacement based. At any rate, based on the whole set of results in Figs. 6 and 7 and Figs. 9 and 10, it is evident that the model of this paper is, for robustness and predictability of the results, certainly more appropriate than the model of Ref. [41] for capturing stiffening effects that always increase with a reducing size, in agreement with alternative nonlocal theories in the literature [13,14,25].  Lam et al. [13] have reported the experimental response of a cantilever epoxy micro-beam with a rectangular cross section, subjected to a tip static load P. The following parameters have been considered [13,27]: b=0.235mm, E=1.44GPa, ν=0.38 (Poisson’s coefficient), P=300μN. The response has been measured for a fixed ratio L/h=10 and four different thickness values h: 20, 38, 75 and 115μm. The results reported by Lam et al. [13] show that the experimental bending rigidity of the beam increases as the thickness decreases. Lam et al. [13] have pointed out that this stiffening effect is not predicted by the classical EB beam theory, where the bending rigidity is constant when the ratio L/h is held constant.  In order to fit the experimental results reported in [13], the parameters/functions defining the proposed TM nonlocal beam model are selected as follows: (i) β 1=1 in the local terms in Eqs. (11b) and (11c), i.e. the local stiffness coincide with the stiffness of the classical TM theory; in this manner, the sought nonlocal solution will be stiffer than the local solution, consistently with the experimental behavior reported by Lam et al. [13]; (ii) the attenuation functions   g   φ   ( x , ξ ) and   g   z   ( x , ξ ) governing pure bending and pure shear nonlocal effects are given the exponential form (51). Since β 1=1 and owing to the exponential form (51) of the attenuation functions, the sought nonlocal solution will revert to the classical local TM beam solution as λ → 0 (in this respect, see comments at the beginning of Section 5).  Under these assumptions, the unknown parameters left are C and λ in Eq. (51). To determine these parameters an error minimization procedure is carried out, based on the experimental data reported in Fig. 12 of [13]. They describe the ratio of the experimental bending rigidity to the classical bending rigidity of the EB beam theory, computed by Lam and coworkers as the ratio of the tip displacement of the classical EB beam theory   v   ( l )   ( L ) to the experimental tip displacement   v   e x   ( L ) (see pag. 1503 of the paper by Lam et al. [13]), i.e. as  (52)    R   e x   =     v   ( l )   ( L )     v   e x   ( L )   .      Hence, in the error minimization procedure the sought values of C and λ are computed as those that minimize, for the different thicknesses (20, 38, 75 and 115μm) in Fig. 12 of [13], the squared difference between R  ex , Eq. (52), and  (53)    R   t h   =     v   ( l )   ( L )   v ( L )   ,   where v(L) is the tip displacement predicted by the nonlocal TM beam model. As in Section 5.1, the latter is computed by the FE method, with n=30 elements. For completeness it is observed that, in Fig. 12 of the paper by Lam et al. [13], a few experimental data are reported for each thickness (20, 38, 75 and 115μm). However since they appear very close, for each thickness their average value will be assumed as reference value in the error minimization procedure.  The results are reported in Fig. 11. A very good agreement between the experimental bending rigidity ratios and those predicted by the proposed nonlocal beam model is attained for C = 3.17 ×   10   11    N    m   − 6   and λ=30μm in Eq. (51). Fig. 11 includes the results obtained also for two alternative sets of C, λ (Set II: C = 1.8 ⋅   10   11    N    m   − 6   , λ=30μm; Set III: C = 1.8 ⋅   10   11    N    m   − 6   , λ=40μm), in order to show that even for different sets of parameters, the qualitative behavior of the nonlocal TM beam model still reflects the trend of the experimental data.   CONCLUSIONS   Recently, a nonlocal TM beam model has been proposed by the authors [35] based on the key idea that nonlocal effects can be modeled as linearly-elastic long-range volume forces/moments exchanged by non-adjacent beam segments, that contribute to the equilibrium of any beam segment along with the classical stress resultants. In this paper, the equilibrium equations of the nonlocal TM beam model, along with the pertinent B.C., have been derived within a variational framework based on a consistent total elastic potential energy functional, which involves local and nonlocal contributions. The variational framework has been used to a build a FE solution of the nonlocal TM beam model, with standard polynomial shape functions of the classical two-node TM beam element. A local and a nonlocal stiffness matrix contribute to the global stiffness matrix. While the local stiffness matrix coincide with the classical stiffness matrix for two-node TM beam elements, the nonlocal stiffness matrix K (nl) is obtained as the sum of component matrices, each related to the long-range interactions between a couple of FEs. For typical attenuation functions of the nonlocal effects, exact closed-form expressions can be derived to evaluate the terms of the nonlocal stiffness matrix, with a consequent significant reduction of the computational costs. Examples have been given in Appendix A for exponential and power-law attenuation functions.  A certain number of parameters/functions shall be set in the proposed model, concerning the local terms, see β 1 in Eq. (2a), as well as nonlocal terms, namely the attenuation functions   g   x   ( x , ξ ) ,   g   φ   ( x , ξ ) ,   g   z   ( x , ξ ) with the related parameters, for which several examples exist in the literature [31,38,44,49]. In practical applications, these parameters/functions shall generally be determined via an optimization procedure, where a fitting to experimental data is sought. It is worth remarking that a similar procedure is not needed in the proposed model only, but is inevitable in all classical nonlocal theories involving an enriched continuum with additional nonlocal terms. Depending on the formulation, the nonlocal terms always involve a number of unknown parameters/functions that only experimental evidence may allow to select. Examples of enriched continua with five additional parameters for nonlocal terms exist in the literature [13,51], or nonlocal beam models with different potential choices of the attenuation functions [31,49]. Obviously, any optimization procedure to fit experimental evidence shall be generally preceded by numerical simulations, which may serve to determine the expected order of magnitude of the nonlocal terms, with respect to the local ones.  The numerical results have shown stiffening effects with respect to the classical local TM beam solution and, in this respect, they have been found consistent with those obtained by alternative nonlocal theories [13,14,25]. Also, it has been seen that the nonlocal TM beam model captures very satisfactorily the experimental small-size stiffening effects reported by Lam et al. [13], for a cantilever epoxy micro-beam subjected to a tip static load. In all the applications β 1=1 has been set in the local terms (see Eq. (2a)) and exponential attenuation functions have been selected, depending on an internal length λ governing the influence distance of nonlocal effects. In this manner, the nonlocal solution reverts to the classical local TM beam solution as λ → 0 .  This appendix illustrates the procedure to derive, in an exact closed form, the elements of the stiffness matrices   K   i j   ( n l )   , for i,j=1,2,…n, involved in Eq. (49b) for the nonlocal stiffness matrix K (nl).  Bearing in mind that the FEs are numbered from 1 to n, with the ith FE delimited by node i and i+1 at    x ^    i   and    x ^    i + 1   (see Section 4), every matrix   K   i j   ( n l )   is a 3(n+1)×3(n+1) matrix. Three cases can be distinguished:  (a) If the ith element and jth element have no node in common, 80 elements (in 12 rows, with 4 or 8 elements per row) will be nonzero in each matrix   K   i j   ( n l )   . These elements will be located in rows and columns pertaining to the degrees of freedom of the nodes of the ith and jth elements and, in particular: from the (3i−2)th row to the (3i+3)th row, and from the (3j−2)th row to the (3j+3)th row; from the (3i−2)th column to the (3i+3)th column, and from the (3j−2)th to the (3j+3)th column. That is, for each matrix   K   i j   ( n l )   , four 6×6 blocks shall be calculated, as shown in Fig. 12. In Fig. 12, elements a  k are the elements of matrix   K   i j   ( n l , η )   associated with long-range axial interactions, while elements b  k and c  k are given as the sum of the elements of matrices   K   i j   ( n l , θ )   and   K   i j   ( n l , ψ )   associated with long-range bending and shear interactions respectively, i.e.   b   k   =   b   k   ( θ )   +   b   k   ( ψ )   and   c   k   =   c   k   ( θ )   +   c   k   ( ψ )   .  If the ith element and jth element have one node in common, 45 elements (in 9 rows, with 3 or 6 elements per row) will be nonzero in each matrix   K   i j   ( n l )   . For instance, for i<j these elements will be located from the (3i−2)th row to the (3j+3)th row, and from the (3i−2)th column to the (3j+3)th column, as shown in Fig. 13. It is interesting to notice that the formal expressions of all the 45 nonzero elements can be derived from the formal expressions of the 80 nonzero elements in case (a), as shown in Fig. 13.  If the ith element and jth element coincide, 20 elements (in 6 rows, with 2 or 4 elements per row) will be nonzero in each matrix   K   i i   ( n l )   . These elements will be located from the (3i−2)th=(3j−2)th row to the (3i+3)th=(3j+3)th row, as shown in Fig. 14. Again, the formal expressions of all the 20 nonzero elements can be derived from the formal expressions of the 80 nonzero elements in case (a), as shown in Fig. 14.  The computation of the elements of matrices   K   i j   ( n l , d )   in Eq. (41), for d=η,θ,ψ, involves the solution of the double integrals in Eq. (42) through Eq. (44), defined over the coordinates x and ξ within the ith element and jth element, respectively. Herein, the following exponential and power-law attenuation functions are considered, as typical examples of attenuation functions in nonlocal continua [31,38,44,49]:  (A.1)  g ( x , ξ ) =   C   0   exp  (  −   | x − ξ |  λ   )       (A.2)  g ( x , ξ ) =   C   α   | x − ξ   |   − ( 1 + α )        For g ( x , ξ ) given as Eqs. (A.1) or (A.2), it is seen that the double integrals in Eq. (42) through Eq. (44) can readily be computed using the symbolic package Mathematica [52], in two steps: (1) first the corresponding indefinite integrals can be obtained, upon specifying whether x < ξ or x > ξ , because of the presence of the absolute value | x − ξ | in Eqs. (A.1) and (A.2); (2) once the indefinite integrals are derived, the following formula is applied:  (A.3)    K   i j   ( n l , d )   [ r , s ] = (   F   r s   ( d )   (    x ^    i + 1   ,    x ^    j + 1   ) −   F   r s   ( d )   (    x ^    i + 1   ,    x ^    j   ) ) − (   F   r s   ( d )   (    x ^    i   ,    x ^    j + 1   ) −   F   r s   ( d )   (    x ^    i   ,    x ^    j   ) )   where [r,s] denotes the generic matrix location (for instance, in Fig. 12 r ranges from 3i−2 to 3i+3 and from 3j−2 to 3j+3, s ranges from 3i−2 to 3i+3 and from 3j−2 to 3j+3), superscript d=η,θ,ψ and   F   r s   ( d )   ( x , ξ ) is the indefinite integral pertaining to the sought element   K   i j   ( n l , η )   [ r , s ] ,   K   i j   ( n l , θ )   [ r , s ] and   K   i j   ( n l , ψ )   [ r , s ] .  In the following, a few examples of indefinite integrals   F   r s   ( d )   ( x , ξ ) will be given.  For g ( x , ξ ) given by the exponential function (A.1), the indefinite integral   F   r s   ( η )   ( x , ξ ) associated with element a 1 in Fig. 12 is given as  (A.4)    F   r s   ( η )   ( x , ξ ) = −   C   0       e   − x + ξ / λ     λ  2  (   j  2    l  2  +   ξ  2  − 2 ξ λ + 2   λ  2  + 2 j l ( − ξ + λ ) )     l  2         The indefinite integral   F   r s   ( θ )   ( x , ξ ) associated with   b   1   ( θ )   is given as  (A.5)    F   r s   ( θ )   ( x , ξ ) =   C   0     36   e   − x + ξ / λ     λ  2      l  6    ( 1 + 12 Ω )  2    (   B   0   +   B   1   λ +   B   2     λ  2  +   B   3     λ  3  +   B   4     λ  4  )   where  (A.6a-e)    B   0   = −   ( − j l + ξ )  2    ( l − j l + ξ )  2  ,    B   1   = − 2 ( ( − 1 + 2 j ) l − 2 ξ ) ( ( − 1 + j ) l − ξ ) ( j l − ξ ) ,    B   2   = − 2 ( ( 1 + 6 ( − 1 + j ) j )   l  2  + 6 ( 1 − 2 j ) l ξ + 6   ξ  2  ) ,    B   3   = 12 ( l − 2 j l + 2 ξ ) ,    B   4   = − 24      Further, the indefinite integral   F   r s   ( ψ )   ( x , ξ ) associated with   b   1   ( ψ )   is given as  (A.7)    F   r s   ( ψ )   ( x , ξ ) =   C   0     2   e   − ( x / λ )     35   l  6  λ   ( 1 + 12 Ω )  2    (   B   5   +   B   6   λ +   B   7     λ  2  +   B   8     λ  3  +   B   9     λ  4  +   B   10     λ  5  +   B   11     λ  6  )   where  (A.8a)   B 5  = 2   e  x / λ    ( 140   j 6    l 6   ( x - ξ ) - 420   j 5    l 5   ( x - ξ )  ( l + x + ξ ) + 70  l  (  x 6  -  ξ 6  ) + 20  (  x 7  -  ξ 7  ) + 35   j 4    l 4   ( x - ξ )  ( 30  l  ( x + ξ ) + 20  (  x 2  + x  ξ +  ξ 2  ) +  l 2   ( 9 - 48  Ω ) ) + 630   l 3   ( -  x 4  +  ξ 4  )  Ω + 1680   l 4   (  x 3  -  ξ 3  )   Ω 2  - 21   l 2   (  x 5  -  ξ 5  )  ( - 3 + 16  Ω ) - 35  j  l  ( x - ξ )  ( 3  l  ( x + ξ ) + 2  (  x 2  + x  ξ +  ξ 2  ) - 12   l 2   Ω )  ( 3  l  (  x 2  +  ξ 2  ) + 2  (  x 3  +  ξ 3  ) - 12   l 2   ( x + ξ )  Ω ) + 70   j 3    l 3   ( 20  l  ( -  x 3  +  ξ 3  ) + 10  ( -  x 4  +  ξ 4  ) + 36   l 3   ( x - ξ )  Ω + 3   l 2   ( x - ξ )  ( x + ξ )  ( - 3 + 16  Ω ) ) + 210   j 2    l 2   ( 5  l  (  x 4  -  ξ 4  ) + 2  (  x 5  -  ξ 5  ) + 18   l 3   ( -  x 2  +  ξ 2  )  Ω + 24   l 4   ( x - ξ )   Ω 2  -  l 2   (  x 3  -  ξ 3  )  ( - 3 + 16  Ω ) ) )  Λ (   - x + ξ  λ  )      (A.8b)   B 6  = 2   e  ξ λ    ( 140   j 6    l 6  - 420   j 5    l 5   ( l + x + ξ ) + 70  l  ( x + ξ )  (  x 2  - x  ξ +  ξ 2  )  (  x 2  + x  ξ +  ξ 2  ) + 20  (  x 6  +  x 5   ξ +  x 4    ξ 2  +  x 3    ξ 3  +  x 2    ξ 4  + x   ξ 5  +  ξ 6  ) - 630   l 3   ( x + ξ )  (  x 2  +  ξ 2  )  Ω + 1680   l 4   (  x 2  + x  ξ +  ξ 2  )   Ω 2  - 21   l 2   (  x 4  +  x 3   ξ +  x 2    ξ 2  + x   ξ 3  +  ξ 4  )  ( - 3 + 16  Ω ) - 35  j  l  ( - 3  l  ( x + ξ ) - 2  (  x 2  + x  ξ +  ξ 2  ) + 12   l 2   Ω )  ( - 3  l  (  x 2  +  ξ 2  ) - 2  (  x 3  +  ξ 3  ) + 12   l 2   ( x + ξ )  Ω ) + 70   j 3    l 3   ( - 10  ( x + ξ )  (  x 2  +  ξ 2  ) - 20  l  (  x 2  + x  ξ +  ξ 2  ) + 36   l 3   Ω + 3   l 2   ( x + ξ )  ( - 3 + 16  Ω ) ) + 210   j 2    l 2   ( 5  l  ( x + ξ )  (  x 2  +  ξ 2  ) + 2  (  x 4  +  x 3   ξ +  x 2    ξ 2  + x   ξ 3  +  ξ 4  ) - 18   l 3   ( x + ξ )  Ω + 24   l 4    Ω 2  -  l 2   (  x 2  + x  ξ +  ξ 2  )  ( - 3 + 16  Ω ) ) - 35   j 4    l 4   ( - 30  l  ( x + ξ ) - 20  (  x 2  + x  ξ +  ξ 2  ) +  l 2   ( - 9 + 48  Ω ) ) ) + 35   e  x / λ    ( 8   j 6    l 6  - 24   j 5    l 5   ( l + x + ξ ) + 12  l  (  x 5  +  ξ 5  ) + 4  (  x 6  +  ξ 6  ) + 6   j 4    l 4   ( 10  l  ( x + ξ ) + 10  (  x 2  +  ξ 2  ) +  l 2   ( 3 - 16  Ω ) ) +  l 2   (  x 4   ( 9 - 60  Ω ) + 9   ξ 4   ( 1 - 4  Ω ) ) - 48   l 3   ( 2   x 3  +  ξ 3  )  Ω + 288   l 4    x 2    Ω 2  + 4   j 3    l 3   ( - 9   l 2   ( x + ξ ) - 30  l  (  x 2  +  ξ 2  ) - 20  (  x 3  +  ξ 3  ) + 12   l 2   ( 3  l + 5  x + 3  ξ )  Ω ) + 6   j 2    l 2   ( 20  l  (  x 3  +  ξ 3  ) + 10  (  x 4  +  ξ 4  ) +  l 2   (  x 2   ( 9 - 60  Ω ) + 9   ξ 2   ( 1 - 4  Ω ) ) - 24   l 3   ( 2  x + ξ )  Ω + 48   l 4    Ω 2  ) + 12  j  l  ( - 3   l 2   (  x 3  +  ξ 3  ) - 5  l  (  x 4  +  ξ 4  ) - 2  (  x 5  +  ξ 5  ) + 4   l 2   ( 5   x 3  + 3   ξ 3  + 3  l  ( 2   x 2  +  ξ 2  ) )  Ω - 48   l 4   x   Ω 2  ) )  Λ (   - x + ξ  λ  )      (A.8c)   B 7  =  e  ξ λ    ( 700   j 4    l 4   ( x - ξ ) + ( x - ξ )  ( 140  l  ( x + ξ )  ( 2   x 2  + x  ξ + 2   ξ 2  ) + 63   l 2   ( 3   x 2  + 4  x  ξ + 3   ξ 2  ) + 20  ( 5   x 4  + 8   x 3   ξ + 9   x 2    ξ 2  + 8  x   ξ 3  + 5   ξ 4  ) ) - 84   l 2   (  x 2   ( 25  l + 17  x ) + x  ( 10  l + 9  x )  ξ + ( - 5  l + x )   ξ 2  - 7   ξ 3  )  Ω + 3360   l 4   ( 2  x + ξ )   Ω 2  + 280   j 3    l 3   ( - 5  ( x - ξ )  ( l + x + ξ ) + 6   l 2   Ω ) - 210   j 2    l 2   ( - ( x - ξ )  ( 3   l 2  + 6   x 2  + 8  x  ξ + 6   ξ 2  + 10  l  ( x + ξ ) ) + 4   l 2   ( 3  l + 7  x - ξ )  Ω ) + 70  j  l  ( - ( x - ξ )  ( 9   l 2   ( x + ξ ) + 4  ( x + ξ )  ( 2   x 2  + x  ξ + 2   ξ 2  ) + 6  l  ( 3   x 2  + 4  x  ξ + 3   ξ 2  ) ) + 24   l 2   ( 3  x  ( l + x ) + x  ξ -  ξ 2  )  Ω - 144   l 4    Ω 2  ) )      (A.8d)   B 8  = -  e  ξ λ    ( - 70   j 4    l 4  + 140   j 3    l 3   ( l + 2  ξ ) + 140  l  (  x 3  - 3  x   ξ 2  +  ξ 3  ) + 10  ( 6   x 4  + 4   x 3   ξ - 6   x 2    ξ 2  - 24  x   ξ 3  + 13   ξ 4  ) + 840   l 3   ( - x + ξ )  Ω + 3360   l 4    Ω 2  + 140  j  l  ( - 3  l  x  ( x - 2  ξ ) - 2  (  x 3  - 3  x   ξ 2  +  ξ 3  ) + 12   l 2   ( x - 2  ξ )  Ω ) + 21   l 2   ( 3  ( x -   ξ )   2   - 4  ( 9   x 2  + 2  x  ξ - 21   ξ 2  )  Ω ) + 420   j 2    l 2   (  x 2  - 2  x  ξ + l  ( - ξ + 2  l  Ω ) ) )      (A.8e)   B 9  = 2   e  ξ λ    ( 140   j 3    l 3  - 210   j 2    l 2   ( l + 2  x ) + 210  l  ξ  ( - 2  x + ξ ) + 20  (  x 3  - 3   x 2   ξ - 18  x   ξ 2  + 13   ξ 3  ) + 420   l 3   Ω - 420  j  l  ( - l  x + ξ  ( - 2  x + ξ ) + 4   l 2   Ω ) - 21   l 2   ( 3  x - 3  ξ + 4  x  Ω - 84  ξ  Ω ) )      (A.8f)   B 10  = - 6   e  ξ λ    ( 140  ( - 1 + 2  j )  l  ( x - ξ ) - 20  ( x - ξ )  ( x + 13  ξ ) + 21   l 2   ( 1 + 28  Ω ) )      (A.8g)   B 11  = 120   e  ξ λ    ( ( 7 - 14  j )  l - 12  x + 26  ξ )      In Eq. (A.8) Λ(x) is the exponential integral function:  (A.9)  Λ ( x ) = −  ∫  − x  ∞      e   − t    t  d t      For g ( x , ξ ) given by the exponential function (A.1), all the indefinite integrals   F   r s   ( d )   ( x , ξ ) , for d=η,θ,ψ can be found by Mathematica [52], and further examples are omitted for brevity.  For g ( x , ξ ) given by the power law function (A.2), the indefinite integral   F   r s   ( η )   ( x , ξ ) associated with element a 1 in Fig. 12 is given as  (A.10)    F   r s   ( η )   ( x , ξ ) = −     C   α       l  2  ( − 3 + α ) ( − 2 + α ) ( − 1 + α ) α   (   ( x − ξ )   1 − α   ( 2   x  2  − 2 x ξ ( − 1 + α ) + 2 j l ( − 3 + α ) ( x + ξ − ξ α ) +   j  2    l  2  ( 6 − 5 α +   α  2  ) +   ξ  2  ( 2 − 3 α +   α  2  ) ) )      The indefinite integral   F   r s   ( θ )   ( x , ξ ) associated with   b   1   ( θ )   is given as  (A.11)    F   r s   ( θ )   ( x , ξ ) =   C   α     36   ( x − ξ )   1 − α   (   B   0   +   B   1   ξ +   B   2     ξ  2  +   B   3     ξ  3  +   B   4     ξ  4  )   (   l  6  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 2 + α ) ( − 1 + α ) α   ( 1 + 12 Ω )  2  )     where  (A.12a)    B   0   = − ( 2   x  2  ( 12   x  2  − 6 l x ( − 5 + α ) +   l  2  ( − 5 + α ) ( − 4 + α ) ) + 2 j l x ( 12   x  2  − 6 l x ( − 4 + α ) +   l  2  ( − 4 + α ) ( − 3 + α ) ) ( − 5 + α ) +   j  2    l  2  ( 12   x  2  − 6 l x ( − 3 + α ) +   l  2  ( − 3 + α ) ( − 2 + α ) ) ( − 5 + α ) ( − 4 + α ) +   j  4    l  4  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 2 + α ) − 2   j  3    l  3  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 2 ( l + x ) + l α ) )      (A.12b)    B   1   = ( 2 ( x ( 12   x  2  − 6 l x ( − 5 + α ) +   l  2  ( − 5 + α ) ( − 4 + α ) ) + j l ( 12   x  2  − 6 l x ( − 4 + α ) +   l  2  ( − 4 + α ) ( − 3 + α ) ) ( − 5 + α ) − 3   j  2    l  2  ( − 2 x + l ( − 3 + α ) ) ( − 5 + α ) ( − 4 + α ) + 2   j  3    l  3  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ) )      (A.12c)    B   2   = − ( 12   x  2  + 6 ( − 1 + 2 j ) l x ( − 5 + α ) + ( 1 + 6 ( − 1 + j ) j )   l  2  ( − 5 + α ) ( − 4 + α ) )      (A.12d)    B   3   = 4 x + 2 ( − 1 + 2 j ) l ( − 5 + α )      (A.12e)    B   4   = − 1      The indefinite integral   F   r s   ( ψ )   ( x , ξ ) associated with   b   1   ( ψ )   is given as  (A.13)    F   r s   ( ψ )   ( x , ξ ) =   C   α     4   ( x − ξ )   − 1 − α   (   B   5   +   B   6   ξ +   B   7     ξ  2  +   B   8     ξ  3  +   B   9     ξ  4  +   B   10     ξ  5  +   B   11     ξ  6  )   (   l  6  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 2 + α ) ( − 1 + α ) α ( 1 + α ) ( 2 + α )   ( 1 + 12 Ω )  2  )     where  (A.14a)    B   5   = − ( 4   j  6    l  6  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 2 + α ) ( − 1 + α ) α − 12   j  5    l  5  ( l + x ) ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 2 + α ) × ( − 1 + α ) α + 6   j  3    l  3  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( x ( − 3   l  2  ( − 2 + α ) ( − 1 + α ) α + 2   x  2  ( − 3 + α ) ( − 2 + 3 α ) − l x ( − 3 + α ) × ( − 2 + α ) ( − 2 + 3 α ) ) + 4   l  2  ( − 2 + α ) ( − 1 + α ) ( − 2 x + 3 ( l + x ) α ) Ω ) + 3   j  4    l  4  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) × ( − 2 + α ) ( 10 l x ( − 1 + α ) α +   x  2  ( − 3 + α ) ( − 2 + 3 α ) −   l  2  ( − 1 + α ) α ( − 3 + 16 Ω ) ) + 18 j l x ( − 5 + α ) × ( − 3 + α ) ( 4   x  4  ( − 2 + 3 α ) − 2 l   x  3  ( − 4 + α ) ( − 2 + 3 α ) − 8   l  3  x ( − 4 + α ) ( − 2 + α ) ( − 1 + α ) Ω + 16   l  4  ( − 4 + α ) ( − 2 + α ) × ( − 1 + α )   Ω  2  +   l  2    x  2  ( − 4 + α ) ( 2 − 16 Ω + α ( − 3 + α + 24 Ω ) ) ) + 18   x  2  ( 4   x  4  ( − 3 + α ) ( − 2 + 3 α ) − 2 l   x  3  ( − 5 + α ) ( − 3 + α ) × ( − 2 + 3 α ) − 8   l  3  x ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 1 + α ) Ω + 16   l  4  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 2 + α )   Ω  2  +   l  2    x  2  ( − 5 + α ) ( − 4 + α ) ( 2 − 16 Ω + α ( − 3 + α + 24 Ω ) ) ) + 9   j  2    l  2  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( 4   x  4  ( − 2 + 3 α ) − 2 l   x  3  ( − 3 + α ) ( − 2 + 3 α ) − 8   l  3  x ( − 2 + α )   ( − 1 + α )  2  Ω + 16   l  4  ( − 2 + α ) ( − 1 + α ) α   Ω  2  +   l  2    x  2  ( − 2 + α ) ( 2 − 16 Ω + α ( − 3 + α + 24 Ω ) ) ) )      (A.14b)    B   6   = ( 6 ( 2   j  5    l  5  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 2 + α ) ( − 1 + α ) α −   j  4    l  4  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 2 + α ) ( 5 l ( − 1 + α ) α + x ( − 6 + α + 7   α  2  ) ) + 3   j  2    l  2  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( x ( 1 + α ) ( − 2   l  2  ( − 2 + α ) ( − 1 + α ) + 2   x  2  ( − 2 + 3 α ) − l x ( − 3 + α ) ( − 2 + 3 α ) ) + 4   l  2  ( − 2 + α ) ( l ( − 1 + α ) ( 1 + 2 α ) + x ( − 2 + α + 3   α  2  ) ) Ω ) −   j  3    l  3  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 2   x  2  ( − 3 + α ) ( 1 + α ) ( − 2 + 3 α ) − 2 l x ( − 2 + α ) ( 1 + α ) ( − 6 + 7 α ) +   l  2  ( − 2 + α ) ( − 1 + α ) ( − 3 α + 8 Ω + 20 α Ω ) ) + 3 j l ( − 5 + α ) ( − 3 + α ) ( 1 + α ) ( 4   x  4  ( − 2 + 3 α ) − 2 l   x  3  ( − 4 + α ) ( − 2 + 3 α ) − 8   l  3  x ( − 4 + α ) ( − 2 + α ) ( − 1 + α ) Ω + 16   l  4  ( − 4 + α ) ( − 2 + α ) ( − 1 + α )   Ω  2  +   l  2    x  2  ( − 4 + α ) ( 2 − 16 Ω + α ( − 3 + α + 24 Ω ) ) ) + 3 x ( 1 + α ) ( 4   x  4  ( − 3 + α ) ( − 2 + 3 α ) − 2 l   x  3  ( − 5 + α ) ( − 3 + α ) ( − 2 + 3 α ) − 8   l  3  x ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 1 + α ) Ω + 16   l  4  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 2 + α )   Ω  2  +   l  2    x  2  ( − 5 + α ) ( − 4 + α ) ( 2 − 16 Ω + α ( − 3 + α + 24 Ω ) ) ) ) )      (A.14c)    B   7   = − ( 3 (   j  4    l  4  ( − 5 + α ) ( − 4 + α )   ( − 3 + α )  2  ( − 2 + α ) ( − 2 + 3 α ) − 2   j  3    l  3  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( l ( − 3 + α ) ( − 2 + α ) × ( − 2 + 3 α ) + 2 x ( 1 + α ) ( 6 + α ( − 9 + 4 α ) ) ) + 6 j l ( − 5 + α ) ( − 3 + α ) ( x ( 1 + α ) ( −   l  2  ( − 4 + α ) ( − 2 + α ) ( − 1 + α ) + 2   x  2  × α ( − 2 + 3 α ) − l x ( − 4 + α ) α ( − 2 + 3 α ) ) + 4   l  2  ( − 4 + α ) α ( l ( − 2 + α ) ( − 1 + α ) + x ( − 2 + α + 3   α  2  ) ) Ω ) − 3   j  2    l  2  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 2   x  2  × α ( − 2 + α + 3   α  2  ) − 2 l x ( 1 + α ) ( 6 + α ( − 9 + 4 α ) ) +   l  2    ( − 2 + α )  2  ( 1 − α + 8 α Ω ) ) + 3 α ( 1 + α ) ( 4   x  4  ( − 3 + α ) ( − 2 + 3 α ) − 2 l   x  3  ( − 5 + α ) ( − 3 + α ) ( − 2 + 3 α ) − 8   l  3  x ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 1 + α ) Ω + 16   l  4  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 2 + α )   Ω  2  +   l  2    x  2  ( − 5 + α ) ( − 4 + α ) ( 2 − 16 Ω + α ( − 3 + α + 24 Ω ) ) ) ) )      (A.14d)    B   8   = − ( 2 ( − 6   x  3  ( − 3 + α ) α ( 1 + α ) ( − 2 + 3 α ) + 3 l   x  2  ( − 5 + α ) ( − 3 + α ) α ( 1 + α ) ( − 2 + 3 α ) + 2   j  3    l  3  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 18 + α ( 13 + α ) ) − 3   j  2    l  2  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) ( − 2 x ( − 6 + α ) ( 1 + α ) + l ( − 18 + α ( 13 + α ) ) ) + 36   l  3  ( − 5 + α ) ( − 4 + α ) ( − 3 + α ) α Ω − 3   l  2  x ( − 5 + α ) ( − 4 + α ) × ( 1 + α ) ( − 6 + α ( 3 − 8 Ω + 12 α Ω ) ) − 3 j l ( − 5 + α ) ( − 3 + α ) ( 2 l x ( − 6 + α ) ( − 4 + α ) ( 1 + α ) + 2   x  2  α ( − 2 + α + 3   α  2  ) +   l  2  ( − 4 + α ) ( 6 − 3 α + 4 α ( 10 + α ) Ω ) ) ) )      (A.14e)    B   9   = 3 ( − 2 ( − 1 + 2 j ) l x ( − 5 + α ) ( − 3 + α ) ( 1 + α ) ( 6 + α ) −   x  2  ( − 3 + α ) α ( 1 + α ) ( − 2 + 3 α ) + 2   l  2  ( − 5 + α ) ( − 4 + α ) ( − 3 + ( − 1 + j ) j ( − 3 + α ) ( 6 + α ) − 4 α ( 4 + α ) Ω ) )      (A.14f)    B   10   = 6 ( ( − 1 + 2 j ) l ( − 5 + α ) ( 6 + α ) + x ( 1 + α ) ( − 12 +   α  2  ) )      (A.14g)    B   11   = − ( 18 + α ( 7 + α ) )      As in the previous case, for g ( x , ξ ) given by the power law function (A.2), all the indefinite integrals   F   r s   ( d )   ( x , ξ ) , for d=η,θ,ψ can be found by Mathematica [52], and further examples are omitted for brevity.   REFERENCES", "highlights": "A finite element method is presented for a nonlocal Timoshenko beam model recently proposed by the authors. The model relies on the key idea that nonlocal effects consist of long-range volume forces and moments exchanged by non-adjacent beam segments, which contribute to the equilibrium of a beam segment along with the classical local stress resultants. The long-range volume forces/moments are linearly depending on the product of the volumes of the interacting beam segments, and their relative motion measured in terms of the pure beam deformation modes, through appropriate attenuation functions governing the spatial decay of nonlocal effects. In this paper, the beam model is reformulated within a variational framework involving a consistent total elastic potential energy functional. The latter serves as a basis to derive a suitable finite element formulation of the equilibrium equations. A local stiffness matrix and a nonlocal stiffness matrix contribute to the global stiffness matrix. While the local stiffness matrix is obtained by a standard assemblage of the classical element stiffness matrices, the nonlocal stiffness matrix is built as the sum of component matrices, each involving the stiffness of the long-range interactions between a couple of finite elements. A remarkable result is that, for most common attenuation functions of nonlocal effects, exact closed-form solutions can be found for every element of the nonlocal stiffness matrix. Numerical applications are presented for a variety of nonlocal parameters, including a comparison with experimental data."}