{"id": "S0168874X15001614", "article": "MAIN-TITLE Efficient coupled polynomial interpolation scheme for out-of-plane free vibration analysis of curved beams   HIGHLIGHTS          We use coupled field interpolation approach to avoid torsion and flexure locking.      We study out-of-plane vibration of Timoshenko & Euler–Bernoulli curved beam elements.      Performance of coupled and independent curved beam elements is evaluated.      The stiffness and consistent mass matrices do not produce any spurious constraints.      These finite element models perform consistently over all stiffness ratio regime.          KEYPHRASES   Finite element  Curved beam  Free vibration  Timoshenko beam  Euler–Bernoulli beam  Shear locking  Flexure locking  Torsion locking  Coupled polynomial field   The out-of-plane free vibration of curved beams exhibit coupled flexure and torsion behavior. The presence of the shear, flexure and torsion locking phenomena in the out-of-plane deformation of conventional curved beam finite element models [1,2] significantly influence their dynamic behavior. The conventional curved Timoshenko beam finite element model exhibit flexure and torsion locking in addition to shear locking, whereas Euler–Bernoulli beam model exhibit only torsion locking [2]. The severity of the flexure and torsion locking phenomena was shown to depend on the magnitude of flexure-to-torsion (EI/GJ) stiffness ratio. It was demonstrated that, the use of inconsistent torsion strain models produces spurious torsion strain energy and fail to simulate accurately the ‘torsionless flexure’ behavior when GJ⪢EI, leading to torsion locking. Similarly, the use of inconsistent flexure strain models produce spurious flexure strain energy and fail to simulate accurately the ‘flexureless torsion’ behavior when EI⪢GJ, leading to flexure locking.  Major research on the out-of-plane vibration analysis of curved beams mainly focused on developing models to accurately represent the dynamic characteristics [3–15]. Other studies focused on understanding the effect of shear deformation and rotary inertia on the frequency and mode shapes of thick and thin beams under constrained and unconstrained end conditions [16–19]. Recently, the authors [1,2], investigated flexure and torsion locking phenomena in out-of-plane deformation of Timoshenko and Euler–Bernoulli curved beams. Improved curved beam finite elements based on coupled displacement field methodology were proposed to alleviate these locking effects and to enhance the convergence rate. In the above papers, the authors have evaluated/examined performance of these proposed elements in the context of static analysis. However, the use of coupled shape functions derived based on the static equilibrium consideration, for computation of consistent element mass matrix for dynamic analysis is questionable and the performance of such a finite element is not obvious. The focus of the current paper is to verify and validate the applicability of the above coupled shape functions to dynamic analysis. The important aspect of the shape functions is that their coefficients are coupled, which however, do not introduce/produce any spurious modes even in the extreme limits of stiffness ratios. The efficacy of the consistent mass matrix is examined and ascertained in predicting the natural frequencies of curved arches under different boundary conditions. Also, the performance of the coupled models is compared with the conventional finite element models which are based on independent field interpolations. Further, the applicability and performance is verified in the shear, flexure and torsion locking regimes.  This article is organized as follows: In Section 2, the geometry and coordinate systems for a curved beam element are described and the finite element formulation based on Hamilton׳s principle is presented. In Section 3, the independent polynomial fields for conventional models are presented and the constraints are examined in the context of flexure and torsion locking. In Section 4, the displacement fields for coupled polynomial models are presented and the role of the coupled terms in eliminating locking is examined in detail. In Section 5, numerical studies are carried out to demonstrate the efficacy of the coupled models in predicting natural frequencies of curved beam structures under different end constraints. These models exhibit consistent performance over a wide range of flexure-to-shear (EI/GA) and flexure-to-torsion (EI/GJ) stiffness ratios and are inherently devoid of shear, flexure and torsion locking phenomena. Conclusions are presented in Section 6.  The geometry and coordinate system for a curved beam element of length 2L and radius of curvature R is shown in Fig. 1. A right-handed orthogonal curvilinear co-ordinate system s-y–z is used with its origin placed at the center of the element. The natural coordinate ξ along the circumferential direction is expressed as ξ = s / L .    The out-of-plane flexure, shear and torsion strain components in the curvilinear co-ordinate system are  (1)  κ = −   θ   z   ′   +     θ   s    R       (2)  γ = v ′ −   θ   z        (3)  τ =   θ   s   ′   +     θ   z    R    In the above equations, v is the transverse out-of-plane displacement, θ  z is the flexure rotation and θ  s is the torsional rotation of the cross-section. The prime (′) indicates the derivative with respect to the circumferential coordinate s.   The strain energy stored in the element is the sum of energies due to shear, flexure and torsion deformation and is written as  (4)    U   e   ( v ,   θ   z   ,   θ   s   ) =  1 2    ∫  − L  L   [  k G A    (  v ′ −   θ   z    )  2  + E   I   z     (  −   θ   z   ′   +     θ   s    R   )  2  + G J    (    θ   s   ′   +     θ   z    R   )  2   ]  d s   The terms in the square bracket represent the strain energy due to transverse shear deformation, bending and torsion respectively; E and G denote Young׳s modulus and shear modulus, respectively, k is the shear correction factor; and R is the radius of curvature of the beam element. The geometric parameters A, I  z and J denote the area, moment of inertia, and torsional constant for the cross-section, respectively.  The kinetic energy stored in the element consists of kinetic energy due to translation motion and rotary inertia due to bending and torsion is expressed as  (5)    T   e   ( v ,   θ   z   ,   θ   s   ) =  1 2    ∫  − L  L   [  ρ A    v ̇   2  + ρ   I   z      θ ̇    z   2   + ρ   I   s      θ ̇    s   2     ]  d s      Neglecting the work done by applied forces, the equation of motion is obtained by applying Hamilton׳s principle [20] as  (6)  0 =  ∫    t   1       t   2     δ  (  T − U  )   d t   Performing integration by parts we obtain the equation of motion as  (7)  M   q ¨  + K  q = 0   where q =   {  v     θ   z       θ   s    }  T  .  Assuming polynomial expressions for the field variables v, θ  z and θ  s as  (8)  v =  ∑  i = 1  l    v   i       ϕ   i   ,    θ   z   =  ∑  i = 1  m    θ   z i       ψ   i   ,    θ   s   =  ∑  i = 1  n    θ   s i       χ   i     and substituting in Eq. (7) we obtain the expressions for stiffness ‘K’ and mass ‘M’ as     K   i j   11   =  ∫  − L  L    [  G A   k   s     d   ϕ   i     d s     d   ϕ   j     d s    ]  d s  ,    K   i j   12   = −  ∫  − L  L    [  G A   k   s     d   ϕ   i     d s     ψ   j    ]  d s  =   K   j i   21     K   i j   22   =  ∫  − L  L    [  G  A   k   s     ψ   j     ψ   i   + G J     ψ   j    R      ψ   i    R  + E I   d   ψ   i     d s     d   ψ   i     d s    ]  d s    K   i j   23   =  ∫  − L  L    [  G J     ψ   j    R    d   χ   i     d s   + E I   d   ψ   i     d s       χ   i    R   ]  d s  =   K   j i   32   ,   K   i j   33   =  ∫  − L  L    [  G J   d   χ   j     d s     d   χ   i     d s   − E I     χ   j    R      χ   i    R   ]  d s  ,   K   i j   13   =   K   j i   31   = 0   M   i j   11   =  ∫  − L  L    [  ρ A    ϕ   j     ϕ   i    ]  d s  ,    M   i j   22   =  ∫  − L  L     [  ρ   I   z     ψ   j     ψ   i    ]  d s  ,   M   i j   33   =  ∫  − L  L    [  ρ   I   s     χ   j     χ   i    ]  d s       The elemental Eq. (7) are assembled to obtain global equations of motion. These second order ordinary differential equations are converted into an Eigenvalue problem by assuming harmonic motion as  (9)   [  K  −   ω  2  M  ]   q = 0   where ω are the eigenvalues and q are eigenvectors.  The accuracy and convergence characteristic of an element depends on the choice of the polynomial assumed for the field variables. Therefore, the selection of a proper displacement field for the element is of utmost important. In the following sections, for a two-noded curved beam element, the displacement fields for independent polynomial models and coupled polynomial models are examined for their effectiveness in flexure and torsion locking regimes.  In general, the conventional beam models assume independent polynomial approximation for the field variables. The order of polynomial depends on the accuracy and convergence requirement of the solution. Here we examine the consistency of the displacement field used in conventional Euler–Bernoulli (designated as EB) and Timoshenko (designated as TIMO) models in the flexure and torsion locking regimes.  The conventional out-of-plane Euler–Bernoulli beam element makes use of cubic interpolation for transverse displacement v, quadratic interpolation for flexure rotation   θ   z   = d v / d s and linear interpolation for torsion rotation   θ   s   as given below:  (10)  v =   a   3     ξ  3  +   a   2     ξ  2  +   a   1   ξ +   a   0   ,    θ   z   =   3   a   3    L    ξ  2  +   2   a   2    L  ξ +     a   1    L  ,    θ   s   =   a   4   ξ +   a   5        The consistency of this choice of displacement fields in the flexure and torsion locking regime in exhibiting the true behavior of flexureless-torsion and torsionless-flexure in the physical limits of stiffness ratios are examined next.  In the regime EI/GJ⪢1 flexure locking is significant [2], and for the element to be free of this locking, the flexure strain energy should tend to vanish in this stiffness ratio regime. This condition of vanishing flexure strain energy can be examined by expressing the flexure strain field in terms of Legendre polynomial coefficients. Substituting for θs and θz from Eq. (10) and expressing the flexure strain of Eq. (1), we get  (11)  κ =  (    2   a   2       L  2    +     a   5    R   )  +  (  −   6   a   3       L  2    +     a   4    R   )   ξ   Due to orthogonal property of Legendre polynomials and independent nature of the generalized coefficients, the condition of flexureless-torsion is satisfied if and only if the coefficients of the above equations independently tend to zero, leading to the following constraints:  (12.1)    2   a   2       L  2    +     a   5    R  → 0      (12.2)  −   6   a   3       L  2    +     a   4    R  → 0   The above constraints are true constraints as they have contributions from all the participating displacement fields. Hence the Euler–Bernoulli (EB) model does not produce any spurious constraints and does not exhibit flexure locking.  In the regime EI/GJ⪡1, torsion locking is significant [2], and for the element to be free of this locking, the torsion strain energy should tend to vanish in this stiffness ratio regime. This condition of vanishing torsion strain energy can be examined by expressing the torsion strain field in terms of Legendre polynomial coefficients. Substituting for θs and θz from Eq. (10) and expressing the torsion strain of Eq. (2), we get  (13)  τ =  (      a   4    L  +     a   1     L R   +     a   3     L R    )  +  (    2   a   2     L R    )   ξ +  (      a   3     L R    )    (  3    ξ  2  − 1  )    Due to orthogonal property of Legendre polynomials and independent nature of the generalized coefficients, the condition of torsionless-flexure is satisfied if and only if the coefficients of the above equation independently tend to zero, leading to the following constraints:  (14.1)      a   4    L  +     a   1     L R   +     a   3     L R   → 0      (14.2)      a   2     L R   → 0      (14.3)      a   3     L R   → 0      The constraints corresponding to Eq. (14.1) is a true constraint as it has contributions from all the participating displacement fields. Eqs. (14.2) and (14.3) are spurious constraints which are responsible for torsion locking.  The conventional out-of-plane Timoshenko beam element makes use of linear interpolation for transverse displacement v, flexure rotation   θ   z   and torsion rotation   θ   s   as given below:  (15)  v =   a   0   +   a   1   ξ ;    θ   s   =   a   2   +   a   3   ξ ;    θ   z   =   a   4   +   a   5   ξ      The consistency of this choice of displacement fields in the flexure and torsion locking regime in exhibiting the true physical behavior of flexureless-torsion and torsionless-flexure respectively are examined in this section.  In the regime EI/GJ⪢1 flexure locking is significant [2], and for the element to be free of this locking, the flexure strain energy should tend to vanish in this stiffness ratio regime. This condition of vanishing flexure strain energy can be examined by expressing the flexure strain field in terms of Legendre polynomial coefficients. Substituting for θs and θz from Eq. (10) and expressing the flexure strain of Eq. (1), we get  (16)  κ =  (  −     a   5    L  +     a   2    R   )  +  (      a   3    R   )    ξ   Due to orthogonal property of Legendre polynomials and independent nature of the generalized coefficients, the condition of flexureless-torsion is satisfied if and only if the coefficients of the above equation independently tend to zero, leading to the following constraints:  (17.1)      a   2    R  −     a   5    L  → 0      (17.2)      a   3    R  → 0      The constraints corresponding to Eq. (17.1) is the true constraint as it has contributions from all the participating displacement fields and this combination can enforce this condition. Eq. (17.2) is the spurious constraint and is responsible for flexure locking.  In the regime EI/GJ⪡1 torsion locking is significant [2], and for the element to be free of this locking, the torsion strain energy should tend to vanish in this stiffness ratio regime. This condition of vanishing torsion strain energy can be examined by expressing the torsion strain field in terms of Legendre polynomial coefficients. Substituting for θs and θz from Eq. (10) and expressing the torsion strain of Eq. (2), we get  (18)  τ =  (      a   4    R  +     a   3    L   )  +  (      a   5    R   )   ξ   Due to orthogonal property of Legendre polynomials and independent nature of the generalized coefficients, the condition of torsionless-flexure is satisfied if and only if the coefficients of the above equation independently tend to zero, leading to the following constraints:  (19.1)      a   4    R  +     a   3    L  → 0      (19.2)      a   5    R  → 0   The constraints corresponding to Eq. (19.1) is the true constraint as it has contributions from all the participating displacement fields and this combination can enforce this condition. Eq. (19.2) is the spurious constraint which is responsible for torsion locking. Hence this choice of interpolation for the field variables produces flexure and torsion locking in the Timoshenko beam element.  Here we examine the consistency of the displacement field used in coupled Euler–Bernoulli model (designated as EB-CP) and coupled Timoshenko model (designated as TIMO-CP) in the flexure and torsion locking regimes.  The coupled out-of-plane Euler–Bernoulli beam element makes use of the following interpolations for the field variables as [2]   (20.1)    θ   z   =   a   3     ξ  2  +   a   2   ξ +   a   1        (20.2)    θ   s   =   α   1   L  (      a   3     ξ  3   3  +     a   2     ξ  2   2   )  +   a   4   ξ +   a   5        (20.3)  v = −   β   1     2   a   3    L  ξ +   β   2   L  (    a   3       ξ  3   3  +   a   2       ξ  2   2  +   a   1   ξ  )  +   β   3   L  (    α   1   (   a   3       ξ  3   3  +   a   2       ξ  2   2  ) +   a   4   ξ  )  +   a   3       ξ  3   3  +   a   2       ξ  2   2  +   a   1   ξ +   a   0     where   α   1   =   − G J   R ( E I + G J )   ,   β   1   =   E I   K G A    ,    β   2   =   G J   K G A   R  2    ,   β   3   =   E I + G J   K G A R      The shear strain is obtained as  (21)  γ = v ′ −   θ   z   = −   β   1     θ   z   ″   +   β   2     θ   z   +   β   3     θ   s   ′        (22)  γ = −   β   1     2   a   3       L  2    +   β   2    (    a   3     ξ  2  +   a   2   ξ +   a   1    )  +   β   3    (    α   1   (   a   3     ξ  2  +   a   2   ξ ) +     a   4    L   )    Eq. (22) represents the shear strain distribution and it is a measure of shear flexibility present in the coupled Euler–Bernoulli curved beam model. For a straight beam configuration, R→∞,   β   2   ,    β   3   → 0 and the shear flexibility reduces to −   β   1     θ   z   ″   . In the thin limits of EI⪡GA and GJ⪡GA,   β   1   ,    β   2   ,    β   3   → 0 and the shear strain vanishes for both curved and straight beams.  The consistency of this choice of displacement fields in the shear and torsion locking regime in exhibiting the true behavior of shearless-flexure and torsionless-flexure in the physical limits of stiffness ratios are examined next.  In the regime EI/GJ⪡1 torsion locking is significant [2], and for the element to be free of this locking, the torsion strain energy should tend to vanish in this stiffness ratio regime. This condition of vanishing torsion strain energy can be examined by expressing the torsion strain field in terms of Legendre polynomial coefficients. Substituting for θs and θz from Eqs. (20.1) and (20.2) torsion strain of Eq. (2) can be expressed as  (23)  τ =  (      a   4    L  +     a   1    R  +  (    α   1   +  1 R   )      a   3    3   )  +  (   (    α   1   +  1 R   )    a   2    )  ξ +  (   (    α   1   +  1 R   )      a   3    3   )   (  3   ξ  2  − 1  )    Due to the independent nature of the generalized coefficients, the condition of torsionless-flexure is satisfied if and only if the coefficients of Legendre polynomials independently tend to zero, leading to the following constraints:  (24.1)      a   4    L  +     a   1    R  +  (    α   1   +  1 R   )      a   3    3  → 0      (24.2)   (    α   1   +  1 R   )    a   2   → 0      (24.3)   (    α   1   +  1 R   )      a   3    3  → 0   All the above constraints are true constraints. Eq. (24.1) has contributions from different fields and this combination can enforce this condition. Eqs. (24.2) and (24.3) are explicitly satisfied when EI⪡GJ, as   α   1   → −  1 R  . Hence the coupled displacement fields for EB-CP model does not produce any spurious constraints in the torsion locking regime and exhibit torsionless-flexure behavior.  In thin regimes (EI⪡GA), shear locking is significant, and for the element to be free of this locking the shear strain energy should tend to vanish in this regime. This condition of vanishing shear strain energy can be examined by expressing the shear strain field in terms of Legendre polynomial coefficients we get  (25)  γ =  (  −   β   1     2   a   3       L  2    +   β   2     a   1   +   β   3       a   4    L  +   β   2     a   3   +   β   3     α   1     a   3    )  +  (    β   2     a   2   +   β   3     α   1     a   2    )  ξ +  (    β   2     a   3   +   β   3     α   1     a   3    )   (  3   ξ  2  − 1  )       Due to orthogonal property of Legendre polynomials and independent nature of the generalized coefficients, the condition of shearless-flexure is satisfied if and only if the coefficients of the above equation independently tend to zero, leading to the following constraints:  (26.1)   (  −   β   1    2    L  2    +   β   2   +   β   3     α   1    )    a   3   +   β   2     a   1   +   β   3       a   4    L  → 0      (26.2)   (    β   2   +   β   3     α   1    )    a   2   → 0      (26.3)   (    β   2   +   β   3     α   1    )    a   3   → 0   All the above constraints are true constraints. Eq. (26.1) has contributions from participating displacement fields and this combination can enforce this condition. Eqs. (26.2) and (26.3) are explicitly satisfied with the combination of (    β   2   +   β   3     α   1    ) . Hence the coupled Euler–Bernoulli (EB) beam model do not produce any spurious constraints in the shear locking regime and exhibit shearless-flexure behavior.  The coupled out-of-plane Timoshenko beam element makes use of the following interpolations for the field variables as  (27.1)    θ   z   =   α   2   L   a   1       ξ  2   2  +   a   3   ξ +   a   4        (27.2)    θ   s   =   α   1   L   a   3       ξ  2   2  +   a   1   ξ +   a   2        (27.3)  v =   α   2     L  2    a   1       ξ  3   6  +   a   3   L     ξ  2   2  +  (    a   4   L +   a   5    )  ξ +   a   6        The shear strain in the TIMO-CP model is obtained by substituting the coupled polynomial interpolations for   θ   z   and v from Eqs. (27.1) and (27.3), in the shear strain definition of Eq. (2) as  (28)  γ =     a   5    L    Eq. (28) represents a constant shear strain distribution over an element and is a measure of shear flexibility present in the TIMO-CP model. The generalized degree of freedom a  5 present in the shear strain do not participate in any other strain field. Being an independent degree of freedom it can assume suitable values to make the shear strain insignificant in the thin regime and significant in the thick regime, for representing the true physical behavior. This adaptability of the generalized degree of freedom a 5 in thin and thick regimes is validated later through numerical example.  The consistency of this choice of displacement fields in the shear, flexure and torsion locking regime in exhibiting the true behavior of shearless-flexure, flexureless-torsion and torsionless-flexure in the physical limits of stiffness ratios are examined next.  In the regime EI/GJ⪢1 flexure locking is significant [2], and for the element to be free of this locking, the flexure strain energy should tend to vanish to exhibit the flexureless-torsion behavior. This condition of vanishing flexure strain energy can be examined by expressing the flexure strain field in terms of Legendre polynomial coefficients. Substituting for θs and θz in flexure strain of Eq. (1) we get  (29)  κ =  (  −     a   3    L  +     a   2    R  +     α   1   L   a   3     6 R   −     α   1     α   2   L   a   3    6   )  +  (   (   1 R  −   α   2    )    a   1    )  ξ +  (      α   1   L   a   3     6 R   −     α   1     α   2   L   a   3    6   )   (  3   ξ  2  − 1  )    Due to the independent nature of the generalized coefficients, the condition of flexureless-torsion is satisfied if and only if the coefficients of Legendre polynomials independently tend to zero, leading to the following constraints:  (30.1)      a   2    R  +   a   3    (  −  1 L  +     α   1   L   6 R   −     α   1     α   2   L  6   )  → 0      (30.2)   (   1 R  −   α   2    )    a   1   → 0      (30.3)   (      α   1   L   6 R   −     α   1     α   2   L  6   )    a   3   → 0      All the above constraints are true constraints. Eq. (30.1) has contributions from different fields and this combination can enforce this condition. Eqs. (30.2) and (30.3) are explicitly satisfied when EI⪢GJ, as   α   1   → 0 ,   α   2   →  1 R  . Hence the coupled displacement fields for TIMO-CP model do not produce any spurious constraints in the flexure locking regime and exhibit flexureless-torsion behavior.  In the regime EI/GJ⪡1 torsion locking is significant [2], and for the element to be free of this locking, the torsion strain energy should tend to vanish to exhibit the torsionless-flexure behavior. This condition of vanishing torsion strain energy can be examined by expressing the torsion strain field in terms of Legendre polynomial coefficients. Substituting the polynomial displacement representation for θs and θz in torsion strain of Eq. (3) we get  (31)  τ =  (      a   1    L  +     a   4    R  +     α   2   L   a   1     6 R    )  +  (   (   1 R  +   α   1   +     α   1     α   2     L  2    a   1     10 R    )    a   3    )  ξ +  (      α   2   L   a   1     6 R    )   (  3   ξ  2  − 1  )  +  (      α   1     α   2     L  2    a   3     30 R    )   (  5   ξ  3  − 3 ξ  )       Due to the independent nature of the generalized coefficients, the condition of torsionless-flexure is satisfied if and only if the coefficients of Legendre polynomials independently tend to zero, leading to the following constraints:  (32.1)      a   1    L  +     a   4    R  +     α   2   L   a   1     6 R   → 0      (32.2)   (   1 R  +   α   1   +     α   1     α   2     L  2    a   1     10 R    )    a   3   → 0      (32.3)      α   2   L   a   1     6 R   → 0      (32.4)      α   1     α   2     L  2    a   3     30 R   → 0   All the above constraints are true constraints. Eq. (32.1) has contributions from different fields and this combination can enforce this condition. Eqs. (32.2)–(32.4) are explicitly satisfied when EI⪡GJ, as   α   1   → −  1 R  ,   α   2   → 0 . Hence the coupled displacement fields for TIMO-CP model does not produce any spurious constraints in the torsion locking regime and exhibit torsionless-flexure behavior.  In thin regimes (EI⪡GA), shear locking is significant, and for the element to be free of this locking the shear strain energy should tend to vanish in this regime. This condition of vanishing shear strain energy can be examined as follows:  (33)  γ =     a   5    L    The condition of shearless-flexure is satisfied if and only if the coefficients of the above equation independently tend to zero, leading to   a   5   → 0 , this constraint is a true constraint. Hence the coupled displacement fields for TIMO-CP model does not produce any spurious constraints in the shear locking regime and exhibit shearless-flexure behavior.   RESULTS AND DISCUSSION   In the present paper, the locking phenomena in the conventional linear iso-parametric Timoshenko beam model (TIMO) and Euler–Bernoulli beam model (EB) in the context of out-of-plane vibrations are discussed. The efficacy of the proposed coupled Timoshenko beam model (TIMO-CP) and coupled Euler–Bernoulli beam model (EB-CP) in eliminating the shear, flexure and torsion locking effects on the natural frequencies are demonstrated. The accuracy of the shear flexibility added to the Euler and Timoshenko beam models through coupled terms is evaluated for thick and thin beam regimes. Convergence characteristics of the proposed models are studied in both flexure and torsion locking regimes. The accuracy of the natural frequencies computed using the TIMO-CP and EB-CP curved beam models for constrained arches and free ring are discussed. The effectiveness of the proposed models in extracting all the rigid body modes is demonstrated. All properties used in the numerical examples are in consistent units. A typical value of shear correction factor, k =5/6 is used.  A quarter curved cantilever beam having length, l=157.08 and radius, R=100 as shown in Fig. 2 is chosen for the free vibration analysis. The cross-sectional properties are area, A=100, Moment of inertia, I=10433 and Torsional constant, J=266. The material properties used are Young׳s Modulus, E=2.0E6 and Poisson׳s ratio, v=0.3. An 8-element idealization of the beam is considered.  The normalized fundamental frequency obtained using TIMO and EB models for an 8-element mesh idealization are compared in Fig. 3. The results are plotted on a logarithmic scale for a wide range of EI/GJ ratios. The natural frequencies are normalized using converged solutions. From Fig. 3, it can be observed that frequencies obtained using TIMO model exhibits both flexure and torsion locking phenomena. However, frequencies obtained using EB model exhibits only torsion locking phenomenon. In the regime of EI/GJ⪢1 flexure locking is dominant and in the regime of EI/GJ⪡1 torsion locking is dominant, as was demonstrated earlier for static problems [1,2]. In the sections that follow, we evaluate the performance of the proposed TIMO-CP and EB-CP models to eliminate these locking effects.  The performance of TIMO-CP and EB-CP models are evaluated in shear, flexure and torsion locking regimes using the test problem described in Section 5.1, with same finite element mesh idealization. Firstly, the performance is evaluated in different regimes of EI/GJ ratio. Secondly, the performance is evaluated in different regimes of EI/GA ratio expressed as a non-dimensional parameter kGAL 2/EI. This parameter is a measure of thick to thin regimes for the beam element and generally used to study the shear locking effects [14].  The normalized fundamental frequency obtained using the conventional and the coupled finite element models are compared in  Figs. 4 and 5 for different regimes of EI/GJ ratio. From Fig. 4, it is observed that TIMO-CP model eliminates both flexure and torsion locking effects on natural frequencies and performs consistently over the entire range of EI/GJ ratio. Similarly, it is observed from Fig. 5 that EB-CP model eliminates torsion locking effects completely.  To study the behavior of TIMO-CP and EB-CP beam models in the shear locking regimes, free vibration analysis of the quarter curved cantilever beam is carried out for various kGAL 2/EI regimes. A typical value of EI/GJ=1 is maintained throughout to make the effects of flexure and torsion locking insignificant.    Fig. 6 shows the comparison of normalised fundamental frequency obtained using TIMO and TIMO-CP models. It can be observed that the TIMO model exhibits severe shear locking in the thin regimes (kGAL 2⪢EI). In contrast, TIMO–CP model performs consistently over the entire thick to thin structural regime of kGAL 2/EI. Hence, TIMO-CP model based on coupled displacement fields eliminates the shear locking phenomenon completely. Fig. 7 shows the comparison of normalized fundamental frequency obtained using EB and EB-CP models. It can be observed that, the EB-CP model performs consistently over the entire range of kGAL 2/EI and it is effective in capturing both classical and shear-deformable fundamental frequencies, without producing any shear locking effects. The performance of the EB model in thick regimes (kGAL 2⪡EI) shows some loss of accuracy, which can be attributed to inherent absence of shear flexibility in this classical beam model. However, as expected, in thin regimes (kGAL 2⪢EI) both EB and EB-CP frequencies coincide.  The convergence behavior of the TIMO-CP and EB-CP models in torsion and flexure locking regimes are studied for the test problem described in Section 5.1. The convergence study is carried out for a refined mesh of 256 elements and it is observed that the results are converged at this level of mesh refinement. The EI/GJ ratios chosen for this study are 0.01 and 100 which lie in the torsion and flexure locking regimes, respectively. A typical value of EI/GA=260 is maintained for the study. Table 1 shows the comparison of first four natural frequencies obtained using different models for EI/GJ=0.01. It is observed that the TIMO and EB models exhibit delayed convergence due to the presence of locking effects. The TIMO-CP and EB-CP models eliminate torsion locking which is predominant in this regime and improves the solution over the conventional models.    Table 2 shows the convergence characteristic of natural frequencies for EI/GJ=100. It is observed that TIMO model exhibits severe flexure locking and delayed convergence. However, TIMO-CP model shows improved performance, without exhibiting flexure locking. As discussed in Section 3.1.1, the flexure locking is absent in Euler–Bernoulli beam finite element formulation and hence both EB and EB-CP models do not exhibit flexure locking and show similar convergence trend in this regime. It is observed from Table 2 that the effect of shear deformation become significant for higher modes and hence TIMO, TIMO-CP and EB-CP models which accommodates shear flexibility converge to lower frequency values in comparison to EB model.  The natural frequencies for out-of-plane vibration of constrained arches, as shown in Fig. 8, obtained using different finite element models are presented in  Tables 3 and 4. The converged results obtained using a refined mesh of 256 elements is compared with the exact solutions from the classical and Timoshenko beam theories [14]. The effects of both shear and rotary inertia are considered in the analysis. The material properties used are Young׳s modulus, E=30E6 and Poisson׳s ratio, v=0.3. The shear correction factor is 0.833 and the density is 0.283564. The frequency parameters obtained for a simply supported circular arch with subtended angles 90° and 180° are shown in Table 3. It is observed that the frequency parameter obtained using the classical solution including the effect of rotary inertia compares well with the EB-CP model with β  i =0 (i=1, 2, 3). Similary, the frequency parameters obained using EB-CP model with β  i ≠0 (i=1, 2, 3) and TIMO-CP models compare well with the Timoshenko solution.  The frequency parameters obtained for a clamped-clamped circular arch with subtended angles 270° and 360° are shown in Table 4. It is observed that, the classical theory solution [14] including the effect of rotary inertia compare well with the EB-CP model β  i =0 (i=1, 2, 3). Similary, the frequency parameter obained using EB-CP model β  i ≠0 (i=1, 2, 3) and TIMO-CP models compare well with the Timoshenko solution [14]. The accuracy of the proposed coupled models is evident from the tabulated results.  The free vibration analysis of a circular ring is carried out using the coupled finite element models and the frequencies obtained are compared with the exact solutions [15]. The effect of both rotary inertia and shear deformation are considered in the analysis. Table 5 shows the comparison of frequency parameters between coupled finite element models and the exact solutions. The converged frequency parameters obtained using a refined mesh of 256 elements are shown in Table 5. It is observed that the results obtained using the EB-CP model with β  i =0 (i=1, 2, 3) compares well with the classical solution including the effect of rotary inertia. Furher, the frequency parameters obained using EB-CP model with β  i ≠0 (i=1, 2, 3) and TIMO-CP models are in good agreement with the Timoshenko beam solutions.  The accuracy of representing the rigid body motion by the coupled finite element models is verified by modeling an unconstrained curved beam segment using a single element.  Tables 6 and 7 show the comparison of first four natural frequencies obtained using the conventional and coupled models for the one-element idealization of a 45° arch segment in flexure and torsion locking regime respectively. For each model, the admissible first elastic natural frequency is identified based on the relative magnitude of the frequencies. The frequencies below this admissible frequency, which are numerically insignificant or zero, are considered as rigid body modes. The EB-CP and TIMO-CP models provide good approximation and capture all the three rigid body modes. In the torsion regime both the EB and TIMO models capture only two rigid body modes and this is due to presence of torsion locking in EB and TIMO models. In the flexure locking regime, TIMO models capture only two rigid body modes due to presence of flexure locking. The EB model captures all the three rigid body modes due to the absence of flexure locking.   CONCLUSION   The performance of two locking-free shear-flexible curved beam finite element models based on coupled polynomial displacement field interpolations are investigated for out-of-plane vibration of arches. These two models are superior to the conventional Timoshenko and Euler–Bernoulli beam elements and proven effective to circumvent the flexure and torsion locking phenomena. The accuracy of the shear flexibility present in the proposed models is examined for thin-to-thick regimes. It is observed that the shear flexibility present in the models does not introduce any spurious behavior and eliminates the shear locking. The coupled finite element models have been shown to perform consistently over a wide range of flexure-to-shear (EI/GA) and flexure-to-torsion (EI/GJ) stiffness ratios and are able to capture all the three rigid body modes. Hence, these beam models are inherently devoid of shear, flexure and torsion locking phenomena. The accuracy of the coupled displacement models and their convergence in computing natural frequencies is verified using test problems consisting of constraint and un-constraint arches.   REFERENCES", "highlights": "The performance of two curved beam finite element models based on coupled polynomial displacement fields is investigated for out-of-plane vibration of arches. These two-noded beam models employ curvilinear strain definitions and have three degrees of freedom per node namely, out-of-plane translation (v), out-of-plane bending rotation (θ  z ) and torsion rotation (θ  s ). The coupled polynomial interpolation fields are derived independently for Timoshenko and Euler–Bernoulli beam elements using the force-moment equilibrium equations. Numerical performance of these elements for constrained and unconstrained arches is compared with the conventional curved beam models which are based on independent polynomial fields. The formulation is shown to be free from any spurious constraints in the limit of ‘flexureless torsion’ and ‘torsionless flexure’ and hence devoid of flexure and torsion locking. The resulting stiffness and consistent mass matrices generated from the coupled displacement models show excellent convergence of natural frequencies in locking regimes. The accuracy of the shear flexibility added to the elements is also demonstrated. The coupled polynomial models are shown to perform consistently over a wide range of flexure-to-shear (EI/GA) and flexure-to-torsion (EI/GJ) stiffness ratios and are inherently devoid of flexure, torsion and shear locking phenomena."}