{"id": "S0168874X15000359", "article": "MAIN-TITLE Finite element modelling of the biaxial behaviour of high-performance fibre-reinforced cement composites (HPFRCC) using Concrete Damaged Plasticity   HIGHLIGHTS          We adopt Concrete Damaged Plasticity model to simulate Textile Reinforced Concrete.      The adopted CDP model can simulate significant strain hardening in uniaxial tension.      The adopted CDP model can simulate the biaxial tension behaviour.      The adopted CDP model can predict failure.          KEYPHRASES   Biaxial  Textile reinforced cement and concrete  Strain hardening  Nonlinear  Abaqus  Model   The implementation of fibres as reinforcement in cement and concrete has evolved significantly in the last decades. The state of the art today are fine-grained mortars or cements, reinforced by large amounts of fibres – often in the form of textiles to control their distribution and orientation [1]. These Textile Reinforced Concretes/Cements (TRC) or Mortars (TRM) often add sufficient fibres to call them high-performance fibre-reinforced cement composites [2]: in tension they show strain hardening, multiple cracking and high strength. Given their relatively high mechanical capacities, various structural applications are currently being studied, such as stay-in-place formwork [3,4] and strengthening and repair of concrete structures [5–8], prefabricated floor slabs [9], thin shell structures [10], large-size façade elements [11], pedestrian bridges [12], seismic design [13,14], etc.  The structural design of these HPFRCC applications could be facilitated by establishing material models in accessible (commercial) finite element software. Particularly an accurate simulation of the nonlinear behaviour due to cracking of the matrix and subsequent strain hardening ( Fig. 1), and validation of this simulation for complex stress states, is crucial to enable the use of the HPFRCC׳s full tensile capacity in these structures. In previous papers authors focused on the uniaxial behaviour only; they either modelled separately cement matrix and reinforcing textile [15–18] having results greatly dependant on the bond between them (cement matrix and fibre rovings); either they modelled cement composites with rather ductile behaviour [19,20] instead of substantial strain-hardening such as presented in the present paper. Attempts to simulate large strain hardening in tension with a homogenised model was undertaken by Giannopoulos [21] and by Tysmans [22]. Both models were able to capture effect of substantial strain hardening characterising the tensile behaviour of the HPFRCC. Nevertheless, in the first case the model was not able to simulate different behaviour in tension and compression. Tysmans by assuming in-plane isotropy of material due to randomness of the fibre orientation as well as homogenous spread of fibres, managed to simulate nonlinear tensile behaviour with different compressive response within one material model, using the Concrete Smeared Cracking model (available in Abaqus), however with the large disadvantage that the model is not able to simulate failure.  To counteract the shortcomings of existing models, the present paper examines if a modified version of the Concrete Damaged Plasticity (CDP) model, available in finite element software Abaqus, may be used for the simulation of HPFRCC׳s constitutive behaviour, within one material model. The CDP model is a modification of the Drucker–Prager strength hypothesis [23]. The model is well-established and is being successfully used to simulate the behaviour of steel-reinforced concrete [23,24]. As a concrete model, it is intrinsically able to model a sign-fragile yield surface and nonlinear tensile behaviour. This paper adapts the model for HPFRCC׳s, and examines whether the established adapted model can simulate:  – nonlinearity in behaviour, and a high degree of strain hardening in tension (ratio of failure stress to linear stress limit more than 8);  biaxial stress states – by comparison with experiments; and  damage, modelled by sudden tension softening.  After a brief theoretical background on the CDP model, this paper describes how the model is adapted for HPFRCC using uniaxial stress–strain data and additional assumptions for multi-axial stress-states. Then, the model is validated by comparison with biaxial tests. The biaxial experiments are performed on HPFRCC cruciform specimens, loaded in tension–tension at two different load ratios (1/1 and 1/2). During the experiments, strains are monitored with Digital Image Correlation (DIC), a full-field strain measurement technique. Hence, the entire strain distribution over specimen surface can be compared to the model results. Both the strain distribution of the cruciform specimen and its evolution with increasing load can be well predicted. Moreover, failure of the specimen can be simulated with the adapted CDP model.  The CDP model is based on the theory of plastic flow. It uses the yield surface proposed by Lubliner et al. [25] with the modifications suggested by Lee and Fenves [26] to account for different evolutions of stiffness under tension and compression [27]. The non-associated potential flow is a Drucker–Prager hyperbolic function [27]. The constitutive theory in the model focuses on the irreversible damage associated with failure mechanics that occur in concrete [27].  The CDP model obeys classical theory of plasticity with the following assumptions:• Additive strain rate decomposition  (1)   ε ̇  =    ε ̇   e  +    ε ̇   p  , .   where    ε ̇   e  is elastic strain rate and    ε ̇   p  is plastic strain rate.• Scalar damage factor d entering the elasticity stress–strain relation:  (2)  σ =  (  1 − d  )    D   0   e l   : ( ε  −    ε  p  ) ,   where d is the scalar stiffness degradation factor;   D   0   e l   is the initial stiffness of the material (undamaged); ε is the total strain;   ε  p  is the plastic strain; and : indicates Frobenius inner product.• Yield function F (  σ ¯  ,    ε ˜   p  ) ≤ 0 obeying Kuhn–Tucker condition:  λ ̇  F = 0 ;    λ ̇  ≥ 0 ;  F ≤ 0 .• Non-associated potential flow rule  (3)     ε ̇   p  = λ   ∂ G (  σ ¯  )   ∂  σ ¯    ,   where  σ ¯  is the effective stress.  The model is based on two sets of uniaxial data and five additional parameters. The uniaxial data correspond to the stress–strain behaviour (in compression and tension separately) after reaching yielding. The sets are the base for evaluating hardening behaviour of the yield surface. The sets can be enriched by the damage data which decrease the stiffness of the material as explained in the following paragraph (Section 2.1). The additional five parameters describe the yield surface, the potential flow and the visco-plastic regulation. The first two parameters modify the yield surface    σ   b 0    /    σ   c 0    is the ratio of biaxial compressive to uniaxial compressive yield stress which influences the yield surface in a plane stress state and   K   c   is the coefficient determining the shape of the deviatoric cross-section (see Section 2.2). Two other parameters modify the non-associated potential flow: ψ is the dilatation angle and ε is the potential flow eccentricity (see Section 2.3). Additionally there is one added parameter that helps converging the analysis by assuming the viscosity of the material.  The effective stress  σ ¯  and the Cauchy stress σ are calculated by the following formulas:  (4)   σ ¯  =   D   0   e l   :  (  ε −   ε  p   )  ,      (5)  σ =  (  1 − d  )   σ ¯    For any cross-section the coefficient (  1  −  d  ) represents the ratio of the effective cross-section bearing loads to the total cross-sectional area. This means that without degradation of the material (d=0 ); the effective stress and Cauchy stress are equal.  Evolution of the damage coefficient d is determined by the two factors   d   t   and   d   c   , independent in tension and compression. Both factors depend on effective stress and set of equivalent plastic strains    ε ˜   p  : d = d (  σ ¯  ,    ε ˜   p  )      Fig. 2 illustrates the idea of degradation of the material for a uniaxial stress–strain relation.  The classical Drucker–Prager yield surface is modified by two independent parameters and two sets of data. The data sets are the uniaxial stress–strain relationship independent in tension and compression. The first parameter is the ratio of   σ   b 0   biaxial compressive yield stress to   σ   c 0   uniaxial yield stress, adapting the yield surface in biaxial stress state (see Fig. 3). The second parameter   K   c   changes the shape of deviatoric cross-section from its circular shape into a smooth triangular shape (see Fig. 4).  This following paragraph discusses the yield function used in the CDP model, including an explanation of each parameter. The yield function is defined by the following formula:  (6)  F  (   σ ¯  ,    ε ˜   p   )  =   1  1 − α    (   q ¯   − 3 α  p ¯  +  β  (     ε ˜   p   )    〈   σ ¯  ^    m a x 〉   − γ 〈 −     σ ¯  ^    m a x 〉    )  −    σ ¯    c   (    ε ˜   p  ) ≤ 0   where  p ¯  = −   1 3    σ ¯  : I is the effective hydrostatic pressure   q ¯  =     3 2    s ¯  :  s ¯    is the equivalent von Mises stress;  s ¯  =  σ ¯  +  p ¯  I is the deviator of the effective stress; where 〈 ⋅ 〉 is the Macauley bracket 〈 × 〉 =   1 2   ⋅ ( × +  | × |  ) ;     σ ¯  ^    m a x   is maximum eigenvalue of tensor  σ ¯  ; α , γ are dimensionless parameters of material and function β  (     ε ˜   p   )  given by the formula:  (7)  β  (     ε ˜   p   )  =      σ ¯    c    (     ε ˜    c   p    )       σ ¯    t    (     ε ˜    t   p    )     (  1 − α  )  − ( 1 + α )   with    σ ¯    t   and    σ ¯    c   effective cohesion stress (tensile and compressive respectively).  In biaxial compression (     σ ¯  ⌢    m a x   = 0 ) the yield surface reduces to the Drucker–Prager condition (see Fig. 3).  Parameter α is defined as fraction  (8)  α =     σ   b 0   −   σ   c 0     2   σ   b 0   −   σ   c 0     ,   where   σ   b 0   is the equibiaxial yield stress and   σ   c 0   is the same stress but in the uniaxial test.  The coefficient γ appears in the surface equation only in triaxial compression (     σ ¯  ⌢    m a x   < 0 ). It can thus be determined by the yield condition ratio along tensile and compressive meridians. The relation of the norms of deviator of stress for both meridians is equal to  (9)    K   c   =      q ¯    T M        q ¯    C M       And hence the formula for γ becomes  (10)  γ =   3 ( 1 −   K   c   )   2   K   c   − 1   .      The potential flow is a hyperbolic Drucker–Prager function influenced by three parameters. The first is the dilatation angle ψ , which describes the angle of inclination of the failure surface towards the hydrostatic axis measured in the meridional plane [23]. The second is ϵ , the eccentricity of the potential flow which defines the rate at which the function approaches the asymptote (the linear Drucker–Prager flow potential) [27]. This eccentricity multiplied by the third parameter   σ   t 0   (the uniaxial tensile strength) corresponds to the distance (measured in hydrostatic axis) between the vertex of hyperbola and the intersection of its asymptote with the hydrostatic axis [23]. The potential flow G is given by the following formula and Fig. 5 shows the exact interpretation of the above mentioned values  (11)  G =     (  ∈   σ   t 0    tan  ψ  )  2  +     q ¯   2    −  p ¯   tan  ψ      The HPFRCC modelled in this paper is a textile reinforced cementitious composite made of an Inorganic Phosphate Cement matrix and fibre mats of chopped, randomly oriented, E-glass fibres. The cement matrix, developed at the Vrije Universiteit Brussel, is not aggressive for the E-glass fibres due to its neutral pH after hardening. Furthermore, its grain size of less than 100μm combined with a hand lay-up manufacturing technique allows to impregnate fibre mats up to over 20% fibre volume fraction, a factor 2–5 times higher than conventional cement composites [28]. As Fig. 1 shows, the cement composite experiences a drop of stiffness after cracking of the matrix (at the value of 6-8MPa), followed by a substantial strain hardening behaviour up to 60MPa. The mechanical behaviour of the composite is significantly different in compression, where it can be assumed to be linear (with a Young modulus of 18GPa) until failure at the value of 80MPa [29].  To predict the mechanical behaviour of the considered HPFRCC with the CDP a set of parameters has to be identified. The very first assumption considers in-plane isotropy of the composite. It is motivated by the high fibre volume fraction (23%), the homogeneous distribution and random orientation of the filaments. Secondly, the behaviour of the material at tensile stresses below the matrix cracking point (7.2MPa) is modelled as linearly elastic, with a Young modulus of 18GPa and a Poisson ratio of 0.3 [29]. The post-cracking behaviour is based on the uniaxial tensile test data (see Fig. 1; [29]) and implemented as stress–strain curve. To enable failure simulation, an artificial steep softening branch is added to the curve after reaching the tensile strength (61MPa). The curve was implemented to fulfil the following contradictory criteria: it has to radically drop the stiffness to indicate failure; it has also to be smooth, enabling convergence, even for strains greater than the failure strain. Compressive behaviour is modelled linearly elastic (the same as before cracking in tension, Young modulus equals 18GPa) until failure at 80MPa. The modelled stress–strain curves in tension and compression are visualised in Fig. 6.  Additionally, to complete the yield surface and the non-associated potential flow, the following data are provided:  –      σ   b 0    /    σ   c 0    is the ratio of biaxial compressive to uniaxial compressive yield stress, for normal concrete the value varies between 1.10 and 1.16 [25]; this research sets the parameter to 1.0 as biaxial loading has no influence on the uniaxial constitutive behaviour of the HPRFCC [22];      K   c   is the coefficient determining the shape of the deviatoric cross-section with a reported value of 0.64–0.8 for normal concrete [30], set to default value of 0.667 according to [27];    ψ is the dilatation angle, physically interpreted as angle of internal friction of concrete, taken as 36° [23];    ϵ is the potential flow eccentricity assumed as default value 0.1 [27]; and   µ is the viscosity parameter used for the visco-plastic regularisation of the concrete constitutive equations in Abaqus/Standard analyses, taken as 0.001 (small value compared to pseudotime of analysis) to improve the rate of convergence.  The biaxial strain data required for the evaluation of the CDP model were obtained by performing in-plane biaxial loading experiments (more elaborately discussed in [22]). The experiments ( Fig. 7) consist of subjecting a cruciform specimen to in-plane biaxial tensile loading, with the following two different load ratios:  – (1/1): equal load applied in both directions.  (1/2): load in one direction is twice the load in the perpendicular direction.  The limited amount of cases was selected because execution of the biaxial tests requires more expertise than uniaxial ones because of additional influencing factors such as load ratios, geometry of the specimen and the position of measurement. The following paragraphs discuss each of the mentioned factors separately.  The loading type was restricted to tension due to the practical limitation of the available test bench. The choice of the load ratios enables, with minimum amount of tests, to verify the biaxial mechanical behaviour of the material in the tension–tension quadrant. The consistency of the results from both biaxial load cases and uniaxial tests enables to postulate a yield surface with these limited load ratios and stress states.  The cruciform specimen ( Fig. 8) is a square plate with diagonal cuts and a reduced thickness in the centre in order to trigger damage initiation in the centre of the specimen, where the actual biaxial stress state was acting. The in-house test set-up is built up specially for biaxial testing of composites. It consists of an Instron horizontal biaxial test bench and two sets of 50mm wide clamps.  The instrumentation of the test is performed by the full-field measurement technique of Digital Image Correlation (DIC) [31]. DIC measures the displacements of a random speckle pattern painted on the surface of the specimen. Correlation of pictures taken from the speckled surface at subsequent load steps with a reference (unloaded) image yields the displacement, and thus strains, of the surface. As the full-field measurement technique allows the computation of the entire strain field of the specimen surface instead of the discrete strains that are measured with strain gauges, a more in-depth comparison with the FE model is possible.  The finite element analysis in the commercial software Abaqus 6.12 is performed in the three-dimensional space in both Standard implicit and Explicit mode. A quarter of the full-size cruciform specimen (see Fig. 8) is modelled as a two-part shell using symmetry boundary conditions to reduce computational time. The two parts of the specimen correspond to two thicknesses −2mm in the circular centre and 6mm in the rest of the sample.  To prevent rigid body movement, the following displacement boundary conditions are applied: the out-of-plane displacement is restricted at the line edge over the clamp length of 25mm (50mm/2 due to symmetry).  The mesh is automatically generated with three different averaged element sizes: 14, 7 and 3.5mm. These reducing element sizes allows to check the convergence of the analysis (see  Figs. 9 and 10). In all analyses, 4-node quadrilateral shell elements with reduced integration are used.  Similarly to the laboratory test, the two performed biaxial load programs – ratio 1/1 and ratio 1/2 – are simulated as follows. The load is applied by applying an equivalent displacement to the plate edges at the position of the clamps (over the edge length of 25mm). Using displacements instead of forces, and implementing an artificial softening branch in the stress-strain curve after tensile failure (Fig. 6), the simulation can predict the failure load and behaviour of the HPFRCC specimen. In equibiaxial tension (load ratio 1/1), the maximum applied displacement is 1/400 of the total length of the sample or 0.7mm. In the second load case (1/2) the applied displacements are equal to 0.175mm and 0.7mm respectively. Each of the load cases is simulated in both available Abaqus modules – Standard and Explicit. In both modules the model is integrated with the backward Euler method.   RESULTS AND DISCUSSION   The comparison of the numerical simulations with the experimental data is discussed on three different levels:  – The strain distribution over the whole surface of the specimen at a load close to the ultimate load, including check of mesh convergence.  The strain evolution in the discrete region of the centre of the specimen with increasing applied force.  The experimental versus predicted ultimate load.   Figs. 9 and 10 present the comparison of the strain distribution measured by DIC and simulated by the CDP model for different meshes (element sizes 3.5mm, 7mm, and 14mm respectively). In Fig. 9, the top images show DIC measurements of three specimens loaded equibiaxially (load case 1/1) at the load of 8kN, while the bottom ones illustrate the mesh convergence of the CDP model simulation for corresponding load. Fig. 10 presents similar results of the load case 2/1 (8kN/4kN). Comparison of both figures shows good correlation between numerical simulations and laboratory tests. The CDP model simulation predicts the same overall strain distribution and the same location of stress concentrations as observed in the experiments. Comparison of the strain field for different mesh sizes moreover demonstrates convergence of the model for the finest mesh (which is used to generate all following results).  The second evaluation of the CDP model is performed based on the evolution of the principal strains in the biaxially loaded centre point of the specimen. The results of the tests were rescaled due to the necessary preload to align the specimen applied before calibration of the DIC displacement measurement device. The rescaling is hence done setting the measured strains at zero for an applied load of 1kN.  Figs. 11 and 12 compare for the respective load cases 1/1 and 2/1 the force–strain behaviour of the three lab specimens (diamond, triangle and square markers) to their numerical simulations performed in different Abaqus modules (cross and x markers for Standard and Explicit, respectively).  The comparison of the results of the experiments with the numerical simulation, in the centre of the biaxially loaded specimen, is divided into three sections: first, the initial stiffness, second, the cracking of the matrix and third, the initiation of the decrease of the stiffness and the evolution of strains close to the failure. The initial stiffness of the material corresponds to the linear elastic behaviour of the composite. Due to rescaling, the part of the initial stiffness is lost, nevertheless, the results of the experiment and simulation tends to agree. The force–strain data from the numerical test for both load cases are in the range of the scatter of the experimental results. Similarly, the decrease of stiffness is well simulated. The drop corresponding to the cracking of the brittle matrix is estimated between 2 and 3kN for both load cases. The final strain evolution before the ultimate force is overestimated by the simulation in the discrete localisation of the centre of the specimen. The maximum ultimate strain in the equibiaxial experiments of 0.58% is estimated by numerical model as 0.64%; where the ultimate strain for load case 2/1 is 0.84% in the experiment and estimated by the numerical simulation as 0.95%. The results of both the Abaqus modules – Standard and Explicit, give almost the same results.  Summing up, the simulation corresponds well with the experiment for both considered load ratios. Measurements and simulations deviate mostly in the post-cracking stage, with the results of the numerical simulation being slightly less stiff than the experimental ones. The reason for this deviation can be explained by the assumption of the minimal constant thickness in the circular centre equals 2mm, whereas in the experiment it can vary upto 2.5mm (related to hand lay-up manufacturing of the specimen). Concluding, the graphs demonstrate capacity of the model to simulate accurately the substantial strain hardening behaviour of the cement composite.  The final evaluation criterion is whether the CDP model can predict the tensile failure behaviour of HPFRCC. To enable this failure prediction, an artificial softening branch succeeding the strain hardening behaviour was modelled in the CDP model. Table 1 compares the highest force achieved during the numerical simulation, and hence considered as ultimate load, to the experimental results. The comparison is made for both load ratios, and for both Standard (implicit) and Explicit simulations.  The numerical simulation gives a satisfying approximation of the ultimate load achieved during the biaxial test. The model results lie within the range of experimental failure loads.   CONCLUSIONS   The research described in this paper presents an adaptation of the Concrete Damaged Plasticity (CDP) model, based on uniaxial tensile test data, for the numerical simulation of high-performance fibre-reinforced cement composites and their inherent nonlinear behaviour including strain hardening. The adapted CDP model is validated by biaxial tension–tension experiments performed on a cruciform-type specimen. The following conclusions are drawn:  – the adapted CDP model is able to simulate the nonlinear constitutive behaviour of highly reinforced cementitious composites, more specifically their significant strain hardening capacity after crack initiation;  the good agreement between the numerical simulations and the biaxial laboratory tests proves that the identified model parameters are either correct, either insensitive for the biaxial tension stress state; and  thus, the adapted CDP model can closely predict the loadbearing behaviour and failure load of in-plane loaded structures.  For the simulation of more complex stress states in the future, special attention has to be drawn to the values of potential flow eccentricity, dilatation angle and the shape of the cross-section in the deviatoric plane.   ACKNOWLEDGEMENTS   This research is financially supported by the Fund for The Research Foundation - Flanders (FWO), Belgium, through a scholarship for the second author.   REFERENCES", "highlights": "High-performance fibre-reinforced cement or concrete composites (HPFRCC) are increasingly used in structural applications exposed not only to uniaxial but also complex stress states. Current finite element models for these materials have however been only validated for uniaxial stress states, and mostly restricted to cement composites with relatively limited strain hardening capacity in tension. To facilitate the numerical analysis and design of more complex structures, this paper adapts and validates the Concrete Damaged Plasticity (CDP) model for both uni- and biaxial stress states, and for cement composites with a large strain hardening capacity (ratio of failure stress to linear stress limit more than 8). The validation of the numerical model is done by performing laboratory biaxial tension–tension tests under various load cases. For the latter, an adapted cruciform specimen was designed. The strain distribution in the specimen as well as its evolution with increasing load correspond well. As the results show, the adapted CDP model can simulate the nonlinear strain hardening behaviour in tension – different from the linear behaviour in compression – of high-performance cement composites for both uniaxial as well as biaxial stress states. Moreover, failure can be simulated."}