{"id": "S0168874X15000669", "article": "MAIN-TITLE Efficient hyper reduced-order model (HROM) for parametric studies of the 3D thermo-elasto-plastic calculation   HIGHLIGHTS          The improved hyper-reduced order model is developed.      The 3D thermo-elasto-plastic problem is resolved with three reduced bases.      The Grassmann manifold interpolation is employed for generating new POD bases.      The parametric studies are performed on varying thermal load and yield stress.      A gain of CPU 25 is obtained for the parametric studies with errors smaller than 10%.          KEYPHRASES   Hyper reduced-order reduction (HROM)  Proper orthogonal decomposition (POD)  Grassmann manifold interpolation  Thermo-elasto-plastic calculation  Parametric studies   In design and control of complex continuum mechanical or physical processes, standard simulation techniques using the finite element method (FEM) are not very efficient due to the large number of degrees of freedom (DOF) and time steps. Indeed, they can involve prohibitive global CPU. Hence, the reduced-order model (ROM) technique helps to save the computational cost using smaller number of DOF through capturing the significant transformations of the parameters of interest [1]. Among ROMs, the proper orthogonal decomposition (POD) reduction method has shown its efficiency for optimization problems in fluid mechanics [2], structural dynamics [3], material science [1], thermal science [4] and real time surgery simulation [5].  However, the classical ROM based on the Galerkin formulation by a POD basis is not efficient for medium size elasto-plastic problems. In such problems, the computational effort related to the local integration of the nonlinear constitutive laws, which is used to determine the state of a system involving internal variables (IVs), can represent more than 80% of the total computational effort [6]. The complexity of the local computations does not depend on the reduced order of the model, as the computational effort needed to estimate IVs is not related to the reduced approximation, and all the elements are included in the loops for obtaining the good estimations of IVs. This defeats the purpose of model reduction and limits the efficiency of the reduced POD models.  By selecting accurately a small set of elements from the detailed model and considering the related equilibrium conditions, it is possible to define a reduced integration domain (RID) for the mechanical model as proposed by Ryckelynck [6]. As a result, the estimation of the significant IVs is only limited within the RID, the remaining variables can be extrapolated to the whole domain by the reduced basis of the IVs, this technology is similar to the Gappy POD method [7]. This clever approach named hyper reduced-order model (HROM) enables the further computational reduction compared with the POD reduction model. However, the time saving is only limited to 75% in the elasto-plastic calculation. Later, Ryckelynck and Benziane [8] developed the A Priori Hyper-Reduction method (APHR) for nonlinear mechanical problems involving internal variables, and a multi-level formulation is introduced to focus on the capability of the method to perform efficient parallel computations, where the best computational saving of 97% is obtained.  Besides, a modified POD strategy of the empirical interpolation method (EIM) is suggested by Maday et al. [9], which reduces the evaluation of the nonlinear term in the reduced model to a level proportional to the number of POD-based reduced variables. Based on the EIM, the discrete empirical interpolation method (DEIM) is proposed by Chaturantabut and Sorensen [10]. The essential of EIM or DEIM is to replace the orthogonal projection in the Galerkin scheme with an interpolatory projection within the selected interpolation points for approximating the nonlinearities. Similar to the HROM, the high efficiency is obtained as it only evaluates the nonlinearities at a few interpolation points.  Concerning the elasto-plastic problem, Radermacher and Reese [11] proposed an adaptive method of sub-structure based on the selective POD, where the reduction is only applied in sub-domains with approximately elastic behavior. Then the POD basis is adapted with the selected sub-domain, while further research is needed on the efficiency. Moreover, the POD-based reduction method has been also extended to inelastic structures including cracks [12], where the global model reduction strategy is developed by mixing both the a posteriori and a priori approaches to simulate the crack propagation. Moreover, the damage initiation problems are also addressed by the POD hyper reduction model when strong topological changes are involved [13].  Recently, Relun et al. [14] have developed a reduction model based on the proper generalized decomposition (PGD) method for elastic-viscoplastic computational analysis, but similar computational time is found compared with FEM. In addition, the reference points method (RPM) is proposed by Ladeveze et al. [15] to decrease the computational complexity of algebraic operations in the framework of the PGD.  Generally speaking, the reduced methods of POD and PGD show potentials to decrease the computational efforts for the elasto-plastic problems, while the hyper reduced-order model (HROM) on thermo-elasto-plastic calculation has not been reported. This paper focuses on the HROM applied to highly localized 3D thermo-elasto-plastic calculation. The first aim of the present paper is to reduce the computational effort significantly by the HROM. Moreover, the precision of stress field is improved by using an additional stress basis in order to recover more efficiently balance equations such as the equilibrium equation. The second aim of the present paper is to perform parametric studies for the parameters of interest. The Grassmann manifold interpolation is then adopted for the adaptive POD basis corresponding to the modified parameter, and the known plastic strains of the the reference cases with full FEM calculations are considered as the initial value of the plastic calculation to accelerate the convergence rate for the parametric studies.  The 3D thermo-elasto-plastic calculation is presented in the context of hyper reduced-order model coupled with Grassmann manifold interpolation, and the structure of this paper is organized as follows: firstly, the thermo-elasto-plastic reference problem is presented. Secondly, the hyper reduced-order model and its improvement is introduced, the evaluation criteria of the POD basis number are developed. The high efficiency of the improved HROM is validated by comparing with the reference solution. Thirdly, the Grassmann manifold interpolation is presented for determining the POD basis corresponding to the modified value of the parameter of interest. Fourthly, the parametric studies on the variational thermal loading and yield stress are performed to validate the accuracy and the versatility of the proposed method.  In this section, a structure (Ω) which obeys to usual thermo-elasto-plastic equations is employed. The thermo-elasto-plastic process subjected to a transient thermal load and usual boundary condition is typically assumed to weakly coupled. The temperature profile is assumed to be independent of stresses and strains. Therefore a heat transfer analysis is performed initially, and the results are imported for the stress analysis. The material constitutive model and the equilibrium equation are given in the below sub-section.  A linear isotropic hardening is considered for the thermo-elasto-plastic calculation. The strain rate tensor       ε   ̲     ̲     ̇   is split into the elastic, plastic and thermal parts:         ε   ̲     ̲     ̇     e   ,         ε   ̲     ̲     ̇     p   and         ε   ̲     ̲     ̇     th   , respectively:  (1)        ε   ̲     ̲     ̇   =         ε   ̲     ̲     ̇     e   +         ε   ̇     ̲     ̲     p   +         ε   ̇     ̲     ̲     th        The equivalent plastic strain (PEEQ) p with the plastic multiplier is defined by  (2)    p   ̇   = ∥    2   3             ε   ̲     ̲     ̇     p   ∥ =   λ   ̇        The free energy is assumed to be of the following form:  (3)  ω =    1   2      (      ε   ̲     ̲   −       ε   ̲     ̲     p   −       ε   ̲     ̲     th    )   T   :         D   ̲     ̲     ̲     ̲   : (     ε   ̲     ̲   −       ε   ̲     ̲     p   −       ε   ̲     ̲     th   ) +    1   2       Hp   2     where         D   ̲     ̲     ̲     ̲   and H are Hooke׳s tensor and hardening modulus for linear isotropic hardening, respectively. The thermal strain can be defined by       ε   ̲     ̲     th   = α Δ T     I   ̲     ̲   , where α is the thermal expansion coefficient, and Δ T is the temperature increment.  The yield surface is defined by the function f:  (4)  f (     σ   ̲     ̲   , p ) =       σ   ̲     ̲   :         M   ̲     ̲     ̲     ̲   :     σ   ̲     ̲     − (   σ   0   + Hp )   where σ 0 is the initial yield stress, and         M   ̲     ̲     ̲     ̲   is the stress operator tensor for von Mises calculation. It should be mentioned that a fixed-point type iteration strategy is suggested for the determination of the plastic multipliers λ [16]. Once λ is determined, the plastic strain       ε   ̲     ̲     p   can be obtained, then the stress can be expressed by  (5)        ε   ̲     ̲     e   =     ε   ̲     ̲   −       ε   ̲     ̲     th   −       ε   ̲     ̲     p       σ   ̲     ̲   =         D   ̲     ̲     ̲     ̲   :       ε   ̲     ̲     e        The discretized FE weak form for the thermo-elasto-plastic problem involves  (6)    f   int   (   u     t   n + 1     ) =   f   ext   (   t   n + 1   )   where we introduce the state variable   X   (   t   n   )   =   { u    ε   p    σ }   n   T   , which is known at time step t  n , while   X   (   t   n + 1   )   =   { u  σ    ε   p   }   n + 1   T   is not known.  In this case, the thermal and mechanical properties are weakly coupled. In a first stage, the temperature field T (   t   n + 1   ) is calculated and the external force   f   ext   (   t   n + 1   ) at time step   t   n + 1   is given. Then the corresponding internal and external generalized node forces for a given degree of freedom (DOF) can be introduced by the FE definition:  (7)    f   i   int   =   ∫   Ω   Tr [     σ   ̲     ̲        ε   ̲     ̲   (     φ   ̲     i   ) ]  d Ω   f   i   ext   =   ∫   ∂ Ω       F   ̲     d   .     φ   ̲     i    dS +   ∫   Ω       f   ̲     d   .     φ   ̲     i    d Ω   where     φ   ̲     i   is the corresponding shape function of the DOF.  By the strain rate relationship Eq. (5) it induces  (8)    ∫   Ω   Tr [     ε   ̲     ̲            D   ̲     ̲     ̲     ̲        ε   ̲     ̲   (     φ   ̲     i   ) ]  d Ω =   f   i   ext   +   ∫   Ω   Tr [       ε   ̲     ̲     p            D   ̲     ̲     ̲     ̲        ε   ̲     ̲   (     φ   ̲     i   ) ]  d Ω +   ∫   Ω   Tr [       ε   ̲     ̲     th            D   ̲     ̲     ̲     ̲        ε   ̲     ̲   (     φ   ̲     i   ) ]  d Ω   Then the equilibrium equation at time step   t   n + 1   for the whole model can be expressed by  (9)  Ku =   f   ext   +   f   th   +   f   p     with the following definitions in standard Voigt notation:   K =   ∫   Ω     B   T   DB  d Ω  the  constant  stiffness  matrix ,   f   ext   =   ∫   ∂ Ω     N   T     F   d    dS +   ∫   Ω     N   T     f   d    d Ω   f   th   =   ∫   Ω     B   T   D   ε   th    d Ω  the  thermal  balance  forces,   f   p   =   ∫   Ω     B   T   D   ε   p    d Ω  the  plastic  internal  forces.      In this paper, we consider a fixed point approach as the notation solver. Here, we can introduce the corresponding linearized system for a given nonlinear iteration k+1:  (10)    K   T   i + 1   δ   u   k + 1   = −   res   k     where   K   T   i + 1   is the tangent stiffness and δ   u   k + 1   is the displacement increment in iteration k+1, with the residual  (11)    res   k   =   f   k   int   −   f   ext   or   res   k   =   Ku   k   −   f   ext   −   f   th   −   f   k   p        In the fixed point method, the tangent stiffness is equal to constant (initial) stiffness by   K   T   =   K   T   (   u   0   = 0 ) = K (the elastic stiffness in Eq. (9)), which avoids the constructions of the tangent stiffness in all iterations. Actually, the fixed point method is a modified Newton–Raphson iteration scheme and considers the updated plastic internal force as the external force in each iteration. As the increment form is adopted in this paper, the final equilibrium equation is expressed by  (12)  K Δ u = Δ   f   ext   + Δ   f   th   + Δ   f   p     where Δ is defined as the parameter increment between time steps   t   n + 1   and t  n .  Concerning the thermo-elasto-plastic calculation, the incremental form is adopted for all quantities, which are considered as the varying rate of the discretized quantities. The POD bases are obtained from the singular value decomposition (SVD) for the parameters of interest. The increment of the displacement field (for 3D model of n degrees of freedom (DOFs) and m time steps) can be defined by  (13)  Δ U = [     Δ   u   1   (   t   1   )   Δ   u   1   (   t   2   )   ⋯   Δ   u   1   (   t   m   )     Δ   u   2   (   t   1   )   Δ   u   2   (   t   2   )   ⋯   Δ   u   2   (   t   m   )     ⋮   ⋮   ⋱   ⋮     Δ   u   n   (   t   1   )   Δ   u   n   (   t   2   )   ⋯   Δ   u   n   (   t   m   )     ] = [ Δ u (   t   1   )  Δ u (   t   2   )  ⋯  Δ u (   t   m   ) ]   where Δ U ∈   R   n × m   is a rectangular matrix. In the next paragraph, the SVD decomposition of Δ U is introduced [17,18].  By the SVD decomposition, the snapshot matrix of the collected increment of displacement Δ U can be  (14)  Δ U = Φ  Σ    ϒ   T   = [   Φ   1    ⋯    Φ   n   ] [       σ   1     0   ⋯   0     0     σ   2      ⋮     ⋮    ⋱   0     0   ⋯   0     σ   m       0   ⋯   0   0     ⋮   ⋯   ⋮   ⋮     0   ⋯   0   0     ] [       ϒ   1   T       ⋮       ϒ   m   T       ]   where Φ ∈   R   n × n   is a unitary matrix containing space vectors, ϒ ∈   R   m × m   a unitary matrix containing time vectors, and Σ ∈   R   n × m   contains diagonal and non-negative singular values σ  i in the decreasing order.    •  Thin (or economy-sized) SVD: In the case of thin SVD, the above decomposition can be expressed by Eq. (15) with m ≪ n :  (15)  Δ U = Φ  Σ    ϒ   T   = [   Φ   1    ⋯    Φ   m   ] [       σ   1     0   ⋯   0     0     σ   2      ⋮     ⋮    ⋱   0     0   ⋯   0     σ   m       ] [       ϒ   1   T       ⋮       ϒ   m   T       ]      Actually, the space vector   Φ   i   is combined with time vector   ϒ   i   scaled with the singular value σ  i . As a result, the displacement increment can be written as a sum of the product of space vector, its singular value and time vector within mode m:  (16)  Δ U =   Φ   1      σ   1      ϒ   1   T   +   Φ   2      σ   2      ϒ   2   T   + ⋯ +   Φ   i      σ   i      ϒ   i   T   + ⋯ +   Φ   m      σ   m      ϒ   m   T     which can also be expressed as  (17)  Δ U =   σ   1     Φ   1   ⊗   ϒ   1   +   σ   2     Φ   2   ⊗   ϒ   2   + ⋯ +   σ   i     Φ   i   ⊗   ϒ   i   + ⋯ +   σ   m     Φ   m   ⊗   ϒ   m          •  Truncated SVD: The following decomposition of Eq. (18) is the rank-k truncated (or partial) SVD of Δ U , where k ≤ r ≤ m and r is the rank of Δ U . The truncated SVD is the most common form of the SVD for applications:  (18)  Δ U ≈   Φ   1      σ   1      ϒ   1   T   +   Φ   2      σ   2      ϒ   2   T   + ⋯ +   Φ   i      σ   i      ϒ   i   T   + ⋯ +   Φ   k      σ   k      ϒ   k   T        Based on the POD basis from the SVD as presented in Eq. (14), we define the reduced basis [19,20] by  (19)    Ψ   U   = Φ Σ      Then Eq. (14) can be replaced by  (20)  Δ U =   Ψ   U   Δ   Λ   U     where Δ   Λ   U   =   V   T   is the time reduced state variable. The reduced basis is also applied for the decomposition of the increments of plastic strain and stress in this paper.  Finally,   Ψ   U   ,   Ψ   Y   and   Ψ   σ   are defined as the space reduced bases of the increments of displacement, plastic strain and stress, respectively. Indeed, it will be shown that the choice of these state variables is essential for the effectiveness of the HROM.  The POD method is actually a model reduction technique projected on a small dimensional subspace Ψ  [11]. Based on FEM, the discrete form of the equilibrium equation can be expressed as Eq. (21) at any time t by selecting the first modes of   Ψ   U   containing the largest part of “energy” of all the modes:  (21)  [   (   Ψ   U   )   T   K   Ψ   U   ] Δ   λ   U   =   (   Ψ   U   )   T   ( Δ   f   ext   + Δ   f   th   + Δ   f   p   )      The resolution of this system, which reduces the unknowns from n (the degree of freedom of the system) to k (the selected mode number of   Ψ   U   ), is very fast but gives an approximation of the solution Δ u ≈   Ψ   U   Δ   λ   U   . It can be noticed that the main drawback of Eq. (21) is the use of the full K matrix on the left-hand side. In practice, only selected DOFs of K are considered (see Section 3.4).  As all the elements are needed to determine the correct plastic deformation for the elasto-plastic calculation, the constitutive equation represents more than 80% of the computational effort and only less than 20% CPU times are saved by the classical POD reduction method, although the number of the primary variables is divided by an amazing factor of n / k  [6]. So this solution needs to be improved by high efficiency while keeping the accuracy.    •  Petrov–Galerkin formulation: It should be mentioned that the POD reduction method does not modify the number of constitutive equations that must be solved to estimate the displacement field. Indeed, it keeps the computational effort for the plastic calculation in the local domain. One way to reduce the number of constitutive equations is the creation of a reduced integration domain (RID), where the calculation of constitutive equations is only considered. Moreover, the orthogonal condition in Eq. (21) does not mean that all the residuals of the equilibrium equations must be equal to zero. In fact, it allows us to introduce a RID only on a part of the global domain. A rectangular boolean matrix Π allows to perform the selection according to the following formulation:  (22)  Π K Δ u = Π ( Δ   f   ext   + Δ   f   th   + Δ   f   p   )      By introducing a truncated orthogonal condition for these selected equations, the hyper reduced formulation of the governing equations of the ROM is obtained:  (23)  (   (   Ψ   U   )   T     Π   T   Π K   Ψ   U   ) Δ   λ   U   =   (   Ψ   U   )   T     Π   T   Π ( Δ   f   ext   + Δ   f   th   + Δ   f   p   )   Then the residual of the hyper reduced formulation can be expressed by  (24)    R   RID   = (   (   Ψ   U   )   T     Π   T   Π K   Ψ   U   ) Δ   λ   U   −   (   Ψ   U   )   T     Π   T   Π ( Δ   f   ext   + Δ   f   th   + Δ   f   p   )      For the matrix   Π   l × n     K   n × n     Ψ   n × k   U   , l should be larger than k, it means that the rank of this matrix must be equal to the number of the reduced state variables k.  For the POD reduction method, it only reduces the number as follows:   (   Ψ   U   )   T   ( Δ   f   ext   + Δ   f   th   + Δ   f   p   ) , but it covers all DOFs for the calculation of the constitutive model. The Petrov–Galerkin formulation, in terms of   (   Ψ   U   )   T     Π   T   Π  ( Δ   f   ext   + Δ   f   th   + Δ   f   p   ) , points out the selected DOFs by   Π   l × n      ( Δ   f   ext   + Δ   f   th   + Δ   f   p   )   n × 1   , where only l equations are adopted. Therefore, the purpose of the hyper reduced problem is to find the reduced state variables Δ   λ   U   such that Δ u =   Ψ   U    Δ   λ   U   by the selected DOFs.    •  The extrapolation of the plastic strain and stress: Concerning the plastic calculation, the plastic strain increment vector is introduced as a column vector Δ Y = { Δ       ε   ̲     ̲     p   } of the plastic strain tensor field.  Similar to the displacement increment reduced basis, the plastic strain increment reduced basis is calculated on a matrix containing all solutions for each time t ( t ≤ m ) for the reference problem, which is given by Δ   Y   ref   = [ Δ   Y   1   … Δ   Y   m   ] . By performing the SVD, we can obtain the modes   Ψ   Y   for the plastic strains.  The components of the plastic strain increment vector Δ   Y   i   calculated inside the RID (reduced integration domain,   Ω   Π   ) are defined in a vector   Y   Π   in each time step, in other words the components of the plastic strain increment vector Δ   Y   i   are not computed outside   Ω   Π   . This section aims at building an estimation of the plastic strain increment vector over the complementary part     Ω   ¯     Π   of RID.  As the reduced basis   Ψ   Y   (k modes) is defined over the entire domain Ω, it can be used to extrapolate the plastic strain Δ   Y   Π   such that  (25)  z = arg  min H (   λ   Y   )      (26)  H ( Δ   λ   Y   ) =   ∫     Ω   Π     〈  Δ   Y   Π   −   ∑   i = 1   i = k      Ψ   i   Y   Δ   λ   i   Y   , Δ   Y   Π   −   ∑   i = 1   i = k      Ψ   i   Y   Δ   λ   i   Y    〉  d Ω      Then, Eq. (27) can be obtained by combining Eqs. (25) and (26):  (27)  z =   (     Ψ   Y     T       Π   Y     T     Π   Y     Ψ   Y   )   − 1       Ψ   Y     T       Π   Y     T     Π   Y   Δ   Y   Π        (28)  Δ Y ( x ) =   ∑   i = 1   i = k      Ψ   i   Y   ( x )    z   i    ∀ x ∈     Ω   ¯     Π        (29)  Δ Y ( x ) = Δ   Y   Π   ( x )  ∀ x ∈   Ω   Π     Similar operation is performed for the stress increment vector in each time step. It should be mentioned that the reduced basis of the stress increment does not participate to the element selection and the reduction of the DOFs of the resolved problem. The main purpose of the introduction of the stress reduced basis is just to increase the level of accuracy of the equilibrium equation solving when the stress is extrapolated from the local RID to the global domain.  In this part, we are now ready to introduce the mode selection of the reduced bases and the creation of the RID for the HROM.  For all reduced bases, we have to define how many modes should be kept, according to the relative importance of the modes. To effectively select the modes, an energy norm, a measure of equivalent plastic strain and the accumulated singular value for displacement, plastic strain and stress are defined below.    •  Energy measure for displacements: Similar to previous works of Giacoma et al. [17,21] and Boucinha et al. [22], the energy measure related to displacements is evaluated in order to determine the size of the reduced basis. The energy measure of the displacement field integrated over the considered time domain is defined by  (30)  E =   ∫   0   t   Δ u   ( t )   T   K  u ( t )  dt      It can be expressed with a summation on the selected modes as E =   ∑   i = 1   m     E   i   , where E  i corresponds to the energetic measure contained in the ith mode:  (31)    E   i   =   σ   i   2     Ψ   i   T   K    Ψ   i      ϒ   i   T      ϒ   i   ′     where   ϒ   j , i   ′   =   ∑   r = 1   r = j     ϒ   r , i   is the cumulative value of the incremental basis.    •  A measure of equivalent plastic strain for the plastic strains: Similar definition is performed for a measure of equivalent plastic strain integrated over the considered time domain:  (32)    E   p   =   ∫   0   t       ε   ̇     p     ( t )   T      ε   p   ( t )  dt      It can be also distributed with a summation on the selected modes as   E   p   =   ∑   i = 1   m     E   i   p   , where E  p   i corresponds to a measure of equivalent plastic strain contained in the ith mode:  (33)    E   i   p   = {     σ   i   p     2       Φ   i   p     T      Φ   i   p   }      ϒ   i   p     T      ϒ   i   p ′     where   ϒ   j , i   p ′   =   ∑   r = 1   r = j     ϒ   r , i   p   is the cumulative value of the incremental basis.    •  Size identification for the stress reduced basis: The size of stress basis is obtained by the singular value accumulation:  (34)    η   σ   =     ∑   i = 1   i = k     λ   i       ∑   i = 1   i = m     λ   i       where λ  i is the singular value of the stress increment.  For the given ratios,   η   U   =   ∑   i = 1   k     E   i   / E ,   η     ε   p     =   ∑   i = 1   k     E   i   p   /   E   p   and   η   σ   , the appropriate modes of the reduced bases can be selected for the increments of displacement, plastic strain and stress.  The RID must be large enough to get Eqs. (23) and (27) well posed. According to Eq. (23), the RID is formed by the list of the elements connected to the DOF related to the selected equilibrium equation. We denote by   E   RID   ( n )   the nth version of the set of selected elements.  The first stage concerns the reduced basis vector   Ψ   i   U   for the selected modes 1 ≤ i ≤ k . A loop is applied for each reduced basis vector to find the maximum absolute values of the vector component. Then the elements connected with the selected nodes are chosen as   E   RID   ( 1 )   .  The second stage is related to the largest absolute value of the component of each vector   Ψ   j   Y   for the selected modes 1 ≤ j ≤   k   E   , and then the corresponding elements are selected as   E   RID   ( 2 )   . It should be mentioned that only one maximum value is selected for each reduced basis vector for the first and the second stage.  The RID is finally increased by adding its neighbor elements to the list, in other words, one layer is added to the list   E   RID   ( 3 )   . So the final selection of RID can be combined by the above selection:  (35)    E   RID   =   E   RID   ( 1 )   ∪   E   RID   ( 2 )   ∪   E   RID   ( 3 )        The global–local algorithm implementation for the HROM is given in Appendix A. Before finishing this subsection, we would like to regularize the state variables related to the reduced-order model as S :  (36)  S = [     Δ U     Δ Y     Δ σ     ]   The SVD operation is performed for each component of S . Then the aim is to determine the reduced state variables as defined by Δ   Λ   U   , Δ   Λ   Y   and Δ   Λ   σ   :  (37)  SVD ( S ) = [     SVD ( Δ U )     SVD ( Δ Y )     SVD ( Δ σ )     ] = [       Φ   U      Σ   U        ϒ   U     T         Φ   Y      Σ   Y        ϒ   Y     T         Φ   σ      Σ   σ        ϒ   σ     T       ] = [       Ψ   U    Δ   Λ   U         Ψ   Y    Δ   Λ   Y         Ψ   σ    Δ   Λ   σ       ]   Besides, the size of the reduced state variables corresponding to their reduced bases is also related to their components and defined below:  (38)    S     R   Dim     = dim ( SVD ( S ) ) = [     dim ( SVD ( Δ U ) )     dim ( SVD ( Δ Y ) )     dim ( SVD ( Δ σ ) )     ] = [     dim (   Ψ   U   )     dim (   Ψ   Y   )     dim (   Ψ   σ   )     ]      The system of interest is a block domain as shown in Fig. 1 and Table 1 , which contains 2601 nodes and 10240 TET4 elements (4-node linear tetrahedral element with one integration point). Similar to the multi-pass welding, the thermal loading magnitude vector of Q (720–880W, with 5% variation of 800W) is given by the linear tendency [ 0 ⋯ 1 ⋯ 1 ⋯ 0 ⋯ 1 ⋯ 1 ⋯ 0 ] , which corresponds to the loading time [ 0 ⋯ 7 ⋯ 14 ⋯ 21 ⋯ 28 ⋯ 35 ⋯ 42 ] with the total T=42millisecond (ms). The thermal source is focused on the top surface of the centered 8 elements connected with the top middle node over the space–time domain [ 0 , T ] × Ω , as shown in Fig. 1. The bottom surface is clamped in all directions. The mechanical and thermal properties are given in Table 2 .  To validate the above improved HROM, the reference problem with a thermal load of 720W is considered firstly. To define the size of the reduced bases easily, the normalized singular values and their equivalent energetic measure (Eq. (31)) and a measure of equivalent plastic strain (Eq. (32)) are given in Fig. 2 . It can be found that the energy measure and the measure of equivalent plastic strain occupy more than 90% of the total ones just after 2 modes in Fig. 2(a) and (b), respectively. Moreover, the increment of the equivalent plastic strains (PEEQ) based on the POD basis for modes 1, 2, 3 and 8 are given in Fig. 3 . In the special case of confined thermal loading, the distributions of PEEQ of first modes are always located at the loading position, and the contribution of the PEEQ to the entire one can be ignored after the 8th mode as indicated in Fig. 3(d). From accuracy and CPU considerations, the size of the reduced bases   S     R   Dim     =   [ 6 , 6 , 5 ]   T   is selected by selecting truncation ratio of   [ 0.9999 , 0.995 , 0.8 ]   T   for the energy measure, the measure of equivalent plastic strain and accumulation of the singular value of the stress, respectively. As a result, only 155 elements are selected based on the selected bases of the displacement increment and plastic strain increment for the RID zone.  The online computational ratio “T  R ” is defined as the ratio between the online CPU time of the HROM and that of the full FEM. All the calculations are performed on 1CPU and 1024mb memory space. Based on the selected modes and the HROM, the online computational time is given in Fig. 4 (b). The HROM plastic calculation is even faster than the elastic FEM calculations (for instance see time step 23). Then, a gain of CPU time close to 22 is obtained finally. Besides, a global level of accuracy less than 10% is ensured in the global domain as given in Table 3 calculated by the following equation:  (39)    e   X   =   ∥   X   HROM   −   X   FEM   ∥   ∥   X   HROM   +   X   FEM   ∥        It should be mentioned that the global stress error is greatly improved with the reduced stress basis as given in Table 3. With the same modes for the displacement and plastic strain and the selected elements in RID, the maximum error decreases from 22.26% to 8.62% while keeping other errors constant. Otherwise, more elements in the RID are needed to improve the precision of stress field, then the computational time increases correspondingly.  To evaluate the influence of the selected truncation ratio on the precision and the gain of CPU time, additional 4 sets are given in Table 4 by considering the case of   [ 0.9999 , 0.995 , 0.8 ]   T   as the reference one. Actually, the truncation ratio corresponds to the selected number of modes, and the number of modes determines the number of elements in the RID. By fixing the truncation ratio of the increments of stress and plastic strain corresponding to case1 and case2, all errors decrease with the increased truncation ratio of the displacement increments, while the CPU time increases with more selected elements in the RIDs (Table 5 ). Similar tendencies are also observed for the increased truncation ratios of the stress and plastic strain corresponding to case2 and case3, case2 and case4 respectively. Because of the hyper reduction of the present HROM, the errors decrease slowly when their values approach to 1% in case5, even with higher truncation ratio. It should be mentioned that the selection of truncation ratio depends on the desired accuracy or the CPU gain.  The POD method produces an orthogonal basis that approximately spans the solution space of the thermo-elasto-plastic system for a given parameter value. If we assume that the solution space varies continuously with the considered parameter, then we could expect that the corresponding POD basis can reasonably span the solution space for another parameter value approximately. Of course it is less optimal than constructing a new POD basis based on the snapshot at the desired parameter value. Nevertheless, the ultimate goal is to construct small size RID with acceptable quality based on the small size POD basis. Thus, we are faced with the question of how to perform an accurate interpolation based on snapshots.  We define the studied subspace X ∈   R   n × m   and the truncated POD basis as Φ = [     Φ   ̲     1   , … ,     Φ   ̲     k   ] , where k ≤ m . Hence, the following subsections will focus on the interpolation between two (   Φ   0   and   Φ   1   ) or more POD bases.  To construct the small size POD bases, the traditional linear interpolation does not give linear variation from the aspect of the geometrical space (the relative angles between POD bases) and interpolated basis is not unitary even though the selected two POD bases are unitary [23]. The subspace angle interpolation shows a good precision for the space interpolation and preserves the unitary nature of the POD basis, while it is limited to second-order interpolation [24]. Fortunately, the subspace manifold interpolation overcomes the above problem [25] and is adopted in this paper.  A manifold is defined as a set of points such that any of these points has a neighborhood which is homeomorphic to an open set of an Euclidian space [26]. In this paper, we are interested in the Grassmann manifold [27], which is defined as the set of k-dimensional linear subspaces of   R   n   :  (40)  G ( k , n ) = { S ⊆   R   n   | ∃ X ∈   R   n × k   , span { X } =  S , rank { X } = k }      At each point S of the manifold G ( k , n ) , there exists a tangent space [28] of the same dimension. This space is denoted by   τ   S   and each of its points χ  i can be represented by a matrix Γ ∈   R   n × k   . This space is a vector space which has its origin at the point of tangency. Hence,   τ   S   is a “flat” space, which is a space in which interpolation can be performed with traditional methods.  Let POD bases   Φ   0   ∈   R   n × k   and   Φ   1   ∈   R   n × k   represent two reduced-order bases pre-computed at two different values s 0 and s 1 of a physical or modeling parameter s. Let S 0 and S 1, corresponding to   Φ   0   and   Φ   1   , denote the two points of G ( k , n ) that are spanned by the columns of the unitary matrices. Let y ( t ) ,  0 ≤ t ≤ 1 , denote the geodesic (which is defined as the shortest path [25] between two points of a manifold) between these two points (S 0, S 1) with S 0 chosen as its origin, which means the geodesic on G ( k , n ) satisfying y ( 0 ) =   S   0   and y ( 1 ) =   S   1   (Fig. 5 ).  The proposed procedure for adapting the two available reduced-order bases to a new value   s   ˜   of s that is different from both S 0 and S 1 can be described in three steps: (1) The selections of reference point (origin point) S 0 and its neighborhood   {   S   i   }   i = 0     N   R   − 1   in the manifold(S 1 is only considered for the second-order interpolation). (2) Mapping S 0 and S 1 from the manifold space G ( k , n ) to the tangent space   τ     S   0     by Eq. (41) (S 0 and   S   1   →   χ   0   = 0 and χ 1, represented by   Γ   0   and   Γ   1   ). (3) Interpolation at the tangent space   τ     S   0     (χ 0 and   χ   1   →   χ   ˜   , represented by   Γ   ˜   ). (4) Mapping back from the tangent space to the manifold space (   χ   ˜   →   S   ˜   ,  represented  by  Φ ) :  (41)  ( I −   Φ   0      Φ   0   T   )    Φ   1      (   Φ   0   T     Φ   1   )   − 1   = U  Σ    V   T   ( Thin  SVD )      The proposed adaption method finally constructs a reduced-order     Φ   ̲     ̲   ( s ) for one value of the parameter s ∈ [   s   0   ,   s   1   ] as given in Eq. (42). More details can be referred to [25]:  (42)  Φ ( s ) =   Φ   0   V cos (  (    s −   s   0       s   1   −   s   0      )   tan   − 1   ( Σ )  ) + U sin (  (    s −   s   0       s   1   −   s   0      )   tan   − 1   ( Σ )  )      Considering higher order interpolation, the scheme is shown in Fig. 6 . The snapshots are projected onto the tangent plane by Eq. (41) based on a reference snapshot, then the interpolation formulation is performed by Eq. (43) to get a new projected basis     Γ   ˜       N   R     ( s ) in the tangent plane:  (43)      Γ   ˜       N   R     ( s ) =   ∑   i = 0     N   R   − 1     ∏   j ≠ i     s −   s   j       s   i   −   s   j       Γ   i   (   s   i   )      Finally, the matrix     Γ   ˜       N   R     ( s ) representing   χ   N   ∈   τ     S   0     is mapped to a subspace S  N on the Grassmann manifold spanned by a matrix   Φ   N   using the exponential Exp  S0, which can be expressed by  (44)      Γ   ˜       N   R     =   U     N   R       Σ     N   R       V     N   R     T    ( Thin  SVD )      (45)    Φ     N   R     =   Φ   0     V     N   R     cos (    Σ     N   R      ) +   U     N   R     sin (    Σ     N   R      )      The presented second and third-order manifold interpolations will be applied for the parametric studies in the following section. In addition, in order to reduce the plastic iterations for the yield elements, the linear interpolated plastic strains of the adopted snapshots are also employed as the initial values at each time step for the case of plastic deformation.  We look for the variation of the thermomechanical response when some parameters change. Here we shall illustrate the methods of the HROM and the Grassmann manifold interpolation in the case of variable intensity of the thermal load and the yield stress. Actually, we want to explore the effect of this variation on some quantities of interest, with the minimum computational efforts.  To simplify the problem, two snapshots, corresponding to 720W and 880W, are considered in the case of thermal load. In addition, the selecting truncation ratio of   [ 0.9999 , 0.995 , 0.8 ]   T   (corresponding to the energy measure, the measure of equivalent plastic strain and accumulation of the singular value of the stress, respectively) is used to determine the modes of the reduced bases, and 1 maximum component selection of each basis vector is adopted for selecting elements in RID.  The SVD analysis for snapshot 1 has been given in Fig. 2 of Section 3.6 for the reference problem. Correspondingly, the SVD analysis is also performed for snapshot 2 as shown in Fig. 7 . It can be seen that a few modes can represent the global solution. As a result, the basis size of   S     R   Dim     =   [ 6 , 6 , 6 ]   T   is selected for snapshot 2. To obtain small size POD bases of the new set of thermal loads of 760W, 800W and 840W, the basis size of   S     R   Dim     =   [ 6 , 6 , 6 ]   T   is selected for the interpolation of two snapshots. Based on the interpolated POD bases, the selected elements in RID are given in Table 6 . The interpolated RIDs and error distribution by manifold interpolation are also presented in Fig. 8 . As all the selected elements are within 250 for the plastic calculation compared to 10240 of the FEM, the online time ratio T  R of 26.61 is obtained for the 5 cases. Moveover, a level of accuracy smaller than 10% is ensured for the displacement, the elastic strain, the plastic strain and the stress as given in Fig. 8(d). It should be mentioned that the CPU time for the manifold interpolation is only 0.28s, which is neglectable compared to the online time. To validate the superiority of the manifold interpolation for small size POD bases, the CPU time and maximum errors of linear and angle interpolation [24] are also given in Table 7 . Similar CPU time is found for the traditional linear interpolation, while it gives the largest error. Besides the CPU time, the angle interpolation shows the same error as the manifold interpolation, which agrees with the previous research [25]. Unfortunately, the angle interpolation is limited to second-order. The manifold keeps the accuracy and is flexible for high-order interpolation, that is also the reason why it is adopted in this paper.  As the plastic strains are the key parameters for the thermo-elasto-plastic analysis, the maximum equivalent plastic strain (PEEQ) is evaluated for the five thermal loads as given in Fig. 9 . Actually, the element containing the maximum PEEQ is in the selected RID and is calculated in all the times steps, hence the precision can be guaranteed, where the maximum error of 1.89% is found for load 800W. Similar distribution is also founded for the stress.  As presented in Section 4, the known plastic strains of the snapshots are considered as the initial values of plastic calculation for the parametric studies. The effectiveness of this improvement is given in Fig. 10 (a). For the time step 7 of thermal load 800W, the residual decreases greatly after the first iteration and it converges to 0.01 within 3 following iterations, while 12 iterations are needed to reach the prescribed level of accuracy without considering the known plastic strains. As a result, the online time comparison is given in Fig. 10(b), it can be seen that the online CPU time in the plastic step 7 of the HROM is much faster (0.28s) than the case without initial plastic strains. Furthermore, there are no significant difference between elastic and plastic calculations with the adopted initial plastic strains, where the online CPU varies from 0.63s to 0.65s with time steps from 23 to 25 in the elastic calculation, and the plastic case is 0.85s in time step 31.  To test the effectiveness of the manifold interpolation, five yield stresses with a variation of 15% of 200MPa, 140MPa, 170MPa, 200MPa, 230MPa and 260MPa are studied with the thermal load of 800W. For two snapshots 140MPa and 260MPa and the same truncation ratio as the thermal load for the reduced basis modes, the error evolution is given in Fig. 11 (a). Unfortunately, the maximum error is near 20% for the elastic strain, and the errors of displacement and stress are more than 10% for yield stresses of 170 and 200MPa with the second-order interpolation.  There are two solutions to improve the accuracy: one way is to increase the size of the reduced basis, while it increases the selected elements in RID and leads to high computational effort; the other one is to increase the order of the interpolation, which keeps the advantage of small size basis. In this paper, we choose the later solution, then an additional snapshot of 200MPa (the middle point) is selected for the Grassmann manifold interpolation. With the algorithm described in Fig. 6 and Eq. (43), the third-order interpolation is implemented. To reduce the computational cost, POD modes of three snapshots for displacement, the plastic strain and stress are considered for the interpolation.  Through the interpolation of three snapshots, the new RID information and error distribution is given in Fig. 11(c). It can been seen that all the interpolation errors are significantly reduced for yield stresses of 170MPa and 230MPa. Due to the enrichment of the POD bases, only few additional elements (corresponding to 191 and 169) are selected compared with the second-order interpolation (162 and 140) as shown in Table 8 . The increased element selection leads to slightly higher online time as shown in Table 9 , while more than 25 times computational time is still obtained compared to the full model. It should be mentioned that the interpolation CPU time can still be ignored compared to the total time as indicated in Table 9.  Besides the global error distributions, the distributions of the maximum PEEQ are also given for two and three snapshots interpolations in Fig. 11(b) and 11(d), respectively. As the element containing the maximum PEEQ is always selected in the RID and calculated in all time steps, slightly influence on the maximum PEEQ is found by the number of the snapshot, and all the errors are within 2%. However, the number of snapshot greatly improves the global error distribution due to more accurate POD bases, which are used to extrapolate the obtained results from the local RID to the entire domain.   CONCLUSIONS   An improved hyper reduced-order model (HROM) for 3D thermo-elasto-plastic calculation is introduced in this paper. The reduced bases of the increments of displacement and plastic strain are used to reduce the global model to a small reduced integration domain (RID). The stress reduced basis is also adopted to increase the precision when stress is projected from the local RID to the global domain. To construct the new bases for parametric studies, the Grassmann manifold interpolation is employed, which is possible for high-order interpolation and ensures the small size of the POD bases. In order to reduce the iteration number of plastic loop, the linear interpolated plastic strains of the adopted snapshots are also chosen as the initial inputs for the interpolated cases, then less than 7 iterations are obtained at each time step for the plastic calculation in the local RID to reach the given level of accuracy.  By the truncation ratio of   [ 0.9999 , 0.995 , 0.8 ]   T   , the reference problem shows that the HROM can be 22 times faster compared to the finite element model with small size POD bases and few elements in the RID, while all the global errors are within 10% for the displacement, elastic strain, plastic strain and stress. With a higher truncation ratio of   [ 0.99999 , 0.9999 , 0.99 ]   T   , the maximum error within 2% can be obtained with the CPU gain of 18. So the selection of truncation ratio depends on the desired accuracy or the CPU gain.  Based on the manifold interpolation for determining the adaptive POD basses, the parametric study on the variational thermal loading saves 26 CPU ratio for the interpolated case with the help of initial plastic information known from the snapshots. Moreover, the global errors are still controlled within 10%.  With the same truncation ratio of   [ 0.9999 , 0.995 , 0.8 ]   T   as the thermal load, and one component selection of each POD basis, the second-order interpolation is not enough for the modified yield stress of a range of 15%. Instead of increasing the size of the POD basis and components selection, the third-order interpolation obtains higher precision with the maximum error of 9.5% and more than 25 CPU ratio is still obtained.  Generally speaking, the HROM coupled with the manifold interpolation seems a very good choice for 3D thermo-elasto-plastic calculations.   ACKNOWLEDGMENTS   The authors would like to acknowledge the AREVA-SAFRAN chair for the financial support.  The final iterative algorithm of the method given in Algorithm 1. Algorithm 1 Global iterative scheme of the HROM.          inputs:      • Snapshots: Δ U ; Δ Y ; Δ σ        • The external load: Δ   f   i   ext   , Δ   f   i   th   , Δ   ε   i   th          • The operators : D , B , ∫   B   T    d Ω , K ,   Π   i          Output:      • The full field of the modified problem:   U   i   ,   ε   i   p   ,   ε   i   e   ,   σ   i              /⁎ Calculation of reduced basis  ⁎/    1.1      Ψ   U     ⟵   SVD   Δ   U   ref   ;     1.2      Ψ   Y     ⟵   SVD   Δ   Y   ref   ;     1.3      Ψ   σ     ⟵   SVD   Δ   σ   ref   ;     1.4  Select the reduced integration domain (RID)     /⁎ Loop over the modified problems  ⁎/    1.5   for each modified problem   Δ   f   i   ext    do             1.6           1.7     1.8        1.9     1.10        1.11     1.12        1.13     1.14     1.15        |     // Start  the  loop  on  each  time  step     for  t = 1 … T  do     |     // Local – global  iterative  scheme     // Determine  the  initial  estimation  of  the  displacements     (   (   Ψ   U   )   T     Π   i   T     Π   i   K   Ψ   U   ) Δ   λ   i   U   ( t ) =   (   Ψ   U   )   T      Π   i   T      Π   i   ( Δ   f   i   ext   ( t ) + Δ   f   i   th   ( t ) )     Δ   u   i   ( t ) =   Ψ   U    Δ   λ   i   U   ( t )     // Determination  of  the  increments  by  RID  ( local  problem )     Δ   u   i   ( t ) ,  Δ   ε   Π i   p   ( t ) ,  Δ   p   Π i   ( t ) ,  Δ   σ   Π i   ( t ) .  ⟵ ( See  Algorithm  2 )     Δ   Y   Π i   ( t ) = { Δ       ε   ̲     ̲     Π i   p   ( t ) }     // Extrapolation  of  the  plastic  strain  to  the  whole  domain     Δ   λ   i   Y   ( t ) =   (     Ψ   Y     T        Π   i   Y     T      Π   i   Y      Ψ   Y   )   − 1        Ψ   Y     T        Π   i   Y     T      Π   i   Y    Δ   Y   Π i   ( t )     Δ   Y   i   ( t ) =   Ψ   Y   Δ   λ   i   Y   ( t )     // Then  the  increment  of  plastic  strain  can  be  obtained     Δ   ε   i   p   ( t ) , Δ   p   i   ( t ) .  Similar  is  done  for  the  stress     Δ   ε   i   e   ( t ) = Δ B  Δ   u   i   ( t ) − Δ   ε   i   p   ( t ) − Δ   ε   i   th   ( t )         end           1.16   end          Local iterative scheme of the HROM.          inputs:      • Increments: Δ   λ   i   U   ( t ) , Δ   f   i   ext   ( t ) , Δ   f   i   th   ( t ) , Δ   ε   i   th   ( t )        • Operator functions: D , B , ∫   B   T    d Ω , K ,   Ψ   U   ,   Ψ   Y   ,   Π   i          outputs:      • Increments of time step t: Δ   u   i   ( t ) , Δ   ε   Π i   p   ( t ) , Δ   p   Π i   ( t ) , Δ   σ   Π i   ( t )            /⁎ Local-iterative scheme: initiation of the increments for plastic strain  ⁎/    2.1    Δ   ε   i   p   ( t ) = 0 ; Δ   f   i   p   ( t ) = 0 ;   R   c   =   10   − 2   .     /⁎   Index   loop   = 1 . ( 1 : continue ; 0 : stop .) ⁎/    2.2   while    Index   loop   = 1 . do          2.3        2.4     2.5     2.6     2.7     2.8     2.9           2.10     2.11        2.12     2.13     2.14        2.15     2.16        2.17     2.18     2.19     2.20        2.21     2.22     2.23        |     Δ   ε   i   ( t ) = B Δ   u   i   ( t ) ,     // Loop  all  the  elements  over  RID     for  n = 1 …   N   RID    do     |     Δ   σ   i   ( t , n ) = D Δ   ε   i   ( t , n )       σ   i   ( t , n ) =   σ   i   ( t , n ) + Δ   σ   i   ( t , n )     Calculate  yield  function ,  f (   σ   i   ( t , n ) ,   p   i   ( t , n ) )     if  f > 0  then     |     Δ   λ   i   ( t , n ) =   f   3 G + H   ,     Δ   ε   i   p   ( t , n ) =    ∂ f   ∂ σ    Δ   λ   i   ( t , n ) ,     Δ   ε   i   e   ( t , n ) = Δ   ε   i   ( t , n ) − Δ   ε   i   p   ( t , n ) − Δ   ε   i   th   ( t , n ) ,     Δ   σ   i   ( t , n ) = D Δ   ε   i   e   ( t , n )     Δ   p   i   ( t , n ) = Δ   λ   i   ( t , n )         else     |     Δ   λ   i   ( t , n ) = 0 ,  Δ   ε   i   p   ( t , n ) = 0 ,  Δ   ε   i   e   ( t , n ) = Δ   ε   i   ( t , n ) ,     Δ   σ   i   ( t , n ) = D Δ   ε   i   e   ( t , n )         end         end     Δ   f   i   P   ( t ) = ∫   B   T   Δ   ε   i   p   ( t )  d Ω     // Check  the  equilibrium  within  the  RID       R   RID   = (   Ψ   T      Π   i   T      Π   i    K  Ψ )  Δ   λ   i   U   ( t ) −   Ψ   T      Π   i   T      Π   i    ( Δ   f   i   ext   ( t ) + Δ   f   i   th   ( t ) + Δ   f   i   p   ( t ) )     if  ∥   R   RID   ∥ > =   R   c    then     |     // Determine  the  displacements  due  to  the  plastic  balance  force     (   (   Ψ   U   )   T      Π   i   T      Π   i    K    Ψ   U   )  Δ   λ   i   Up   ( t ) =   (   Ψ   U   )   T      Π   i   T      Π   i    Δ   f   i   p   ( t )     Δ   u   i   p   ( t ) =   Ψ   U    Δ   λ   i   Up   ( t )     Δ   u   i   ( t ) = Δ   u   i   ( t ) + Δ   u   i   p   ( t )         else     |     // Stop  loop : loop  index  is  given  to  0       Index   loop   = 0     Return  Δ   ε   i   p   ( t ) ,  Δ   p   i   ( t )         end           2.24   end           REFERENCES", "highlights": "This paper focuses on a 3D thermo-elasto-plastic localized thermal source simulation and its parametric analysis with high CPU efficiency in the reduced-order model (ROM) framework. The hyper reduced-order model (HROM) is introduced and improved with two choices. Firstly, three reduced bases are constructed: one for the displacement increments, one for the plastic strain increments and one for the stress state. Equilibrium equation in plasticity relies on the knowledge of plastic strain rate, hence the plastic strain has to be included into the variable to be reduced, and the incremental form is adopted in the paper. It is shown that the introduction of an extra stress basis greatly improves the quality and the efficiency of the ROM. Secondly, the reduced state variables of plastic strain increments are determined in a reduced integration domain. Concerning the parametric analysis, the interpolation of the reduced bases is based on the Grassmann manifold, which permits to generate the new proper orthogonal decomposition bases for the modified parameters. In order to increase the convergence rate, the plastic strain interpolated from snapshots (the reference cases with full FEM calculations) is considered as the initial value of each time step for the modified problem of parametric studies. As a result, the plastic calculation is always done on the confined domain and only a few iterations are then required to reach static and plastic admissibility for each time step. The parametric studies on varying thermal load and yield stress show high versatility and efficiency of the HROM coupled with Grassmann manifold interpolation. A gain of CPU time of 25 is obtained for both cases with a level of accuracy smaller than 10%."}