{"id": "S0168874X13000966", "article": "MAIN-TITLE The moving grid finite element method applied to cell movement and deformation   HIGHLIGHTS          A novel application of the moving grid finite element method to a visco-elastic model for cell movement and deformation.      The cell moves and deforms on a two-dimensional substrate in complete agreement with experiments.      The cell can move, translate, expand, contract and relocate, its position continuously changing.      The generality of the numerical methodology allows us to solve similar complex problems in multi-dimensions.          KEYPHRASES   Moving grid finite element method  Moving boundary problem  Lagrangian kinematics  Cell movement  Cell deformation  Cell motility  Reaction–diffusion equations   The migratory behavior of cells plays a crucial role in many biological events (e.g. physiological and pathological process [4]) such as immune response [5–7], wound healing, development of tissues [8], embryogenesis [9,10], inflammation and the formation of tumor metastasis [7,11]. According to experimental observations, actin plays an important role in cell movement and deformation. Actin is a polymer that can exist in two forms; in monomeric form as G-actin or in polymeric form (i.e. in filamentous form) as F-actin [12]. The mechanical properties of actin network and the biochemical dynamics of actin (i.e. the concentration of F-actin, its random movement via diffusion, convective and dilution effects due to shape movement and its kinetics of polymerization and de-polymerization from F-actin to G-actin) inside the cell play an active role in cell movement and deformation [12–15].  In order to describe the dynamics of movements and changes in cell geometry of a eukaryotic cell we will consider a cytomechanical model that is derived based on the actin dynamics. The model is highly complex and consist of a system of nonlinear equations defined on a complex evolving geometry representing the cell. We propose to apply a novel numerical method: the moving grid finite element method (MGFEM) [1,17] to compute numerical approximate solutions of the cytomechanical model. A determining factor in choosing a numerical method is usually the ease in which a method can be applied to a problem at hand and the ability of the method to produce highly accurate solutions in comparison with other available methods. The key factors being accuracy, efficiency and robustness of the numerical method Bindu [16,17,20,25].  To the best of our knowledge, this article is the first to present the use of finite elements to solve the cytomechanical model system. To-date, numerical approximation of the cytomechanical model has been done by Alt and Tranquillo [15] and Stéphanou et al. [12] based on finite differences. Rather than working in the original cartesian coordinates, the authors transform the model system into a polar coordinate system which makes it difficulty to describe the evolution of a cell as it moves outside the origin of the polar coordinate system. The cell is not able to move or deform away from the origin [12]. The origin remains a fixed point, the cell is only able to deform along the boundary but is not able to move freely on the substrate as is observed in experiments [12]. In order to remedy this drawback, we propose to employ the MGFEM thereby enabling us to simulate accurately cell movement and deformation in complete agreement with experimental observations. Other alternative methods that could be used to overcome difficulties in solving the cytomechanical model using [18,19] finite differences include (but are not limited to) boundary element methods (BEM) [22,23] and level set methods (LSM) [24]. Since the cytomechanical model is a second order inhomogeneous and nonlinear system of partial differential equations, the application of the BEM is much more difficult compared to FEM [26]. The LSM will not be implemented here but could be implemented in the future by coupling the method to the MGFEM in order to facilitate modeling splitting and reconnecting cells. In this article, we choose to implement a finite element formulation by employing the MGFEM [1,17,29] for two advantageous reasons: (i) the MGFEM solves the model equations in their physical cartesian coordinates without the need for transformations or mappings and (ii) the MGFEM easily handles complex and evolving cellular domains. As a result, the cell is able to move and deform freely on the substrate in complete agreement with experimental observations.  In view of these key advantages, we develop a MGFEM of the cytomechanical model that is defined on a two-dimensional (2D) cartesian coordinate system. The MGFEM is a novel extension of the finite element method to moving boundary problems introduced by Madzvamuse [27] to study partial differential equations posed on complex evolving domains. The essential component underlying the MGFEM is that the object function is represented by piecewise basis functions on a finite element mesh in which the nodal positions vary with time [1,17,29]. It is a highly accurate, efficient and robust numerical method which has been used successfully to compute numerical solutions of reaction–diffusion systems on evolving and continuously deforming domains with complex geometries (see [1,17,21,28] for details). The novelty of the MGFEM is its ability to allow the prescription of the nodal displacement of the computational grid points of the finite element mesh during the evolution of the domain. It is able to accommodate a priori description of the grid displacement [27], a computed grid displacement (which are solutions of a partial differential equation of an unknown variable) or a grid displacement generated by minimizing the residual of the differential equation [29,30] (as developed by [30] in the moving finite element). The difference between the moving finite element and MGFEM is the derivation of the grid displacement [21].  Therefore, this article is structured as follows: In Section 2 we present the cytomechanical model. In Section 3 we derive the weak formulation for the cytomechanical model and then present the finite element discretization of the model system. We also describe the method of computation of the domain evolution and the techniques of implementation of the MGFEM. Since the cytomechanical model is a highly complex nonlinear system of partial differential equations, analytical solutions in closed form can not be derived. To this end, it is difficult to compare numerical solutions to exact analytical solutions. Therefore, in order to validate numerical results, we call upon linear stability theory and show that close to bifurcation points, the numerical method computes solutions in close agreement with those predicted by linear theory. Details of linear stability theory are presented in Appendix B. Linear theory also provides us with plausible ranges for the parameter values. Once validated, numerical results obtained from the implementation of the MGFEM are shown in Section 4. Finally, in Section 5 we conclude and discuss future research strands.  Following George et al. [31], let   Ω   t   ⊂   R   2   be a simply connected bounded continuously deforming domain representing the Eukaryotic cell shape at time t ∈ I = [ 0 ,   T   f   ] ,   T   f   > 0 and ∂   Ω   t   be the boundary describing the cell. At any given point, x = ( x ( t ) ,  y ( t ) ) ∈   Ω   t   ⊂   R   2   , let a = a ( x ( t ) ,  t ) be the F-actin concentration and u =   ( u ( x ( t ) ,  t ) , v ( x ( t ) , t ) )   T   be a vector of displacement of the elements of the actin network at position x ∈   Ω   t   at time t ∈ I . As a result of cell movement we define β to represent the flow velocity of the elements of the actin network and   ω   n   the normal velocity of the boundary. Furthermore denote n = (   n   1   ,    n   2   ) the outward unit vector normal to the boundary. We note that by defining u to be a vector of displacement of the elements of the actin network at position x ∈   Ω   t   at time t ∈ I , the following system of equations describing the actin dynamics as given by Stéphanou et al. [12] models both plasticity and viscoelasticity of the actin network: for all t ∈ I ,  (2.1a)  ∇ · (   σ   v   +   σ   e   +   σ   c   +   σ   p   ) = 0  in    Ω   t   ,      (2.1b)    ∂ a   ∂ t   −   D   a   Δ a + ∇ · ( a β ) −   k   a   (   a   c   − a ) = 0  in    Ω   t   ,      (2.1c)  u ( x ( t ) , t ) = 0  ∀ x ∈   Ω   0   ,      (2.1d)  a ( x ( t ) , t ) =   a   0    ∀ x ∈   Ω   0   ,      (2.1e)  β =   ω   n    ∀ x ∈ ∂   Ω   t   ,      (2.1f)  (   σ   v   +   σ   e   ) · n = n · ∇ a = 0  ∀ x ∈ ∂   Ω   t   ,   where   Ω   0   is the initial cell domain at time t=0. In (2.1a),   σ   v   ,   σ   e   ,   σ   c   and   σ   p   are the viscous, elastic, contractile and pressure component stress tensors. These are defined as  (2.2)  {       σ   c   = σ ( a ) I = ψ   a   2     e   − a /   a   sat     I ,       σ   v   =   μ   1      ∂ ϵ   ∂ t    +   μ   2      ∂ ϕ   ∂ t    I ,       σ   e   =    E   1 + ν    (  ϵ +    ν   1 − 2 ν    ϕ I  ) ,       σ   p   =    p   1 + ϕ    (  1 +    2   π    δ ( l )  arctan  a  ) I ,       where ϵ =   1   2   ( ∇ u + ∇   u   T   ) represents the strain tensor, I is the identity tensor, ϕ = ∇ · u is the dilation, and   μ   1   and   μ   2   are the shear and bulk viscosities of the actin network respectively. Finally E and ν are the Young's modulus and Poisson ratio respectively. The function σ ( a ) represents the contractile activity of the actomyosin network [31]. In the above formulation, 2   a   sat   represents the saturation concentration of F-actin. In order to describe the pressure forces   σ   p   acting within the cell we make the following assumptions. We assume that the initial domain is a unit disk which we denote as   Ω   0   and that there exists a family of bijective mappings that maps the points ξ = (   ξ   x   ,   ξ   y   ) of the initial domain to point x on the current domain   Ω   t   . Let l :   Ω   t   × I → R and it's corresponding function on the initial domain be   l   ^   :   Ω   0   × I → [ 0 , 1 ] where   l   ^   ( ξ ,  t ) is the distance between the centroid and the point ξ in the initial domain with   l   ^   ( ξ , t ) = l ( x ( ξ ,  t ) , t ) . The function p ( a ) ≔ p / 1 + ϕ ( 1 + ( 2 / π ) δ ( l )  arctan  a ) describes the pressure force in different regions governed by the heavy-side function:  (2.3)  δ ( l ) = {     1   if  the  point  ( x ,  t )  with  l ( x ( ξ , t ) , t ) =   l   ^   ( ξ , t )  is  such  that      the  distance      ξ   x   2   +   ξ   y   2     > 0.8  in  the  initial  domain ,     0   elsewhere .          This signifies that far from the membrane, only the osmotic component p / ( 1 + ϕ ) of the pressure force exists within the network and depends on the dilation ϕ . In the vicinity of the membrane (i.e. where     ξ   x   2   +   ξ   y   2     > 0.8 ), a polymerization-induced pressure which depends on the local actin density reinforces the osmotic stress and pushes the membrane out at regions where the filaments are not firmly linked to the membrane [31]. δ ( l ) is used here to specify the differences in pressure in the cell at the vicinity of the membrane and further away from it. We have assumed that the polymerization of actin, which happens predominately at the vicinity of the membrane, induces a pressure that reinforces the osmotic pressure at the vicinity of the membrane. Eq. (2.1b) describes the conservation of F-actin within the cell. It describes the concentration of F-actin, its random movement via diffusion, convective and dilution effects due to the movement of the cell and its kinetics of polymerization and depolymerization.  In (2.1b), a  c is a constant parameter representing the F-actin concentration at the chemical equilibrium. It differentiates the states of polymerization and depolymerization. The polymerization rate is given by k  a and D  a is a positive diffusion coefficient for F-actin. The reaction kinetics   k   a   (   a   c   − a ) , models the actin dynamics of polymerization and depolymerization. The actin polymerization and depolymerization are considered to occur at the same rate k  a . Thus the state of polymerization or depolymerization depends on the local value of F-actin concentration relative to the concentration at the chemical equilibrium a  c  [55]. On the boundary, we take the flow velocity of the actin network β =   ω   n   ≔ ∂ u / ∂ t . Here u is the displacement of the actin network at any given point in space and is computed as the displacement solution obtained from the force balance equation (2.1a). In the interior of the domain, we assume that β = ∂ x / ∂ t ≔ ∂ u / ∂ t where ∂ x / ∂ t is the mesh velocity. Thus we have a Lagrangian description of the domain evolution.  For initial conditions, we define the initial domain   Ω   0   , t=0, to be a unit disk. We prescribe the initial conditions for F-actin density a 0 to correspond to random small perturbations around the homogeneous steady state of the cell. This state biologically corresponds to the cell condition right after mitosis (i.e. cell division) with the cell having a perfectly circular shape. The steady state of F-actin is assumed to occur as a result of an equilibrium in the kinetics of polymerization/depolymerization of actin within the cell and there is no flux of actin from the exterior. We assume that at the initial time, the cell is unstrained from its original position. The boundary conditions in (2.1f) specify a zero flux boundary for the reaction–diffusion equation (2.1b) and a stress free boundary for the force balance equation (2.1a). Remark 2.1 We note that in a previous work by Stéphanou et al. [12], the displacement u ( x ( t ) ,  t ) was taken to be the displacement of the elements of the actin network from the original unstrained position. In this work, we compute the displacement u ( x ( t ) , t ) continuously given the previous positions of x ∈   Ω   t   , at time t ∈ I . An advantage of this modification is that the cell is no longer rigid but can translate, expand and contract.  Model parameter values are chosen close to those available in the literature. For example, in Stéphanou et al. [12], a diffusion coefficient D  a in the range 0.00962 – 0.134    cm   2   / s and an actin saturation concentration a  sat of 1.1 normalized density were used. Viscosity of Fibroblast cells is given in Bausch et al. [32] to be 200dyn/cm2. Here we choose the value of the shear viscosity to be 96.15  dyn  s    cm   2   and the value of the bulk viscosity of the actin network   μ   2   = 250  dyn  s /   cm   2   to be larger than that of the shear modulus. This is because F-actin are more resistant to compression than shear [33]. The rest of the dimensional model parameter values are shown in Table 1 . It must be noted that we have not assigned parameter values for pressure coefficient p and the contractile coefficient ψ , these will be determined mathematically by use of linear stability as illustrated in Appendix B.  The essential component underlying the moving grid finite element method (MGFEM) is that the object function is represented by piecewise basis functions on a finite element mesh in which the nodal positions vary with time [1,17,29]. The way in which these nodes are moved and how the solution evolves is derived in the weak form of the model system. Unlike previous studies [1,17] where the nodal movement was provided by a separate definition, here nodal movement is an unknown quantity to be computed simultaneously with the actin concentrations. The MGFEM is an extension of the finite element method to moving boundary problems. Thus from Sections 3.1–3.80, we describe the finite element discretization of the coupled system (2.1) defined on a moving cell and in Section 3.9, we present the method for the cell domain evolution. We note that the MGFEM applied to reaction–diffusion equations has already been established [21] but this is not the case for the force balance equation. Our aim is to present in detail the MGFEM applied to the cytomechanical model by deriving a MGFEM of the force balance equation and then couple it to that of the reaction–diffusion equation.   Reynolds transport theorem. Here we state the Reynolds transport theorem. This theorem shall be useful in the derivation of the weak formulation for the reaction–diffusion equation. Theorem 3.1 Reynolds transport theorem    Let  g ( x , t )  be a scalar function defined on    Ω   t    and  β  be a flow velocity field then   (3.1)    d   dt     ∫     Ω   t     g  d   Ω   t   =   ∫     Ω   t     (    Dg   Dt   + g ∇ · β  )   d   Ω   t      A proof of this theorem can be found in [27].  To proceed, we decouple the force balance equation into a system of two partial differential equations for ease of implementation of the weak formulation. We substitute the values of   σ   v   ,   σ   e   ,   σ   c   and   σ   p   as defined in (2.2) into the force balance equation (2.1a). This necessitates the expression of the stress tensors in tensor-matrix forms. It follows that the dilation ϕ by definition is ϕ ≔ ∇ · u = ∂ u / ∂ x + ∂ v / ∂ y and the stain tensor ϵ is   ϵ ( u ) =   1   2   ( ∇ u + ( ∇ u ) T ) = (       ∂ u   ∂ x       1   2   (   ∂ v   ∂ x   +   ∂ u   ∂ y   )       1   2   (   ∂ v   ∂ x   +   ∂ u   ∂ y   )     ∂ v   ∂ y       )  ∈    R   2 × 2   .   By using the above representation of the strain tensor ϵ and the dilation ϕ , we represent the stress tensors   σ   c   ,   σ   p   ,   σ   e   and   σ   v   (defined in (2.2)) in two-dimensional tensor-matrix forms as members of   R   2 × 2   as follows:     σ   c   = (     ψ   a   2     e   − a /   a   sat       0     0   ψ   a   2     e   − a /   a   sat         ) ,   σ   v   = (     (   μ   1   +   μ   2   )   ∂   u   ̇     ∂ x   +   μ   2     ∂   v   ̇     ∂ y         μ   1     2   (   ∂   v   ̇     ∂ x   +   ∂   u   ̇     ∂ y   )         μ   1     2   (   ∂   v   ̇     ∂ x   +   ∂   u   ̇     ∂ y   )     μ   2     ∂   u   ̇     ∂ x   + (   μ   1   +   μ   2   )   ∂   v   ̇     ∂ y       ) ,   σ   e   =   E ′   2   (     ( ν ′ + 2 )   ∂ u   ∂ x   + ν ′   ∂ v   ∂ y       ∂ v   ∂ x   +   ∂ u   ∂ y         ∂ v   ∂ x   +   ∂ u   ∂ y     ν ′   ∂ u   ∂ x   + ( ν ′ + 2 )   ∂ v   ∂ y       ) ,   and     σ   p   = (       p   1 + ϕ   ( 1 +   2   π   δ ( l )  arctan  a )   0     0     p   1 + ϕ   ( 1 +   2   π   δ ( l )  arctan  a )     ) .   Substituting the matrix tensor representation of the stress tensors into (2.1a) we obtain the force balance equation in matrix tensor form which is then decoupled into a system of two equations. The decoupled system of differential equations of the force balance equation is thus  (3.2a)    ∂   ∂ x   (    D   11     ∂   u   ̇     ∂ x   +   D   12     ∂   v   ̇     ∂ y    ) +   ∂   ∂ y   [    D   33   (    ∂   u   ̇     ∂ y   +   ∂   v   ̇     ∂ x    )  ] +   ∂   ∂ x   (    C   11     ∂ u   ∂ x   +   C   12     ∂ v   ∂ y    )  +   ∂   ∂ y   [    C   33   (    ∂ u   ∂ y   +   ∂ v   ∂ x    )  ] = −   ∂   f   1     ∂ x   ,   and  (3.2b)    ∂   ∂ x   [    D   33   (    ∂   u   ̇     ∂ y   +   ∂   v   ̇     ∂ x    )  ] +   ∂   ∂ y   (    D   12     ∂   u   ̇     ∂ x   +   D   22     ∂   v   ̇     ∂ y    ) +   ∂   ∂ y   (    C   12     ∂ u   ∂ x   +   C   22     ∂ v   ∂ y    )  +   ∂   ∂ x   [    C   33   (    ∂ u   ∂ y   +   ∂ v   ∂ x    )  ] = −   ∂   f   2     ∂ y   ,   where     f   1   ≡   f   2   = [    p   1 + ϕ   (  1 +   2   π   δ ( l )  arctan  a  ] + ψ   a   2     e   − a /   a   sat      ) ,         D   11   =   D   22   =   μ   1   +   μ   2   ,    D   12   ≡   D   21   =   μ   2   ,    D   33   =   μ   1   / 2 ,         C   11   ≡   C   22   =   E ( 1 − ν )   ( 1 + ν ) ( 1 − 2 ν )   ,    C   12   ≡   C   21   =   E ν   ( 1 + ν ) ( 1 − 2 ν )   ,  and         C   33   =   E   2 ( 1 + ν )   .      To derive the weak formulation of the force balance equation, we multiply the system of partial differential Eqs. (3.2a) and (3.2b) by the test functions   w   1   ( x ,  t ) and   w   2   ( x ,  t ) ∈   H   1   (   Ω   t   ) , t  ∈ I respectively, and using Green's formula [34] we integrate the partial differential equations over the domain   Ω   t   and apply the boundary condition (2.1f). We note that the boundary condition (2.1f) implies that the boundary term vanishes after carrying out the integration over the domain. The weak formulation is thus: Find u ( x ,  t ) , v ( x ,  t ) ∈   H   1   (   Ω   t   ) , t ∈ I such that  (3.3a)    ∫     Ω   t       ∂   w   1     ∂ x   (    D   11     ∂   u   ̇     ∂ x   +   D   12     ∂   v   ̇     ∂ y   +   C   11     ∂ u   ∂ x   +   C   12     ∂ v   ∂ y    ) +   ∂   w   1     ∂ y   [    D   33   (    ∂   u   ̇     ∂ y   +   ∂   v   ̇     ∂ x    )  ]  +   ∂   w   1     ∂ y   [    C   33   (    ∂ u   ∂ y   +   ∂ v   ∂ x    )  ] d   Ω   t   =   ∫     Ω   t       w   1     ∂   f   1     ∂ x    d   Ω   t   ,   and  (3.3b)    ∫     Ω   t       ∂   w   2     ∂ y   (    D   12     ∂   u   ̇     ∂ x   +   D   22     ∂   v   ̇     ∂ y   +   C   12     ∂ u   ∂ x   +   C   22     ∂ v   ∂ y    ) +   ∂   w   2     ∂ x   [    D   33   (    ∂   u   ̇     ∂ y   +   ∂   v   ̇     ∂ x    )  ]  +   ∂   w   2     ∂ x   [    C   33   (    ∂ u   ∂ y   +   ∂ v   ∂ x    )  ]  d   Ω   t   =   ∫     Ω   t       w   2     ∂   f   2     ∂ y    d   Ω   t   ,   for all   w   1   ( x ,  t ) ,   w   2   ( x ,  t ) ∈   H   1   (   Ω   t   ) , t ∈ I . The integrals on the right hand side of the weak formulation (3.3) are difficult to evaluate. To show this we write them out explicitly as  (3.4)  {       ∫     Ω   t       w   1      ∂   f   1     ∂ x     d   Ω   t   =   ∫     Ω   t       w   1      ∂   ∂ x    [     p   1 + ϕ    (  1 +    2   π    δ ( l )  arctan  a  )  ]  d   Ω   t        +   ∫     Ω   t       w   1      ∂   ∂ x    ( ψ   a   2     e   − a /   a   sat     )  d   Ω   t   ,       ∫     Ω   t       w   2      ∂   f   2     ∂ y     d   Ω   t   =   ∫     Ω   t       w   2      ∂   ∂ y    [    p   1 + ϕ   (  1 +    2   π    δ ( l )  arctan  a  )  ]  d   Ω   t        +   ∫     Ω   t       w   2      ∂   ∂ y    ( ψ   a   2     e   − a /   a   sat     )  d   Ω   t   ,       since   f   1   ≡   f   2   = p / 1 + ϕ ( 1 + ( 2 / π ) δ ( l )  arctan  a ) + ψ   a   2     e   − a /   a   sat     . In view of this, we state the following identities which can be derived using the gradient and divergence theorems and are useful in the sequel in rewriting the weak form in a computationally efficient form. Let r ( x ,  t ) and g ( x ,  t ) be scalar functions of class   C   0   (   Ω   t   ) defined in   Ω   t   ⊂   R   2   and also let n = (   n   1   ,    n   2   ) denote the outward unit vector normal to ∂   Ω   t   for time t ∈ I . Then the following identities (derived from the gradient theorem) hold [16]:  (3.5)  {       ∫     Ω   t     r    ∂ g   ∂ x     d   Ω   t   = −   ∫     Ω   t     g    ∂ r   ∂ x     d   Ω   t   +   ∫   ∂   Ω   t       n   1   rg  ds ,       ∫     Ω   t     r    ∂ g   ∂ y     d   Ω   t   = −   ∫     Ω   t     g    ∂ r   ∂ y     d   Ω   t   +   ∫   ∂   Ω   t       n   2   rg  ds ,       where ds is the element of arclength. Using the identities (3.5) we can rewrite the weak form as follows: Find u ( x , t ) , v ( x , t ) ∈   H   1   (   Ω   t   ) , t ∈ I such that  (3.6a)    ∫     Ω   t       ∂   w   1     ∂ x   (    D   11     ∂   u   ̇     ∂ x   +   D   12     ∂   v   ̇     ∂ y   +   C   11     ∂ u   ∂ x   +   C   12     ∂ v   ∂ y    ) +   ∂   w   1     ∂ y   [    D   33   (    ∂   u   ̇     ∂ y   +   ∂   v   ̇     ∂ x    )  ]  +   ∂   w   1     ∂ y   [    C   33   (    ∂ u   ∂ y   +   ∂ v   ∂ x    )  ]  d   Ω   t   = −   ∫     Ω   t       f   1     ∂   w   1     ∂ x    d   Ω   t    +   ∫   ∂   Ω   t       n   1     f   1     w   1    ds ,   and  (3.6b)    ∫     Ω   t       ∂   w   2     ∂ y   (    D   12     ∂   u   ̇     ∂ x   +   D   22     ∂   v   ̇     ∂ y   +   C   12     ∂ u   ∂ x   +   C   22     ∂ v   ∂ y    ) +   ∂   w   2     ∂ x   [    D   33   (    ∂   u   ̇     ∂ y   +   ∂   v   ̇     ∂ x    )  ]  +   ∂   w   2     ∂ x   [    C   33   (    ∂ u   ∂ y   +   ∂ v   ∂ x    )  ]  d   Ω   t   = −   ∫     Ω   t       f   2     ∂   w   2     ∂ y    d   Ω   t    +   ∫   ∂   Ω   t       n   2     f   2     w   2    ds ,   for all    w   1   ( x ,  t ) ,   w   2   ( x ,  t ) ∈   H   1   (   Ω   t   ) , t ∈ I . Here n 1 and n 2 are the direction cosines of the outward unit vector, n normal to ∂   Ω   t   for time t ∈ I . The test functions we use are piecewise linear basis functions and their spatial derivatives are easy and straight forward to compute, the weak formulation as expressed in (3.6) is a lot easier to compute compared to (3.3). We say that u ( x ,  t ) , v ( x ,  t ) are weak solutions of the force balance equation (2.1a) if u ( x ,  t ) , v ( x ,  t ) ∈   H   1   (   Ω   t   ) and (3.11) holds. Here we have assumed that a ( x ,  t ) is known and is the solution of the reaction–diffusion equation (2.1b). Remark 3.1 We would like to note that we do not actually compute the derivatives of the delta function but we transfer these derivatives to the test function by using identities (3.5).  We first re-write the reaction–diffusion equation for the actin biochemical dynamics in the following amenable form  (3.7)    Da   Dt   −   D   a   Δ a + a ( ∇ · β ) −   k   a   (   a   c   − a ) = 0   where     Da   Dt   =   ∂ a   ∂ t   + ( ∇ a ) · β   denotes the material derivative of the actin concentration a.  To obtain the weak formulation we multiply (3.7) by a test function   w   3   ( x , t ) ∈   H   1   (   Ω   t   ) ,  t ∈ I , then we integrate by parts and apply the boundary conditions (see (2.1f)):  (3.8)    ∫     Ω   t     [    w   3     Da   ∂ t   + a    w   3   ( ∇ · β ) +   D   a   ∇ a · ∇   w   3   +   k   a   a    w   3    ]  d   Ω   t    =   ∫     Ω   t       k   a     a   c     w   3    d   Ω   t   .   Using the product rule, the differential equation (3.8) can be rewritten as  (3.9)    ∫     Ω   t     [    D (   aw   3   )   ∂ t   − a     Dw   3     ∂ t   +   aw   3   ( ∇ · β ) +   D   a   ∇ a · ∇   w   3    ]  d   Ω   t    +   ∫     Ω   t       k   a     aw   3    d   Ω   t   =   ∫     Ω   t       k   a     a   c     w   3    d   Ω   t   .   Using the Reynolds transport theorem [35], we rewrite (3.9) such that the weak formulation reads: Find a ( x , t ) ∈   H   1   (   Ω   t   ) , t ∈ I such that  (3.10)    d   dt     ∫     Ω   t       aw   3    d   Ω   t   +   ∫     Ω   t     (   D   a   ∇ a · ∇   w   3   +   k   a     aw   3   )  d   Ω   t   =   ∫     Ω   t       k   a     a   c     w   3    d   Ω   t    +   ∫     Ω   t     a     Dw   3     Dt    d   Ω   t   ,  ∀   w   3   ∈   H   1   (   Ω   t   ) .      The weak formulation of the coupled problem (2.1) is thus: find a ( x , t ) , u ( x , t ) , v ( x , t ) ∈   H   1   (   Ω   t   ) , t ∈ I such that  (3.11a)    ∫     Ω   t       ∂   w   1     ∂ x   (    D   11     ∂   u   ̇     ∂ x   +   D   12     ∂   v   ̇     ∂ y   +   C   11     ∂ u   ∂ x   +   C   12     ∂ v   ∂ y    ) +   ∂   w   1     ∂ y   [    D   33   (    ∂   u   ̇     ∂ y   +   ∂   v   ̇     ∂ x    )  ]  +   ∂   w   1     ∂ y   [    C   33   (    ∂ u   ∂ y   +   ∂ v   ∂ x    )  ]  d   Ω   t   = −   ∫     Ω   t       f   1     ∂   w   1     ∂ x    d   Ω   t    +   ∫   ∂   Ω   t       n   1     f   1   w  ds ,      (3.11b)    ∫     Ω   t       ∂   w   2     ∂ y   (    D   12     ∂   u   ̇     ∂ x   +   D   22     ∂   v   ̇     ∂ y   +   C   12     ∂ u   ∂ x   +   C   22     ∂ v   ∂ y    ) +   ∂   w   2     ∂ x   [    D   33   (    ∂   u   ̇     ∂ y   +   ∂   v   ̇     ∂ x    )  ]  +   ∂   w   2     ∂ x   [    C   33   (    ∂ u   ∂ y   +   ∂ v   ∂ x    )  ]  d   Ω   t   = −   ∫     Ω   t       f   2     ∂   w   2     ∂ y    d   Ω   t     +   ∫   ∂   Ω   t       n   2     f   2     w   2    ds ,   and  (3.11c)    d   dt     ∫     Ω   t       aw   3    d   Ω   t   +   ∫     Ω   t     (   D   a   ∇ a · ∇   w   3   +   k   a     aw   3   )  d   Ω   t   =   ∫     Ω   t       k   a     a   c     w   3    d   Ω   t    +   ∫     Ω   t     a     Dw   3     Dt    d   Ω   t   ,   for all   w   1   ( x , t ) ,   w   2   ( x , t ) ,   w   3   ( x , t ) ∈   H   1   (   Ω   t   ) , t ∈ I .  Let   Ω   h , t   , t ∈ I be a bounded domain triangulated by   T   h , t   . Each triangular partition is known as an element S. We use barycentric coordinates as the local coordinate system on the elements of the triangulation. Let     P   ¯     1   be a finite dimensional function space defined on   S   ¯   , where   S   ¯   is a reference element:     S   ¯   ≔ {  (   λ   0   , … ,   λ   2   ) ∈   R   3   ; 0 ≤   λ   k   ≤ 1 ,   ∑   k = 1   3     λ   k   = 1  }   then there exist a one-to-one mapping from   S   ¯   to S. Also let {   x   1   ( t ) ,   x   2   ( t ) ,   x   3   ( t ) } denote the vertices of the element S. Then the following parameterization using barycentric coordinates over the element S can be defined [36],  (3.12)  x (   λ   1   ,   λ   2   ,   λ   3   , t ) =   ∑   k = 1   3     λ   k     x   k   ( t ) .   Let w ( x ( t ) ) : Ω → R , t ∈ I , be a finite element function on an element S defined by a finite dimensional function space     P   ¯     1   defined on a reference element   S   ¯   and the mapping   λ   S   from the reference element   S   ¯   to S such that w ( x ( t ) ) =   w   ¯   (   λ   S   ( x ( t ) ) ) , where   w   ¯   is defined on S. We define the space   X   h   ( t ) ⊂   H   1   (   Ω   t   ) :     X   h   ( t ) = { w ∈   C   0   (   Ω   t   ) ∩   H   1   (   Ω   t   ) ;    w   ¯   ∈     P   ¯     1    for  all  S ∈   T   h , t   ,  t ∈ I } .      First let us approximate the continuously evolving cell domain with a finite polygonal domain as follows: at each time t, t ∈ I , we discretize   Ω   t   into a finite unstructured triangular partition   Ω   h , t   of non-overlapping triangles, where h is the maximum size of the largest triangle. Each triangular partition is known as an element S and the set of these finite triangular elements is called a mesh and we denote this mesh by   T   h , t   . For the finite element mesh we require that no vertex of any element lie on the interior of a side of another element and   S   i   ∩   S   j   = ∅ if i ≠ j . Thus       Ω   ¯     h , t   =   ⋃   S ( t ) ∈   T   h , t     S ( t ) .   We assume that the triangulation   T   h , t   for all t ∈ I is shape regular. Definition 3.1 Shape regularity (Johnson [37])   Let   h   S   = be the longest side of S (otherwise known as the diameter of S),   ρ   S   the diameter of the circle inscribed in S and   h =   max   S ∈   T   h , t        h   S   .   A triangulation   T   h , t   is shape regular if there exist a positive constant ζ independent of h such that  (3.13)      ρ   S       h   S     ≥ ζ  ∀ S ∈   T   h , t   ,  t ∈ I .   The constant ζ is a measure of the minimum angle in any S ∈   T   h , t   , t ∈ I . The regularity condition (3.13) specifies that the elements S are not allowed to be arbitrary thin.  We note that all angles of the triangular elements stay away from 180° and are thus shape-consistent. Next, we discretize the problem (3.11) using the classical Galerkin method. The discretized problem of the coupled system(P  S ) of (3.11) reads: find   a   h   ( x , t ) ,   u   h   ( x , t ) ,   v   h   ( x , t ) ∈   X   h   ( t ) , t ∈ I such that  (3.14a)    ∫     Ω   h , t       ∂   w   h   1     ∂ x   (    D   11     ∂     u   ̇     h     ∂ x   +   D   12     ∂     v   ̇     h     ∂ y   +   C   11     ∂   u   h     ∂ x   +   C   12     ∂   v   h     ∂ y    ) +   ∂   w   h   1     ∂ y   [    D   33   (    ∂     u   ̇     h     ∂ y   +   ∂     v   ̇     h     ∂ x    )  ]  +   ∂   w   h   1     ∂ y   [    C   33   (    ∂   u   h     ∂ y   +   ∂   v   h     ∂ x    )  ]  d   Ω   h , t   = −   ∫     Ω   h , t       f   1     ∂   w   h   1     ∂ x    d   Ω   h , t    +   ∫   ∂   Ω   h , t       n   1     f   1     w   h   1    ds ,      (3.14b)    ∫     Ω   h , t       ∂   w   h   2     ∂ y   (    D   12     ∂     u   ̇     h     ∂ x   +   D   22     ∂     v   ̇     h     ∂ y   +   C   12     ∂   u   h     ∂ x   +   C   22     ∂   v   h     ∂ y    ) +   ∂   w   h   2     ∂ x   [    D   33   (    ∂     u   ̇     h     ∂ y   +   ∂     v   ̇     h     ∂ x    )  ]  +   ∂   w   h   2     ∂ x   [    C   33   (    ∂   u   h     ∂ y   +   ∂   v   h     ∂ x    )  ]  d   Ω   h , t   = −   ∫     Ω   h , t       f   2     ∂   w   h   2     ∂ y    d   Ω   h , t    +   ∫   ∂   Ω   h , t       n   2     f   2     w   h   2    ds ,   and  (3.14c)    d   dt     ∫     Ω   h , t       a   h     w   h   3   d   Ω   h , t   +   ∫     Ω   h , t     (   D   a   ∇   a   h   · ∇   w   h   3   +   k   a     a   h     w   h   3   )  d   Ω   h , t    =   ∫     Ω   h , t       k   a     a   c     w   h   3    d   Ω   h , t   +   ∫     Ω   h , t     a     Dw   h   3     Dt    d   Ω   h , t   ,   for all   w   h   1   ( x , t ) ,   w   h   2   ( x , t ) ,   w   h   3   ( x , t ) ∈   X   h   ( t ) . Let nde represent the total number of degrees of freedom of the nodes for the finite element discretization. Also let the set  (3.15)  {   φ   i   ,   φ   i   ∈   X   h   ( t ) ⊂   H   1   (   Ω   t   ) ,  i = 1 , … , nde }   represent piecewise linear finite element nodal basis functions satisfying that     φ   i   (   x   j   , t ) = {     1   if  i = j ,     0   if  i ≠ j .       We seek to find the finite element numerical approximation   a   h   ( x , t ) ,   u   h   ( x , t ) ,   v   h   ( x , t ) ∈   X   h   ( t ) ⊂ X (   Ω   t   ) expressed as linear combinations of the linear nodal basis functions   φ   i   of the form  (3.16)    a   h   ( x , t ) =   ∑   i = 1   nde     a   i   ( t )   φ   i   ( x , t ) ,    u   h   ( x , t ) =   ∑   i = 1   nde     U   i   ( t )   φ   i   ( x , t ) ,  and   v   h   ( x , t ) =   ∑   i = 1   nde     V   i   ( t )   φ   i   ( x , t ) .   We take the number of nodes nde in   Ω   t   to be large enough, typically in the orders of tens of thousands such that a  h , u  h and v  h are a good approximation of a, u and v respectively.   Transformation of local basis functions to a reference simplex. We denote the local basis functions on a reference element   S   ¯   by     φ   ¯     i   with i = 1 ,  2 ,  3 . The local basis function   φ   i   , i = 1 ,  2 ,  3 on an element S ∈   T   h , t   can be obtained by     φ   i   ( x ( t ) ) =     φ   ¯     i   (   λ   S   ( x ( t ) ) ) ,   where   λ   S   is the barycentric coordinates for a point ( x , y , t ) in an element S. Lemma 3.1 Transport property of basis functions (Dziuk and Elliott [36])    The finite element space on the discretized domain is a space of continuous piecewise linear functions whose nodal basis functions have the following property;  (3.17)       D   φ   i   S     Dt    |   S   = 0 .      The basis functions   φ   i   S   ( x , t ) j = 1 , 2 , 3 on S satisfy   φ   i   S   ( x ( t ) ) =     φ   ¯     i   (   λ   S   ( x ( t ) ) ) , where   λ   S   is the barycentric coordinates for a point ( x , y , t ) in S. And the material derivative of   φ   i   S   ( x ( t ) ) on an element S yields     D   Dt     φ   i   ( x ( t ) ) =   D   Dt       φ   ¯     i   (   λ   S   ( x ( t ) ) = 0   because   λ   S   = (   λ   1   ,   λ   2   ,   λ   3   ) satisfies 0 ≤   λ   k   ≤ 1 , k = 1 , 2 , 3 for a point ( x , y , t ) in S.□  In order to write the semi-discrete finite element approximation of the force balance equation in block matrices form, we substitute   w   h   1   ,   w   h   2   and   w   h   3   by the basis function   φ   j   , ( j = 1 , … , nde ) , u  h and v  h by their corresponding values as given in (3.16) into (3.14a) and (3.14b), then the resulting semi-discrete system of algebraic equations can be written in compact-matrix-vector form as  (3.18)  [       A   11   ( t )     A   12   ( t )       A   12     ( t )   T       A   22   ( t )     ] {       d U   dt   ( t )       d V   dt   ( t )     } + [       B   11   ( t )     B   12   ( t )       B   12     ( t )   T       B   22   ( t )     ] {     U ( t )     V ( t )     }  = {       F   1   ( t )       F   2   ( t )     }   where {   U ( t )   V ( t )   } are solutions of the finite element semi-discrete (3.18). In (3.18) we denote by U ( t ) = (   U   1   ( t ) , … ,   U   nde   ( t ) ) , V ( t ) = (   V   1   ( t ) , … ,   V   nde   ( t ) ) , d U / dt ( t ) = ( d   U   1   / dt ( t ) , … , d   U   nde   / dt ( t ) ) and d V / dt ( t ) = ( d   V   1   / dt ( t ) , … , d   V   nde   / dt ( t ) ) vectors of the solutions and their derivatives.   A   kl   ( t ) ,   B   kl   ( t ) , ( k , l = 1 , 2 ) and F ( t ) ≔   (   F   1   ( t ) ,   F   2   ( t ) )   T   are, respectively, the time dependent stiffness matrices and the generalized force vector. Their respective entries are defined by     A   ij   11   ( t ) ≔   ∫     Ω   h , t     (    D   11     ∂   φ   i   ( x ( t ) )   ∂ x     ∂   φ   j   ( x ( t ) )   ∂ x   +   D   33     ∂   φ   i   ( x ( t ) )   ∂ y     ∂   φ   j   ( x ( t ) )   ∂ y    )  d   Ω   h , t   ,   A   ij   22   ( t ) ≔   ∫     Ω   h , t     (    D   33     ∂   φ   i   ( x ( t ) )   ∂ x     ∂   φ   j   ( x ( t ) )   ∂ x   +   D   22     ∂   φ   i   ( x ( t ) )   ∂ y     ∂   φ   j   ( x ( t ) )   ∂ y    )  d   Ω   h , t   ,   A   ij   12   ( t ) ≔   ∫     Ω   h , t     (    D   12     ∂   φ   i   ( x ( t ) )   ∂ x     ∂   φ   j   ( x ( t ) )   ∂ y   +   D   33     ∂   φ   i   ( x ( t ) )   ∂ y     ∂   φ   j   ( x ( t ) )   ∂ x    )  d   Ω   h , t   ,   with:     B   ij   11   ( t ) ≔   ∫     Ω   h , t     (    C   11     ∂   φ   i   ( x ( t ) )   ∂ x     ∂   φ   j   ( x ( t ) )   ∂ x   +   C   66     ∂   φ   i   ( x ( t ) )   ∂ y     ∂   φ   j   ( x ( t ) )   ∂ y    )  d   Ω   h , t   ,   B   ij   22   ( t ) ≔   ∫     Ω   h , t     (    C   33     ∂   φ   i   ( x ( t ) )   ∂ x     ∂   φ   j   ( x ( t ) )   ∂ x   +   C   22     ∂   φ   i   ( x ( t ) )   ∂ y     ∂   φ   j   ( x ( t ) )   ∂ y    )  d   Ω   h , t   ,   B   ij   12   ( t ) ≔   ∫     Ω   h , t     (    C   12     ∂   φ   i   ( x ( t ) )   ∂ x     ∂   φ   j   ( x ( t ) )   ∂ y   +   C   33     ∂   φ   i   ( x ( t ) )   ∂ y     ∂   φ   j   ( x ( t ) )   ∂ x    )  d   Ω   h , t   ,   and     F   j   1   ( t ) ≔ −   ∫     Ω   h , t       f   1   ( x ( t ) )   ∂   φ   j   ( x ( t ) )   ∂ x    d   Ω   h , t   +   ∫   ∂   Ω   h , t       n   1     f   1   ( x ( t ) )   φ   j   ( x ( t ) )  ds ,   F   j   2   ( t ) = −   ∫     Ω   h , t       f   2   ( x ( t ) )   ∂   φ   j   ( x ( t ) )   ∂ y    d   Ω   h , t   +   ∫   ∂   Ω   h , t       n   2     f   2   ( x ( t ) )   φ   j   ( x ( t ) )  ds .    Appendix A illustrates how the normals, n 1 and n 2, to the cell boundary are computed and validated. For convenience's sake, we denote   [ A ( t ) ] ≔ [       A   11   ( t )     A   12   ( t )       A   12     ( t )   T       A   22   ( t )     ] ,  [ B ( t ) ] ≔ [       B   11   ( t )     B   12   ( t )       B   12     ( t )   T       B   22   ( t )     ] , { W ( t ) } ≔ {     U ( t )     V ( t )     } ,  {    d W   dt   ( t )  } ≔ {       d U   dt   ( t )       d V   dt   ( t )     }  and  { F ( t ) } ≔ {       F   1   ( t )       F   2   ( t )     } .   Then we can write the semi-discrete finite element model for the force balance equation (3.18) in the following compact form:  (3.19)  [ A ( t ) ] {    d W   dt   ( t )  } + [ B ( t ) ] {  W ( t )  } = F ( t ) .     Remark 3.2 Some entries of the block matrices [ A ] and [ B ] are non-symmetric matrices, hence [ A ] and [ B ] are non-symmetric block matrices.  To proceed to write the semi-discrete finite element approximation of the reaction–diffusion equation in matrix-vector form, we substitute w  h by the basis function   φ   j   , ( j = 1 , … , nde ) and a  h by its corresponding value as given in (3.16) into (3.14c). Upon applying the transport property of basis functions (see Lemma 3.1 for details) we obtain the following semi-discrete system of algebraic equations written in compact-matrix-vector form:  (3.20)    d   dt   ( M ( t ) { a ( t ) } ) + (   D   a   K ( t ) +   k   a   M ( t ) ) { a ( t ) } =   k   a     a   c   H ( t ) ,   where { a } = (   a   1   , … ,   a   nde   ) are actin concentration solutions of the semi-discrete (3.20). M , K and H are the time dependent mass and stiffness matrices, and force vector, whose entries are defined respectively as     M   ij   ( t ) ≔   ∫     Ω   h , t       φ   i   ( x ( t ) )   φ   j   ( x ( t ) )  d   Ω   h , t   ,   K   ij   ( t ) ≔   ∫     Ω   h , t     ∇   φ   i   ( x ( t ) ) · ∇   φ   j   ( x ( t ) )  d   Ω   h , t    and   H   j   ( t ) ≔   ∫     Ω   h , t       φ   j   ( x ( t ) )  d   Ω   h , t   .      We discretize the time interval ( 0 ,   T   f   ] into a finite number of uniform subintervals [   t   n   ,   t   n + 1   ] such that 0 =   t   0   <   t   1   … <   t   n   <   t   n + 1   ≤   T   f   . The size of each time interval τ ≔   t   n + 1   −   t   n   . In order to obtain a fully discrete finite element model of the coupled problem, we consider a modified implicit finite differentiation formula for the time integration of the semi-discrete finite element model of the force balance equation and the reaction–diffusion equation as given in (3.19) and (3.20) respectively. Thus the fully discrete finite element model of the coupled problem is given by  (3.21a)  ( [ A (   t   n   ) ] + τ [ B (   t   n   ) ] )   { W }   n + 1   = [ A (   t   n   ) ]   { W }   n   + τ F (   t   n   ) ,   and  (3.21b)  [ ( 1 + τ    k   a   ) M (   t   n + 1   ) + τ (   D   a   K (   t   n + 1   ) ) ]   { a }   n + 1   = M (   t   n   )   { a }   n   + τ    k   a     a   c   H (   t   n   ) ,   where   { W }   n   ,   { W }   n + 1   and   { a }   n   ,   { a }   n + 1   are the displacement solutions and the actin concentrations at time t  n and   t   n + 1   respectively. For the numerical implementation, the initial data   { W }   0   and   { a }   0   are interpolated on the initial mesh   Ω   h , 0   . All integral are evaluated using Gauss numerical quadrature [16]. At each time t, t ∈ I , we assemble the finite elements to obtain the system of linear algebraic (3.21). This system (3.21a) is solved using a generalized minimal residual method (GMRES) [38] while that of (3.21b) is solved using a conjugate gradient method (CG) with diagonal pre-conditioner [39,40].  In order to track the evolution of the domain accurately, we specify a Lagrangian kinematic description of the domain. We assume that the displacement of the boundary of the domain occurs only in the direction that is normal to its non-deformed position. The displacement of the domain boundary at any time t corresponds to the solutions of the force balance equation W ( x , t ) = ( U ( x , t ) , V ( x , t ) ) at the boundary which in turn are dependent on the local concentration of the actin filament a ( x , t ) at any particular space and time. The displacement of the interior nodes of the mesh is chosen to be equal to the flow velocity β (i.e. β =   x   ̇   ). On the boundary we assume that β =   ω   n   ≔ ∂ W / ∂ t , where W is the displacement solution of the force balance equation.  A limitation of the Lagrangian kinematic description is that the minimum angle condition for the mesh elements can be violated for non-constant mesh velocity and large mesh velocity. A remedy is to introduce a monitor function to check the quality of the mesh (say after a couple of mesh movements) and re-mesh when the elements are no longer favourable. It must be noted that re-meshing will introduce interpolation errors. In our case, the displacement solutions of the force balance equation are small in value hence the mesh velocity is small. For the time interval we considered, no mesh refinement was required. Developing adaptive time- and mesh-refinement strategies form part of our current studies for these types of models.  The fully discrete coupled problem is solved iteratively. We present in Algorithm 3.1 the numerical algorithm for the method. Algorithm 3.1 Fully discrete scheme.      Initialize   W   0   and   a   0   . Set the time-step size to τ .         FOR  n = 1 , … ,   T   F    with time-step size  τ  DO      Assemble  M (   t   n   ) , H (   t   n   ) , [ A (   t   n   ) ] , [ B (   t   n   ) ]  and  F (   t   n   ) .     Solve for    { W }   n + 1    in (3.21a).     Compute the new domain given    { W }   n + 1         Assemble  M (   t   n + 1   )  and  K (   t   n + 1   )  on the new domain.     Solve for    { a }   n + 1    in (3.21b).    END FOR         Let t = n τ , where τ and n denotes the time-step size and number of time-steps respectively. The initial domain we consider is a unit disk   Ω   0   . We assume that at time 0 <   t   s   ≪ 1 the domain evolution is negligible and based on this assumption we are able to compare the finite element solutions to predictions from linear stability theory. The perturbations used in the initial conditions will be dependent on the eigenmode we seek to excite. We subsequently show that the finite element scheme gives numerical results that are consistent with those predicted by linear stability theory. In all our simulations rnd denotes a randomly generated number between 10−3 and 10−5 and a tilde will be used to denote non-dimensional parameter values.  We present the numerical results for actin concentration a  h and the displacement solutions   u   h   = (   u   h   ,   v   h   ) in Fig. 1 (b) and (c) respectively. These results are consistent with those predicted by linear stability theory as given in Fig. B1(a). The initial conditions used were 1.0009 + rnd ⁎ sin ( x ) , a finite element mesh with 2113 nodes was used and τ = 1.0228 ×   10   − 2   .  Let us fix   p   ˜   = 1.646 and   ψ   ˜   = 38.24 respectively. For these parameter choices, the dispersion relation again isolates the lowest non-zero wavenumber   k   1 , 1   2   . The initial conditions of the actin concentration are chosen to be equal to   a   c   + rnd ⁎ cos ( x ) . We found that by choosing the perturbations in the initial conditions to be rnd ⁎ cos ( x ) , we encouraged the excitation of the eigenmode −   w   0 , 2   , where   w   0 , 2   is the lowest eigenmode. The numerical simulation results are shown in Fig. 2 for the actin concentrations a  h and the displacement solutions   u   h   . We note that all numerical results for   u   h   are plotted using its magnitude. For the sake of the comparison of the eigenmode   w   0 , 2   to the numerical solutions we present in Fig. 2(a) a plot of the eigenmode   w   0 , 2   .  In Fig. 2(c), we observe that the displacement solutions   u   h   has its highest value around the points where   x   2   +   y   2   = 0.8 . These points correspond to the points where δ ( l ) is discontinuous. It is clear that the method is able to provide accurate solutions as predicted by linear theory close to the bifurcation points.  Far from the bifurcation points of   k   1 , 1   2   , we have the possibility of exciting mixed or higher modes. Below we present the numerical results for actin concentration a  h and displacement solutions   u   h   showing the excitation of mixed and higher modes.  The excitation of mixed modes and higher modes is possible if the value of   ψ   ˜   is allowed to vary while all other parameters value are fixed (see Table B4 for possible values of   ψ   ˜   and the corresponding number of modes the dispersion relation isolates). We present in Figs. 3 and 4 the simulation results for actin concentration a  h and the displacement solutions showing the excitation of mixed and higher modes respectively. We present in Table 2 the value of ψ used in the numerical simulations. A comparison of the predicted solutions from linear theory (Fig. 3(a) and (d)) with the numerical results (Fig. 3(b), (c) and (e), (f)) show that the numerical scheme reproduces results in close agreement to those predicted by linear stability theory for the mixed and higher modes for the actin concentration.  Now that we have validated our numerical results by use of linear stability theory close to bifurcation points, we are in position to illustrate the robustness and applicability of the numerical method. By choosing appropriate model parameter values far away from bifurcation points, cell expansion and contraction (uniform) can be observed as well as non-uniform cell deformation as illustrated in the next.  The simulation results showing the actin concentration solutions with uniform expansions are shown in Fig. 5 for (   ψ   ˜   ,   p   ˜   ) = ( 70.366 ,  0.433 ) . In Fig. 5(e) we present a plot of the area of the cell against the number of time-steps taken to show the rate at which the area is increasing.  For the sake of numerical experiment, we allow p to take a negative value. By choosing   p   ˜   = − 0.433 and   ψ   ˜   = 70.366 we observe the cell contracting uniformly at positions that are equidistant from the centroid of the cell domain. And the concentration of actin increases from the boundary to the centroid. We show in Fig. 6 the actin concentration solutions at a time (a) t = 1.2046 ×   10   − 3   , (b) t = 3.6137 ×   10   − 3   , (c) t=0.0361 and (d) t=0.5180. The initial conditions of actin concentration are still equal to   a   c   + rnd ⁎ cos ( x ) .  Non-uniform cell deformations occur if all parameter values in Table B1 stay unchanged but   ψ   ˜   is increased or by choosing parameter values   ψ   ˜   and   p   ˜   far away from bifurcation points (refer to Fig. B2 for a parameter space plot of (   ψ   ˜   ,   p   ˜   ) ). Below we give the parameter values and the simulation results for both cases were non-uniform cell deformations occur. Here the initial conditions of actin concentration are given by   a   c   + rnd ⁎ cos ( x ) .  • If all model parameter values are kept fixed as given in Table B1, taking increasing values of   ψ   ˜   results in non-uniform cell deformations. For example taking   ψ   ˜   = 1.04 ×   10   5   , we observed from the numerical results that the cell deforms non-uniformly and rapidly making it impossible to capture the solutions and the numerical algorithm fails.  If we choose   ψ   ˜   and   p   ˜   arbitrarily such that the parameter space (   ψ   ˜   ,   p   ˜   ) is very far from bifurcation points (for example,   ψ   ˜   = 7.8 ×   10   3   and   p   ˜   = 0.026 ), we observe non-uniform cell contraction with actin localized around the centroid of the cell (see Fig. 7 ). In Fig. 7(d) we present a plot of the cell area. A plot of the index of polarity against the number of time-step taken is given in Fig. 7(e).  We recall that the simulation results presented in Fig. 7(e) was obtained for   p   ˜   = 0.026 and   ψ   ˜   = 7.8 ×   10   3   . Now if we decrease only   ψ   ˜   such that   ψ   ˜   = 1.3 ×   10   3   , we observe cell deformations which agree qualitatively to those observed experimentally [41]. It can be observed that actin concentration is high at the periphery of the cell boundary and is highest at regions were protrusions occur. In Fig. 8 , we present the graphical display of the simulation results of the actin concentration. A plot of the index of polarity against the number of time-steps taken is given in Fig. 8(g). We can infer from these results that the dynamics of the cell domain, the distribution of actin filaments are related to the pressure coefficient p and the contractile tonicity ψ .  The distribution of F-actin in cells has been well studied and epifluorescence images are available in the literature. Fig. 9 (a) shows an epifluorescence image of a Swiss 3T3 fibroblast cell obtained from [41]. The fibroblast was stained by the authors for F-actin after being allowed to spread for 1h. The epifluorescence image shows that F-actin is predominant at the cell periphery and is highest at the regions were protrusions occur. The simulation results presented in Fig. 9(b) are thus consistent with the experimental observations. Remark 4.1 Key model parameters   Based on the linear stability analysis and the numerical simulation results we are able to identify key parameters that control cell deformations with respect to the model problem. The contractile tonicity ψ is the bifurcation parameter and determines the transition from stable to unstable state. The actin saturation concentration a  sat and the pressure coefficient were also found to play a key role in cell deformations.  Here we choose parameters for the cell such that they are consistent with those available in the literature such that Young's modulus E of the actin filament is 4000dyn/cm2 [42], diffusion coefficient D  a of the actin filament is 1.6 ×   10   − 10      cm   2   / s  [43,44], the polymerisation rate k  a is 66 / s  [45], the values of the poisson ratio ν , shear and bulk viscosities   μ   1   and   μ   2   respectively are as given in Table 1. A cell of radius 10  μ m (0.001 cm) is assumed. We also assume that the pressure coefficient is 800dyn/cm2 and the contractile tonicity is 6.9 ×   10   4    dyn /   cm   2   . We note that for these choice of dimensional parameter values the equivalent non-dimensional parameter values would have a dispersion relation that isolates more than 7 wavenumbers inclusive of   k   4 , 1   2   . We used an initial perturbation for actin equal to | rnd  sin  x  sin  y | in order to bias the excitation of the mode   w   4 , 1   . The numerical simulation result gives protrusion on four fronts and is similar to the result given in Fig. 10 .  Understanding cell movement and deformation in cell motility, developmental biology and biomedical engineering promises to unearth new research strands currently unchartered. In many cases, the models derived are highly complex and nonlinear with no closed form analytical solutions. Furthermore, growth evolution (cell membrane movement and deformation) is an added parameter that makes it even more difficult to treat the models analytically. It remains therefore, to propose and develop novel numerical methods capable of providing approximate solutions. The numerical method should be robust, efficient, and should be able to deal easily with domain and surface evolution. In this article, we proposed the moving grid finite element method [1] to numerically compute solutions to a system of nonlinear partial differential equations describing cell movement and deformation. Our main contributions are:  • a novel application of the MGFEM to solve a cytomechanical model that allows cells to move and deform arbitrarily.  by using linear stability theory close to bifurcation points, we validated numerical results where linear solutions are analytically derived.  far away from bifurcation points, we generate and observe complex cell deformations typically observed in experiments. Our numerical results show cell expansion, cell contraction, cell translation and relocation and cell protrusions.  the contractile tonicity formed by the association of actin filaments to the myosin II motor proteins and the pressure coefficient are identified as key model bifurcation parameters of the model.   ACKNOWLEDGMENTS   This work (A.M.) is partly supported by the following grants: EPSRC (EP/H020349/1 and EP/J016780/1), the LMS Grant (R4P2), the British Council through its UK-US New Partnership Fund (PMI2) and the Royal Society Grant: (R4N9). U.G. would like to acknowledge financial support from Akwa Ibom State University Technology Nigeria in support of her DPhil studies.  Here we present the technique for the computation of n on the polygonal unit circle corresponding to the boundary of   Ω   h , 0   given in (3.18). The exact normals of a unit circle can be calculated analytically and are known [46]. As the number of boundary nodes increases (via global refinement of the mesh) the mesh height h decreases and we show in Table A1 that the numerically computed unit normals converges to the exact normal of a unit circle.  Given a line L with end points   P   1   = (   x   1   ,   y   1   ) and   P   2   = (   x   2   ,   y   2   ) . Then a vector N = (   N   1   ,   N   2   ) normal to the line L is [47]      N   1   =   y   1   −   y   2   ,  and    N   2   =   x   2   −   x   1   .   The unit normal vector n = (   n   1   ,   n   2   ) to L is then obtain by dividing the normal vector N by its magnitude such that     n   1   =     y   1   −   y   2         (   y   1   −   y   2   )   2   +   (   x   2   −   x   1   )   2        and    n   2   =     x   2   −   x   1         (   y   1   −   y   2   )   2   +   (   x   2   −   x   1   )   2       .   Given a boundary of a closed surface with nodal points P  i   ( i = 1 , … , nde ) having coordinates (   x   i   ,    y   i   ) , where nde denotes the total number of nodes, then the outward pointing unit vector normal to any line segment [ i , i + 1 ] (see for example Fig. A1(b)) is     n   1   =     y   i   −   y   i + 1         (   y   i   −   y   i + 1   )   2   +   (   x   i + 1   −   x   i   )   2       ,  and    n   2   =     x   i + 1   −   x   i         (   y   i   −   y   i + 1   )   2   +   (   x   i + 1   −   x   i   )   2       .      At the intersection of two line segments (i.e. at a nodal position). The resultant normal n is computed by applying the parallelogram law of forces (see Fig. A1 ).  In Table A1 we show that the computed normals converge to the exact normal in the L 2 norm as the number of mesh points increases. The mesh with no global refinement corresponds to a macro triangulation having 4 line segments that form a diamond shape. The mesh with 1, 2, 3 global refinements of the macro triangulation have polygonal boundaries that comprises of 8, 16 and 32 line segments. We note that we have incorporated nodal projection of boundary nodes during mesh refinements so that the resulting mesh approximates the unit circle better as the number of global refinement increases.  Here we present linear stability analysis of the cytomechanical model. Specific details of linear stability theory can be found in [31]. The primary purpose of linear stability theory in this article are two fold: (i) to present linear solutions that validate numerical solutions around bifurcation points and (ii) to determine mathematically plausible parameter values for the pressure coefficient p and the contractile coefficient ψ that will give rise to cell deformation. To proceed, we first non-dimensionalize the system of equations in order to reduce the number of parameters making the mathematical analysis afterwards more amendable.  Let the length scale L be a typical radius of a cell. Substituting the following dimensionless quantities into (2.1a) and (2.1b),  (B.1)  {       t   ˜   =   tk   a   ,    a   ˜   =   a     a   c     ,    u   ˜   =   u   L   ,    ∇   ˜   = L ∇ ,    Δ   ˜   =   L   2   Δ ,      a   ˜     sat   =     a   sat       a   c     ,       p   ˜   = p   1 + ν   E   ,    ϕ   ˜   = ϕ ,    ϵ   ˜   = ϵ ,      μ   ˜     i   =   μ   i     k   a     1 + ν   E   ,    ψ   ˜   = ψ   a   c   2     1 + ν   E   ,       β   ˜   =   β     k   a   L   ,  d =     D   ˜     a   =     D   a       k   a     L   2     ,       results in  (B.2)  {    ∇ · {  (    μ   1     ϵ   t   +   μ   2     ϕ   t   I  ) + (  ϵ + ν ′ ϕ I  ) + ψ   a   2     e   − a /   a   sat     I  } +     ∇ · {    p   1 + ϕ   [  1 +   2   π   δ ( l )  arctan ( a )  ] I  } = 0 ,       ∂ a   ∂ t   − d Δ a + ∇ · ( a β ) = 1 − a ,      where ν ′ = ν / 1 − 2 ν , ν ≠ 0.5 . In the above, we have dropped the tildes without any loss of generality. Non-dimensionalized parameters are shown in Table B1 and these are determined from the dimensional values shown in Table 1.  We restrict linear stability analysis to be carried out on a static unit disk. The assumption is that for time t =   t   0   + n τ , t >   t   0   with n small, the deformed cell domain is still very close to a unit disk. Hence linear analysis is valid on   Ω   t   provided t ≪ 1 and   Ω   t   ≈   Ω   0   . Here τ is a small time step.  The steady state solution of (B.2) is   a   s   = 1 ,   u   s   = 0 . Consider the stability of the steady state to small perturbations a =   a   s   +   a   ^   , and u =   u   s   +   u   ^   , where   a   ^   and   u   ^   are small variations from the steady state. Substituting these into the nonlinear system (B.2) and neglecting all but the linear terms results in the following linear system of partial differential equations:  (B.3)  {     ∇ · [  (   μ   1     ϵ   t   +   μ   2     ϕ   t   I ) + ( ϵ + ν ′ ϕ I ) + σ ′ ( 1 ) a I + p ( 1 − ϕ ) I + p   2   π   δ ( l ) a I )  ] = 0 ,       ∂ a   ∂ t   − d Δ a + ∇ · ( β ) + a = 0 ,       where σ ′ ( 1 ) = ∂ σ ( a ) / ∂ a   |   a =   a   s     .  Let λ and k represent the growth rate (also known as an eigenvalue) and the wave vector respectively and assume that a ⁎ and   u   ⁎   are constants. It follows that the linearized system (B.3) admits non-trivial solutions of the form  (B.4)  a ( x , t ) =   a   ⁎    exp ( λ  t + i k · x )  and  u ( x , t ) =   u   ⁎    exp ( λ  t + i k · x ) ,   provided λ satisfies  (B.5)    k   2   [ μ   λ   2   + b (   k   2   ) λ + c (   k   2   ) ] = 0 ,   where   b (   k   2   ) = μ   dk   2   + [  1 + ν ′ + μ − σ ′ ( 1 ) − p −   2   π   p δ ( l )  ] ,   and   c (   k   2   ) = d [ 1 + ν ′ − p ]   k   2   + [ 1 + ν ′ − p ] ,   where k 2 is the solution of the eigenvalue problem Δ w = −   k   2   w , w ≠ 0 with homogeneous Neumann boundary condition i.e.   n   ^   · ∇ w = 0 , where w are time-independent eigenfunctions of the linear system of differential equation (B.3). Solving (B.5) results in the dispersion relation  (B.6)  λ (   k   2   ) =    − b (   k   2   ) ±     b   2   (   k   2   ) − 4 μ   k   2   c (   k   2   )     2 μ   k   2      .   From (B.5), it is obvious that the dispersion relation is indeterminate when   k   2   = 0 . Thus in the linear stability analysis we shall only consider   k   2   > 0 . Instability will occur for some wavenumber   k   2   > 0 if the corresponding λ (   k   2   ) has Re ( λ ) > 0 . Below we use Routh–Hurwitz stability criterion [48] to determine a sufficient condition on the coefficients of the polynomial (B.5) that would result in Re  λ (   k   2   ) > 0 for some   k   2   > 0 . Instability can occur for some   k   2   > 0 if one of the following conditions is satisfied (see Table B2 for details):  1.   b (   k   2   ) > 0 and c (   k   2   ) < 0 or    b (   k   2   ) < 0 and c (   k   2   ) > 0 or    b (   k   2   ) < 0 and c (   k   2   ) < 0 .  In order to determine the value of k 2, we use the separation of variables method to solve for an eigenfunction w, w ≠ 0 and a wavenumber k 2 such that the eigenvalue problem is well defined. We present the result in Remark B.1 below. Remark B.1 Consider a scalar function w such that Δ w =   k   2   w , w ≠ 0 , on a disk   Ω   0   = { ( x , y ) :   x   2   +   y   2   ≤   R   2   } with homogeneous Neumann boundary condition. Then the discrete eigenvalues are given by [49,50]   (B.7)    k   m , n   2   =   ( j   ′   m , n   / R )   2   ,  m = 0 , 1 , 2 , ⋯ ;  n = 1 , 2 , ⋯ ,   with corresponding eigenfunctions,   w   m , n   given by     w   m , n   ( r , θ ) = {       J   0   ( j   ′   0 , n   r / R )   if  m = 0 ,       J   m   ( j   ′   m , n   r / R ) c  cos  m ( θ −   θ   1   )   if  m > 0 .      n = 1 , 2 , ⋯ ,   for constants c and   θ   1   . Here Jm is the mth Bessel function of the first kind and j   ′   m , n   is the n  th positive zero of J   ′   m   (except for j   ′   0 , 1   = 0 ), where J   ′   m   denotes the derivative of the Bessel function J  m with respect to r.  Values of j   ′   m , n   are obtained from the ‘Handbook of Mathematical Functions with Formulas, Graphs, and Mathematical Tables’ by Abramowitz and Stegun [51]. For the sake of completeness, in Table B3 , we present some values of j   ′   m , n   for m = 0 , … , 5 and n = 1 , … , 4 . We consider the lowest non-zero wavenumber   k   1 , 1   2   ≔   ( j   ′   1 , 1   / R )   2   and its corresponding vibration mode   w   1 , 1   ( r , θ ) =   J   1   ( j   ′   1 , 1   r / R ) cos  θ .  The wavenumber k 2 are discrete. In Table B4 , we give the values of ψ required by the dispersion relation to isolate a couple of wavenumbers. In Fig. B1 we show possible single and mixed modes that could evolve for bands of wavenumbers given in Table B4.  Here we keep all parameters given in Table B1 fixed except the pressure coefficient   p   ˜   and the contractile tonicity   ψ   ˜   . We make a plot o f the parameter space (   ψ   ˜   ,   p   ˜   ) showing spaces that lie in a region of Hopf instability ( Re ( λ ) < 0 and Imag ( λ ) > 0 ) , oscillatory instability ( Re ( λ ) > 0 and Imag ( λ ) > 0 ) or Turing instability ( Re ( λ ) > 0 and Imag ( λ ) = 0 )  [52–54]. This plot is presented in Fig. B2 for the case where b (   k   2   ) has δ ( l ) = 1 . Note that for δ ( l ) = 0 the parameter space plot is identical to that shown in Fig. B2. In Fig. B2 we observe that there exists Hopf, oscillatory and Turing instability regions where all have a dispersion relation that isolates   k   1 , 1   2   as the only non-zero wavenumber. The ash area (H) signifies the region of Hopf instability with a dispersion relation that isolates   k   1 , 1   2   as the onlyunstable non-zero wavenumber. The region (dark blue) preceding that of Hopf instability represents the region where the uniform steady state is always stable for all wavenumbers k 2. Immediately after the Hopf instability region we have a purple region (OS1) where an oscillatory instability exists for   k   1 , 1   2   . The green region is a Turing instability region and has a dispersion relation that isolates   k   1 , 1   2   as the only unstable non-zero wavenumber. In the purple region (OS2) an oscillatory instability exists for   k   2 , 1   2   . The light blue region is also a Turing instability region and has a dispersion relation that isolates the first two non-zero wavenumbers   k   1 , 1   2   and   k   2 , 1   2   .   REFERENCES", "highlights": "In this article we present a novel application of the moving grid finite element method [1] for solving a cytomechanical model that describes actin dynamics in order to generate cell movement and deformation. The cytomechanical model describes both the mechanical and biochemical properties of the cortical network of actin filaments and its concentration. Actin is a polymer that can exist either in filamentous form (F-actin) or in monometric form (G-actin) [2] and the filamentous form is arranged in a paired helix of two protofilaments [3]. By assuming slow deformations of the cell, we validate numerical results by comparing qualitatively with predictions from linear stability theory close to bifurcation points. Far from bifurcation points, the mathematical model and computational algorithm are able to describe and generate the complex cell deformations typically observed in experiments. Our numerical results illustrate cell expansion, cell contraction, cell translation and cell relocation as well as cell protrusions. A key model bifurcation parameter identified is the contractile tonicity formed by the association of actin filaments to the myosin II motor proteins. The robustness, generality and applicability of the numerical methodology allows us to tackle similar problems in developmental biology, biomedicine and plant biology where similar mechanisms are routinely used."}