{"id": "S0168874X14000717", "article": "MAIN-TITLE Performance of hydrostatic tilted thrust pad bearings of various recess shapes operating with non-Newtonian lubricant   HIGHLIGHTS          Finite element formulation of non-Newtonian lubricant by using Galerkin׳s technique in thrust bearing.      An iterative non-linear FEM scheme is used to solve the Reynolds equation for thrust bearing.      Effect of tilt on the hydrostatic thrust pad bearing.      Performance characteristics of hydrostatic thrust bearing.          KEYPHRASES   Non-linear finite element method  Thrust bearing  Non-Newtonian  Rabinowitsch fluid model   In hydropower plants, axial thrust coming from heavy machinery, turbines and generators is very large. To support the heavy axial thrust load with minimum friction, hydrostatic thrust bearings are widely used due to their ability to provide high load carrying capacity. Therefore, the design of hydrostatic thrust pad bearing system under realistic condition is quite important. Hydrostatic thrust pad bearings have been extensively investigated by many researchers during the last few decades and their research efforts, focused on various aspects of hydrostatic thrust pad bearing. The following paragraph details some of the important studies reported in literature.  In recent past, many investigations have been carried out and reported in the area of hydrostatic thrust bearing considering various issues. Osterle and Hughes [1] analyzed the effect of lubricant inertia on the performance of load carrying capacity of hydrostatic thrust bearing and it was found that the load carrying capacity of hydrostatic thrust bearing neglecting the effect of lubricant inertia had significant errors at high speeds, if the effect of lubricant inertia is neglected. Influence of flexibility of pad on the bearing performance was studied by Sinhasan et al. [2–4]. They computed performance characteristics of hydrostatic thrust bearing by considering different types of restrictor by considering the pad deformation.  In general the hydrostatic thrust pad bearing is designed to work under parallel operation, however, tilt in hydrostatic thrust pad bearing systems is inevitable due to manufacturing, assembly errors, structural vibrations, etc. Therefore, many researchers focused their study to analyzed the effect of tilt on the performance of thrust bearing [5–14]. Safar and Mote [15] analyzed the hydrostatic thrust bearing system operating with Newtonian lubricant under non-axisymmetric operation. In their analysis, they considered the effect of bearing number, the fluid film thickness variation and bearing offset on the bearing pressure, load carrying capacity and lubricant flow rate. Later on a study by Safar [6] reported semi analytical solution for the pressure distribution in tilted hydrostatic thrust pad bearing by using the series solution method. It was found that the tilt of hydrostatic thrust pad gave rise to negative fluid film pressures and this results cavitation. He further observed that the value of bearing characteristic parameters gets changed significantly by including tilt angle in the analysis. Prabhu and Ganesan [8] studied the effect of tilt and rotation on the performance of a multirecess plane hydrostatic thrust bearing. They studied a hydrostatic thrust bearing configuration with four sectorial type recesses. Studies related to hydrostatic thrust bearings by considering tilt have been carried out not only for the case of plane hydrostatic thrust bearing as well as for conical hydrostatic thrust bearing system [9,16,17]. Prabhu and Ganeshan [16] theoretically studied non-parallel operation of annular recess conical hydrostatic thrust bearing compensated with capillary under the tilt and rotation.  Due to the stringent requirements of modern machinery system, it is imperative to look for the enhancement in lubricating performance. A number of additive packages are generally mixed to achieve the desired lubricating performance. Addition of additives in the lubricant makes lubricant behavior non-Newtonian. To study the additized lubricant behavior, various non-Newtonian lubricant models such as Bingham plastic fluid [18], Cason models [19], micropolar [20–22] and power law [23] have been proposed. Among these models a non-Newtonian model named as Rabinowitsch fluid model was experimentally established by Wada and Hayashi [24,25]. In their experimental study, they showed that the blending of additives improved the viscosity index of lubricant. After Wada and Hayashi, many researchers used this model in their studies [26–28]. Sinhasan and Sah [27] analyzed orifice compensated journal bearing system by using this model. They used finite element method and Newton Raphson iterative scheme to analyze the performance of journal bearing system. Very recently, Singh et al. [29] made use of this model in their study to analyze the effects of centrifugal inertia on the performance of annular ring hydrostatic thrust bearing. Lin [26] analyzed squeeze film characteristics of annular ring thrust bearing system with Rabinowitsch model lubricant. Closed form expressions for squeeze film load carrying capacity were derived after making approximations in Reynolds׳s equation.  The available studies in literature clearly reveals that consideration of both lubricant behavior as well as tilt is very important to generate the realistic design data [7,26,30,31]. No study in the literature has yet been reported that demonstrates the behavior of thrust bearing operation with Rabinowitsch lubricant with tilt consideration. Recently, some studies have been carried out in the case of parallel operation thrust bearing by using Rabinowitsch fluid model. However, these studies are not practical as they ignored the effect of tilt. Thus, the present work has been planned to bridge this gap in the literature. The present work deals with a tilted pad hydrostatic thrust pad bearing operating with non-Newtonian lubricant. To analyze the effect of tilt, three different types of recess geometries have been chosen from the literature [32,33]. Further, it has been found that the tilt of hydrostatic thrust pad significantly affects the static and dynamic performance characteristics parameters. The numerically simulated results presented in the paper are expected to be quite useful to the academic community and bearing designers.  A schematic diagram of a hydrostatic thrust pad bearing system with tilt and compensated with orifice restrictor is shown in Fig. 1. The modified Reynolds equation governing the flow of non-Newtonian lubricant in bearing clearance space of a hydrostatic tilted pad thrust bearing shown in Fig. 1 is expressed in dimensionless as follows [27,32].     (1)   ∂  ∂ α    (     h ¯   3     F ¯    2     ∂  p ¯    ∂ α    )  +  ∂  ∂ β    (     h ¯   3     F ¯    2     ∂  p ¯    ∂ β    )  =   ∂  h ¯    ∂  t ¯      where    F ¯    0   ,    F ¯    1   and    F ¯    2   are fluid film viscosity integrals along the thickness and calculated by following relations.  (2)     F ¯    0   =  ∫ 0 1    1  μ ¯    d  z ¯  ,     F ¯    1   =  ∫ 0 1     z ¯   μ ¯   d  z ¯   ,     F ¯    2   =  ∫ 0 1     z ¯   μ ¯    (   z ¯  −      F ¯    1        F ¯    0      )  d  z ¯        Fluid film thickness expression as a function of tilt can be written as [6].  (3)   h ¯  =    h ¯    r   +  λ ¯  α   where  λ ¯  = λ   r   o   /   h   r   is defined as a tilt parameter.  The bearing performance characteristic parameters of a tilted pad thrust bearing operating with Rabinowitsch fluid model lubricant have been computed by obtaining the numerical solution of governing modified Reynolds equation. Therefore, a FEM program in MATLAB is developed to calculate performance characteristic parameters of a thrust bearing. Discretization of flow field for FEM calculation is done by using four-noded bilinear isoparametric quadrilateral elements. The fluid film pressure variation is approximated to vary bilinearly over an element and is  (4)   p ¯  =  ∑  j = 1     n   l   e         p ¯    j     N   j      where, N  j is the nodal shape function and   n   l   e   is number of nodes in a quadrilateral element. Here value of   n   l   e   is four. Using Galerkin׳s orthogonality conditions after the usual assembly procedure, global system of equation is obtained as [27,32].  (5)  [  F ¯  ]  {  p ¯  } = {  Q ¯  } +   h ̇  ¯  [    R ¯    t   ]      The eth element in the matrixes are expressed as  (6a)     F ¯    i j   e   = ∫  ∫     h ¯   3   [     F ¯    2     ∂   N   i     ∂ α     ∂   N   j     ∂ α   +    F ¯    2     ∂   N   i     ∂ β     ∂   N   j     ∂ β    ]    ∂ α ∂ β      (6b)     Q ¯    i   e   =  ∫    Γ  e      {   (     h ¯   3     F ¯    2     ∂  p ¯    ∂ α    )    l   1   +  (     h ¯   3     F ¯    2     ∂  p ¯    ∂ β    )    l   2    }    N   i   d    Γ ¯   e        (6c)     R ¯    t   e   = ∫  ∫    N   i     ∂ α ∂ β   where l 1 and l 2 are direction cosines and i, j=1, 2 …   n   l   e   (number of nodes per element).      Γ  e  is the boundary and   Ω  e  refers to the domain of the eth element. The elemental matrices are generated for all elements and are assembled in a global matrix and are expressed in below expression [34].  (7)   [         F ¯    11          F ¯    12      …       F ¯    1 j       . …        F ¯    1 n            F ¯    21          F ¯    22      …       F ¯    2 j      …       F ¯    2 n        ⋮   ⋮   ⋮   ⋮   ⋮   ⋮         F ¯    i 1          F ¯    i 1      …       F ¯    i j      …       F ¯    i n        ⋮   ⋮   ⋮   ⋮   ⋮   ⋮         F ¯    n 1          F ¯    n 2      …       F ¯    n j      …       F ¯    n n        ]   [         p ¯    1            p ¯    2        ⋮         p ¯    i        ⋮         p ¯    n        ]  =  [         Q ¯    1            Q ¯    2        ⋮         Q ¯    i        ⋮         Q ¯    n        ]  +   h ̇  ¯   [         R ¯    t 1            R ¯    t 2        ⋮         R ¯    t i        ⋮         R ¯    t n        ]    where the values of global square matrix elements    F ¯    i j   , column vector    Q ¯    i   and column vector    R ¯    t i   are computed by using Eqs. (6a)–(6c).  The pressure    p ¯    i   at node i is defined as a function of  h ¯  ,   h ̇  ¯         p ¯    i   =    p ¯    i   ( α , β ,  h ¯  ,   h ̇  ¯  )      For the steady state condition (   h ̇  ¯  = 0 ) , the nodal pressure column vector is expressed as [  p ¯  ] = [    p ¯    0   ] .  The lubricant flow rate through orifice restrictor for steady-state condition is expressed as follows:  (8)     Q ¯    R   =    C ¯    S 2     ( 1 −    p ¯    o i   )   1 / 2        For continuity of flow, the flow input by restrictor must be equal to flow of bearing. ith is the node lying on the pocket geometry.    Q ¯    i   =    Q ¯    R   .  The system of equation, after applying boundary condition is expressed as  (9)   [         F ¯    11          F ¯    12      …       F ¯    1 j       . …        F ¯    1 n            F ¯    21          F ¯    22      …       F ¯    2 j      …       F ¯    2 n        ⋮   ⋮   ⋮   ⋮   ⋮   ⋮         F ¯    i 1          F ¯    i 1      …       F ¯    i j      …       F ¯    i n        ⋮   ⋮   ⋮   ⋮   ⋮   ⋮         F ¯    n 1          F ¯    n 2      …       F ¯    n j      …       F ¯    n n        ]   [         p ¯    01            p ¯    02        ⋮         p ¯    0 i        ⋮         p ¯    0 n        ]  =  [         Q ¯    1            Q ¯    2        ⋮         C ¯    S 2     ( 1 −    p ¯    o i   )   1 / 2        ⋮         Q ¯    n        ]       It may be noted that a system of Eq. (9) is non-linear in pressure due to orifice restrictor and cannot be solved directly. Therefore, the solution of these non-linear equations is obtained by using an iterative technique Newton–Raphson.  In order to obtain nodal pressure vector [  p ¯  ] following analytical expression in matrix form is applied to compute the nodal pressures [33].  (10)    [    p ¯    0   ]   k + 1   =   [    p ¯    0   ]   k   −   (   [  F ¯  ]   k   −   [ DQ ]   k   )   − 1   (   [  F ¯  ]   k     [    p ¯    0   ]   k   −   [  Q ¯  ]   k   )      (11)    [    p ¯    0   ]   k + 1   =   [    p ¯    0   ]   k   + [ Δ    p ¯    0   ] =   [    p ¯    0   ]   k   −   (   [  F ¯  ]   k   −   [ DQ ]   k   )   − 1   (   [  F ¯  ]   k     [    p ¯    0   ]   k   −   [  Q ¯  ]   k   )   where   [    p ¯    0   ]   k   is column pressure matrix at the kth iteration.   [  Q ¯  ]   k   is the lubricant flow rate at kth iteration. [ Δ    p ¯    0   ] is the increment the pressure vector. DQ is the derivative of column flow vector   [  Q ¯  ]   k   with respect to pressure and calculated as  (12)  D   Q   i j   =   ∂    Q ¯    i     ∂    p ¯    j          It may be noted that the column vector   [  Q ¯  ]   k   at nodes located on the pockets is function of pressure. Therefore [ DQ ] is also function of pressure.  Eq. (9) is solved by using the current value of nodal pressure vector   [    p ¯    0   ]   k   , which is obtained from the previous iteration. These iterations are repeated till the following criterion is not satisfied.  (13)  tol = 0.001 >  max  (      [    p ¯    0   ]   k + 1   −   [    p ¯    0   ]   k       [    p ¯    0   ]   k      )       The bearing performance characteristics for a hydrostatic circular thrust pad compensated bearing are obtained by performing the integration over the elements [32].      (14)     F ¯    o   =    F ¯    o     |   land   +    F ¯    o     |   pocket      F ¯    o   =  ∑  e = 1     n   e      {   ∫  − 1  1    ∫  − 1  1   (    p ¯    1     N   1   +    p ¯    2     N   2   +    p ¯    3     N   3   +    p ¯    4     N   4   ) |  J ¯  | d ξ d η    }  +  ∑  i = 1   i =   n   p         A ¯    o c      p ¯    o c    =  ∑  e = 1     n   e      {   ∫  − 1  1    ∫  − 1  1    (   ∑  i = 1     n   l   = 4       p ¯    i     N   i     )  |  J ¯  | d ξ d η    }  +  ∑  i = 1   i =   n   p         A ¯    o c      p ¯    o c             (15)   S ¯  =   ∂    F ¯    0     ∂  h ¯    =  ∑  e = 1     n   e      {   ∫  − 1  1    ∫  − 1  1    (    ∂    p ¯    1     ∂  h ¯      N   1   +   ∂    p ¯    2     ∂  h ¯      N   2   +   ∂    p ¯    3     ∂  h ¯      N   3   +   ∂    p ¯    4     ∂  h ¯      N   4    )  |  J ¯  | d ξ d η    }  +  ∑  i = 1   i =   n   p         A ¯    o c     ∂    p ¯    o c     ∂  h ¯     =  ∑  e = 1     n   e      {   ∫  − 1  1    ∫  − 1  1    (   ∑  i = 1     n   l   = 4      ∂    p ¯    i     ∂ h     N   i     )  |  J ¯  | d ξ d η    }  +  ∑  i = 1   i =   n   p         A ¯    o c     ∂    p ¯    o c     ∂  h ¯       where ∂ {  p ¯  } / ∂  h ¯  is obtained by differentiating Eq. (7) with respect to  h ¯     (16)  [  F ¯  ]   ∂ {  p ¯  }   ∂  h ¯    =  {    ∂  Q ¯    ∂  h ¯     }  +   h ̇  ¯   ∂  ∂  h ¯    [    R ¯    t   ] −   ∂ [  F ¯  ]   ∂  h ¯    {  p ¯  }   where     ∂  Q ¯    ∂  h ¯    =  [        ∂    Q ¯    1     ∂  h ¯            ∂    Q ¯    2     ∂  h ¯         ⋮        ∂    Q ¯    i     ∂  h ¯         ⋮        ∂    Q ¯    n     ∂  h ¯         ]  ,    ∂ [  F ¯  ]   ∂  h ¯    =  [        ∂    F ¯    11     ∂  h ¯          ∂    F ¯    12     ∂  h ¯       …      ∂    F ¯    1 j     ∂  h ¯        . …       ∂    F ¯    1 n     ∂  h ¯            ∂    F ¯    21     ∂  h ¯          ∂    F ¯    22     ∂  h ¯       …      ∂    F ¯    2 j     ∂  h ¯       …      ∂    F ¯    2 n     ∂  h ¯         ⋮   ⋮   ⋮   ⋮   ⋮   ⋮        ∂    F ¯    i 1     ∂  h ¯          ∂    F ¯    i 1     ∂  h ¯       …      ∂    F ¯    i j     ∂  h ¯       …      ∂    F ¯    i n     ∂  h ¯         ⋮   ⋮   ⋮   ⋮   ⋮   ⋮        ∂    F ¯    n 1     ∂  h ¯          ∂    F ¯    n 2     ∂  h ¯       …      ∂    F ¯    n j     ∂  h ¯       …      ∂    F ¯    n n     ∂  h ¯         ]  ,   ∂  ∂  h ¯    [    R ¯    t   ] =  [        ∂    R ¯    t 1     ∂  h ¯            ∂    R ¯    t 2     ∂  h ¯         ⋮        ∂    R ¯    t i     ∂  h ¯         ⋮        ∂    R ¯    t n     ∂  h ¯         ]   and    ∂ {  p ¯  }   ∂  h ¯    =  [        ∂    p ¯    1     ∂  h ¯            ∂    p ¯    2     ∂  h ¯         ⋮        ∂    p ¯    i     ∂  h ¯         ⋮        ∂    p ¯    n     ∂  h ¯         ]           (17)   C ¯  =   ∂  F ¯    ∂   h ̇  ¯    =  ∑  e = 1     n   e       {   ∫  − 1  1    ∫  − 1  1    (    ∂    p ¯    1     ∂   h ̇  ¯      N   1   +   ∂    p ¯    2     ∂   h ̇  ¯      N   2   +   ∂    p ¯    3     ∂   h ̇  ¯      N   3   +   ∂    p ¯    4     ∂   h ̇  ¯      N   4    )  |  J ¯  | d ξ d η    }  +   ∑  i = 1   i =   n   p         A ¯    o c     ∂    p ¯    o c     ∂   h ̇  ¯     =  ∑  e = 1     n   e       {   ∫  − 1  1    ∫  − 1  1    (   ∑  i = 1     n   l   = 4      ∂    p ¯    i     ∂   h ̇  ¯      N   i     )  |  J ¯  | d ξ d η    }  +   ∑  i = 1   i =   n   p         A ¯    o c     ∂    p ¯    o c     ∂   h ̇  ¯       where ∂ {  p ¯  } / ∂   h ̇  ¯  is obtained by differentiating Eq. (7) with respect to   h ̇  ¯     (18)  [  F ¯  ]   ∂ {  p ¯  }   ∂   h ̇  ¯    =  {    ∂  Q ¯    ∂   h ̇  ¯     }  +  ∂  ∂   h ̇  ¯    (   h ̇  ¯  [    R ¯    t   ] ) −   ∂ [  F ¯  ]   ∂   h ̇  ¯    {  p ¯  }   where     ∂  Q ¯    ∂   h ̇  ¯    =  [        ∂    Q ¯    1     ∂   h ̇  ¯            ∂    Q ¯    2     ∂   h ̇  ¯         ⋮        ∂    Q ¯    i     ∂   h ̇  ¯         ⋮        ∂    Q ¯    n     ∂   h ̇  ¯         ]  ,   ∂ [  F ¯  ]   ∂   h ̇  ¯    =  [        ∂    F ¯    11     ∂   h ̇  ¯          ∂    F ¯    12     ∂   h ̇  ¯       …      ∂    F ¯    1 j     ∂   h ̇  ¯        . …       ∂    F ¯    1 n     ∂   h ̇  ¯            ∂    F ¯    21     ∂   h ̇  ¯          ∂    F ¯    22     ∂   h ̇  ¯       …      ∂    F ¯    2 j     ∂   h ̇  ¯       …      ∂    F ¯    2 n     ∂   h ̇  ¯         ⋮   ⋮   ⋮   ⋮   ⋮   ⋮        ∂    F ¯    i 1     ∂   h ̇  ¯          ∂    F ¯    i 1     ∂   h ̇  ¯       …      ∂    F ¯    i j     ∂   h ̇  ¯       …      ∂    F ¯    i n     ∂   h ̇  ¯         ⋮   ⋮   ⋮   ⋮   ⋮   ⋮        ∂    F ¯    n 1     ∂   h ̇  ¯          ∂    F ¯    n 2     ∂   h ̇  ¯       …      ∂    F ¯    n j     ∂   h ̇  ¯       …      ∂    F ¯    n n     ∂   h ̇  ¯         ]   ∂  ∂   h ̇  ¯    [    R ¯    t   ] =  [        ∂    R ¯    t 1     ∂   h ̇  ¯            ∂    R ¯    t 2     ∂   h ̇  ¯         ⋮        ∂    R ¯    t i     ∂   h ̇  ¯         ⋮        ∂    R ¯    t n     ∂   h ̇  ¯         ]   and    ∂ {  p ¯  }   ∂   h ̇  ¯    =  [        ∂    p ¯    1     ∂   h ̇  ¯            ∂    p ¯    2     ∂   h ̇  ¯         ⋮        ∂    p ¯    i     ∂   h ̇  ¯         ⋮        ∂    p ¯    n     ∂   h ̇  ¯         ]       For the hydrostatic thrust pad bearing problem following boundary conditions are applied [4,32,35].  (i) The value of fluid film pressure at all nodes situated on external boundary is zero.  The value of fluid film pressures for all nodes on the pocket boundary is equal.  The flow of lubricant through the restrictor is equal to the bearing input flow.  The cubic shear stress law, which gives the nonlinear relationship between shear stress and shear strain rate for the non-Newtonian behavior of the lubricant is written in dimensionless form as [26,27].  (19)   τ ¯  +  κ ¯     τ ¯   3  =   γ ̇  ¯       This type of non-Newtonian model is incorporated into the Reynolds equation by using the value of the coefficients    F ¯    0   ,    F ¯    1   and    F ¯    2   . These coefficients are known as the cross apparent viscosity integral along the fluid film thickness. This type of methodology to model non-Newtonian lubricant in orifice compensated journal bearing is previously used by the Sinhasan and Sah [27]. For an incompressible non-Newtonian fluid, the shear strain rate (   γ ̇   ¯   ) at a point in fluid film is expressed as [27].  (20)    γ ̇  ¯  =   [    (    h ¯   μ ¯     ∂  p ¯    ∂ α    (   z ¯  −      F ¯    1        F ¯    0      )   )  2  +   (    h ¯   μ ¯     ∂  p ¯    ∂ β    (   z ¯  −      F ¯    1        F ¯    0      )   )  2   ]   1 / 2     where     ∂  p ¯    ∂ α   =  ∑  j = 1     n   l   e         p ¯    j     ∂   N   j     ∂ α     and    ∂  p ¯    ∂ β   =  ∑  j = 1     n   l   e         p ¯    j     ∂   N   j     ∂ β         The viscosity of a non-Newtonian lubricant is described by apparent viscosity (    μ ¯    a   ) which is defined as a function of shear strain rate (   γ ̇  ¯  ) [27].  (21)     μ ¯    a   =  τ ¯  /   γ ̇  ¯       The equation of lubricant flow (    Q ¯    R   ) through the orifice restrictor is expressed in dimensionless form as [36,37].  (22)     Q ¯    R   =    C ¯    s 2     ( 1 −    p ¯    o c   )   1 / 2     where    C ¯    s 2   is dimensionless parameter for orifice discharge.  For the present case, Reynolds equation is non-linear in nature. Thus, a numerical simulation of Reynolds equation can be obtained by only numerical iterative methods. Therefore, an iterative solution procedure shown in Fig. 2 is applied with above formulation. The numerical procedure applied for the computation of static and dynamic performance characteristic parameters contain the following steps.  1. Hydrostatic thrust pad bearing domain is discretized into the 4-noded quadrilateral isoparametric elements.  Values of fluid film pressure distribution and pressure gradient on the nodes are initialized.  If lubricant is non-Newtonian, computation of coefficients    F ¯    0   ,    F ¯    1   and    F ¯    2   is done by using Eqs. (2), (20) and (21).  Gauss points are generated in the elements to compute elemental matrixes. And the elemental matrixes are assembled into global matrixes.  Boundary conditions are applied to global fluidity matrixes.  Linearized system of equation for the fluid film pressure distribution is computed by Gauss–Siedel iterative method.  Steps 3 to 6 are repeated until the convergence criteria for pressure is satisfied.  Once the convergence criteria is satisfied. Static and dynamic performance characteristic are computed using the expressions described earlier sections.  The solution algorithm as described in the flowchart is used to compute the performance characteristics of the thrust bearing system. The values of bearing geometric and operating parameters are judiciously chosen on the basis of the available published literature [6,27,32,38]. To check the validity of the developed algorithm the simulated results are compared with the previously obtained result of hydrostatic thrust bearing. As stated earlier finite element formulation of thrust bearing system with non-Newtonian lubricant is not available (to the best of the author׳s knowledge). Therefore, the results simulated in this paper have been validated by considering the lubricant of thrust bearing to be Newtonian one i.e. (  κ ¯  = 0 ) [36]. Firstly, the results have been compared by considering that the thrust bearing works under parallel operation and compensated with orifice restrictor. Secondly, when thrust bearing has tilt and constant pocket pressure, the numerical result simulated for an orifice restrictor is presented in Table 1. The results indicated in Table 1 shows that thrust bearing compensated with orifice restrictor has reasonably good comparison with the previously obtained result of orifice compensation [36]. The result compared with tilted pad thrust bearing is presented in Fig. 3. As shown in Fig. 3, the results have good comparison with literature results [6].  Three different types of recess shape having the same ratio of    A ¯    b   /    A ¯    o c   = 4 have been chosen in the analysis. Finite element discretization of these bearing geometries is shown in   Figs. 4–6. To analyze the circular, annular and sectorial recess shaped thrust bearing, meshes of 382,169 and 319 elements are used. Figs. 5 and 6 are generated in ANSYS software. The static and dynamic characteristics of bearings have been simulated and computed for various values of tilt parameter, pseudoplastic parameter and restrictor design parameter. A dimensionless pseudoplastic parameter (  κ ¯  ) has been defined as a measure of lubricant nonlinearity. Based on the available published literature [27,38] of journal bearing, the value of pseudoplastic parameter has been chosen to be ranging between 0.0 and 1.0. To show the accuracy of developed algorithm, fluid film pressure distribution is plotted on the thrust pad. Further, the combined influence of pseudoplastic parameter and tilt parameter on the thrust pad bearing has been studied. The value of tilt parameter has been selected to be ranging 0–0.8 [6]. The influence of tilt on the bearing performance characteristic parameter has been presented as a function of tilt parameter (  λ ¯  ) as shown in        Figs. 10–14 by considering restrictor design parameter a fixed value.     Figs. 15–19 show the influence restrictor design parameter on the static as well as dynamic performance characteristic parameter. In Table 2, conversion of dimensionless parameter into dimensional parameter is given.   Figs. 7–9 show the 3-D contour plot of fluid film pressure distribution for the chosen value of tilt parameter and restrictor design parameter for circular recessed, annular recessed and sectorial recessed thrust pad bearing. Fig. 7(a) shows that there is no variation in fluid film pressure distribution along the circumferential direction when there is no tilt, which clearly shows the validity of the formulation. Fig. 7(b) shows the variation in fluid film pressure on tilted pad circular recessed bearing. In Fig. 7(b) change in pocket pressure due to tilt is very small. Therefore, variation in fluid film pressure distribution due to tilt is very small as compared to other recess. Fig. 8(a) shows the variation of fluid film pressure on the annular shape recessed thrust bearing pad. Pressure distribution on annular shape recessed thrust pad does not vary along the circumference. When it is tilted in x-direction, pressure distribution does not hold symmetry about y-axis shown in Fig. 8(b) and the change in the fluid film pressure distribution is substantially high. Furthermore, it may also be noted that fluid film pressure does not vary on the central portion of bearing pad for both the case Fig. 8(a) and (b), whereas fluid film pressure varies in the outer ring. Hence, there is no flow of lubricant on the central portion of pad. Fig. 8(b) also shows that tilt parameter significantly reduces the pocket pressure of the annular recess thrust bearing and increases the lubricant flow rate. Lubricant fluid film pressure variation on the sectorial shape recess bearing pad without tilt is shown in Fig. 9(a). Pressure at the outer circumference is observed to be zero. As shown in Fig. 9(a). Fluid film pressure does not vary on the central portion of the bearing. Fluid film pressure distribution for the tilted pad sectorial recessed thrust bearing with tilt is shown in Fig. 9(b). In this thrust pad is tilted in x direction. It has been observed that the fluid film pressure distribution changes significantly with tilt parameter. Pocket pressure of all the pockets without tilt is equal but when it is tilted pocket pressure of the bearing change significantly. As the lubricant flow rate is directly proportional to the fluid film pressure distribution thereby the lubricant flow rate gets changed. In the presented result, pocket pressure of pocket 1 is plotted in Figs. 10 and 15.   Fig. 10 shows the influence of tilt parameter on the value of pocket pressure    p ¯    o c   of different recess shapes. As indicated in Fig. 10, it is obvious that pocket pressure of the bearing reduces monotonically with increasing value of tilt parameter for all types of recessed bearing studied in this work. For a thrust bearing with sectorial recess operating with non-Newtonian lubricant for a specified value of  λ ¯  = 0 , the pocket pressure has maximum value, whereas pocket pressure of thrust bearing with circular pocket and having non-Newtonian (  κ ¯  = 0 ) lubricant is seen to be minimum for the value of tilt parameter  λ ¯  = 0.8 . For Newtonian lubricant the percentage change in the value of    p ¯    o c   on account of tilt parameter (  λ ¯  = 0.8 ) is found to be order of 8.0%, 10.4% and 2.3% for sectorial shape recessed, annular shape recessed and circular shape recessed thrust bearings respectively. Further, it may be observed that the tilt and pseudoplastic properties of non-Newtonian effect results in a reduction in pocket pressure of lubricant. And these parameters have least effect on the pocket pressure of circular shape recessed thrust bearing whereas pocket pressure of annular shape recessed thrust bearing is sharply decreases with an increase in value of these parameters. On the basis of the result presented the following general trends have been observed.      p ¯    o c     |   Tilt   <    p ¯    o c     |   Without  tilt    and     p ¯    o c     |   Newtonian   > |    p ¯    o c     |   Non - Newtonian        As depicted in Fig. 11, lubricant flow rate increases as the value of non-Newtonian parameter and tilt parameter increase and it is due to decrease in the apparent viscosity of non-Newtonian lubricant. In general, the bearing with sectorial shape recess, flow rate is maximum with respect to annular and circular recessed thrust bearing. Further, it has been observed from Fig. 11 that influence of pseudoplastic properties of non-Newtonian lubricant results in increase in lubricant flow rate. Therefore, restrictor flow rate of sectorial shape recess with non-Newtonian (  κ ¯  = 1 ) lubricant is maximum whereas, flow rate of circular recessed thrust bearing operating with Newtonian lubricant (  κ ¯  = 0 ) is observed to have least value of lubricant flow rate. For the chosen value of tilt parameter  λ ¯  = 0.4 , the percentage change in the value  Q ¯  due to pseudoplastic properties (  κ ¯  = 0.58 ), is found to be order of 116% 39.5%, and 53.9% for sectorial shaped recess, annular shaped recess and circular shaped recess respectively, when compared to the base Newtonian fluid. It has also been observed that the value of  Q ¯  for different bearing recess shape configuration follow the following general pattern.       Q ¯    |   Circle   <  Q ¯    |   annular   <  Q ¯    |   sectorial   ,   Q ¯    |   Tilt   >  Q ¯    |   Without  tilt   ,   Q ¯    |   Newtonian   <  Q ¯    |   Non - Newtonian    and   Q ¯    |   Newtonian  with  tilt   <  Q ¯    |   Non - Newtonian  without  tilt       For   λ ¯  = 0  and   κ ¯  = 0 ,   Q ¯    |   Circle   <  Q ¯    |   annular   <  Q ¯    |   sectorial       For   λ ¯  = 0.8  and   κ ¯  = 1 ,  Q ¯    |   Circle   <  Q ¯    |   annular   <  Q ¯    |   sectorial           The variation of value of fluid film reaction with respect to an increasing value of tilt parameter for the various values of pseudoplastic parameter is presented in Fig. 12. Pseudoplastic properties of non-Newtonian lubricant and increase in tilt of thrust pad results in a decrease in load carrying capacity of annular and sectorial shape recess whereas the load carrying capacity of circular shape recess bearing slightly increases with tilt parameter and marginal changes with pseudoplastic parameter. The sectorial shaped recessed thrust pad bearing operating with Newtonian lubricant has almost same load carrying capacity with tilt parameter because on increasing value of tilt parameter, pressure of pocket 3 increases and pressure of pocket 1 decreases. For annular recessed thrust pad bearing with non-Newtonian lubricant (  κ ¯  = 1 ) and tilt parameter (  λ ¯  = 0.8 ) has the minimum value of load carrying capacity. For a particular value of tilt parameter (  λ ¯  = 0.4 ), the fluid film reaction of non-Newtonian lubricant due to pseudoplastic properties (  κ ¯  = 1 ) changes 21.3%, 1.72% and 6% with respect to the base Newtonian lubricant for annular recess shape, circular shape recess and sectorial shape recess respectively. Following general patterns have been observed for the higher value of tilt parameter (  λ ¯  > 0.2 ) with the value of load carrying capacity of the thrust bearing.         F ¯    0     |   Circuiar   <    F ¯    0     |   annular   <    F ¯    0     |   sectorial   ,     F ¯    0     |   Newtonian   >    F ¯    0     |   Non - Newtonian       For   λ ¯  = 0  and   κ ¯  = 0 ,     F ¯    0     |   Circuiar   <    F ¯    0     |   annular   <    F ¯    0     |   sectorial       For   λ ¯  = 0.8  and   κ ¯  = 1 ,     F ¯    0     |   annular   <    F ¯    0     |   Circuiar   <    F ¯    0     |   sectorial           Variation of fluid film stiffness coefficient with tilt parameter for various values of pseudoplastic parameter is presented in Fig. 13. In general, the value of fluid film stiffness coefficient increases monotonically with an increase in the tilt parameter for sector shaped and circular shaped recess. Graphical plots clearly represent that an increase in pseudoplastic properties increases the fluid film stiffness coefficient. This increase in the value of fluid film stiffness coefficient is observed due to decrease in the apparent viscosity of pseudoplastic lubricant. In general, the value of fluid film stiffness coefficient of annular recess is higher than that of sectorial and circular recess. Annular recessed thrust pad bearing provides good value of fluid film stiffness coefficient with non-Newtonian lubricant (  κ ¯  = 0.58 ,  κ ¯  = 1 ). For the chosen value of  λ ¯  = 0.4 , the percentage change in the value of  S ¯  due to pseudoplastic properties (  κ ¯  = 0.58 ) is 14.7%, 0.25% and 3.3% for annular, circular and sectorial shape recess respectively. The value of fluid film stiffness coefficient of the bearing follows the following trend       S ¯    |   Newtonian  without  tilt   <  S ¯    |   Non − Newtonian  with  tilt    and   S ¯    |   Newtonian   <  S ¯    |   Non − Newtonian       For   λ ¯  = 0  and   κ ¯  = 0 ,   S ¯    |   sectorial   <  S →    |   Circuiar   <  S ¯    |   annular       For   λ ¯  = 0.8  and   κ ¯  = 1 ,   S ¯    |   sectorial   <  S →    |   Circuiar   <  S ¯    |   annular           The variation of direct fluid film damping coefficient (  C ¯  ) has been plotted in Fig. 14. Fig. 14 clearly shows that an increase in tilt parameter increases the fluid film damping coefficient while psuedoplastic properties of lubricant results reduction in the value of fluid film damping coefficient. This reduction in the value of fluid film damping coefficient is found due to decrease in the value of apparent viscosity of non-Newtonian lubricant. For the value of tilt parameter  λ ¯  = 0.8 , circular recessed thrust bearing operated with Newtonian lubricant provides maximum value of fluid film damping coefficient. For a given value of  λ ¯  = 0.6 , the percentage decrease in the value of fluid film damping coefficient (  C ¯  ) due to pseudoplastic properties (  κ ¯  = 0.58 ) is observed 25%, 20.8% and 34.8% for circular recessed, annular recessed and sectorial recessed respectively as compared to base Newtonian lubricant. Following useful trend with all the value of tilt parameter is observed in the fluid film damping coefficient with different recess configurations.       C ¯    |   Tilt   >  C ¯    |   Without  tilt    and   C ¯    |   Newtonian   >  C ¯    |   Non - Newtonian       For   λ ¯  = 0  and   κ ¯  = 0 ,   C ¯    |   sectorial   <  C ¯    |   Circuiar   <  C ¯    |   annular       For   λ ¯  = 0.8  and   κ ¯  = 1 ,   C ¯    |   sectorial   <  C ¯    |   annular   <  C ¯    |   Circuiar            Figs. 15–19 show the variation of performance characteristics of thrust bearing with respect to restrictor design parameter (    C ¯    S 2   ) . Fig. 15 represents the variation of the value of pocket pressure with respect to restrictor design parameter (    C ¯    S 2   ) for the fixed value of tilt parameter. As the plot clearly indicates that value of pocket pressure of all the recess shape monotonically increases as the value of restrictor design parameter (    C ¯    S 2   ) increase and pseudoplastic properties of lubricant decreases the pocket pressure. And it may also be noted that pocket pressure of the Newtonian lubricant has higher value than the pocket pressure of the non-Newtonian lubricant. For the chosen value of restrictor design parameter    C ¯    s 2   = 20 , the percentage increase in the value pocket pressure due to pseudoplastic parameter (  κ ¯  = 1 ) is observed 8.8%, 13.6% and 1.4% sectorial shape recess, annular shape recess and circular shape recess respectively which seems to be significant.  Variation of lubricant flow rate (  Q ¯  ) with increasing value of restrictor design parameter (    C ¯    s 2   ) for a constant value of tilt parameter is shown in Fig. 16. In general, restrictor flow rate of non-Newtonian lubricant is higher vis-à-vis Newtonian lubricant and it increases monotonically with the increasing value of restrictor design parameter (    C ¯    S 2   ) . Change in restrictor design parameter (    C ¯    S 2   ) has least effect on the circular recessed thrust bearing having non-Newtonian lubricant. Lubricant flow rate (  Q ¯  ) via orifice restrictor is maximum for sectorial shape recessed thrust bearing having non-Newtonian lubricant (  κ ¯  = 1 ) whereas the lubricant flow rate (  Q ¯  ) of circular shape recess is minimum with Newtonian lubricant (  κ ¯  = 1 ). Pseudoplastic properties of non-Newtonian lubricant substantially increases amount of lubricant flow rate (  Q ¯  ) of annular and sectorial shape recess whereas it has less effect on the value of lubricant flow rate of circular shape recess. The flow requirement for all the bearings studied follows following general pattern as       Q ¯    |   Sect   >  Q ¯    |   annular   >  Q ¯    |   Circular   ,   Q ¯    |   Non - Newtonian   >  Q ¯    |   Newtonian       For     C ¯    S 2   = 5 ,   λ ¯  = 0.4  and   κ ¯  = 0 ,   Q ¯    |   Circuiar   <  Q ¯    |   annular   <  Q ¯    |   sectorial       For     C ¯    S 2   = 40 ,   λ ¯  = 0.4  and   κ ¯  = 1 ,   Q ¯    |   Circuiar   <  Q ¯    |   annular   <  Q ¯    |   sectorial           The variation of fluid film reaction with respect to increasing value of restrictor design parameter (    C ¯    S 2   ) is depicted in Fig. 17. The value of fluid film reaction increases with an increase in the value of restrictor design parameter (    C ¯    S 2   ) because pocket pressure increases with the increasing value of restrictor design parameter. The value of fluid film reaction of circular shape recessed bearing is least affected by pseudoplastic parameter whereas a drastic change is observed in the value of load carrying capacity of annular recessed thrust pad bearing with pseudoplastic properties. For the chosen value of restrictor design parameter    C ¯    s 2   = 20 , the percentage change in the value of load carrying capacity due to pseudoplastic properties (  κ ¯  = 1 ) is 2%, 12% and 1.58% for sectorial recessed, annular recessed and circular recessed thrust bearing respectively. Further, it is also observed that up to a certain value of restrictor design parameter value    C ¯    s 2   = 10 for circular recess, the value of load carrying capacity of pseudoplastic lubricant is more than the value of load carrying capacity of Newtonian lubricant.   For     C ¯    S 2   = 5 ,   λ ¯  = 0.4  and   κ ¯  = 0 ,     F ¯    0     |   Circuiar   <    F ¯    0     |   annular   <    F ¯    0     |   sectorial   For     C ¯    S 2   = 40 ,   λ ¯  = 0.4  and   κ ¯  = 1 ,     F ¯    0     |   Circuiar   <    F ¯    0     |   annular   <    F ¯    0     |   sectorial        As shown in Fig. 18 the value of fluid film stiffness coefficient (  S ¯  ) decreases with the increasing value of restrictor design parameter (    C ¯    S 2   ) . An increase in pseudoplastic properties of non-Newtonian lubricant increases the fluid film stiffness coefficient (  S ¯  ) of bearing. The value of fluid film stiffness coefficient (  S ¯  ) of sectorial shape recess with Newtonian lubricant is minimum whereas the value of fluid film stiffness coefficient (  S ¯  ) of annular recessed thrust bearing with non-Newtonian lubricant is maximum. For the given value of restrictor design parameter    C ¯    s 2   = 15 , percentage increase in the value of fluid film stiffness coefficient (  S ¯  ) of non-Newtonian lubricant (  κ ¯  = 0.58 ) is observed 150%, 79% and 398% for annular recess shape, circular recess and sectorial shape recess respectively with respect to base Newtonian lubricant, this shows the effect of pseudoplastic properties on fluid film stiffness coefficient (  S ¯  ) . Following useful trends in the value fluid film stiffness coefficient have been observed.       S ¯    |   Non - Newtonian   >  S ¯    |   Newtonian       For     C ¯    S 2   = 5 ,   λ ¯  = 0.4  and   κ ¯  = 0 ,   S ¯    |   sectorial   <  S →    |   Circuiar   <  S ¯    |   annular       For     C ¯    S 2   = 40 ,   λ ¯  = 0.4  and   κ ¯  = 1 ,   S →    |   Circuiar   <  S ¯    |   sectorial   <  S ¯    |   annular           Variation of the fluid film damping coefficient (  C ¯  ) with respect to restrictor design parameter (    C ¯    S 2   ) is illustrated in the Fig. 19. The value of fluid film damping coefficient (  C ¯  ) continuously decreases with the increasing value of restrictor design parameter (    C ¯    S 2   ) . In general, pseudoplastic properties of lubricant results decrease in the value of fluid film damping coefficient (  C ¯  ) . It is due to decrease in apparent viscosity of pseudoplastic lubricant compared to base Newtonian lubricant. For a chosen value of restrictor design parameter    C ¯    s 2   = 25 , the percentage change due to pseudoplastic properties (  κ ¯  = 0.58 ) is 13.5%, 42.8% and 40.6% for annular recess, sectorial recess and circular recess respectively which seems to be significant. It has been observed from the graph that the value of fluid film damping coefficient follow following pattern.       C ¯    |   Non - Newtonian   <  C ¯    |   Newtonian       For     C ¯    S 2   = 5 ,   λ ¯  = 0.4  and   κ ¯  = 0 ,   C ¯    |   sectorial   <  C ¯    |   Circuiar   <  C ¯    |   annular       For     C ¯    S 2   = 40 ,   λ ¯  = 0.4  and   κ ¯  = 1 ,   C ¯    |   sectorial   <  C ¯    |   Circuiar   <  C ¯    |   annular            CONCLUSIONS   In the present work, hydrostatic thrust pad bearing lubricated with Rabinowitsch fluid model, the influence of the tilt parameter having different geometric shapes of recesses on the static and dynamic performance characteristic is carried out. The modified Reynolds equation with tilt is solved by using an iterative FEM Formulation. On the basis of numerically simulated results following general conclusions have been drawn.  1. The static and dynamic performance of a circular hydrostatic tilted thrust pad bearing change significantly as the tilt parameter and shape of the recess change.  The lubricant flow (  Q ¯  ) requirement of a bearing operating with non-Newtonian lubricant is higher than that of Newtonian lubricant thus the pumping power loss enhances.    Q ¯    |   Non - Newtonian   >  Q ¯    |   Newtonian        Lubricant flow rate of sectorial, annular and circular shape recess follow the general pattern  Q ¯    |   Sect   >  Q ¯    |   annular   >  Q ¯    |   Circular   and load carrying capacity of sectorial recess is higher than that of annular and circular shape recess bearing.  Load carrying capacity (    F ¯    0   ) of sectorial and circular shape recess thrust bearing with Newtonian lubricant remains almost same with tilt parameter (  λ ¯  ). Further, the value of    F ¯    0   increases with the increasing value restrictor design parameter (    C ¯    s 2   ). Whereas the value of    F ¯    0   of sectorial and annular recessed with non-Newtonian decreases with tilt parameter (  λ ¯  ).  The value of fluid film stiffness coefficient (  S ¯  ) gets enhanced when the bearing operates with pseudoplastic lubricant and an increase in the value of restrictor design parameter (    C ¯    S 2   ) results a reduction in the value of (  S ¯  ) whereas an increase in tilt parameter (  λ ¯  ) results in an increase in the value of (  S ¯  ) of circular and sectorial shape recess.    S ¯    |   Newtonian  without  tilt   <  S ¯    |   Non − Newtonian  with  tilt   ,  S ¯    |   Non - Newtonian   >  S ¯    |   Newtonian        Newtonian lubricant provides the higher value of fluid film damping coefficient than non-Newtonian lubricant. It is observed that an increase in the value of restrictor design parameter (    C ¯    S 2   ) results a reduction in the value of  C ¯  and an increase in the value of tilt parameter results an increase in the value of  C ¯  .    C ¯    |   Non - Newtonian   <  C ¯    |   Newtonian        To get desired performance from a hydrostatic tilted thrust pad bearing, proper selections of recess shape and non-Newtonian lubricant are essential.   REFERENCES", "highlights": "Hydrostatic thrust bearings are an integral part of hydroelectric power stations. These bearings are usually designed to work under parallel operation, but tilt is inevitable due to manufacturing errors, assembly errors, structural vibrations and structural deformations. Owing to the advent of latest advancements in manufacturing techniques, any geometric shape of recess can be easily manufactured and the designer has a greater flexibility. The geometric shape of recess significantly affects the performance of a bearing. Therefore, the present study is aimed to numerically analyze the influence of the tilt and recess shape on the static and dynamic performance characteristics of the hydrostatic thrust pad bearing system having Rabinowitsch fluid model lubricant. The lubricant obeying Rabinowitsch fluid model with tilt makes the Reynolds equation highly non-linear therefore, finite element method is used to analyze. Three different types of recess shapes of equal area    A ¯    b   /    A ¯    o c   = 4 have been analyzed to model hydrostatic thrust pad compensated by orifice compensator. The numerically simulated results indicate that the tilt angle significantly affects the dynamic and static characteristic parameters. The value of pocket pressure and fluid film reaction of a hydrostatic thrust pad bearing has been found to significantly decrease with tilt whereas the value of lubricant flow, fluid film stiffness coefficient and fluid damping coefficient increase with tilt.   area  fluid film damping coefficient  diameter of the orifice  resultant fluid film reaction  (    ∂ h   ∂ t    )  ≠ 0    resultant fluid film reaction  (    ∂ h   ∂ t    )  = 0    fluid film thickness  reference fluid film thickness  pressure  pocket pressure  (    ∂ h   ∂ t    )  ≠ 0    supply pressure  bearing flow  restrictor flow  non-linearity parameter  capillary length  total number of nodes  total number of elements  number of pockets  total number of nodes in an element  outer radius of the circular thrust pad  fluid film stiffness coefficient  time  viscosity of the lubricant  tilt angle  density of the lubricant  Cartesian coordinate system  coefficient of discharge for an orifice restrictor      C   h   f   3       r   o   4   μ          3 π   d   o   2   μ   2   h   r   3       Ψ   d     (   2  ρ   p   s      )   1 / 2   ( Orifice )         C ¯    s 1   / 6        F   0   /   r   o   2     p   s        F /   r   o   2     p   s        h /   h   r          A   b   /   A   o c          ∂ h   ∂  t ¯         p /   p   s          12 μ     p   s     h   r   3       Q   R         μ    p   s     h   r   3     Q      κ   (      h   r     p   s       r   o      )  2         12 μ     p   s     h   r   3       Q   r          λ    r   o       h   r          X /   r   o        Y /   r   o        t /  (    μ   r   o   2       h   r   2     p   s      )     bearing  contribution due to bearing land area  contribution due to pocket area   eth element  pocket  steady state equilibrium  restrictor  corresponding dimensionless parameter  supply pressure  assembled fluidity matrix  nodal pressure vector  nodal flow vector  right hand side vector due to squeeze terms"}