{"id": "S0168874X15001602", "article": "MAIN-TITLE Direct-differentiation-based sensitivity analysis of an axisymmetric finite element formulation including torsion   HIGHLIGHTS          We present a sensitivity analysis for axisymmetry including torsion using the direct differentiation method.      The sensitivity analysis is performed in the framework of finite strains.      The accuracy is assessed by comparison with finite difference results.      The sensitivity analysis permits the use of gradient-based methods in shape optimization in axisymmetry with torsional loads.          KEYPHRASES   Finite element modeling  Generalized axisymmetry  Direct differentiation   In case of axisymmetric or near-axisymmetric geometries, generalized axisymmetry offers the possibility to reduce a three-dimensional model to a two-dimensional model with additional degrees of freedom in tangential direction. Generally speaking, the geometry is defined in a plane, and a discrete Fourier expansion is operated in tangential direction, in order to take into account either a non-axisymmetric geometry or, as in most cases, non-axisymmetric loads. The introduction of a single degree of freedom in tangential direction enables the treatment of axisymmetry with superposed torsion. The generalized axisymmetry thus offers the possibility to strongly reduce the computational effort by reducing the number of degrees of freedom in comparison to a full three-dimensional model. This may especially be of interest in optimization or inverse problems, where the same finite element model has to be recomputed a significant number of times. An additional advantage of an axisymmetric model concerns contact mechanics, as the treatment of contact surfaces in three dimensions is reduced to that of contact curves in two dimensions, which greatly simplifies modeling and enables the use of methods for more efficient contact treatment, like for example contact surface discretizations with C 1-continuity [1].  Among the first authors to produce a finite element formulation for generalized axisymmetry are [2,3] for linear elasticity and [4] for inelastic materials, both at small strains. Finite strain formulations for generalized axisymmetry in solid mechanics have been presented in [5], and later on in various contexts like thermomechanical homogenization [6], mixed or enhanced strain formulations [7–9], ALE formulations [6], consolidation analysis [10], or others [11,12]. Contact mechanics in the context of generalized axisymmetry has been treated in [14], for example. One of the major challenges in finite strains is that the base vectors vary with position [13]. The treatment of generalized axisymmetry may be executed either in mathematical or physical coordinates [15], using different ways to arrive at the equations of virtual work. Different mathematical concepts are use for an efficient treatment of generalized axisymmetry. For example, use is made of a mathematical shifter tensor in [16] for deriving the kinematics of generalized axisymmetry. In [5], the finite element equations use cylindrical coordinates for the description of the geometry, but the displacements are kept in Cartesian coordinates, in order to avoid displacement locking. Issues related to the numerical integration of axisymmetric finite element formulations are discussed in [17], an improved treatment of incompressibility is detailed in [18] and methods for reducing mesh locking in the context of axisymmetry are given in [19–21], for example.  Sensitivity analysis, i.e. the calculation of derivatives with respect to model parameters like material or shape parameters, amongst others, is useful in gradient-based solution methods of inverse problems or shape optimization. Various aspects of sensitivity analysis in standard axisymmetry have been presented in [22–24], for example. Recently, the sensitivity analysis using the adjoint state method for generalized axisymmetry with fully asymmetric loading has been presented in [25] for the case of small strains. In the present work, sensitivity analysis based on the direct differentiation method is presented for finite strains for the most simple case of generalized axisymmetry, i.e. axisymmetry with superposed torsion. First, the kinematics of generalized axisymmetry are outlined. Then, the linearization and sensitivity analysis of the kinematic quantities are presented and introduced into the virtual work equation. With the sensitivity of the Cauchy stress, the discretized formulation of the linearized virtual work equation is given. Finally, the performance of the sensitivity analysis is assessed in two examples by comparing the sensitivities obtained by direct differentiation to those obtained by the finite difference method.  According to [13], the geometry x in the current state, described by the coordinates r, z and ϕ,  (1)  x = r   e   r   + z   e   z   ,   is related to the initial geometry with coordinates R, Z and Φ through the radial displacement u, the vertical displacement v and the angular displacement θ:  (2)  r = R + u ( R , Z ) z = Z + v ( R , Z ) ϕ = Φ + θ ( R , Z ) .   The current basis vectors are   e   r   ,   e   ϕ   and   e   z   , the first two depending on ϕ. Then, the deformation gradient can be expressed as  (3)  F = (       ∂ r   ∂ R       ∂ r   ∂ Z     0       ∂ z   ∂ R       ∂ z   ∂ Z     0     r   ∂ ϕ   ∂ R     r   ∂ ϕ   ∂ Z       r   R     ∂ ϕ   ∂ Φ       ) = (     1 +   ∂ u   ∂ R       ∂ u   ∂ Z     0       ∂ v   ∂ R     1 +   ∂ v   ∂ Z     0     r   ∂ θ   ∂ R     r   ∂ θ   ∂ Z     1 +   u   R       ) .      Taking into account that in polar or cylindrical coordinates, the non-zero variations of the basis vectors are  (4)  δ   e   r   = δ θ    e   ϕ   δ   e   ϕ   = − δ θ    e   r   ,   the variation of the deformation gradient, Eq. (3), becomes  (5)  δ F = (       ∂ δ u   ∂ R       ∂ δ u   ∂ Z     0       ∂ δ v   ∂ R       ∂ δ v   ∂ Z     0     r   ∂ δ θ   ∂ R     r   ∂ δ θ   ∂ Z       δ u   R       ) + (     0   0   0     0   0   0     δ u   ∂ ϕ   ∂ R     δ u   ∂ ϕ   ∂ Z     0     ) + δ θ (     − r   ∂ ϕ   ∂ R     − r   ∂ ϕ   ∂ Z     −   r   R       0   0   0       ∂ r   ∂ R       ∂ r   ∂ Z     0     ) .   With the partial velocity gradient  (6)  δ   L   ˜   = (       ∂ δ u   ∂ r       ∂ δ u   ∂ z     0       ∂ δ v   ∂ r       ∂ δ v   ∂ z     0     r   ∂ δ θ   ∂ r     r   ∂ δ θ   ∂ z       δ u   r       )   and the sparse anti-symmetric tensor  (7)  δ Ξ = (     0   0   − δ θ     0   0   0     δ θ   0   0     ) ,   the variation of the deformation gradient can be expressed as  (8)  δ F = δ   L   ˜   F + δ Ξ  F ,   where the last term in Eq. (5), which stems from the basis variation, equals the last term in Eq. (8). The variation of the velocity gradient δ L is subsequently obtained by multiplying Eq. (8) by the inverse of the deformation gradient, yielding  (9)  δ L = δ F    F   − 1   = δ   L   ˜   + δ Ξ .      In opposition to sensitivities of kinematic entities with respect to material parameters, where the sensitivities correspond to a linearization, shape sensitivities include additional terms because the initial and current coordinates include the shape change. Thus, for shape sensitivities, Eq. (2) has to be rewritten using a reference geometry,   X   r   , a design velocity V and a parameter τ quantifying the design change, as described in [26,27]. In the following, the sensitivity of a generic variable α, designating either a scalar or a first or second order tensor, is defined as  (10)    [  α  ]   ⋄   =    lim   τ → 0      α (    X   r   + τ V (    X   r    )  ) − α (    X   r    )   τ   .   It should be noted that the design change is prescribed on the boundary of the solid, but the way the resulting design velocity propagates into the interior of the solid is determined using methods like the finite difference method, isoparametric mapping, boundary displacement method or fictitious load method [26,27]. In the present work, the boundary displacement method is used. In generalized axisymmetry, the shape change only affects the in-plane initial coordinates, i.e. no shape change in tangential direction, or shape change dependency in tangential direction, takes place. Thus one can extend Eq. (2) into  (11)  r =   R   r   +   V   r   τ + u ( R , Z ) z =   Z   r   +   V   z   τ + v ( R , Z ) ϕ = Φ + θ ( R , Z ) .   The linearization of the deformation gradient gives a similar result to Eq. (5), notably  (12)    [  F  ]   ⋄   =   [    L   ˜    ]   ⋄    F +   [  Ξ  ]   ⋄    F − F   ∂ V   ∂ X   ,   with  (13)    ∂ V   ∂ X   = (       ∂   V   r     ∂ R       ∂   V   r     ∂ Z     0       ∂   V   z     ∂ R       ∂   V   z     ∂ Z     0     0   0       V   r     R       ) .   The last term in Eq. (12) comes from the dependency of the initial geometry on the shape velocity in the differentiation with respect to the initial geometry, as explained in [27]. Multiplying Eq. (12) with the inverse of the deformation gradient, one gets  (14)    [  L  ]   ⋄   =   [  F  ]   ⋄      F   − 1   =   [    L   ˜    ]   ⋄   +   [  Ξ  ]   ⋄   − F   ∂ V   ∂ x   ,   where  (15)    ∂ V   ∂ x   =   ∂ V   ∂ X      F   − 1     and the tensors   [    L   ˜    ]   ⋄   and   [  Ξ  ]   ⋄   are defined as  (16)    [    L   ˜    ]   ⋄   = (       ∂   [  r  ]   ⋄     ∂ r       ∂   [  r  ]   ⋄     ∂ z     0       ∂   [  z  ]   ⋄     ∂ r       ∂   [  z  ]   ⋄     ∂ z     0     r   ∂   [  ϕ  ]   ⋄     ∂ r     r   ∂   [  ϕ  ]   ⋄     ∂ z       δ u   r       )   and  (17)    [  Ξ  ]   ⋄   = (     0   0   −   [  ϕ  ]   ⋄       0   0   0       [  ϕ  ]   ⋄     0   0     ) .   Eqs. (16) and (17) are similar to the definitions of the respective variations in Eqs. (6) and (7), respectively, with the difference that the former use derivatives of sensitivities of the coordinates, whereas the latter use derivatives of the variations of the displacements. The sensitivity of Eq. (9) reads  (18)    [  δ L  ]   ⋄   =   [  δ F  ]   ⋄      F   − 1   − δ F    F   − 1     [  F  ]   ⋄      F   − 1   =   [  δ F  ]   ⋄      F   − 1   − δ L   [  L  ]   ⋄   .   The second term in the middle of Eq. (18) comes from the sensitivity of the inverse of the deformation gradient, which is rewritten using the definitions of δ L and   [  L  ]   ⋄   from Eqs. (9) and (14), respectively. With  (19)  δ   F   ˜   = δ   L   ˜   F ,   one can show that  (20)    [  δ   F   ˜    ]   ⋄      F   − 1   =   M   ˜   − δ   F   ˜     ∂ V   ∂ x   + δ   F   ˜     [  Ξ  ]   ⋄   ,   where the tensor   M   ˜   is defined as  (21)    M   ˜   = (     0   0   0     0   0   0     δ u   ∂   [  ϕ  ]   ⋄     ∂ r     δ u   ∂   [  ϕ  ]   ⋄     ∂ z     0     ) + (     0   0   0     0   0   0       [  r  ]   ⋄     ∂ δ θ   ∂ r       [  r  ]   ⋄     ∂ δ θ   ∂ z     0     ) .   Then, the linearization of the variational velocity gradient takes the form  (22)    [  δ L  ]   ⋄   =   M   ˜   − δ   F   ˜     ∂ V   ∂ x   +   [  δ Ξ  ]   ⋄   + δ Ξ   [  L  ]   ⋄   +   [  Ξ  ]   ⋄   δ L − δ L   [  L  ]   ⋄   .   With the second term in Eq. (22) also being included in the last term, and with the sensitivity of the variation of Ξ being zero, Eq. (22) becomes  (23)    [  δ L  ]   ⋄   =   M   ˜   +   [  Ξ  ]   ⋄    δ   L   ˜   +   [  Ξ  ]   ⋄    δ Ξ − δ   L   ˜      [  Ξ  ]   ⋄   − δ   L   ˜      [    L   ˜    ]   ⋄   .   It can easily be shown that in a Cartesian coordinate system or in a standard axisymmetric analysis, all terms but the last one in Eq. (23) vanish.  Using the Cauchy stress σ in a body of current volume v, the equation of virtual work can be expressed as  (24)  δ W =   ∫   v   σ : δ L  dv =   ∫   v   σ : (  δ   L   ˜   + δ Ξ  )  dv .   The linearization of the virtual work equation then becomes, with the trace operator tr  (25)    [  δ W  ]   ⋄   =   ∫   v   (    [  σ  ]   ⋄   : δ L − σ : (  δ   L   ˜      [    L   ˜    ]   ⋄    ) + σ : δ L  tr   [  L  ]   ⋄    )  dv +   ∫   v   σ : δ L  tr (  F   ∂ V   ∂ x    )  dv +   ∫   v   σ : (    M   ˜   +   [  Ξ  ]   ⋄    δ   L   ˜   +   [  Ξ  ]   ⋄    δ Ξ − δ   L   ˜      [  Ξ  ]   ⋄    )  dv .   In Eq. (25), the first integral contains the standard constitutive, geometric and volumetric terms. The second integral stems from the shape change due to the shape parametrization. The last integral is specific to the use of cylindrical coordinates, as it vanishes in the case of Cartesian coordinates. Taking into consideration that σ and   [  σ  ]   ⋄   are symmetric whereas   [  Ξ  ]   ⋄   is antisymmetric, the double contractions of some tensors are zero. In addition to that, the integrand of the second integral cancels out a part of the last term of the first integral, as can be seen from Eq. (14). Thus, Eqs. (24) and (25) can be simplified to  (26)  δ W =   ∫   v   σ : δ   L   ˜    dv .   and  (27)    [  δ W  ]   ⋄   =   ∫   v   (    [  σ  ]   ⋄   : δ   L   ˜   − σ : (  δ   L   ˜      [    L   ˜    ]   ⋄    ) + σ : δ   L   ˜    tr   [    L   ˜    ]   ⋄    )  dv +   ∫   v   σ : (    M   ˜   +   [  Ξ  ]   ⋄    δ   L   ˜   +   [  Ξ  ]   ⋄    δ Ξ − δ   L   ˜      [  Ξ  ]   ⋄    )  dv .   The additional terms stemming from δ Ξ and   [  Ξ  ]   ⋄   do not have a significant impact on the complexity or effort of calculating the stiffness matrix because these tensors are sparse and antisymmetric. It is important to notice that even in the absence of δ Ξ in Eq. (26) and in the first integral of Eq. (27), the angular degrees of freedom appear implicitly in δ   L   ˜   , as can be seen from Eq. (6). Likewise, even if the shape velocity vector does not appear in Eq. (26), it is implicitly included in the sensitivities of the current coordinates in   [    L   ˜    ]   ⋄   .  In this paper, neohookean material behavior is considered. However, for a generalization of the equations to inelastic material behavior, an incremental form of the material behavior is also used. The neohookean material behavior can be stated as  (28)  σ =   μ   J   (  b − I  ) +   λ  ln  J   J   I .   Here, J is the determinant of the deformation gradient, F, μ and λ are the Lamé constants and I is the second order identity tensor. The right Cauchy–Green deformation tensor b is defined as  (29)  b =   FF   T   ,   and with Eq. (14) and the symmetric fourth-order unit tensor   I   S   , its linearization becomes  (30)    [  b  ]   ⋄   =   [  F  ]   ⋄     F   T   + F   [    F   T    ]   ⋄   =   [  L  ]   ⋄   b + b   [    L   T    ]   ⋄   = 2   I   S   : (    [  L  ]   ⋄   b  ) ,   In an incremental formulation of kinematics, use is made of the deformation gradient   F   0   and deformation tensor   b   0   at the start of the time increment, and of the deformation gradient increment Δ F , defined as  (31)  Δ F = F   (    F   0    )   − 1   .   Using Eq. (31), the deformation tensor can alternatively be written as  (32)  b = Δ   Fb   0   Δ   F   T   ,   and the linearization becomes  (33)    [  b  ]   ⋄   = Δ F   [    b   0    ]   ⋄   Δ   F   T   +   [  Δ F  ]   ⋄   Δ   F   − 1   b + b   [  Δ   F   T    ]   ⋄   Δ   F   − T   = Δ F   [    b   0    ]   ⋄   Δ   F   T   + 2   I   S   : (    [  Δ F  ]   ⋄   Δ   F   − 1   b  ) .   The linearization of the neohookean elasticity law can be written as  (34)    [  σ  ]   ⋄   =   ∂ σ   ∂ κ   + C :   [  b  ]   ⋄   =   ∂ σ   ∂ κ   +   C   ¯   :   [  L  ]   ⋄   ,   where the fourth-order elasticity tensors, C and   C   ¯   , are defined as  (35)  C =   1   J   (  μ    I   S   +   λ  I − J  σ   2   ⊗   b   − 1    )   and  (36)      C   ¯     ijkl   = 2   C   ijmn   :   I   mnkp   S     b   pl   .   The first term on the right-hand side of Eq. (34) represents the explicit dependency of the Cauchy stress on the parameter κ with respect to whom the sensitivity is determined, as for example in sensitivities with respect to material parameters. In shape optimization, this term is zero. For the linearization in the framework of a sensitivity analysis in an incremental setting with variables at the increment start labeled ‘0’ and increment ‘ Δ ’, the sensitivities of the coordinates can be brought in the form  (37)    [  r  ]   ⋄   =   V   r   +   [    u   0    ]   ⋄   +   [  Δ u  ]   ⋄   =   [    r   0    ]   ⋄   +   [  Δ u  ]   ⋄     [  z  ]   ⋄   =   V   z   +   [    v   0    ]   ⋄   +   [  Δ v  ]   ⋄   =   [    z   0    ]   ⋄     [  Δ v  ]   ⋄     [  ϕ  ]   ⋄   =   [    θ   0    ]   ⋄   +   [  Δ θ  ]   ⋄   =   [    ϕ   0    ]   ⋄   +   [  Δ θ  ]   ⋄   .   Using the incremental kinematic quantities, some auxiliary tensors may be defined:  (38)    [      L   ˜     01    ]   ⋄   = (       ∂   [    r   0    ]   ⋄     ∂ r       ∂   [    r   0    ]   ⋄     ∂ z     0       ∂   [    z   0    ]   ⋄     ∂ r       ∂   [    z   0    ]   ⋄     ∂ z     0     r   ∂   [    ϕ   0    ]   ⋄     ∂ r     r   ∂   [    ϕ   0    ]   ⋄     ∂ z         [    r   0    ]   ⋄     r       )      (39)    [  Δ     L   ˜     01    ]   ⋄   = (       ∂   [  Δ u  ]   ⋄     ∂ r       ∂   [  Δ u  ]   ⋄     ∂ z     0       ∂   [  Δ v  ]   ⋄     ∂ r       ∂   [  Δ v  ]   ⋄     ∂ z     0     r   ∂   [  Δ θ  ]   ⋄     ∂ r     r   ∂   [  Δ θ  ]   ⋄     ∂ z         [  Δ u  ]   ⋄     r       ) ,      (40)    [    Ξ   0    ]   ⋄   = (     0   0   −   [    ϕ   0    ]   ⋄       0   0   0       [    ϕ   0    ]   ⋄     0   0     ) ,   and  (41)    [  Δ Ξ  ]   ⋄   = (     0   0   −   [  Δ θ  ]   ⋄       0   0   0       [  Δ θ  ]   ⋄     0   0     ) .   Here, it is crucial to keep in mind that the tensors with index ‘01’ are derivatives with respect to the current configuration. Then, the sensitivity of the velocity gradient,   [  L  ]   ⋄   in Eq. (14), can be written as  (42)    [  L  ]   ⋄   =   [      L   ˜     01    ]   ⋄   +   [    Ξ   0    ]   ⋄   − F   ∂ V   ∂ x   +   [  Δ     L   ˜     01    ]   ⋄   +   [  Δ Ξ  ]   ⋄   .   In Eq. (42), the first three terms on the right-hand side are known at the increment start once the boundary value problem is solved, whereas the last two terms contain the sensitivity of the displacement increments which remain to be determined. Likewise, the terms in Eq. (33) containing the sensitivity of the deformation gradient increment require the determination of  (43)    [  Δ F  ]   ⋄   Δ   F   − 1   =   [  L  ]   ⋄   − Δ F   [    F   0    ]   ⋄     F   − 1   .   Here, the second term on the right-hand side of Eq. (43) contains sensitivities of the increment start and is independent on the unknown sensitivities of the displacement increment. The second term uses the sensitivity of the deformation gradient at increment start,   [    F   0    ]   ⋄   , calculated as  (44)    [    F   0    ]   ⋄   =   [      L   ˜     00    ]   ⋄      F   0   +   [    Ξ   0    ]   ⋄      F   0   −   F   0     ∂ V   ∂ X   ,   with  (45)    [      L   ˜     00    ]   ⋄   = (       ∂   [    r   0    ]   ⋄     ∂   r   0         ∂   [    r   0    ]   ⋄     ∂   z   0       0       ∂   [    z   0    ]   ⋄     ∂   r   0         ∂   [    z   0    ]   ⋄     ∂   z   0       0       r   0     ∂   [    ϕ   0    ]   ⋄     ∂   r   0         r   0     ∂   [    ϕ   0    ]   ⋄     ∂   z   0           [    r   0    ]   ⋄       r   0         ) .   With the absence of body forces and contact loads, splitting up between known sensitivities and unknown sensitivity increments, and using the consistent tangent operator D with components  (46)    D   ijkl   =     C   ¯     ijkl   −   σ   il     δ   jk   +   σ   ij     δ   kl     and the fourth order tensors   A   ¯   and   B   ¯   defined as  (47)    A   ijkl   =   σ   jk     δ   il   −   σ   il     δ   jk     and  (48)    B   ijkl   =   δ   il     σ   jk   ,   Eq. (27) can be transformed into a linear equation for the determination of the sensitivity increments  (49)    ∫   v   δ   L   ˜   : D :   [  Δ     L   ˜     01    ]   ⋄    dv +   ∫   v   δ   L   ˜   :   C   ¯   :   [  Δ Ξ  ]   ⋄    dv +   ∫   v   δ r (    σ   31     ∂   [  Δ θ  ]   ⋄     ∂ r   +   σ   32     ∂   [  Δ θ  ]   ⋄     ∂ z    )  dv +   ∫   v   (    σ   31     ∂ δ θ   ∂ r   +   σ   32     ∂ δ θ   ∂ z    )   [  Δ u  ]   ⋄    dv +   ∫   v   (  δ   L   ˜   : A + δ Ξ : B  ) :   [  Δ Ξ  ]   ⋄    dv +   ∫   v   δ   L   ˜   : D :   [      L   ˜     01    ]   ⋄    dv +   ∫   v   δ   L   ˜   :   C   ¯   : (    [    Ξ   0    ]   ⋄   − F   ∂ V   ∂ x    )  dv +   ∫   v   δ u (    σ   31     ∂   [    ϕ   0    ]   ⋄     ∂ r   +   σ   32     ∂   [    ϕ   0    ]   ⋄     ∂ z    )  dv +   ∫   v   (    σ   31     ∂ δ θ   ∂ r   +   σ   32     ∂ δ θ   ∂ z    )   [    r   0    ]   ⋄    dv +   ∫   v   (  δ   L   ˜   : A + δ Ξ : B  ) :   [    Ξ   0    ]   ⋄    dv = 0 .   The first five integrals in Eq. (49) constitute the consistent stiffness matrix with the unknown sensitivity increments, whereas the last five integrals make up the so-called pseudo-load vector.  With the axisymmetric solid being discretized using N  e solid elements with shape functions N  A , the coordinates and their variations, increments and sensitivities being interpolated as  (50)  α =   N   A     α   A   ,  α ∈ { x ,   u   x   , Δ   u   x   , δ   u   x   ,   [  x  ]   ⋄   ,   [    x   0    ]   ⋄   ,   [  Δ   u   x    ]   ⋄   } ,   where a summation is performed over the index ‘A’, i.e. the number of nodes in an element, and x and u  x stand for the coordinates r, z, ϕ and the displacements u ,v, θ, respectively. With the second order tensor P, defined as  (51)  P = (     0   0   − 1     0   0   0     1   0   0     ) ,   the variation δ Ξ can be written as  (52)  δ Ξ = P   N   A   δ   θ   A   .   With the following auxiliary tensors  (53)    C   ˜   =   C   ¯   : P   and  (54)    A   ˜   =   A   ¯   : P   and with the scalar   B   ˜   defined as  (55)    B   ˜   = P :   B   ¯   : P ,   Eq. (49) can be expressed as a summation over the integrals over elements with elemental volume v  e    (56)     ∑     N   e        ∫     v   e     δ   L   ˜   : D :   [  Δ     L   ˜     01    ]   ⋄      dv   e   +    ∑     N   e        ∫     v   e     δ   L   ˜   : (    C   ˜   +   A   ˜    )   N   B      dv   e     [  Δ   θ   B    ]   ⋄   + δ   u   A      ∑     N   e        ∫     v   e       N   A   (    σ   31     ∂   N   B     ∂ r   +   σ   32     ∂   N   B     ∂ z    )    dv   e     [  Δ   θ   B    ]   ⋄   + δ   θ   A      ∑     N   e        ∫     v   e     (    σ   31     ∂   N   A     ∂ r   +   σ   32     ∂   N   A     ∂ z    )   N   B      dv   e     [  Δ   u   B    ]   ⋄   + δ   θ   A      ∑     N   e        ∫     v   e       N   A     B   ˜     N   B      dv   e     [  Δ   θ   B    ]   ⋄   +    ∑     N   e        ∫     v   e     δ   L   ˜   : (  D :   [      L   ˜     01    ]   ⋄   + (    C   ˜   +   A   ˜    )   N   B     [    ϕ   0 , B    ]   ⋄   −   C   ¯   : (  F   ∂ V   ∂ x    )  )    dv   e   + δ   u   A      ∑     N   e        ∫     v   e       N   A   (    σ   31     ∂   N   B     ∂ r   +   σ   32     ∂   N   B     ∂ z    )   [    ϕ   0 , B    ]   ⋄      dv   e   + δ   θ   A      ∑     N   e        ∫     v   e     (    σ   31     ∂   N   A     ∂ r   +   σ   32     ∂   N   A     ∂ z    )   N   B     [    r   0 , B    ]   ⋄      dv   e   + δ   θ   A      ∑     N   e        ∫     v   e       N   A     B   ˜     N   B     [    ϕ   B , B    ]   ⋄      dv   e   = 0 .   With the vectors  (57)  δ x = (    N   A   δ   u   A   ,   N   A   δ   v   A   ,   N   A   δ   θ   A    ) ,      (58)    [  Δ x  ]   ⋄   = (    N   A     [    u   A    ]   ⋄   ,   N   A     [    v   A    ]   ⋄   ,   N   A     [    θ   A    ]   ⋄    )   and  (59)    ∂   N   A     ∂ x   = (    ∂   N   A     ∂ r   ,   ∂   N   A     ∂ z   , 0  ) ,   together with the matrices  (60)  h = (     1   0   0     0   1   0     0   0   r     ) ,   and  (61)      L   ¯     A   = (     0   0   0     0   0   0     0   0       N   A     r       ) ,   the variations in Eq. (6) and the sensitivities in (39) can be rewritten as  (62)  δ     L   ˜     ij   = δ   x   k   A     h   ki     ∂   N   A     ∂   x   j     +     L   ¯     ij   A    δ   u   A     and  (63)    [  Δ     L   ˜     ij   01    ]   ⋄   =   [  Δ   x   k   B    ]   ⋄     h   ki     ∂   N   B     ∂   x   j     +     L   ¯     ij   B     [  Δ   u   B    ]   ⋄   .   With Eqs. (57)–(63), Eq. (56) can be written as  (64)  δ   x   p   A      ∑     N   e        ∫     v   e       h   pi     ∂   N   A     ∂   x   j        D   ijkl      h   qk     ∂   N   B     ∂   x   l        dv   e     [  Δ   x   q   B    ]   ⋄   + δ   x   p   A      ∑     N   e        ∫     v   e       h   pi     ∂   N   A     ∂   x   j        D   ij 33       N   B     r      dv   e     [  Δ   u   B    ]   ⋄   + δ   u   A      ∑     N   e        ∫     v   e         N   A     r     D   33 kl      h   qk     ∂   N   B     ∂   x   l        dv   e     [  Δ   x   q   B    ]   ⋄   + δ   u   A      ∑     N   e        ∫     v   e         N   A     r     D   3333       N   B     r      dv   e     [  Δ   u   B    ]   ⋄   + δ   x   p   A      ∑     N   e        ∫     v   e       h   pi     ∂   N   A     ∂   x   j     (      C   ˜     ij   +     A   ˜     ij    )   N   B      dv   e     [  Δ   θ   B    ]   ⋄   + δ   u   A      ∑     N   e        ∫     v   e       N   A   (        C   ˜     33   +     A   ˜     33     r     N   B   +   σ   3 i     ∂   N   B     ∂   x   i      )    dv   e     [  Δ   θ   B    ]   ⋄   + δ   θ   A      ∑     N   e        ∫     v   e       σ   3 i     ∂   N   A     ∂   x   i       N   B      dv   e     [  Δ   u   B    ]   ⋄   + δ   θ   A      ∑     N   e        ∫     v   e       N   A     B   ˜     N   B      dv   e     [  Δ   θ   B    ]   ⋄   . + δ   x   p   A      ∑     N   e        ∫     v   e       h   pi     ∂   N   A     ∂   x   j     (    D   ijkl     [      L   ˜     kl   01    ]   ⋄   + (      C   ˜     ij   +     A   ˜     ij    )   N   B     [    ϕ   0 , B    ]   ⋄   −     C   ¯     ijkl   (    F   kq     ∂   V   q     ∂   x   l      )  )    dv   e   + δ   u   A      ∑     N   e        ∫     v   e         N   A     r   (    D   33 kl     [      L   ˜     kl   01    ]   ⋄   + (  (      C   ˜     33   +     A   ˜     33    )   N   B   + r    σ   3 i     ∂   N   B     ∂   x   i      )   [    ϕ   0 , B    ]   ⋄   −     C   ¯     33 kl   (    F   kq     ∂   V   q     ∂   x   l      )  )    dv   e   + δ   θ   A      ∑     N   e        ∫     v   e     (    σ   3 i     ∂   N   A     ∂   x   i       [    r   0 , B    ]   ⋄   +   N   A     B   ˜     [    ϕ   0 , B    ]   ⋄    )   N   B      dv   e   = 0 .   The first eight integrals in Eq. (64) yield the components of the elemental stiffness matrix relative to nodes A and B as  (65)    K   pq   e , AB   =   ∫     v   e       h   pi     ∂   N   A     ∂   x   j        D   ijkl      h   qk     ∂   N   B     ∂   x   l        dv   e   +   ∫     v   e       h   pi     ∂   N   A     ∂   x   j        D   ij 33       N   B     r     δ   1 q      dv   e   +   ∫     v   e       δ   1 p       N   A     r     D   33 kl      h   qk     ∂   N   B     ∂   x   l        dv   e   +   ∫     v   e       δ   1 p       N   A     r     D   3333       N   B     r     δ   1 q      dv   e   +   ∫     v   e       h   pi     ∂   N   A     ∂   x   j     (      C   ˜     ij   +     A   ˜     ij    )   N   B     δ   3 q      dv   e   +   ∫     v   e       δ   1 p     N   A   (        C   ˜     33   +     A   ˜     33     r     N   B   +   σ   3 i     ∂   N   B     ∂   x   i      )   δ   3 q      dv   e   +   ∫     v   e       δ   3 p     σ   3 i     ∂   N   A     ∂   x   i       N   B     δ   1 q      dv   e   +   ∫     v   e       δ   3 p     N   A     B   ˜     N   B     δ   3 q      dv   e   .   Likewise, the last three integrals in Eq. (64), which make up the pseudo-load vector, yield the components of the elemental pseudo-load vector of node A as  (66)    f   p   A   =   ∫     v   e       h   pi     ∂   N   A     ∂   x   j     (    D   ijkl     [      L   ˜     kl   01    ]   ⋄   + (      C   ˜     ij   +     A   ˜     ij    )   N   B     [    ϕ   0 , B    ]   ⋄   −     C   ¯     ijkl   (    F   kq     ∂   V   q     ∂   x   l      )  )    dv   e   +   ∫     v   e       δ   1 p       N   A     r   (    D   33 kl     [      L   ˜     kl   01    ]   ⋄   + (  (      C   ˜     33   +     A   ˜     33    )   N   B   + r    σ   3 i     ∂   N   B     ∂   x   i      )   [    ϕ   0 , B    ]   ⋄   −     C   ¯     33 kl   (    F   kq     ∂   V   q     ∂   x   l      )  )    dv   e   +   ∫     v   e       δ   3 p   (    σ   3 i     ∂   N   A     ∂   x   i       [    r   0 , B    ]   ⋄   +   N   A     B   ˜     [    ϕ   0 , B    ]   ⋄    )   N   B      dv   e   .      Generally speaking, in the direct differentiation method, the sensitivities are calculated after the solution of the time increment of the boundary value problem by the finite element method, once the geometry and state variables both at increment start and increment end are known. The sensitivities at increment start are known, either they are zero (or equal to the shape velocity for the current geometry) at the start of the first time increment, or known from the solution of the previous time increment. In the direct differentiation method, each increment of the finite element model is treated in three stages:  1. Calculation of pseudo-load vector from Eq. (66) and, depending on the linearization used for the solution of the boundary value problem, retrieval or calculation of the consistent stiffness matrix according to Eq. (65).  Solution of the discretized system of linear equations, which results from Eq. (64), for each shape parameter to obtain the unknown sensitivities of the displacement increment.  Update of the sensitivities: backsubstitution of the displacement increment sensitivities to obtain the updated sensitivities of current geometry, x, and state variables, here only b, at the end of the increment.  After implementing the equations developed in Section 2.6 into a finite element program, it is of crucial importance to assess both the correctness and accuracy of the calculated sensitivities. Because in general, no test cases with analytical sensitivity results which represent load cases with sufficient complexity are available, the validation of the shape sensitivities, computed here by direct differentiation, has to be performed by comparison against results obtained by the finite difference method. It is important to keep in mind that the sensitivities obtained by finite differences may be severely affected by the applied perturbation size, and that numerical round-off errors may lead to outright wrong results. For this reason, any comparison between the sensitivities obtained by both methods yields a relative or absolute difference, but one cannot conclude straight away from a large difference in results that the sensitivities of the direct differentiation method are wrong, as would be the case with a comparison against analytical results.  For the validation of the shape sensitivities, it is sufficient to consider rather trivial shape changes involving single boundary nodes instead of shape parameters of parametrized shape boundaries, which in fact comes down to prescribing simultaneous shape changes to a larger number of boundary nodes. However, it is not sufficient to apply the finite difference method to two consecutive finite element models where the location of a single specific boundary has been perturbed. In fact, the definition of the sensitivity, Eq. (10), has to be applied, and the velocity field resulting from the perturbed boundary node has to be used for modifying all the affected nodes within the solid. Then, the sensitivity of a generic variable α is approximated by the finite difference method as  (67)    [  α  ]   ⋄   ≈   α (    X   r   + Δ τ V (    X   r    )  ) − α (    X   r    )   Δ τ   .   In the following first example, the shape change is introduced by modifying the coordinates of single nodes, whereas in the second, more complex example, a segment-wise linear interpolation of specific parts of the boundary by a small number of boundary nodes is performed. Thus, in both cases, the shape parameters are the coordinates of specific boundary nodes. As a consequence, the perturbation size for the finite difference method, Δ τ , is determined by machine precision, γ , the magnitude of the respective reference coordinate of the boundary node with respect to which the sensitivity is calculated, i.e. either R  r or Z  r , and a scaling factor, p, used for reducing the impact of numerical noise  (68)  Δ τ = p  γ  | α | ,  α ∈ {    R   r   ,   Z   r    } .      There is another very important issue in the validation of the sensitivity calculation by the comparison between finite difference and direct differentiation results. In the calculation of the pseudo-load vector and the consistent stiffness matrix, the sensitivity of the deformation gradient has to be calculated using Eq. (12). Likewise, all variables calculated from this sensitivity, like the sensitivity of the deformation tensor or of the stress rely on the definition of Eq. (12). However, the true sensitivities, computed in the update step, and to be compared to the finite difference results, require their calculation based on a sensitivity of the deformation without the second term on the right-hand side of Eq. (12), i.e. the term stemming from the rotation of the basis. For example, the sensitivity of the deformation gradient has to be compared using  (69)    F (    X   r   + Δ τ V (    X   r    )  ) − F (    X   r    )   Δ τ   ≈   [    L   ˜    ]   ⋄    F − F   ∂ V   ∂ X   .   In elasticity, the deformation tensor and its sensitivity can be calculated directly from the deformation gradient and its sensitivity using Eqs. (29) and (30), respectively. In this case, the calculation of the sensitivities with or without the second term in Eq. (12) stemming from the basis rotation, to be used for the calculation of the pseudo-load vector or the true sensitivities after the sensitivity update step, respectively, is trivial. However, if the deformation tensor is defined in an incremental way using Eq. (32), and subsequently also its sensitivity in Eq. (33), which is not necessary in elasticity but unavoidable in inelasticity, an important change in variable storage is required. In fact, for the calculation of the pseudo-load vector, the term   [  Ξ  ]   ⋄   F is required for the calculation of the sensitivities of the deformation tensor and the stress tensor, whereas in the update step, the sensitivity of the deformation tensor without this term is required, for example for calculating the stress sensitivity. Therefore, both versions of the sensitivity of the state variable b have to be stored and transferred between time increments.  A very simple finite element model has been used for a basic validation of the implementation of the direct differentiation method for axisymmetry with superposed torsion. The validation itself has been performed by comparing the sensitivities of the stress components with respect to the in-plane coordinates of several boundary nodes, calculated by the direct differentiation method (DD) to those obtained by the finite difference method (FD) with a perturbation scaling factor p =   10   2   . To this avail, the average magnitude of the difference in the results obtained by both methods is calculated over all integration points in the model, i.e.  (70)      E   ¯     α β   =   1     N   el     N   ip       ∑   i = 1     N   el       ∑   j = 1     N   ip     |      [   σ   α β   i , j   ]    ⋄     FD       [   σ   α β   i , j   ]    ⋄     DD     − 1  | ,  ∀ α β ∈ {  rr , zz , θ θ , rz , z θ , r θ  } .   The finite element model consists of an axisymmetric model of a slanted bloc. The finite element model is depicted in Fig. 1 . The bloc has a constant height of 8mm, whereas the width changes from 10 to 11mm in vertical direction. It contains   N   el   = 2 × 5 = 10 linear displacement-based elements with   N   ip   = 4 integration points, resulting in 18 nodes. The material behavior considered is finite strain elasticity with Young׳s modulus of E = 175  000  MPa and a Poisson ratio of ν = 0.3 . Two load cases are considered, one in displacement control and one in load control with the intent of producing inhomogeneous stress fields.  In displacement control, a vertical displacement of   u   z   = 3  mm is applied to node 13 and a tangential displacement of   u   θ   = 0.1  rad is applied to node 18. In load control, a vertical point load of   F   z   = 100  000  N is applied to node 13 and a torsional moment of   F   θ   = 10  000  N  mm is applied to node 18. The sensitivities are calculated with respect to both in-plane components of the nodal positions of nodes 6, 12, 15 and 18, whose locations are given in Fig. 1.  The results of the average difference between the sensitivities of DD and FD with respect to the nodal positions, as defined in Eq. (70), are given in Table 1 for displacement control and in Table 2 for load control. It can be observed that the relative difference between both methods is very small, i.e. in general below   10   − 2   % , which leads to the conclusion that the sensitivities of the stress components calculated by the direct differentiation method are very accurate. In fact, differences below 0.01% can be considered as numerical noise. In case higher differences are found, it is worthwhile taking into account that both an inappropriate magnitude of the perturbation and values close to zero may lead to very large differences, in order to avoid mistaking numerical round-off issues for an implementation error.  In dental prosthetics, the replacement of a tooth by a prosthesis is performed in two stages. In a first stage, an implant is inserted into the jawbone. As the implant does not protrude out of the jawbone, it is only subjected to small loads, which is beneficial to the growth of bone cells around it. Once the implant has been sufficiently fixed to jawbone by growing bone cells, a crown is fitted onto the implant by means of an abutment. More precisely, the abutment is screwed to the implant and the crown is glued onto the abutment. In general, implant, abutment and screw are made of titanium. However, for the prosthesis of front teeth, one can observe a trend towards abutments made of zirconia ceramics, which are white, for purely aesthetic reasons. This comes with a major drawback, because ceramic materials are inherently brittle, and very specific design rules have to be applied. In this example, a shape sensitivity analysis is performed using a finite element model of the abutment shown in Fig. 2 . This sensitivity analysis may then for example be used in shape optimization using gradient-based optimization algorithms.  The finite element model of the ceramic abutment consists of 2175 four-noded displacement-based axisymmetric elements which include torsion. The abutment has neohookean elastic behavior, with Young׳s modulus of E = 200  GPa and Poisson׳s ratio of ν = 0.25 . The finite element model is constrained in tangential and vertical direction on the line AB, which corresponds to the abutment/implant interface. The analyzed load case corresponds to the fixed implant without mastication loads, i.e. a torque applied to surface CD which is the abutment/screw interface. The torque of T = 250  N  mm of the screw induces a compressive load of F = 1000  N . Both the vertical load and the torque are applied as surface loads on the surface CD. The inner surface of the abutment is represented by a segment-wise linear interpolation using the nodes at locations U, C, D and V in Fig. 2, where U and V are remaining fixed. A part of the outer surface is interpolated using locations A, B and W, with fixed A and W. The shape sensitivities are calculated with respect to the vertical shape change of points C and D, as well as the horizontal and vertical displacement of point B. Like in the previous example, the relative difference between the sensitivities computed by direct differentiation and finite differences according to Eq. (70) is used as a global indicator for assessing the quality of the sensitivities. The finite difference sensitivity analysis uses a perturbation scaling factor p =   10   1   . In Table 3 , the average global relative difference is shown for all six stress components. One can see that most values are well below 0.01%, which indicates that the sensitivities are very accurate.   CONCLUSIONS   A shape sensitivity analysis based on the direct differentiation method has been developed in this article for axisymmetry including torsion in finite strains. It has been shown that the obtained sensitivities are highly accurate and the method is suitable for use in gradient-based shape optimization of axisymmetric structures subjected to torsional loading. Thus, the main advantage of this type of axisymmetric analysis in comparison to fully three-dimensional finite element model, which is a highly reduced number of degrees of freedom, can help to considerably reduce the computational effort required in shape optimization of this type of mechanical problems.   ACKNOWLEDGMENTS   This project has been funded by the Fonds National de la Recherche of the Grand Duchy of Luxembourg under Grant number C10/MS/783981/MOLBIER.   REFERENCES", "highlights": "The shape sensitivity analysis using the direct differentiation method is developed for the case of axisymmetry with superposed torsion in the framework of finite strains and elastic material behavior. The accuracy of this method is compared to results obtained by the finite difference method in two simple examples."}