{"id": "S0168874X14002017", "article": "MAIN-TITLE Free vibration analysis for shells of revolution based on p-version mixed finite element formulation   HIGHLIGHTS          We present a new p-version mixed finite element for free vibration analysis of shells of revolution.      The introduction of hierarchical high-order displacement functions and field-consistent stress parameters yield locking-free and accurate numerical results.      The loss of accuracy due to Guyan reduction in formulating the present mixed finite element is not observed.      The element having the cubic displacement functions and quadratic stress resultant functions shows the most efficient performance.          KEYPHRASES   Shells of revolution  Free vibration analysis     p-Version mixed finite element  Hierarchical shape functions   Shells of revolution have been widely used in pressure vessels, cooling towers, bioengineering applications, aerospace structures and nuclear reactors, and span all branches of engineering because their double curvature has a significant effect on the behavior of a structure in carrying load. At the same time, it introduces complexity into the formulation and numerical calculation. Thus it has been a challenging subject to find satisfactory solutions for shells of revolution with any kind of boundary condition, as can be evidenced from a great number of literatures [1,2].  Besides analytical methods [3–5], many numerical studies such as the differential quadrature method [6,7], the boundary element method [8], the Ritz method[9], the strip method [10], and finite element methods [11–29] have been proposed. Among these different methods, the finite element method is recognized as the most versatile approach. Grafton and Strome [11] firstly proposed the element modeled as a straight-sided conical frustrum and extended to the case of non-axisymmetric loads. This harmonic axisymmetric shell element has one major advantage that the uncoupled circumferential harmonics make the analysis be performed independently for each harmonic.  The conventional low-order displacement-based finite element models have poor convergence and accuracy in predicting the stress field due to shear and membrane locking phenomena [12–15]. To overcome these problems, many techniques such as the selective/reduced integration finite element [16,17], the field-consistent element [15], the spline finite element [18–21], and the mixed finite element [22–24] have been proposed. The mixed finite elements based on multi-field variational principles can provide better convergence rates and accuracy in the stresses than the conventional displacement-based element. However, the mixed finite element having low-order interpolation functions in displacement field and inappropriate stress parameters still does not have sufficiently satisfactory numerical performance [22,23]. Another alternative strategy for avoiding locking phenomena is to use high-order p-version methods [25,26]. Chapell and Bathe [27] show that these p-version elements are free from locking in the displacement field and energy-norm for general shells, but not excused from locking in the stress field.  In this study, we propose a new two-node p-version mixed finite element for free vibration analysis of shells of revolution. The present element is based on the first-order Reissner–Mindlin shear deformation shell theory and the Hellinger–Reissner variational principle. The high-order nodeless hierarchical shape functions in the displacement field are introduced to enhance the accuracy in the prediction of higher vibration modes. The parameters for eight stress resultant variables, which are selected to be field-consistent to five displacement variables, can make possible to develop an element alleviating numerical difficulties such as shear and membrane locking, typical in the limits of shearless deformation and inextensional pure bending deformation. All field variables in the formulation are expanded into Fourier series with respect to the circumferential coordinate, and the initial two-dimensional problem is transformed into a series of independent one-dimensional problems. The stress parameters and the introduced nodelss degrees in the displacement field are sequentially removed in the final stages of element formulation through the functional stationarity and Guyan reduction, respectively.  The numerical performance of the present mixed element is evaluated in several examples. These numerical tests for comparison to available solutions in the literatures show that the present element has satisfactory convergence and accuracy in the free vibration analysis for shells of revolution.  The r, θ, and z -coordinate system in an element of a shell of revolution is shown in Fig. 1. The meridional radius of curvature is defined by   r   1   = d s / d φ and the arc length along the meridian is depicted by s. The positive normal direction ζ is outward while the center of curvature of the meridian is on the inside. The meridional, circumferential and normal displacements in the s, θ and ζ directions are expressed by U, V and W, respectively.  By assuming that the meridional and circumferential displacements vary linearly across the shell thickness, while the normal displacement is constant, these displacements are represented in the following form of the generalized displacement components for an arbitrary point at location ( z ,  θ ,  0 ) :  (1)  U =  {      U ( z , θ , ζ )       V ( z , θ , ζ )       W ( z , θ , ζ )      }  =  [     ζ   0   1   0   0     0   ζ   0   1   0     0   0   0   0   1     ]   {        β   s           β   θ        u     v     w     }  = TD   where u, v, w are the translation on the mid-surface along the meridional, circumferential, and normal directions, respectively, and   β   s   ,   β   θ   are the rotations of the normal to the mid-surface along meridional and circumferential directions, respectively.  The relationship between strains and displacements in the interior of the domain can be stated as  (2)  ε =  {        ε   s           ε   θ           ε   s θ           κ   s           κ   θ           κ   s θ           γ   s           γ   θ        }  =  [     0   0     ∂  ∂ s      0     1    r   1          0   0      cos  ϕ  r       1 r   ∂  ∂ θ         sin  ϕ  r       0   0     1 r   ∂  ∂ θ        ∂  ∂ s       −   cos  ϕ  r         ∂  ∂ s      0   0   0   0        cos  ϕ  r       1 r   ∂  ∂ θ      0   0   0       1  2 r    ∂  ∂ θ   −   cos  ϕ   2 r        1 2   ∂  ∂ s      0   0   0     1   0     1    r   1        0    −  ∂  ∂ s        0   1   0    −   sin  ϕ  r       1 r   ∂  ∂ θ        ]   {        β   s           β   θ        u     v     w     }  = Δ D   where ε  s , ε  θ , ε  sθ =ε  θs are three in-plane strains;   κ   s   ,   κ   θ   ,   κ   s θ   =   κ   θ s   are two curvature changes and twisting strain; and γ  s , γ  θ are two transverse shear strains. In the present formulation, symmetric mixed strain components are preserved as approximately equivalent [6]. The relationship between stress resultants shown in Fig. 2 and strains for linearly elastic isotropic material are defined by  (3)  σ =  {        N   s           N   θ           N   s θ           M   s           M   θ           M   s θ           Q   s           Q   θ        }  =  [        E   1         E   2      0   0   0   0   0   0        E   2         E   1      0   0   0   0   0   0     0   0      E   3      0   0   0   0   0     0   0   0      E   4         E   5      0   0   0     0   0   0      E   5         E   4      0   0   0     0   0   0   0   0      E   6      0   0     0   0   0   0   0   0      E   7      0     0   0   0   0   0   0   0      E   7        ]   {        ε   s           ε   θ           ε   s θ           κ   s           κ   θ           κ   s θ           γ   s           γ   θ        }  = E ε =   C   − 1   ε   where E, ν and t are the elastic modulus, Poisson׳s ratio and shell thickness, respectively, and   E   1   = E t / [ 2 ( 1 −   ν  2  ) ] ,   E   2   = ν   E   1   ,   E   3   = ( 1 − ν )   E   1   / 2 ,   E   4   = E   t  3  / [ 12 ( 1 − ν ) ] ,   E   5   = ν   E   4   ,   E   6   = ( 1 − ν )   E   4   / 2 ,   E   7   =   k   s     E   3   . The transverse shear factor is denoted by   k   s   .  Assuming a time-harmonic motion with the natural angular frequency ω, Hamilton׳s principle for shells of revolution [30] can be written as  (4)  δ   Π   R   = δ  {   ∫ 0  2 π     [   ∫    s   1       s   2        L   R    d s −  1 2  ρ   ω  2   ∫    s   1       s   2       ∫  − t / 2   t / 2      U  T  U  d ζ r  d s     ]  d θ   }  = 0   where ρ is the mass density, and the energy density L  R is depicted as  (5)    L   R   =   σ  T  ε − ∫    ε  T   d σ  =   σ  T  ε −   1 2     σ  T    C  T  σ   The vectors of stress resultants, strains and displacements vectors in Eqs. (1) and (4) are written in terms of a partial harmonic Fourier series expansion with respect to the circumferential coordinate θ as  (6a)  σ =  {        N   s           N   θ           N   s θ           M   s           M   θ           M   s θ           Q   s           Q   θ        }  =  ∑  n = 0  ∞   {        N   s   ( n )    cos  n θ         N   θ   ( n )    cos  n θ         N   s θ   ( n )    sin  n θ         M   s   ( n )    cos  n θ         M   θ   ( n )    cos  n θ         M   s θ   ( n )    sin  n θ         Q   s   ( n )    cos  n θ         Q   θ   ( n )    sin  n θ      }       (6b)  ε =  {        ε   s           ε   θ           ε   s θ           κ   s           κ   θ           κ   s θ           γ   s           γ   θ        }  =  ∑  n = 0  ∞   {        ε   s   ( n )    cos  n θ         ε   θ   ( n )    cos  n θ         ε   s θ   ( n )    sin  n θ         κ   s   ( n )    cos  n θ         κ   θ   ( n )    cos  n θ         κ   s θ   ( n )    sin  n θ         γ   s   ( n )    cos  n θ         γ   θ   ( n )    sin  n θ      }       (6c)  D =  {        β   s           β   θ        u     v     w     }  =  ∑  n = 0  ∞   {        β   s   ( n )    cos  n θ         β   θ   ( n )    sin  n θ         u   ( n )    cos  n θ         v   ( n )    sin  n θ         w   ( n )    cos  n θ      }       By substituting Eq. (6) into Eq. (4) and integrating δ    Π   R   over θ , the Hellinger–Reissner functional and the kinetic energy for the nth circumferential harmonic number take the final form as  (7)  δ   Π   R   ( n )   = δ  {  k π  [   ∫    s   1       s   2        L   R   ( n )    d s −  1 2  ρ   ω  2   ∫    s   1       s   2       ∫  − t / 2   t / 2      D   ( n ) t     T  t  T   D   ( n )    d ζ r  d s     ]   }  = 0   where k=2 for n=0, k=1 for n>1, and the energy density   L   R   ( n )   is given as  (8)    L   R   ( n )   =   σ   ( n ) T     ε   ( n )   −   1 2     σ   ( n ) T     C  T    σ   ( n )        The displacements   D   ( n )   =   {   β   s   ( n )   ,   β   θ   ( n )   ,   u   ( n )   ,   v   ( n )   ,   w   ( n )   }  t  in Eq. (6c) within an element are interpolated introducing the high-order hierarchical shape function such as   ξ  m  ( 1 − ξ ) in addition to the following typical C 0-continutity Lagrangian polynomials:  (9)    β   s   ( n )   = ( 1 − ξ )   β   s 1   ( n )   + ξ   β   s 2   ( n )   +  ∑  k = 1  m     ξ  k  ( 1 − ξ )   a   k   ( n )      β   θ   ( n )   = ( 1 − ξ )   β   θ 1   ( n )   + ξ   β   θ 2   ( n )   +  ∑  k = 1  m     ξ  k  ( 1 − ξ )   b   k   ( n )      u   ( n )   = ( 1 − ξ )   u   1   ( n )   + ξ   u   2   ( n )   +  ∑  k = 1  m     ξ  k  ( 1 − ξ )   c   k   ( n )      v   ( n )   = ( 1 − ξ )   v   1   ( n )   + ξ   v   2   ( n )   +  ∑  k = 1  m     ξ  k  ( 1 − ξ )   d   k   ( n )      w   ( n )   = ( 1 − ξ )   w   1   ( n )   + ξ   w   2   ( n )   +  ∑  k = 1  m     ξ  k  ( 1 − ξ )   e   k   ( n )      The above five displacements can be written in the vector form as  (10)    D   ( n )   = [   N   c   :   N   h   ]  {        d   c   ( n )           d   h   ( n )        }  = N   d   ( n )     where   d   c   ( n )   and   d   b   ( n )   are the typical nodal degrees of freedom and the nodeless degrees of freedom without an obvious physical meaning for the nth circumferential harmonic number, respectively, and have the following vector form:  (11a)    d   c   ( n )   =   {   β   s 1   ( n )   ,   β   θ 1   ( n )   ,   u   1   ( n )   ,   v   1   ( n )   ,   w   1   ( n )   ,   β   s 2   ( n )   ,   β   θ 2   ( n )   ,   u   2   ( n )   ,   v   2   ( n )   ,   w   2   ( n )   }  T       (11b)    d   h   ( n )   =   {   a   1   ( n )   ,   b   1   ( n )   ,   c   1   ( n )   ,   d   1   ( n )   ,   e   1   ( n )   , … ,   a   m   ( n )   ,   b   m   ( n )   ,   c   m   ( n )   ,   d   m   ( n )   ,   e   m   ( n )   }  T    The dimensionless parameter ξ varies from 0 to 1 in an element and the Jacobian | J | is defined as  (12)  d s =     ( d r / d ξ )  2  +   ( d z / d ξ )  2     d ξ =  | J |  d ξ      To determine appropriate locking-free functions for stress resultants, the limiting behavior of membrane and shear strains should be considered [15]. In limits of inextensional bending behavior and extremely thin shell, the corresponding shear and membrane strains disappear as  (13)    γ   s   ( n )   =  (    β   s 1   ( n )   +     w   1   ( n )   −   w   2   ( n )   −   e   1   ( n )     |  J |    )  +  (    β   s 2   ( n )   −   β   s 1   ( n )   +   a   1   ( n )   +   2   e   1   ( n )   − 2   e   2   ( n )     |  J |    )  ξ + ⋯ +  (    a   m   ( n )   −   a   m − 1   ( n )   +   ( m + 1 )   e   m   ( n )     |  J |    )    ξ  m  −   a   m   ( n )     ξ   m + 1   → 0      (14)    ε   s   ( n )   =  (      u   2   ( n )   −   u   1   ( n )   +   c   1   ( n )     |  J |   −     w   1   ( n )       r   1      )  +  (    2   c   2   ( n )   − 2   c   1   ( n )     |  J |   +     w   2   ( n )   −   w   1   ( n )   +   e   1   ( n )       r   1      )  ξ + ⋯ +  (      e   m   ( n )   −   e   m − 1   ( n )       r   1     −   ( m + 1 )   c   m   ( n )     |  J |    )    ξ  m  −     e   m   ( n )       r   1       ξ   m + 1   → 0   In Eqs. (13) and (14), the constraints of vanishing   a   m   ( n )   and   e   m   ( n )   , which are known as spurious constraints expressed by (   ∂   m + 1     β   s   ( n )   ) / ( ∂   ξ   m + 1   ) → 0 and (   ∂   m + 1     w   ( n )   ) / ( ∂   ξ   m + 1   ) → 0 , result in shear and membrane locking in addition to serious oscillation in stress resultants over the element. Previous studies [23,24] indicate that improved accuracy is secured in axisymmetric cylindrical shell which may have membrane locking problems, when   ε   θ   is also assumed field-consistent with   ε   s   . This is necessary, as in such problem we demand (   ε   s   + ν   ε   θ   ) = 0 and field-consistency is achieved at this level only if   ε   θ   and related stress resultants have also one order lower functions. Similarly, other stress resultants could be assumed as following field-consistent parameters  (15)    N   s   ( n )   =  ∑  k = 0  m     ξ  k    ψ   k   ( n )    ;    N   θ   ( n )   =  ∑  k = 0  m     ξ  k    ψ   m + k + 1   ( n )    ;    N   s θ   ( n )   =  ∑  k = 0  m     ξ  k    ψ   2 m + k + 2   ( n )      M   s   ( n )   =  ∑  k = 0  m     ξ  k    ψ   3 m + k + 3   ( n )    ;    M   θ   ( n )   =  ∑  k = 0  m     ξ  k    ψ   4 m + k + 4   ( n )    ;    M   s θ   ( n )   =  ∑  k = 0  m     ξ  k    ψ   5 m + k + 5   ( n )      Q   s   ( n )   =  ∑  k = 0  m     ξ  k    ψ   6 m + k + 6   ( n )    ;    Q   θ   ( n )   =  ∑  k = 0  m     ξ  k    ψ   7 m + k + 7   ( n )      and may be put in compact form as  (16)    σ   ( n )   =   {   N   s   ( n )   ,   N   θ   ( n )   ,   N   s θ   ( n )   ,   M   s   ( n )   ,   M   θ   ( n )   ,   M   s θ   ( n )   ,   Q   s   ( n )   ,   Q   θ   ( n )   }  t  = P ( 1 , ξ , … ,   ξ  m  ) ⋅   ψ   ( n )     where   ψ   ( n )   =   {   ψ   0   ,   ψ   2   , … ,   ψ   8 m + 7   }  T  , denoting the vector of stress resultant parameters for the nth harmonic number, are not continuous at the element boundary, and P is the 8 m + 7 matrix.  The substitution of Eqs. (10) and (16) into Eq. (7) yields  (17)    Π   R   ( n )   =   ψ   ( n ) T   G   d   ( n )   −   1 2     ψ   ( n ) T   Ξ   ψ   ( n )   −   1 2     ω  2    d   ( n ) T   Μ   d   ( n )     where  (18)  G = k π  ∫ 0 1   [   P  T  Δ (   N   c   :   N   b   ) ] |  J | d ξ = (   G   c   :   G   h   )       (19)  Ξ = k π  ∫ 0 1     P  T    C  T  P |  J | d ξ       (20)    M   ( n )   = k π  ∫ 0 1    ∫  − t / 2   t / 2    ρ   N  t    T  t  TN d ζ |  J | d ξ        By applying the stationary condition of   Π   R   ( n )   regarding   d   ( n )   and   ψ   ( n )   , respectively, and then substituting the displacements   d   ( n )   for the parameters of stress resultant   ψ   ( n )   , the following equation of motion can be obtained:  (21)   [        K   c c   ( n )         K   c h   ( n )           K   h c   ( n )         K   h h   ( n )        ]   {        d   c   ( n )           d   h   ( n )        }  −   ω  2   [        M   c c   ( n )         M   c h   ( n )           M   h c   ( n )         M   h h   ( n )        ]   {        d   c   ( n )           d   h   ( n )        }  =  {     0     0     }    where the element submatrices   K   i j   ( n )   and   M   i j   ( n )   are defined as  (21)    K   i j   ( n )   =   G   i   T     Ξ   − 1     G   j      (  i  and  j = c , h  )       (22)    M   i j   ( n )   = k π  ∫ 0 1    ∫  − t / 2   t / 2    ρ   N   i   T     T  T  T   N   j    d ζ | J | d ξ     (  i  and  j = c , h  )    When the Guyan reduction is applied to the equation of motion (21), we can express   d   b   ( n )   in terms of   d   c   ( n )      (23)    d   b   ( n )   =   ( I −   ω  2    K   b b   ( n ) − 1     M   b b   ( n )   )   − 1     K   b b   ( n ) − 1   (   ω  2    M   b c   ( n )   −   K   b c   ( n )   )   d   c   ( n )     Then a Taylor series expression of Eq. (23) in   ω  2  yields  (24)    d   b   ( n )   = [ I +   ω  2    K   b b   ( n ) − 1     M   b b   ( n )   +   ω  4    (   K   b b   ( n ) − 1     M   b b   ( n )   )  2  + ⋯ ]   K   b b   ( n ) − 1   (   ω  2    M   b c   ( n )   −   K   b c   ( n )   )   d   c   ( n )     The substitution of Eq. (24) into Eq. (21) and the first-order approximation to neglect higher order terms gives the following reduced eigenvalue problem on the element level:  (25)  [   K   e   ( n )   −   ω  2    M   e   ( n )   ]   d   c   ( n )   = 0   where the condensed element stiffness matrix   K   e   ( n )   and mass matrix   M   e   ( n )   are expressed by  (26)    K   e   ( n )   =   K   c c   ( n )   −   K   c h   ( n )     K   h h   ( n ) − 1     K   h c   ( n )        (27)    M   e   ( n )   =   M   c c   ( n )   +   K   c h   ( n )     K   h h   ( n ) − 1     M   h h   ( n )     K   h h   ( n ) − 1     K   h c   ( n )   −   K   c h   ( n )     K   h h   ( n ) − 1     M   h c   ( n )   −   M   c h   ( n )     K   h h   ( n ) − 1     K   h c   ( n )     It is noted that the first term   K   c c   ( n )   and   M   c c   ( n )   is the stiffness matrix and mass matrix, respectively, of the mixed element without nodeless degrees.  To evaluate the accuracy and numerical performance of the two-node p-version mixed element, several numerical examples studied in open literatures are considered. All calculations are carried out by programming in MATLAB.  We have analyzed the fixed hemispherical shell shown in Fig. 3 to study the convergence characteristics of natural frequencies in the membrane-dominated shell problem using various numbers of elements. Only half of the hemispherical shell was modeled by considering the structure mid-plane symmetry. Numerical results are calculated in terms of natural frequency parameter, λ = a ω   ( ρ / E )   1 / 2   , where a is the radius of the hemispherical shell. The exact solution obtained by Kunieda [4] was used as the reference value.   Fig. 3 shows the convergence characteristics of the present element for the first frequency parameter depending on the value of ‘m’, which denotes the order of shape functions in (10) and (15). We can clearly observe that the present element converges rapidly as increasing the order of the shape functions to m = 2 , i.e. cubic displacement functions and quadratic stress functions. It should be noted that the element (  m = 2  ) show almost comparable convergence to the element (  m = 3  ) . Fig. 4 shows the error norm of the first frequency for the circumferential harmonic number n = 1 by the ratio R / t of the element length to the thickness. We can see that the present mixed elements are free from locking problems and the nodeless degrees can improve the numerical performance substantially.  The frequency parameter λ for some combinations of mode and circumferential harmonic numbers are also summarized in Table 1. The present results obtained by six present mixed elements (  m = 3  ) are compared with the exact values by Kunieda [4] and the results from Luah and Fan׳s six spline finite elements [31]. Excellent agreement between the present results and exact solutions is observed. It has been known that the accuracy of the eigenvalues are expected to decrease progressively as the number of kinematically condensed degrees of freedom associated with higher order terms increases. In the case of the present mixed elements, however, the loss of accuracy that may be attributed to the Guyan reduction is not observed in Table 1.    Fig. 5 shows the second and third natural frequencies of the clamped-free cylindrical shell obtained by using four present mixed elements with m = 1 ,  2 ,  3 . The shell dimensions and material properties are R=101.6mm, L=226.786mm, t=1.016mm, E=2.069×1011 N/m2, ν =0.3, ρ=7868kg/m3. It can be seen that the results obtained by using only four elements show satisfactory agreement with those of Luah and Fan [21] by six spline finite elements. The two results by the present mixed elements with m =  2 ,  3 have almost comparable convergence and differ only by between –0.04% and 0.726%. It is evident that the introduction of high-order functions in displacements and consistent stress functions in the present dual-field mixed formulation yields substantially improved numerical results particularly for higher natural frequencies.  We consider a cylindrical pressure vessel with a torispherical head shown in Fig. 6. Torispherical heads are used commonly in large pressure and containment vessels because of their simple manufacturing and good strength in high pressure condition. This example has the geometry:   R   a   / a = 1.6667 ,   R   b   / a = 0.3333 , h / a = 0.01 ,   r   p   / a = 0.66667 ,   z   p   / a = 0.5120 . We carried out numerical tests using three segments. The spherical cap, the torus and the cylindrical portion are discretized into 16 elements and the smooth closed-apex without a slope discontinuity is assumed to have symmetric boundary conditions.    Table 2 shows the comparison of the first frequency parameters λ = a ω   ρ / E   for three circumferential harmonic numbers (n=1, 2, 3) with those by Kim׳s ten three-node hybrid-mixed elements [23], Singh׳s 16 two-node Bezier finite elements [28] and ANSYS general shell elements (1725 nodes). Fig. 7 represents the comparison of first meridional vibration mode shapes corresponding to the circumferential harmonic number n=1, 2, 3 with those by ANSYS. In all of present results, we can confirm again good agreements with the reference results. The proposed p-version mixed element is expected to produce accurate vibrational mode shapes which will be necessary in predicting stresses caused by transient dynamic loading.  In this section, we discuss the free vibration response of the hyperbolic cooling tower shown in Fig. 8. Hyperbolic cooling towers are large, thin shell reinforced concrete structures which contribute to environmental protection and to power generation efficiency and reliability. There is a large number of literature on free vibrations of hyperbolic shells of revolution [2]. We consider the example studied by Sen and Gould [29], and Hashish and Abu-Sitta [31]. Sen and Gould used the finite element method, and Hashish et al. conducted experimental investigations using a scale model. This cooling tower has a cross section described by the hyperbolic equation,   ( r / a )  2  −   ( z / b )  2  = 1 , where a=4.79 and b=11.391. The material properties are E = 0.738 ×   10  6   psi , ν = 0.23 and ρ = 0.210 ×   10   − 3      lb - s  2  / in   .  4  . The hyperbolic shell was assumed to be fixed at the base and free at the top. All non-uniform thickness variations were also considered.  The results obtained by using 10 and 15 present mixed elements are summarized in Table 3 together with those given by Refs. [29,31]. The experimental frequencies are consistently higher than numerical results due to the changes in the mechanical properties of the scale model which have not been considered in the numerical analysis, but once again a good agreement with those by Sen and Gould can be found. Fig. 9 shows the first vibration mode shapes for the circumferential harmonic numbers n=2, 3, 4. We can see that typical undulating modes around the cross-section with no net translation are well represented in the higher harmonic numbers n > 1 . It is clear that even with a small number of elements, the proposed p-version mixed elements ( m ≥ 2 ) are effective in solving practical problems accurately.   CONCLUSIONS   In this study, we presented a new two-node p-version element based on the dual-field mixed finite element formulation for the free vibration analysis of shells of revolution. The present formulation adopted the Hellinger–Reissner variational principle and the first-order Reissner–Mindlin shear deformation shell theory. The introduction of hierarchical high-order shape functions related to nodeless degrees in the displacement field and field-consistent stress parameters can make possible to develop an effective element improving the numerical performance substantially as well as removing the locking phenomena. The proposed mixed finite element converges rapidly as increasing the order of the shape functions to m = 2 , i.e. cubic displacement functions and quadratic stress resultant functions. The several numerical results demonstrate that the mixed element ( m ≥ 2 ) proposed herein can be applied with credibility to treating practical shells of revolution efficiently.   ACKNOWLEDGMENTS   This work was supported by research grants from the Catholic University of Daegu in 2013.   REFERENCES", "highlights": "In this study, an effective p-version two-node mixed finite element is newly presented for predicting the free vibration frequencies and mode shapes of isotropic shells of revolution. The present element considering shear strains is based on Reissner–Mindlin shear deformation shell theory and Hellinger–Reissner variational principle. To improve the accuracy and resolve the numerical difficulties due to the spurious constraints, field-consistent stress parameters are employed corresponding to displacement shape functions with high-order hierarchical shape functions. The elimination of stress parameters and the reduction of the nodeless degrees by the Guyan reduction yield the standard stiffness and mass matrix. Results of the proposed element are compared with analytical, experimental and numerical solutions found in the literature. We can confirm a very satisfactory numerical behavior of the present p-version mixed element."}