{"id": "S0168874X15000396", "article": "MAIN-TITLE A numerical model for the scattering of elastic waves from a non-axisymmetric defect in a pipe   HIGHLIGHTS          A hybrid numerical formulation is proposed to study wave scattering from defects.      Finite element method and modal expansion solutions are combined.      Predictions are presented both in the frequency and time domain.      A two dimensional Fourier transform is used to determine modal amplitudes.      Problems associated with dispersion can be avoided in the converted k − ω domain.          KEYPHRASES   Ultrasonic guided wave  Non-axisymmetric defect  Hybrid finite element method  Time domain scattered signals  Separation of dispersive modes   Guided ultrasonic waves are used in the non-destructive testing of pipelines. The guided waves normally take the form of a pulse with a narrow frequency bandwidth, which is launched along the pipe wall and is then scattered when it hits a defect in the pipe, such as a crack or region of corrosion. Following scattering by the defect the returning wave is detected and interrogated and the aim of the method is to infer the presence of the defect and if possible the geometry of the defect. The scattering of guided ultrasonic waves from a general defect is a three-dimensional problem and so this presents a significant computational challenge that potentially requires a large number of degrees of freedom. Consequently computation time can quickly become prohibitive for relatively long pipe lengths. To overcome this problem, this article applies a hybrid numerical approach in order to deliver an efficient three dimensional methodology for the propagation of elastic waves in a pipe. It is demonstrated that this type of approach is sufficiently efficient to permit the generation of predictions for scattering from arbitrary defects located in long lengths of pipe in both the frequency and time domain.  The development of three dimensional numerical models suitable for modelling large structures including pipelines continues to present a significant challenge. Current strategies include attempting to take advantage of symmetries present in a structure, or using finite element discretisations that are localised around a defect. For example, one may take advantage of symmetry in a pipeline and reduce the problem to two dimensions. Heidary and Ozevin recently accomplished this for an axisymmetric pipe under non-axisymmetric loading conditions [1], although this method cannot readily be applied to wave scattering problems from a general defect in a pipe because the loading function for a general defect remains unknown. Moreover, one must still mesh the entire pipe length which reduces the effectiveness of the method for long pipes. Alternatively, one can treat the pipe wall as a one dimensional structure and assume that the displacements and associated stresses and strains are constant over the pipe wall [2,3]. This will give a good approximation of the true behaviour for those modes in which the through thickness displacement profile is close to being constant, although this will be less successful for those modes for which this is not the case. Therefore, as the frequency of excitation is increased this approach is unlikely to capture accurately the behaviour of all modes propagating within a pipe.  To overcome the limitations of two dimensional models one must return to a three dimensional approach that delivers a full numerical discretisation of the defect as well as the surrounding structure. For example, Casadei et al. [4] presented a multi-scale finite element approach to study localized defects in plates. A multi-scale approach delivers a significant reduction in elements placed well away from a defect and so improves the efficiency of the model. However, this method still demands that the entire structure is meshed and so for large structures such as plates recent efforts centre on discretising only the immediate vicinity surrounding a scattering object. For example, Velichko and Wilcox [5] use finite elements to discretise the region surrounding a scatterer and then asymptotic Green׳s functions to reconstruct the solution outside this region. This has the advantage of lowering the number of degrees of freedom required to analyse a relatively small scattering object located in a much larger structure; however, in order to suppress reflections from the boundaries in the outer region it is necessary to include an artificial absorbing region. Velichko and Wilcox demonstrate that this method can be applied to guided wave scattering from a circular hole in a plate, and this approach was later applied to irregular defects by Moreau et al. [6]. The addition of an absorbing layer, which is often called a perfectly matched layer, has also been widely applied by other authors and is popular in commercial finite element software. For example, Żak et al. proposed an absorbing layer with a particular damping profile to suppress reflections in a finite element model for elastic wave propagation in unbounded structures [7]. It is of course possible to apply this type of approach to the study of guided waves in pipelines; however, the absorbing boundary or perfectly matched layer demands extra degrees of freedom and this leads to computational inefficiencies. Moreover, the absorbing region does not fully absorb the outgoing waves and so some reflection is inevitable, especially in three dimensional applications where high order propagating modes are difficult to attenuate. Accordingly, where possible it is desirable to seek methods that avoid the use of absorbing layers.  In the study of guided waves it is common to encounter long uniform sections of waveguide surrounding a relatively small scattering object or defect. It is desirable to take advantage of regions of uniformity and this can be accomplished in an efficient way by using a normal mode expansion. For example, Cho and Rose [8,9], and Zhao and Rose [10] proposed a hybrid boundary element method for analysing the scattering of Lamb and shear horizontal waves in a plate. Here the elastodynamic boundary integral equation is mapped onto an analytical normal mode expansion for the uniform section of the plate and this enabled the study of mode conversion by arbitrary defects. This method demonstrates a more efficient approach to studying guided waves as it does not rely on adding artificial absorbing regions. However, the method relies on the use of analytic expression for the propagating eigenmodes and so it is desirable to look at ways of removing this restriction so one can study waveguides with irregular cross-sectional geometries, as well as those applications where obtaining analytic solutions is challenging. Accordingly, it is sensible to extend this type of approach to include a numerical solution of the governing eigenequation for the uniform section of the waveguide. To this end a hybrid normal mode/finite element methodology has long been used in the study of elastic waves, although its application to pipes is still relatively limited. For example, Datta and Shah [11] applied the method to the scattering of shear waves in a plate, and Baronian et al. [12] examined the more general case of scattering from an arbitrary defect, although this was limited to a two dimensional waveguide. For pipes, Zhuang et al. [13] applied a hybrid formulation in the study of scattering from cracks in welds, although their analysis was restricted to an axisymmetric problem in order to permit the use of a Rayleigh Ritz approach for solving the eigenproblem on either side of the defect. Bai et al. [14] extended the work of Zhuang et al. [13] to non-axisymmetric circumferential cracks by combining analytic solutions for the pipe eigenmodes and coupling these to a numerical discretisation for the crack, although this was limited to an infinitely thin crack and, like Cho and Rose [8,9], they relied upon analytic eigensolutions. However, by subdividing the scattering from the crack into a symmetric and antisymmetric problem, Bai et al. were able to show that one may generate reflection coefficients for a non-axisymmetric problem in a pipe.  An alternative method for computing the eigenmodes in a uniform section of the pipe was proposed by Zhou et al. [15], who used the wave finite element (WFE) method to solve the governing eigenproblem. This numerical solution for the eigenmodes enabled Zhou et al. to link their model to a finite element discretisation of the defect in a computationally efficient way. Zhou et al. used a hybrid WFE and finite element scheme to study axisymmetric and non-axisymmetric defects in pipes and presented predictions for reflection coefficient in the frequency domain. The majority of the results presented by Zhou et al. are for a two dimensional formulation. Furthermore, it is known that some numerical issues are present with the WFE method [16,17] and so it appears appropriate to investigate alternative methods for three dimensional problems. One possible approach is to find the eigenmodes for a waveguide by directly solving the governing eigenequation. This method is often referred to in the elastodynamic literature as the semi analytic finite element (SAFE) method; however it has also been used in the acoustic waveguide literature where there is no such terminology [18,19]. A hybrid SAFE-FE method was recently applied to elastic wave propagation in a solid cylinder by Benmeddour et al. [20]. This method uses a full three dimensional discretisation of a small region surrounding the non-axisymmetric crack and then uses the two dimensional finite element mesh on the surface of this region to directly solve the governing eigeneqaution. Accordingly, this method removes the need for absorbing boundaries remote from the defect and/or separating three dimensional slices of the pipe for solving the eigenproblem. This makes the SAFE-FE hybrid method very efficient and so it has also been used, for example, to study axisymmetric defects in coated pipes [21,22]. The purpose of this article is the application of the SAFE-FE method to pipe in a way that permits the solution and separation of all propagating modes in the time domain.  The hybrid methods developed so far tend to be limited to the frequency domain, at least when studying three dimensional problems. This article will demonstrate that it is possible to generate predictions in the time domain for an arbitrary non-axisymmetric defect in a waveguide of arbitrary cross-section. The work presented here adopts a hybrid finite element method similar to that proposed by Benmeddour et al. [20], although a different formulation is used here. Benmeddour et al. use the principle of virtual work and apply a variational formulation to derive the governing SAFE-FE equations, whereas in this article we will use the alternative weighted residual method (WRM). The WRM is in principle a more general approach than the variational method and so this method is presented here for elastic wave propagation in pipes. Galerkin׳s method is then used to solve the problem and this is of course equivalent to a variational approach, but it will be shown that by using the WRM method one may arrive at a final governing equation that avoids the multiplication of global matrices seen in the variational approach of Benmeddour et al. [20]. The avoidance of these additional global matrix multiplications is potentially advantageous when one is required to make many repetitive solutions of the problem, as will be the case when Fourier transforms are used here to generate time domain predictions. Accordingly, this article begins by presenting a hybrid SAFE-FE formulation in Section 2 using a weighted residual approach. The frequency domain methodology is presented first and time domain simulations are then obtained following an inverse Fourier transform of the frequency domain computations. In Section 3, predictions are benchmarked against measured and predicted values for reflection coefficients reported in the literature. The method is then used to study scattering from a relatively small non-axisymmetric defect in both the time and frequency domain. Here k − ω plots are used to separate the propagating eigenmodes and it is shown that these plots can be used to avoid problems with dispersion when attempting to recover information about the defect at high frequencies.  A hybrid SAFE-FE method is presented here that is valid for a waveguide of arbitrary cross-section. The material properties of the waveguide are assumed to be isotropic and homogeneous in order to simplify the notation in the equations that follow; however this method may be used for material properties that vary over the pipe cross section, as well as within the region discretised by finite elements. The governing equation for wave propagation in an elastic medium is given by Navier׳s equation:  (1)   (  λ + μ  )  ∇  (  ∇ ⋅ u ′  )  + μ   ∇  2  u ′ = ρ     ∂  2  u ′   ∂   t  2    ,   where λ and μ are the Lamé constants, u ′ is the displacement vector, ρ is density and t is time. A time dependence of   e   i ω t   is assumed throughout this article, where ω is the radian frequency and i =   − 1   . Navier׳s equation may be written as three scalar equations using a Cartesian co-ordinate system, which gives  (2a)   (  λ + μ  )   (      ∂  2    u   x   ׳     ∂   x  2    +     ∂  2    u   y   ׳     ∂ x ∂ y   +     ∂  2    u   z   ׳     ∂ x ∂ z    )  + μ  (      ∂  2    u   x   ׳     ∂   x  2    +     ∂  2    u   x   ׳     ∂   y  2    +     ∂  2    u   x   ׳     ∂   z  2     )  = ρ     ∂  2    u   x   ׳     ∂   t  2    ,      (2b)   (  λ + μ  )   (      ∂  2    u   x   ׳     ∂ x ∂ y   +     ∂  2    u   y   ׳     ∂   y  2    +     ∂  2    u   z   ׳     ∂ y ∂ z    )  + μ  (      ∂  2    u   y   ׳     ∂   x  2    +     ∂  2    u   y   ׳     ∂   y  2    +     ∂  2    u   y   ׳     ∂   z  2     )  = ρ     ∂  2    u   y   ׳     ∂   t  2    ,      (2c)   (  λ + μ  )   (      ∂  2    u   x   ׳     ∂ x ∂ z   +     ∂  2    u   y   ׳     ∂ y ∂ z   +     ∂  2    u   z   ׳     ∂   z  2     )  + μ  (      ∂  2    u   z   ׳     ∂   x  2    +     ∂  2    u   z   ׳     ∂   y  2    +     ∂  2    u   z   ׳     ∂   z  2     )  = ρ     ∂  2    u   z   ׳     ∂   t  2    ,   where   u   x   ׳   ,   u   y   ׳   and   u   z   ׳   are displacements in the x, y and z directions, respectively, see also Fig. 1. On the surface of the pipe it is assumed that no external forces are present so that all the tractions over the surface are zero. The boundary conditions may then be written as  (3)    h   q   =   σ   q l     n   l   = 0 ,   where the indices q and l take on values of x , y and z , and the summation convention applies to repeated indices of l only. In Eq. (3)    σ   q l   denotes the Cauchy stress tensor and   n   l   is the unit outward normal vector to the surface of the pipe. The usual relationships between stresses and strains are  (4a)    h   x   = λ  (    ∂   u   x   ׳     ∂ x   +   ∂   u   y   ׳     ∂ y   +   ∂   u   z   ׳     ∂ z    )    n   x   + 2 μ   ∂   u   x   ׳     ∂ x     n   x   + μ  (    ∂   u   x   ׳     ∂ y   +   ∂   u   y   ׳     ∂ x    )    n   y   + μ  (    ∂   u   x   ׳     ∂ z   +   ∂   u   z   ׳     ∂ x    )    n   z   ,      (4b)    h   y   = μ  (    ∂   u   y   ׳     ∂ x   +   ∂   u   x   ׳     ∂ y    )    n   x   + λ  (    ∂   u   x   ׳     ∂ x   +   ∂   u   y   ׳     ∂ y   +   ∂   u   z   ׳     ∂ z    )    n   y   + 2 μ   ∂   u   y   ׳     ∂ y     n   y   + μ  (    ∂   u   y   ׳     ∂ z   +   ∂   u   z   ׳     ∂ y    )    n   z   ,      (4c)    h   z   = μ  (    ∂   u   z   ׳     ∂ x   +   ∂   u   x   ׳     ∂ z    )    n   x   + μ  (    ∂   u   z   ׳     ∂ y   +   ∂   u   y   ׳     ∂ z    )    n   y   + λ  (    ∂   u   x   ׳     ∂ x   +   ∂   u   y   ׳     ∂ y   +   ∂   u   z   ׳     ∂ z    )    n   z   + 2 μ   ∂   u   z   ׳     ∂ z     n   z   .      The SAFE method is used to obtain the eigenvalues for the pipe and this method is now well rehearsed in the literature, see for example Refs. [23–26], and so this is only briefly reported here. The displacements   u   1 q   ׳   in region   Ω   1   of the pipe (regions   Ω   1   and   Ω   3   are assumed to be identical) are expanded over the pipe eigenmodes to give  (5)    u   1 q   ׳    (  x , y , z  )  =  ∑  n = 0  ∞    u   1 q   n    (  x , y  )    e   − i k   γ  n  z   ,   where the subscript q = x ,  y   or   z , and   u   1 q    (  x , y  )  are the eigenvectors in region   Ω   1   , with k = ω /   c   T   so that γ is a dimensionless wavenumber. In addition,   c   T   and   c   L   are the shear (torsional) and compressional (longitudinal) bulk wave velocities, respectively. The finite element analysis proceeds by discretising the displacements of any mode n over the pipe cross-section to give  (6)    u   1 q    (  x , y  )  =  ∑  j = 1     p   1 q       N   q j    (  x , y  )    u   1 q j   =   N   q     u   1 q   ,   where   N   q j   is a global trial (or shape) function,   u   1 q j   is the value of   u   1 q   at node j , and   p   1 q   is the number of nodes (or degrees of freedom) for the displacements in direction q . In addition,   N   q   and   u   1 q   are row and column vectors of length   p   1 q   , respectively, and it is convenient to choose   N   x   =   N   y   =   N   z   = N . To formulate the governing eigenequation, Eq. (5) is substituted back into Eq. (2) and by using a weak formulation and introducing the boundary conditions in Eq. (3) one may arrive at the following general eigenequation:  (7)  P   u   1   = γ S   u   1 ,     where   u   1   =   [       u   1 x         u   1 y         u   1 z       γ   u   1 x       γ   u   1 y       γ   u   1 z       ]  T  . The constituents of matrices P and S are given in Appendix A. Eq. (7) is a sparse symmetric eigenequation of order 6   p   1   , with   p   1   =   p   1 x   =   p   1 y   =   p   1 z   . This equation is able to provide eigenvalue solutions for waveguides with an arbitrary cross-sectional area. However, the focus of this article is to study wave scattering problem in an axisymmetric pipe. Solution of this equation yields an unordered list of the eigenvalues γ and their associated eigenvectors   u   1   , where the eigenvalues appear in the pairs γ and – γ , which indicates waves travelling in the positive and negative z directions, respectively. It is necessary to sort these modes before further implementation of the hybrid method; however, one problem with a general application of the SAFE method is that it is often rather difficult to distinguish each family of modes when sorting the unordered list of eigenvalues. To overcome this the eigenvectors are first transformed from a Cartesian to a cylindrical coordinate system ( r ,  θ   and  z ) through the relationships   u   1 θ   = −  sin  θ   u   1 x   +  cos  θ   u   1 y   ,   u   1 r   =  cos  θ   u   1 x   +  sin  θ   u   1 y   , and with   u   1 z   remaining the same for both systems. This article focuses on pipes and so the modes are labelled according to the convention established by Silk and Bainton [27], which defines the torsional T ( 0 , n ) , longitudinal L ( 0 , n ) and flexural F ( m , n ) modes, for m > 0 . To sort these modes a Fourier transform is applied to those values of   u   1 θ   and   u   1 z   lying on the outer circumference of the pipe. Now   u   1 θ   and   u   1 z   may be expressed in the circumferential direction as either sin  m θ or cos  m θ , so that the peak value in the Fourier transformed domain can only exist at mode order m if   u   1 θ   or   u   1 z   is not equal to zero. Thus, the circumferential order m of each mode is found by locating the peak value of the Fourier transformed data for   u   1 θ   or   u   1 z   , which permits the sorting of solutions to Eq. (7) into torsional, longitudinal and flexural modes. Each mode type is then sorted in ascending order based on the absolute value of the eigenvalue.  A three dimensional finite element discretisation is used for the non-uniform section of the pipe,   Ω   2   , which is assumed to contain a defect of arbitrary shape, see Fig. 1. The displacements   u   2 q   ׳    (  x , y , z  )  in   Ω   2   are discretised to give:  (8)    u   2 q   ׳    (  x , y , z  )  =  ∑  j = 1     p   2 q       W   q j    (  x , y , z  )    u   2 q j   =   W   q     u   2 q   ,   where   W   q j   is a global shape function and   u   2 q j   is the value of   u   2 q   ׳   at node j, and   p   2 q   is the number of nodes in the q direction. Following the previous section,   W   x   =   W   y   =   W   z   = W . The hybrid method implemented here follows the same general approach as that described by Kirby et al. [21,22] for elastic waveguides, see also Kirby [18] and Duan and Kirby [19] for acoustic waveguides. Accordingly, a weak form of Eq. (2) yields  (9a)   ∫    Ω   2      {   [   (  λ + μ  )    ∂   W  T    ∂ x     ∂ W   ∂ x   + μ ∇   W  T  ∇ W − ρ   ω  2    W  T  W  ]    u   2 x   +  [  λ   ∂   W  T    ∂ x     ∂ W   ∂ y   + + μ   ∂   W  T    ∂ y     ∂ W   ∂ x    ]    u   2 y   +  [  λ   ∂   W  T    ∂ x     ∂ W   ∂ z   + μ   ∂   W  T    ∂ z     ∂ W   ∂ x    ]    u   2 z    }  d   Ω   2   =  ∫    Γ   2       W  T    h   2 x   d   Γ   2   ,      (9b)   ∫    Ω   2      {   [  λ   ∂   W  T    ∂ y     ∂ W   ∂ x   + μ   ∂   W  T    ∂ x     ∂ W   ∂ y    ]    u   2 x   +  [   (  λ + μ  )    ∂   W  T    ∂ y     ∂ W   ∂ y   + μ ∇   W  T  ∇ W − ρ   ω  2    W  T  W  ]    u   2 y   +  [  λ   ∂   W  T    ∂ y     ∂ W   ∂ z   + μ   ∂   W  T    ∂ z     ∂ W   ∂ y    ]    u   2 z    }  d   Ω   2   =  ∫    Γ   2       W  T    h   2 y   d   Γ   2   ,      (9c)      ∫    Ω   2      {   [  λ   ∂   W  T    ∂ z     ∂ W   ∂ x   + μ   ∂   W  T    ∂ x     ∂ W   ∂ z    ]    u   2 x   +  [  λ   ∂   W  T    ∂ z     ∂ W   ∂ y   + μ   ∂   W  T    ∂ y     ∂ W   ∂ z    ]    u   2 y   +  [   (  λ + μ  )    ∂   W  T    ∂ z     ∂ W   ∂ z   + μ ∇   W  T  ∇ W − ρ   ω  2    W  T  W  ]    u   2 z    }  d   Ω   2       =  ∫    Γ   2       W  T    h   2 z   d   Γ   2   .      On the surface of region   Ω   2   that does not include planes   Γ   A   and   Γ   B   it is assumed that no external forces are applied so that tractions   h   2 q   are equal to zero. However, on planes   Γ   A   and   Γ   B   , these traction forces are not zero and it is these surfaces that form the link to the modal expansions in regions   Ω   1   and   Ω   3   . Accordingly, the displacements in regions   Ω   1   and   Ω   3   are written as modal expansions so that  (10)    u   1q   ׳    (  x , y , z  )  =  ∑  n = 0     m   1 q       A  n    u   1 q +   n    (  x , y  )    e   − i k   γ  n  z   +  ∑  n = 0     m   1 q       B  n    u   1 q −   n    (  x , y  )    e   i k   γ  n  z   ,      (11)    u   3 q   ׳    (  x , y ,   z  ׳   )  =  ∑  n = 0     m   1 q       C  n    u   1 q +   n   ( x , y )   e   − i k   γ  n    z  ׳    .   Here   A  n  ,   B  n  and   C  n   are modal amplitudes, and   u   1 q +   n   and   u   1 q −   n   are eigenvectors for the incident and reflected waves, respectively. The number of modes in regions   Ω   1   and   Ω   3   in direction q is   m   1 q   , where   m   1 q   ≤   p   1 q   . It is assumed that the pipe extends to infinity in region   Ω   3   so that no reflected waves are present in this region. In addition, Eq. (10) allows for a general incident sound field, although in the analysis that follows this will be restricted either to torsional T ( 0 , 1 ) or longitudinal L ( 0 , 2 ) excitation as this best reflects experimental practice.  Continuity of the normal and shear stresses is enforced over planes   Γ   A   and   Γ   B   by substituting Eqs. (10) and (11) into Eqs. (9a)–(9c), and using the stress/strain relations in Eq. (4). This permits Eqs. (9a)–(9c) to be re-written as  (12a)    G   22     u   2 x   +   G   32   T     u   2 y   +   G   42   T     u   2 z   +   G   21   B +   G   25   C =  [    Q   1 x +   −   Q   1 zx +    ]  A ,      (12b)    G   32     u   2 x   +   G   33     u   2 y   +   G   43   T     u   2 z   +   G   31   B +   G   35   C =  [    Q   1 y +   −   Q   1 z y +    ]  A ,      (12c)    G   42     u   2 x   +   G   43     u   2 y   +   G   44     u   2 z   +   G   41 −   B +   G   45   C = −   G   41 +   A ,   where A  ,  B and C are vectors holding the modal amplitudes   A  n  ,   B  n  and   C  n  respectively. The other matrices in these equations are given in Appendix B. Eq. (12a)–(12c) enforce the traction continuity conditions over planes   Γ   A   and   Γ   B   ; continuity of displacement is enforced separately, which yields  (13a)    u   q 2    (  x , y , 0  )  =  ∑  n = 0     m   1 q       A  n    u   1 q +   n   +  ∑  n = 0     m   1 q       B  n    u   1 q −   n     and  (13b)    u   q 2    (  x , y , L  )  =  ∑  n = 0     m   1 q       C  n    u   1 q +   n   ,   where L is the length of region   Ω   2   , see Fig. 1. The displacement continuity equations are weighted by an appropriate weighting function and then integrated over planes   Γ   A   and   Γ   B   respectively. The weighting function is chosen to take advantage of modal orthogonality where possible, see for example Gregory [28] for a discussion on orthogonality relations for elastic waves, and also Kirby et al. [21,22] for implementation in axisymmetric problems. The use of an appropriate semi-orthogonality relation also helps to deliver a convergent system of equations, which is crucial in delivering an accurate solution for the problem. Accordingly, the displacement on plane   Γ   A   in the x direction is weighted with   G   21   T   , while in the y and z directions   G   31   T   and   G   41 −   T   are used, respectively. For   Γ   A   this yields  (14a)    G   21   T     u   2 x   +   G   31   T     u   2 y   +   G   41 −   T     u   2 z   −   G   11 −   B =   G   11 +   A ,   and for   Γ   B      (14b)    G   25   T     u   2 x   +   G   35   T     u   2 y   +   G   45   T     u   2 z   +   G   55   C = 0 .      Finally, Eqs. (12a)–(12c) and (14a) and (14b) are grouped together to give the final system equation  (15)   [      −   G   11 −         G   21   T         G   31   T         G   41 −   T      0        G   21         G   22         G   32   T         G   42   T         G   25           G   31         G   32         G   33         G   43   T         G   35           G   41 −         G   42         G   43         G   44         G   45        0      G   25   T         G   35   T         G   45   T         G   55        ]   {     B        u   2 x           u   2 y               u   2 z        C         }  =  {        G   11 +   A        [    Q   1 x +   −   Q   1 zx +    ]  A            [    Q   1 y +   −   Q   1 zy +    ]  A       −   G   41 +   A      0         }  .   Eq. (15) is a set of   n   t     ( = 2   m   1   +   p   2   ) linear equations, where   p   2   is the number of nodes in region   Ω   2   (   p   2   =   p   2 x   +   p   2 y   +   p   2 z   ) , and   m   1   is the number of modes in regions   Ω   1   and   Ω   3   respectively (   m   1   =   m   1 x   +   m   1 y   +   m   1 z   ) . The modal amplitudes in   Ω   1   and   Ω   3   , and the displacements in region   Ω   2   , are then found on the solution of Eq. (15). The frequency domain displacements in region   Ω   1   can be calculated from Eq. (10), and the corresponding time domain displacements in region   Ω   1   are easily obtained following an inverse Fourier transform.  Eq. (15) is solved in the frequency domain. In order to generate a time domain response an incident pulse is first specified in the time domain, which is then transformed into the frequency domain using a discretised Fourier transform. The complex amplitude obtained for the pulse at each frequency is then used as the incident modal amplitude in Eq. (15). For the time domain predictions that follow, Eq. (15) is solved in the frequency domain at 3671 discrete frequencies, which delivers a frequency range suitable for minimising numerical noise whilst at the same time delivering an acceptable solution time. Following the frequency domain calculations an inverse Fourier transform is undertaken to generate the time domain predictions.   RESULTS AND DISCUSSION   The accuracy of the hybrid model generally depends on the number of modes used in the uniform sections of the pipe, as well as the number of the degrees of freedom in the non-uniform section. To achieve a good level of accuracy while retaining the efficient nature of the model, a convergence study is carried out first for a non-axisymmetric defect in a pipe in the frequency domain. The defect studied in this section is chosen to be a relatively small crack so that it is difficult to locate and presents a demanding problem with which to investigate convergence. Accordingly, a defect is chosen that extends around 10% of the circumference of a 3in. schedule 40 steel pipe. The shape of this defect is shown in Fig. 2. The outer and inner radius of the pipe is 43.5mm and 38mm respectively. The depth of the defect is 50% of the pipe wall thickness and its length (in the z direction) is 2.5mm. This equates to a defect that extends approximately 27mm around the outer circumference of the pipe, with a depth of 2.75mm, and so this is considered to be a relatively small defect in the context of typical non-destructive testing on pipelines [3]. The properties of the steel pipe are   c   T   = 3260  m / s , τ = 3.342 , and ρ = 8030   kg /   m  3  . For the three dimensional model, six noded isoparametric elements are used for planes   Γ   A   and   Γ   B   , and ten noded tetrahedral isoparametric elements are used for   Ω   2   . The distance between planes   Γ   A   and   Γ   B   is L = 8.5  mm . The numerical model was programmed in MATLAB and executed on a laptop with a 2.4GHz Intel Core™ CPU and an 8GB RAM.  The convergence of the numerical model is investigated in the frequency domain using a frequency of 70kHz. The convergence of the model is investigated in terms of the number of modes (   m   1   ) used in the uniform sections, see Table 1, and the number of degrees of freedom in the mesh surrounding the crack (   p   2   ), see Table 2. Here convergence is investigated in terms of sound power in order to permit a power balance to be calculated. Accordingly, the reflected and transmitted sound power ratio is defined, in the frequency domain, as  (16)    P   r   =   Re  {   ∫    Γ   A      [    σ   1 z q −   ⋅   u   1 q −   ⁎    ]  d   Γ   A    }    Re  {   ∫    Γ   A      [    σ   1 z q +   ⋅   u   1 q +   ⁎    ]  d   Γ   A    }      and  (17)    P   t   =   Re  {   ∫    Γ   B      [    σ   3 z q +   ⋅   u   3 q +   ⁎    ]  d   Γ   B    }    Re  {   ∫    Γ   A      [    σ   1 z q +   ⋅   u   1 q +   ⁎    ]  d   Γ   A    }    .      Here the superscript ⁎ indicates the complex conjugate, and q takes on values of x , y and z . In addition,    u   1 q +   and   u   1 q −   are the incident and reflected displacements, and   σ   1 z q +   and   σ   1 z q −   are the incident and reflected stress tensors, on plane   Γ   A   . Similarly,   u   3 q +   and   σ   3 z q +   are the transmitted displacement and stress tensor on plane   Γ   B   , respectively. The sum of the reflected and transmitted sound power ratio should of course be equal to unity and in Tables 1 and 2 the percentage error in the power balance is seen to be less than 0.01% once a sufficient number of elements have been included. This represents very good agreement and compares favourably to the error in the energy balance reported elsewhere, for example Velichko and Wilcox [5] report an error of between 2% and 4% for guided waves in a plate with three propagating modes present. Note that in Table 1, the number of degrees of freedom surrounding the defect is fixed so that   p   2   = 21 , 030 and this corresponds to an element density of 31 nodes per wavelength for the torsional mode. This high mesh density is designed to demonstrate that very accurate results can be obtained, although if one relaxes this requirement and tolerates a higher error in the power balance then a much faster solution may be obtained. The aim of this article is to retain very accurate solutions where possible and so in view of the results presented in Tables 1 and 2 the number of modes in the uniform pipe section is chosen to be   m   1   = 200 so that good convergence of the solution is retained. Note that when   m   1   = 200 for this particular problem, both propagating and non-propagating (evanescent) modes are included. Evanescent modes are very important in delivering good convergence for the matching conditions over boundaries   Γ   A   and   Γ   B   , and so a sufficient number of modes is necessary to obtain an accurate solution. At a frequency of 70kHz, 39 propagating modes are present for this pipe, and of these 3 are axisymmetric and 36 are flexural modes; the total number of evanescent modes is 161, with 80 modes possessing purely imaginary wavenumbers and 81 modes possessing complex wavenumbers. This number of modes was chosen to ensure good convergence of the matching conditions over boundaries   Γ   A   and   Γ   B   . Note that the evanescent modes are sorted in ascending order according to the absolute value of their imaginary parts, and so evanescent modes with smaller imaginary parts are always selected first. This is because those evanescent modes with a smaller imaginary part will play a more important role in satisfying the boundary conditions when compared to those with a larger imaginary part. The three dimensional model is computationally efficient so that the computation time is less than 3min for each frequency when using   m   1   = 200 and   p   2   = 21 , 030 . Clearly if one tolerates lower levels of accuracy, such as those reported in the literature, then this computation time can be significantly improved and it can be seen in Tables 1 and 2 that this can be reduced to 18s for   m   1   = 50 and   p   2   = 21 , 030 . Moreover, with solutions times of this order the method is suitable for the use of inverse Fourier transforms in order to generate time domain predictions.  In order to illustrate convergence in terms of fulfilling the matching conditions across the boundary   Γ   A   , the torsional displacement distribution for plane   Γ   A   is shown in Fig. 3 at a frequency of 70kHz. The displacement field over plane   Γ   A   lying in region   Ω   1   is calculated by solving Eq. (15) and substituting the incident and reflected modal amplitudes A and B into Eq. (10). This is then combined with the eigensolutions from Eq. (7) to enable the modal sum, and hence the displacement field in   Ω   1   , to be computed. The displacement distribution over plane   Γ   A   lying in region   Ω   2   is obtained from the nodal displacement field for the finite element mesh found on solution of Eq. (15). It can be seen that the two solutions deliver identical displacement distributions demonstrating that the displacement boundary condition has been executed correctly. Similar diagrams can be obtained for the other boundaries and matching conditions. It is interesting to note in Fig. 3 that the highest displacement is at the top of the pipe in the region that is opposite the defect. Clearly this displacement field is non-axisymmetric and so this is evidence of the strong influence of flexural modes on the displacement distribution over this plane.  The hybrid method is now validated in the frequency domain because this can be done by comparing predictions against a two dimensional model for an axisymmetric defect. A two dimensional model will be very accurate because a significant reduction in the degrees of freedom is possible for a symmetrical problem. This then provides a very rigorous test of the current model. The two dimensional results presented by Kirby et al. [21,22] are chosen here and so this validation is carried out for a 3in. Schedule 40 steel pipe and a square (uniform) axisymmetric defect with a 50% area reduction and a length of 15mm. For the three dimensional model, six noded isoparametric elements are used for planes   Γ   A   and   Γ   B   , and ten noded tetrahedral isoparametric elements are used for   Ω   2   .  In the results that follow the reflection coefficient of waves reflected back into region   Ω   1   is used to characterise the scattering by the defect. The model presented in the previous section will capture every mode scattered by a defect and so accommodate all mode conversions that take place during this process. However, in commercial experimental tools transducers are used to transmit as well as receive the guided waves and these transducers are normally aligned to excite/measure either torsional or longitudinal displacements. This means that only those modes with a dominant displacement in the torsional direction will be picked up when the transducers are aligned to excite T(0,1), and similarly for axial displacements when exciting with L(0,2). Therefore, in order to enable direct comparison with the experimental measurements of Kirby et al. [21,22] the reflection coefficient predictions must be designed to separate torsionally and axially dominant displacements. Accordingly, the reflection coefficient Λ for mode (  m , n  ) is defined [in the frequency domain only] as  (18)    Λ   (  m , n  )   =     B   (  m , n  )     u   1 q −   (  m , n  )       A   (    m   I   ,   n   I    )     u   1 q +   (    m   I   ,   n   I    )     ,     q = θ  or  z .      Thus, Λ is calculated by normalising a reflected mode (  m , n  ) by an incident mode (    m   I   ,   n   I    ) , where the incident mode determines whether one chooses the torsional ( θ ) or longitudinal ( z ) displacements on the right hand side of Eq. (18). That is, if the incident mode is T ( 0 , 1 ) then q = θ , and if it is L ( 0 , 2 ) then q = z . Building in the appropriate torsional or longitudinal displacements into Eq. (18) thus permits the comparison with measurements taken with T ( 0 , 1 ) and L ( 0 , 2 ) incident modes.  In Fig. 4(a) and (b) the reflection coefficients for an axisymmetric defect are compared for excitation by T ( 0 , 1 ) and L ( 0 , 2 ) incident modes, respectively. The theoretical model uses values of   m   1   = 200 and   p   2   = 64 , 707 for each frequency. The agreement between the different methods is seen to be very good and the reflection coefficients for the two and three dimensional models agree to an accuracy of at least two decimal places over the frequency range shown in Fig. 4(a) and (b). This provides evidence that the three dimensional model is working correctly and is capable of accurately modelling wave scattering of different incident modes in the frequency domain.  The theoretical model is now validated in the time domain. Time domain predictions are obtained using the method outlined at the end of Section 2, with an incident pulse consisting of a 10 cycle Hanning windowed sinusoidal wave with a centre frequency of 70kHz. Following transformation in the frequency range, the problem is solved at 3671 discrete frequencies extending from 35kHz to 105kHz in increments of 19.07Hz. Predictions are compared against reflection coefficient data measured by Lowe et al. [3] for an L ( 0 , 2 ) mode incident on a through thickness defect in a 3in. schedule 40 steel pipe. This defect was machined into the pipe by Lowe et al. using a 3.2mm slot drill, and different distances around the circumference of the pipe were machined in order to generate a range of different non axisymmetric defects. Accordingly, the data reported by Lowe et al. [3] provides a rigorous test of the theoretical model as it covers a number of different defects, as well as the reflection coefficients for L  (  0 , 2  )  and F ( 1 , 3 ) .  The reflection coefficients reported by Lowe et al. [3] contain data for F ( 1 , 3 ) so that the displacement profile varies around the circumference of the pipe. Lowe et al. [3] placed 16 transducers evenly around the circumference of the pipe in order to capture the circumferential displacement profile. A phase delay of ( m θ / 2 π ) was then applied to each transducer before summing up and averaging the data measured by each transducer, where m is the order of the circumferential mode to be extracted. If m > 0 the circumferential dependence is sinusoidal and so for flexural modes the average value will be exactly halfway between the maximum and minimum displacements. In this article our reflection coefficient in the time domain is defined as the ratio of the maximum values of the reflected and incident signals. Therefore in order to directly compare the theoretical predictions generated in this article with the experimental data measured by Lowe et al. [3] it is necessary to multiply the measured data by 2 for F ( 1 , 3 ) . Accordingly, the reflection coefficients measured by Lowe et al. for the L  (  0 , 2  )  and F ( 1 , 3 ) modes are compared against theoretical predictions obtained using a time domain model in Fig. 5. The current method is seen to agree very well with the experimental data over a wide range of different non-axisymmetric defect geometries and this serves to further validate the hybrid model presented here.  It is common when measuring the scattering of modes in the time domain to measure the peak amplitude of the displacement. A common problem with this is that the peak amplitude changes with distance from the defect because all modes apart from T(0,1) are dispersive. Accordingly it is common to choose modes and a centre frequency that minimises this effect and for the L ( 0 , 2 ) and F ( 1 , 3 ) modes chosen by Lowe et al. [3] these modes are only weakly dispersive at 70kHz. However, at different frequencies and/or for different modes dispersion will causes many problems when trying to identify a reflection coefficient and this limits the general use of this method and often makes it difficult to distinguish scattering from objects that convert energy into many dispersive modes.  This problem may be illustrated with the theoretical model developed here. To do this a non-axisymmetric part-thickness defect of the type shown in Fig. 2 is generated for a 3in. schedule 40 pipe. The dimensions of this defect are the same as those described in Section 3.1. This type of defect is commonly found in real applications and generates a more complicated scattering profile when compared to through thickness defects such as those examined in Fig. 5. Accordingly, a long length of pipe is utilised here so that propagating eigenmodes may be separated, as far as possible, in the time domain. The sound source is again chosen to be a 10 cycle Hanning windowed sinusoidal wave with a centre frequency of 70kHz. Following transformation in the frequency range, the problem is solved at 3671 discrete frequencies extending from 35kHz to 105kHz in increments of 19.07Hz. To maintain a well converged and yet computationally efficient solution those values identified in Section 3.1 (   m   1   = 200 and   p   2   = 21 , 030 ) are used and the model is executed on a computer with 12 CPU cores and a total accessible RAM of 128GB. Parallelisation techniques are used so that the problem is solved in parallel for 12 frequencies at a time. The total computation time is around 13h.  In  Figs. 6 and 7 the normalised displacements in the x and y directions are presented for excitation by the T ( 0 , 1 ) and L ( 0 , 2 ) modes, respectively. The displacements are those obtained at the outer circumference of the pipe using the modal expansion given by Eq. (13a). The displacements are sampled up to 15m away from the defect so that differences in group velocity help to separate out the modes in each figure. Note that the defect is placed on top of the pipe so that it is symmetric about the y axis (see Fig. 2). It can be seen that some numerical noise is present between the incident and the first reflected pulse in Figs. 6 and 7. This is a result of using an inverse Fourier transform for the time domain predictions, whereby the total time duration of the signal is determined by the number of frequencies used in the model, as well as the sampling period chosen. The duration of the time domain signal is of course finite, however theoretically the time domain signal should be infinitely long to accommodate those modes that are extremely dispersive [with group velocities approaching zero at modal cut-on frequencies]. Accordingly, one has to use a finite time domain window to truncate this infinitely long signal and this leads to numerical noise following the inverse Fourier transform. For the examples shown in Figs. 6 and 7 the total duration of the signal is 52.4ms and this delivers a minimum signal to noise ratio of 52dB. Therefore, it is concluded that this numerical noise has a negligible influence on the scattered signals that are of interest here. Of course, one may further increase this signal to noise ratio, but this would require an increase in the duration of the time domain signal, which would increase the computation time. Accordingly, one must balance numerical noise in the time domain signal with computational time for solving the problem, and in this and following examples a signal to noise ratio of greater than 50dB was deemed to be sufficient.  The complexity of the scattering problem is obvious in Figs. 6 and 7, even with a long pipe length to separate the propagating modes. A large number of modes are seen to be cut-on at 70kHz, and the part through defect is seen readily to scatter energy into a number of these modes. The modes are identified by comparing values calculated for their group velocity with the time of flight measured in Figs. 6 and 7. It is not surprising to see that energy scatters into the same mode as the one used to excite the problem; however, significant amounts of energy is also seen to scatter into higher order flexural modes, especially those that have a mode shape similar to the incident mode. For example, in Fig. 8(a) the mode shapes for F ( 1 , 2 ) and F ( 2 , 2 ) are compared to those for T ( 0 , 1 ) , and in Fig. 8(b) modes F ( 1 , 3 ) and F ( 5 , 2 ) are compared to L ( 0 , 2 ) . In both cases these modes shapes are sufficiently similar to the incident mode to see significant energy reflected into these modes in Figs. 6 and 7. This illustrates one of the problems of using guided elastic waves at high frequencies, as modes with similar shapes will continue to cut on as the frequency increases and so energy will readily transfer into these propagating higher order modes. Accordingly, this scattering of energy into dispersive higher order modes presents a problem when trying to interpret reflections obtained in the time domain because the amplitude of each mode depends on the distance travelled. This is seen to occur even at a centre frequency of 70kHz and for a relatively small pipe. These results also illustrate the difficulty of discretising the whole pipe using a traditional finite element based approach because a large number of modes are seen to carry energy and so fully capturing the behaviour of these modes is likely to require a very large number of elements as the pipe extends beyond about 1m. The hybrid finite element method neatly overcomes this difficulty by using a modal expansion for the displacement field in the uniform pipe section so that the time to solve the problem is independent of pipe length, which allows all of the scattered modes to be captured over a long-length of pipe and does not rely on absorbing regions to damp unwanted reflections.  The problems with dispersion seen in previous figures serve to reduce the effectiveness of experimental methods, especially when one is trying to separate signals from more than one defect. Therefore, it is interesting to investigate possible methods for removing the effects of dispersion when processing the scattered data. One possible approach is to define the reflection coefficient in terms of modal amplitude in the frequency domain rather than using peak amplitude in the time domain. This can be achieved using a two dimensional Fourier analysis in order to separate out modes in the time domain modes. For example, when undertaking experimental measurements Lowe et al. [3] used evenly spacing multiple receivers around the circumference of a pipe to separate out modes with different circumferential orders. This procedure is demonstrated theoretically in  Figs. 9 and 10 for the pipe and defect studied previously in this section, with 64 receivers used for torsional T ( 0 , 1 ) and longitudinal L ( 0 , 2 ) excitation, respectively. It can be seen in Figs. 9 and 10 that low-order flexural modes may be separated, however, higher order flexural modes that are highly dispersive still overlap, see for example F ( 2 , 2 ) and F ( 2 , 3 ) , F ( 3 , 2 ) and F ( 3 , 3 ) . Furthermore, the high levels of dispersion mean that the peak amplitudes of these modes will depend strongly on receiver location. As a consequence, it is difficult to arrive at a meaningful interpretation of the time domain peak amplitudes of these flexural modes and this problem cannot be overcome simply by increasing the number of transducers in the circumferential direction.  A two dimensional Fourier transform with receivers arranged circumferentially is seen to be able to separate some propagating modes, however an alternative approach is to use the Fourier transform to study modal amplitudes rather than displacement amplitude. Modal amplitude is entirely independent of modal dispersion, see for example Eqs. (10) and (11). Accordingly, modal amplitude may be recovered by using a k − ω plot. This can be achieved for a pipe by placing receivers along the length of the pipe rather than around the pipe circumference. Thus, for the pipe and defect geometry used in Figs. 6–10, k − ω plots are generated here using displacements calculated at 512 axial sampling points placed evenly along the length of the outer circumference of the pipe, with every point at the same circumferential location directly opposite the defect, so that x = 0 for all sampling points. The first sampling point is located 15m away from the defect, with the other points placed a distance of 10mm away from one another in the direction of the defect, so that the sampling points extend a distance of 5.11m towards the defect. The time domain signal calculated at each sampling point is then stored in the row of a matrix and, following truncation of each signal, a two dimensional Fourier transform is applied to the matrix in order to generate a k − ω plot. In the k − ω domain the largest wavenumber that can be sampled is dictated by the distance between the sampling points and for this example the maximum value is   k   max   = 314    m   − 1   . The wavenumber resolution Δ k is determined by the distance between the first and last receivers, which for this example gives Δ k = 1.227    m   − 1   .  In Fig. 11(a) and (b), k − ω plots are presented for the modes scattered by a defect with excitation by the T ( 0 , 1 ) and L ( 0 , 2 ) modes, respectively. It is well known that k − ω plots will recover the dispersion curves for a waveguide and this is clearly seen in Fig. 11. Accordingly, this method separates out individual modes and will remove those problems associated with dispersion that are typically encountered in the time domain. Crucially, the k − ω plots also deliver the modal amplitudes at each frequency; these are independent of the effects of dispersion and so they may be used to generate reflection coefficients that are independent of sampling location. This is very important when attempting to study energy scattered into higher order modes when a large number of modes propagate. It is interesting also to note in Fig. 11 that the scattering from an L ( 0 , 2 ) incident mode delivers a much more complex response when compared to a T ( 0 , 1 ) incident mode. It is, therefore, possible to reduce the number of sampling locations if one is interested solely in excitation by T ( 0 , 1 ) . Note also that some of these modes are seen to overlap one another at particular frequencies and better discrimination between these modes may be achieved by increasing the length of the pipe over which the data is sampled; however, this is not thought to be necessary as it is relatively straightforward to avoid frequencies where modes overlap one another by consulting dispersion curves for a pipe.  The key advantage of a k − ω plot is that reflection coefficients may be generated that are independent of the effects of dispersion. This is illustrated in Fig. 12(a) and (b), where the modal amplitude is plotted against wavenumber at a frequency of 70kHz for T ( 0 , 1 ) and L ( 0 , 2 ) excitation, respectively (this is a vertical slice through the k − ω plots in Fig. 11). One can clearly see that it is now much easier to separate the response from individual modes when compared to the time domain responses seen previously. Thus, these reflection coefficients provide significantly more information when compared to that recovered in the time domain and through the careful processing of this information it may be possible to gain more knowledge about the defect, such as the geometry and/or type of defect encountered. For example, in Fig. 12 it is seen that it may be possible to use F ( 3 , 3 ) or F ( 5 , 2 ) as a guide to interpreting the presence of a defect rather than T ( 0 , 1 ) or L ( 0 , 2 ) , respectively. The k − ω domain figures also remove the problem of coherent noise (the overlapping of dispersive modes in the time domain). Of course, such an approach does depend on being able to distinguish the signature of this crack from that of other scattering objects that are likely to be present in a real pipe. Furthermore, this approach requires the use of a relatively large number of sampling points placed along the axis of a pipe and so it remains to be been seen how easy it is to apply this method in practice. One may also be able to significantly reduce the number of sampling locations is one wishes to target particular modes in the dispersion curve. However, ultimately an increase in experimental difficulty is a penalty one must probably expect to pay in order to recover significantly more information about a defect in a pipe.   CONCLUSIONS   This article develops a three dimensional numerical approach to the analysis of elastic wave propagation in pipes with non-axisymmetric defects. The article introduces an alternative WRM approach to deriving the governing finite element equations and through the use of Galerkin׳s method a hybrid SAFE-FE method is developed that avoids multiplying global matrices before solving the problem. The modal and displacement solutions are obtained through solution of a final governing equation in the frequency domain, and time domain solutions are calculated from an inverse Fourier transform. A hybrid approach permits the study of long lengths of pipe and it is shown that for non axisymmetric defects energy is scattered into higher order flexural modes and the dispersive nature of these modes means that separating them in the time domain is likely to be difficult. Moreover, when attempting to recover the peak amplitude of a particular mode problems will occur because for all modes apart from T ( 0 , 1 ) these amplitudes are a function of the axial location of the receiver on the pipe.  The hybrid model is seen to converge quickly and for a non-axisymmetric defect the error in power balance is generally below 0.01% for a computation time of less than 3min for each frequency. Following this the time domain model currently takes about 13h to solve with the use of parallelisation techniques; however, if one tolerates lower levels of accuracy then this solution time may be significantly reduced. Accordingly a time domain model based on frequency calculations using the hybrid method presented here are seen to be significantly faster than using a full FE discretisation of the problem. Thus, this paper demonstrates that an FE based method can be used to solve a time domain scattering problem for an arbitrary defect in a long waveguide with an arbitrary cross-section. This article also demonstrates that it is possible to avoid problems caused by dispersion by working in the k − ω domain using sensors placed along the pipe axis. This permits modal amplitudes for every propagating mode to be determined, which provides a significant increase in the information that may be extracted when compared to the analysis of amplitude in the time domain.     (A1)  P =  [     0   0   0      Z   41   T         Z   51   T      0     0   0   0      Z   51         Z   52   T      0     0   0   0   0   0      Z   63   T           Z   41         Z   51   T      0   0   0      Z   64   T           Z   51         Z   52      0   0   0      Z   65   T        0   0      Z   63         Z   64         Z   65      0     ]          (A2)  S =  [        Z   41   T         Z   51   T      0   0   0   0        Z   51         Z   52   T      0   0   0   0     0   0      Z   63   T      0   0   0     0   0   0    −   k  2    K   2      0   0     0   0   0   0    −   k  2    K   2      0     0   0   0   0   0    τ   k  2    K   2        ]          (A3)    Z   41   =  (  τ − 1  )    K   x   +   K   1   −   k  2    K   2           (A4)    Z   51   =  (  τ − 2  )    K   x y   T   +   K   x y           (A5)    Z   52   =  (  τ − 1  )    K   y   +   K   1   −   k  2    K   2           (A6)    Z   63   = −  (    K   1   −   k  2    K   2    )          (A7)    Z   64   = i k  [   (  2 − τ  )    K   3   +   K   3   T    ]          (A8)    Z   65   = i k  [   (  2 − τ  )    K   4   +   K   4   T    ]          (A9a,b)    K   1   =  ∫    Γ   1     ∇   N  T  ∇ N d   Γ   1        and        K   2   =  ∫    Γ   1       N  T  N d   Γ   1           (A10a,b)    K   3   =  ∫    Γ   1       N  T    ∂ N   ∂ x   d   Γ   1        and        K   4   =  ∫    Γ   1       N  T    ∂ N   ∂ y   d   Γ   1            (A11a,b)    K   x   =  ∫    Γ   1       ∂   N  T    ∂ x     ∂ N   ∂ x   d   Γ   1    and    K   y   =  ∫    Γ   1       ∂   N  T    ∂ y     ∂ N   ∂ y   d   Γ   1           (A12)    K   x y   =  ∫    Γ   1       ∂   N  T    ∂ x     ∂ N   ∂ y   d   Γ   1        Note that τ =   c   L   2   /   c   T   2   .     (A13a,b)    R   x   =  ∫    Ω   2       ∂   W  T    ∂ x     ∂ W   ∂ x   d   Ω   2    and    R   y   =  ∫    Ω   2       ∂   W  T    ∂ y     ∂ W   ∂ y   d   Ω   2           (A14a,b)    R   x y   =  ∫    Ω   2       ∂   W  T    ∂ x     ∂ W   ∂ y   d   Ω   2        and        R   x z   =  ∫    Ω   2       ∂   W  T    ∂ x     ∂ W   ∂ z   d   Ω   2           (A15a,b)    R   y z   =  ∫    Ω   2       ∂   W  T    ∂ y     ∂ W   ∂ z   d   Ω   2        and       R   z   =  ∫    Ω   2       ∂   W  T    ∂ z     ∂ W   ∂ z   d   Ω   2            (A16a,b)    R   1   =  ∫    Ω   2     ∇   W  T  ∇ W d   Ω   2    and    R   2   =  ∫    Ω   2       W  T  W d   Ω   2           (A17)    Q   1 x ±   = i k   γ  n   ∫    Γ   A       W  T    u   1 x ±   n   d   Γ   A   ,   n = 1 , 2 …   m   1           (A18)    Q   1 z x ±   =  ∫    Γ   A       W  T    ∂   u   1 z ±   n     ∂ x   d   Γ   A   ,   n = 1 , 2 …   m   1           (A19)    Q   3 x +   = i k   γ  n   ∫    Γ   B       W  T    u   1 x +   n   d   Γ   B   ,  n = 1 , 2 …   m   1           (A20)    Q   3 z x +   =  ∫    Γ   B       W  T    ∂   u   1 z +   n     ∂ x   d   Γ   B   ,   n = 1 , 2 …   m   1           (A21)    Q   1 y ±   = i k   γ  n   ∫    Γ   A       W  T    u   1 y ±   n   d   Γ   A   ,   n = 1 , 2 …   m   1           (A22)    Q   1 z y ±   =  ∫    Γ   A       W  T    ∂   u   1 z ±   n     ∂ y   d   Γ   A   ,   n = 1 , 2 …   m   1           (A23)    Q   3 y +   = i k   γ  n   ∫    Γ   B       W  T    u   1 y +   n   d   Γ   B   ,  n = 1 , 2 …   m   1           (A24)    Q   3 z y +   =  ∫    Γ   B       W  T    ∂   u   1 z +   n     ∂ y   d   Γ   B   ,   n = 1 , 2 …   m   1           (A25)    Q   1 z ±   = i k   γ  n   ∫    Γ   A       W  T    u   1 z ±   n   d   Γ   A   ,   n = 1 , 2 …   m   1           (A26)    Q   1 x x ±   =  ∫    Γ   A       W  T    ∂   u   1 x ±   n     ∂ x   d   Γ   A   ,   n = 1 , 2 …   m   1           (A27)    Q   1 y y ±   =  ∫    Γ   A       W  T    ∂   u   1 y ±   n     ∂ y   d   Γ   A   ,   n = 1 , 2 …   m   1           (A28)    Q   3 z +   = i k   γ  n   ∫    Γ   B       W  T    u   1 z +   n   d   Γ   B   ,   n = 1 , 2 …   m   1           (A29)    Q   3 x x +   =  ∫    Γ   B       W  T    ∂   u   1 x +   n     ∂ x   d   Γ   B   ,   n = 1 , 2 …   m   1           (A30)    Q   3 y y +   =  ∫    Γ   B       W  T    ∂   u   1 y +   n     ∂ y   d   Γ   B   ,  n = 1 , 2 …   m   1           (A31)    M   1 q ±   = i k   γ  m   ∫    Γ   A       u   1 q −   m     u   1 q ±   n   d   Γ   A    ( m = 0 , 1 , ⋯ ,   m   1   ; n = 0 , 1 , ⋯ ,   m   1   )         (A32)    M   1 z x x ±   =  ∫    Γ   A       ∂   u   1 z −   m     ∂ x     u   1 x ±   n   d   Γ   A    ( m = 0 , 1 , ⋯ ,   m   1   ; n = 0 , 1 , ⋯ ,   m   1   )         (A33)    M   1 z y y ±   =  ∫    Γ   A       ∂   u   1 z −   m     ∂ y     u   1 y ±   n   d   Γ   A    ( m = 0 , 1 , ⋯ ,   m   1   ; n = 0 , 1 , ⋯ ,   m   1   )         (A34)    M   1 x x z ±   =  ∫    Γ   A       ∂   u   1 x −   m     ∂ x     u   1 z ±   n   d   Γ   A    ( m = 0 , 1 , ⋯ ,   m   1   ; n = 0 , 1 , ⋯ ,   m   1   )         (A35)    M   1 y y z ±   =  ∫    Γ   A       ∂   u   1 y −   m     ∂ y     u   1 z ±   n   d   Γ   A    ( m = 0 , 1 , ⋯ ,   m   1   ; n = 0 , 1 , ⋯ ,   m   1   )         (A36)    M   3 q ±   = i k   γ  m   ∫    Γ   B       u   1 q +   m     u   1 q ±   n   d   Γ   B    ( m = 0 , 1 , ⋯ ,   m   1   ; n = 0 , 1 , ⋯ ,   m   1   )         (A37)    M   3 z x x ±   =  ∫    Γ   A       ∂   u   1 z +   m     ∂ x     u   1 x ±   n   d   Γ   A    ( m = 0 , 1 , ⋯ ,   m   1   ; n = 0 , 1 , ⋯ ,   m   1   )         (A38)    M   3 z y y ±   =  ∫    Γ   A       ∂   u   1 z +   m     ∂ y     u   1 y ±   n   d   Γ   A    ( m = 0 , 1 , ⋯ ,   m   1   ; n = 0 , 1 , ⋯ ,   m   1   )         (A39)    M   3 x x z ±   =  ∫    Γ   A       ∂   u   1 x +   m     ∂ x     u   1 z ±   n   d   Γ   A    ( m = 0 , 1 , ⋯ ,   m   1   ; n = 0 , 1 , ⋯ ,   m   1   )         (A40)    M   3 y y z ±   =  ∫    Γ   A       ∂   u   1 y +   m     ∂ y     u   1 z ±   n   d   Γ   A    ( m = 0 , 1 , ⋯ ,   m   1   ; n = 0 , 1 , ⋯ ,   m   1   )         (A41)    G   11 ±   =   M   1 x ±   +   M   1 z x x ±   +   M   1 y ±   +   M   1 z y y ±   + τ   M   1 z ±   +  (  τ − 2  )    M   1 x x z ±   +  (  τ − 2  )    M   1 y y z ±           (A42)    G   21   =   Q   1 x −   +   Q   1 z x −           (A43)    G   31   =   Q   1 y −   +   Q   1 z y −           (A44)    G   41 ±   =  (  τ − 2  )    Q   1 x x ±   +  (  τ − 2  )    Q   1 y y ±   ∓ τ   Q   1 z ±           (A45)    G   22   =  (  τ − 1  )    R   x   +   R   1   −   k  2    R   2           (A46)    G   32   =  (  τ − 2  )    R   x y   T   +   R   x y           (A47)    G   42   =  (  τ − 2  )    R   x z   T   +   R   x z           (A48)    G   33   =  (  τ − 1  )    R   y   +   R   1   −   k  2    R   2           (A49)    G   43   =  (  τ − 2  )    R   y z   T   +   R   y z           (A50)    G   44   =  (  τ − 1  )    R   z   +   R   1   −   k  2    R   2           (A51)    G   25   =   Q   3 x +   −   Q   3 z x +           (A52)    G   35   =   Q   3 y +   −   Q   3 z y +           (A53)    G   45   = −  (  τ − 2  )    Q   3 x x +   −  (  τ − 2  )    Q   3 y y +   + τ   Q   3 z +           (A55)    G   55   = −   M   3 x +   +   M   3 z x x +   −   M   3 y +   +   M   3 z y y +   − τ   M   3 z +   +  (  τ − 2  )    M   3 x x z +   +  (  τ − 2  )    M   3 y y z +         REFERENCES", "highlights": "Ultrasonic guided waves are used in the non-destructive testing of pipelines. This involves launching an elastic wave along the wall of the pipe and then capturing the returning wave scattered by a defect. Numerical study of wave scattering is often computationally expensive because the shortest wavelength is often very small compared to the size of the pipe in the ultrasonic frequency range. Furthermore, the number of the scattered wave modes from a non-axisymmetric defect in the pipe can be large and separation of these modes is difficult in a conventional finite element method. Accordingly, this article presents a model suitable for studying elastic wave propagation in waveguides with an arbitrary cross-section in the time and frequency domain. A weighted residual formulation is used to deliver an efficient hybrid numerical formulation, which is applied to a long pipeline containing a defect of arbitrary shape. The problem is solved first in the frequency domain and then extended to the time domain using an inverse Fourier transform. To separate the scattered wave modes in the time domain, a technique is proposed whereby measurement locations are arranged axially along the pipe and a two dimensional Fourier transform is used to present data in the wavenumber−frequency domain. This enables the separation of highly dispersive modes and the recovery of modal amplitudes. This has the potential to reveal more information about the characteristics of a defect and so may help in distinguishing between different type of defects, such a cracks or regions of corrosion, typically found in pipelines."}