{"id": "S0168874X15001134", "article": "MAIN-TITLE Evolutionary topology optimization for natural frequency maximization problems considering acoustic–structure interaction   HIGHLIGHTS          Topology optimization is applied to natural frequency maximization problems.      A displacement/pressure formulation is used to analyze coupled systems.      The proposed optimization procedure is based on the BESO method.      The objective is to maximize natural frequencies of the coupled systems.          KEYPHRASES   Topology optimization  BESO method  Acoustic–structure interaction  Natural frequency  Free vibration   Structural Topology Optimization method for continuum structures [1,2] has gained in popularity and now is used daily as a design tool in industry and academy. The basic idea is to find an optimal distribution of material in a structural design domain considering an objective function and constraints. Commercial topology optimization tools have been developed based on special Finite Element Method (FEM) solvers or have been added in standard commercial packages, many of them concerning stiffness or natural frequencies maximization.  Although the optimization procedures have reached a satisfactory level of maturity, many topics are still open to research. An important group consists of multiphysics problems. Commercial FEM packages often contain solvers for multiphysics problems, however they do not enable optimization.  Through the last 10 years, the methods of topology optimization have been under a considerable scientific effort to be extended to different physical phenomenon problems. One may cite aerolastic structures [3], acoustics design [4–6], thermo-elastic stresses [7], fluid flows [8] and fluid–structure interaction [9–11], acoustic–structure responses [12–14], multiscale analysis [15,16] and others.  The presented work aims to contribute to the design of multiphysics systems, more specifically in acoustic–structure interaction design problems. Yoon et al. [12] proposed a mixed element formulation to model acoustic–structure responses. The method approximated both acoustic and solid domains in an overlapped mixed model, allowing the solid isotropic material with penalization (SIMP) method to be applied. Vicente et al. [14] developed a new sensitivity analysis for the bi-directional evolutionary structural optimization (BESO) method for frequency responses minimization of acoustic–structure systems. The authors considered the minimization of pressures and displacements under harmonic loads. Different from [12,14], herein no loads are applied and free vibration of coupled acoustic–structure systems is considered for eigenvalues maximization. The fluid and solid fields considered here are modeled with the classic finite element formulation from Zienkiewicz and Bettess [17], currently and widely used in commercial codes. In the coupled eigenproblem both acoustic and structural fields strongly influence the vibration modes of the system in all directions since no harmonic excitation is applied. This type of modal analysis has been explored in optimization for purely structural analysis [18–21], but not for free vibration of acoustic–structure problems using the classic formulation.  In order to allow the switch between solid, fluid and void elements, the BESO method is applied. The discrete update scheme of the evolutionary methods allows the use of separate and different governing equations during the optimization problems, such as proposed by Picelli et al. [22]. This overcomes a well known challenge of the classic density based methods in dealing with moving multiphysics loads and interfaces [23,24]. Thus, in the context of multiphysics optimization, the BESO method presents great potential applications specially considering classic formulations, which can be advantageous for the combination of commercial FEM packages and the optimization codes.  The technique so-called Evolutionary Structural Optimization (ESO) was first introduced in the 90s with Xie and Steven [25]. The ESO method was initially proposed as a gradual removal of inefficient material from the design domain until the remaining structure converges to the optimum topology. Material elimination is done after a sensitivity analysis. A later development of this method was called Bi-directional ESO (BESO), in which elements are also added in void positions near to the elements with the highest sensitivity numbers [26]. In the evolutionary optimization methods, the elemental sensitivity number is a local index and represents the sensitivity of the objective function when the element is added or removed. Papers considering the BESO method have presented convergent and mesh independent solutions [27], natural frequencies constraints [20] and others. Recently, Sigmund and Maute [28] and Deaton and Grandhi [29] have cited the evolutionary methods as one class of the main structural topology optimization methods.  The paper is organized as follows: Section 2 presents the governing equations and the finite element model for the acoustic–structure coupled system. In Section 3, the topology optimization problem for free vibration is formulated and the sensitivity analysis is carried out. Details of the method are also described. Section 4 shows the numerical results achieved with the proposed methodology. Finally, conclusions are drawn in Section 5.  Herein, the analyzed systems are limited to free vibration of flexible structures in contact with acoustic fluids. For this system, the structure can be described by the differential equation of motion for a continuum body assuming small deformations and the fluid by the acoustic wave equation [17,30,31]. The governing equations for the fluid and structural domains as well as the coupling boundary conditions are defined as follows.  In this paper, the fluid is considered inviscid, irrotational and only under small translation conditions. The governing equation for the pressure field in a homogeneous acoustic fluid medium can be described by the acoustic wave equation  (1)    1     c   f   2         ∂   2     p   f     ∂   t   2     −   ∇   2     p   f   = 0  in    Ω   f   ,   where   p   f   is the acoustic pressure and   c   f   is the speed of sound in the acoustic domain   Ω   f   . In this paper, the following boundary conditions are considered:  (2)    p   f   =   p   0    on    S   p   ,      (3)  ∇   p   f   ·   n   f   = 0  on    S   f   ,   representing the pressure Dirichlet boundary condition, Eq. (2), applied on the portion of the boundary   S   p   , where p 0 is the constrained pressure, and the hard wall natural boundary condition, Eq. (3), applied on   S   f   , as shown in Fig. 1 .  We consider the equilibrium of a linearly elastic structure in the domain Ω  s . The solid domain is governed by the equilibrium equation  (4)  ∇ ·   σ   s   −   ρ   s       ∂   2     u   s     ∂   t   2     = 0  in    Ω   s   ,   where ∇ ·   σ   s   is the divergence of the Cauchy stress tensor,   ρ   s   is the structural mass density and   u   s   is the structural displacement vector field. In this work the Dirichlet boundary conditions are applied as follows (see Fig. 1):  (5)    u   s   = 0  on    S   u   ,      At the interface   S   fs   between the structural and fluid domains, the fluid and the structure move together in the normal direction of the boundary. The normal vector n =   n   f   = −   n   s   (see Fig. 1) can be used in order to guarantee the equilibrium condition between fluid pressures and structural tractions on   S   fs   :  (6)    σ   s     n   s   =   p   f     n   f    on    S   fs   ,   With relations derived from the governing equations and the previous coupling conditions, the interface forces may be obtained. Using an approximation based on the finite element method (FEM), the force acting on the structure provided by the fluid pressure is [17,30,31]   (7)    f   fs   =   ∫     S   fs       N   s   T     nN   f    d   S   fs      p   f     and the excitation acting on the fluid domain can be expressed in terms of the structural acceleration  (8)    f   sf   = −   ρ   f     ∫     S   fs       N   f   T     nN   s    d   S   fs        u   ¨     s     where   p   f   is the vector of nodal pressure in the fluid elements,   ρ   f   is the mass density of the fluid,   u   s   is the vector of structural displacements in the structural elements and   N   s   and   N   f   contain the finite element shape functions for structural and fluid elements, respectively.  The introduction of a spatial coupling matrix,   L   fs   , where  (9)    L   fs   =   ∫     S   fs       N   s   T     nN   f    d   S   fs     allows the coupling forces to be written as  (10)    f   fs   =   L   fs     p   f     and  (11)    f   sf   = −   ρ   f     L   fs   T       u   ¨     s     where   f   fs   and   f   sf   are the nodal force vectors on the interfaces.  Thus, the fluid–structure problem can be described by an asymmetrical system of equations  (12)  [       M   s     0       ρ   f     L   fs   T       M   f       ] [         u   ¨     s           p   ¨     f       ] + [       K   s     −   L   fs       0     K   f       ] [       u   s         p   f       ] = [     0     0     ]   where   M   s   and   K   s   are the structural mass and stiffness matrices, respectively, and   M   f   and   K   f   are the fluid mass and stiffness matrices, respectively. The vectors of the displacement field   u   s   and the pressure field   p   f   are defined for the whole structural and fluid volumes, respectively. Nevertheless, assuming that the coupling between the fluid and structure domains occurs at the interface, the matrix   L   fs   is defined only at the interface nodes, shared by structural and fluid elements.  Compactly,  (13)  [    M   fs    ] [      u   ¨     fs    ] + [    K   fs    ] [    u   fs    ] = [    f   fs    ]   where   M   fs   and   K   fs   are the acoustic–structure mass and stiffness matrices, respectively. These matrices encompass the structural and fluid matrices, represented by the subscript s for the structural field and f for the acoustic field. The acoustic–structure vibration modes are expressed by the vector   u   fs   , including nodal displacements   u   s   and nodal pressures   p   f   . This finite element model has been used to calculate responses of acoustic–structure or fluid–structure interaction problems as described in the reference books [30,32].  In this section the optimization problem is stated, the sensitivity analysis is derived and the evolutionary procedure is described.  In the evolutionary topology optimization methods for structural problems, the design variable, x  i , is restricted to discrete values 1 and 0 (0 for hard-kill or x  min for the soft-kill procedure), which correspond to solid and void elements, respectively. Then, no intermediate density elements are allowed during the optimization procedures [2]. Herein, the extended BESO method can substitute the solid elements by fluid or void ones [22,14]. With no intermediate densities, solid, void and fluid regions as well as the interface between the domains are explicitly defined.  In free vibration analysis the following eigenproblem is solved to describe the dynamic behavior of an acoustic-structural system:  (14)  (   K   fs   −   ω   k   2     M   fs   )   Φ   k   = 0   where ω  k is the kth natural frequency and Φ  k is the corresponding coupled eigenmode.  Premultiplying Eq. (14) with the transposed eigenvector, Φ  k   T , the eigenvalue ω  k  2 can be related with Φ  k by  (15)    ω   k   2   =     Φ   k   T     K   fs     Φ   k       Φ   k   T     M   fs     Φ   k       which is called the Rayleigh quotient.  For natural frequencies maximization of the described acoustic–structure system, the discrete optimization problem can be defined as  (16)  max :   ω   k   2     x   i   subject  to: V (    x   i    ) /   V   0   =   V   s   (   K   fs   −   ω   k   2     M   fs   )   Φ   k   = 0   x   i   = [    x   min   , 1  ]    V 0 is the full design domain volume, V  s is the prescribed final solid volume fraction and nel is the number of elements inside the design domain. The binary design variable x  i declares the presence of a completely solid element (1) or the density of a void/fluid element with a small value of x  min (e.g. 10−4).  In the evolutionary procedure, the sensitivity of the objective function is required in order to rank the efficiency of the elements after the finite element analysis of the model. Considering that maximizing ω  k  2 is the same as maximizing ω  k , the sensitivity of the objective function due to a structural element removal can be obtained by deriving ω  k with respect to the design variables:  (17)    d   ω   k       dx   i     =   1   2   ω   k     Φ   k   T     M   fs     Φ   k     [  2   ∂   Φ   k   T     ∂   x   i     (    K   fs   −   ω   k   2     M   fs    )   Φ   k   +   Φ   k   T   (    ∂   K   fs     ∂   x   i     −   ω   k   2     ∂   M   fs     ∂   x   i      )   Φ   k    ]   With Eq. (14), the derivative may be simplified as  (18)    d   ω   k       dx   i     =   1   2   ω   k     Φ   k   T     M   fs     Φ   k     [    Φ   k   T   (    ∂   K   fs     ∂   x   i     −   ω   k   2     ∂   M   fs     ∂   x   i      )   Φ   k    ]      In order to evaluate the derivatives of the acoustic–structure mass and stiffness matrices, a material model must be chosen. For the soft-kill BESO method developed in [33], to keep the ratio between mass and stiffness constant when   x   i   =   x   min   it is required that  (19)  ρ (   x   min   ) =   x   min     ρ   s   E (   x   min   ) =   x   min     E   s     where   ρ   s   and   E   s   are the density and Young׳s modulus of the solid material, respectively. To guarantee the previous condition the material interpolation scheme can be done as follows:  (20)  ρ (   x   min   ) =   x   i     ρ   s   E (   x   i   ) = [      x   min   −   x   min   p     1 −   x   min   p     (  1 −   x   i   p    ) +   x   i   p    ]   E   s     where (  0 <   x   min   ≤   x   i   ≤ 1  ) and p is a penalization factor.  Thus, neglecting the alteration in   M   f   ,   K   f   and   L   fs   due to the ith solid element removal, the derivatives of the global acoustic–structure mass and stiffness matrices may be evaluated by  (21)    ∂   M   fs     ∂   x   i     =   M   i   s        (22)    ∂   K   fs     ∂   x   i     =   1 −   x   min     1 −   x   min   p       px   i   p − 1     K   i   s     where   M   i   s   and   K   i   s   are the mass and stiffness matrices of the ith solid element, respectively.  With the derivatives of   K   fs   and   M   fs   from Eqs. (21) and (22) and considering that the eigenvector is mass-normalized (   Φ   k   T     M   fs     Φ   k   = 1 ), the sensitivity for the kth natural frequency is  (23)    d   ω   k       dx   i     =   1   2   ω   k       Φ   k   T   (    1 −   x   min     1 −   x   min   p       px   i   p − 1     K   i   s   −   ω   k   2     M   i   s    )   Φ   k        For the solid–fluid–void design, the sensitivity numbers α  i for natural frequency maximization can be expressed as  (24)    α   i   =   1   p     d   ω   k       dx   i     = {        1   2   ω   k        Φ   k   T   (     1 −   x   min     1 −   x   min   p        K   i   s   −      ω   k   2     p      M   i   s    )   Φ   k   ,     x   i   = 1        1   2   ω   k        Φ   k   T   (       x   min   p − 1   −   x   min   p     1 −   x   min   p        K   i   s   −      ω   k   2     p      M   i   s    )   Φ   k   ,     x   i   =   x   min         or when x  min tends to 0:  (25)    α   i   = {        1   2   ω   k        Φ   k   T   (    K   i   s   −      ω   k   2     p      M   i   s    )   Φ   k   ,     x   i   = 1     −      ω   k     2 p      Φ   k   T     M   i   s     Φ   k   ,     x   i   =   x   min            Sometimes, cases with multiple frequencies optimization might be considered, e.g., both ω  k and ω  k+1 maximization, where the objective function is the sum of ω  k and ω  k+1. For this case, one can mention that the sensitivity numbers are evaluated by the mean value of the sensitivities of both k and k + 1 considered eigenmodes, as shown in [34,35].  The main steps of the extended fluid–structure BESO methodology are given as follows:  1. Discretize the design domain using a finite element (FE) mesh for the given boundary conditions. Initially, the global acoustic–structure mass,   M   fs   , and stiffness,   K   fs   , matrices must be assembled uncoupled assuming that all the degrees of freedom can alternate between displacement and pressure.  Couple and store current design matrices   M   n   and   K   n   with the coupling matrices according to the current design of the nth iteration and the appropriate boundary conditions. Thus, the current matrices become equivalent to the acoustic–structure matrices from Eq. (12).  Perform FE analysis (solve Eq. (14)) on the current design to obtain the eigenvalues, ω  k  2, and the coupled eigenmodes,   Φ   k   .  Evaluate the sensitivity numbers α  i according to Eq. (24).  Apply a filter scheme. Evaluate nodal sensitivity numbers α  j by averaging the elemental sensitivity numbers of the jth connected elements. Project a sub-domain Ψ  i with length scale equal to the filter radius r  min and centered in the ith element. All the nodes inside Ψ  i must have their nodal sensitivity numbers averaged back to the ith elemental level as follows:  (26)    α   i   =     ∑   j = 1   nod   w (   r   ij   )   α   j       ∑   j = 1   nod   w (   r   ij   )     where r  ij is the distance between the node j and the center of the element i, nod is the total number of nodes inside the design domain and w (   r   ij   ) is a weight factor that values   r   min   −   r   ij   for nodes inside the sub-domain Ψ  i and 0 for nodes outside the sub-domain.  Average the sensitivity numbers with their previous iteration ( n − 1 ) numbers as follows:  (27)    α   i   =     α   i   n   +   α   i   n − 1     2     where n is the current iteration number. Huang and Xie [27] have shown that this averaging helps in the stabilization of the optimization process. This procedure demonstrated to be an effective way to avoid convergence problems.  Determine the target structural volume   V   n + 1   for the next iteration n + 1 . The target volume   V   n + 1   is defined as  (28)    V   n + 1   =   V   n   ( 1 ± ER )   where ER is the evolutionary ratio. ER is the percentage of V 0 and increases or decreases   V   n + 1   towards the final prescribed structural volume fraction V  s .  Update the design variables. The target volume   V   n + 1   sets the threshold α  th of the sensitivity numbers. Solid elements (   x   i   = 1 ) with  (29)    α   i   ≤   α   th     are switched to void condition (   x   i   =   x   min   ). Void elements (   x   i   =   x   min   ) are switched to solid condition (   x   i   = 1 ) when  (30)    α   i   >   α   th     Meanwhile, the volume addition ratio (AR) is restricted to a maximum addition ratio AR  max , which declares the maximum allowable addition volume per iteration. Once AR >   AR   max   , only some of the elements with highest sensitivity numbers are switched to   x   i   = 1 in order to set AR =   AR   max   . Then, some of the elements with the lowest sensitivity numbers are switched to   x   i   =   x   min   to satisfy the target volume   V   n + 1   . Each target volume defines the percentage of solid elements that the structure must have in the iteration n + 1 .  Update the fluid region considering the elements with design variable   x   i   =   x   min   . If the void element has at least one fluid element as neighbor, it must be turned also into a fluid element. If the element does not have any fluid neighbors, the element must be kept as void. This procedure is repeated until there are no more changes in the fluid–void regions. In this case, some layers of structural elements nearby the fluid–structure interface can be replaced by fluid elements and void holes appear only inside the structural domain.  Update the original uncoupled global matrices   K   fs   and   K   fs   according to the change of the current design.  Repeat steps 2–11 until the prescribed structural volume fraction is achieved and the convergence criterion with a predefined error tolerance τ is satisfied. The variation in the objective function is calculated as  (31)    |   ∑   m = 1   3     C   n − m + 1   −   ∑   m = 1   3     C   n − m − 2   |     ∑   i = 1   3     C   n − m + 1     ≤ τ   where n is the current iteration number and C is the value of the objective natural frequency ω  k or   ω   k   +   ω   k + 1   for multiple natural frequencies objectives. This equation estimates the change in the objective function during the last 6 iterations of the algorithm.  More details about implementation matters (e.g. filter scheme, element removal/addition and convergence criterion) can be found in [2,27].  In this section, some optimization problems are solved with the proposed BESO method. The first example considers a clamped beam vibrating between two acoustic fluid domains and it is used as a comparison to the literature. The second example proposes the optimization of a tunable resonant device, in which open and closed fluid cavities are used. The last example considers the maximization of the first two natural frequencies of a water dam model.  This first example considers a clamped beam between two acoustic fluid domains. The unitary thickness coupled model (showed in Fig. 2 ) is under free vibration and plane stress condition. This example is similar to the one presented by Yoon et al. [12]. Herein, the solid Young׳s modulus used is 70GPa, the density is 2700kg/m3 and Poisson׳s ratio is 0.3. The fluid domain has density of 1000kg/m3 and the speed of sound in the medium of 1450m/s. An amount of 90,000 finite elements is used to discretize the model.  For this design problem BESO׳s evolutionary ratio is chosen to be as ER = 2 % and the final prescribed volume   V   s   = 50 % . The filter radius used is   r   min   = 60  mm and the penalty factor is p=3. The other parameters are set as   x   min   = 0.001 ,   AR   max   = 5 % and τ = 0.001 . Fig. 3 presents the solution obtained with the initial structure starting from the full design domain and from an initial guess design (thinner clamped beam) with initial volume fraction being most near to V (    x   i    ) = 50 %=   V   s   . This last allows the optimization to be carried out with constant volume during the whole algorithm. Both topologies showed to be similar between each other, with the final natural frequency ω 1=152.31Hz for the solution starting with the full design domain and ω 1=152.41Hz starting with the initial guess design. Both topologies are in accord with the one obtained by Yoon et al. [12], which used the SIMP method and a mixed finite element formulation.  In this example it is possible to observe the main feature of the discrete nature of the BESO method. No intermediate density elements are present in the final solution. This allows the fluid elements to advance and enter the design domain, tracking the fluid–structure interfaces and moving coupled loads. Thus, the coupling integrals can be evaluated straightforwardly in each step of the optimization using the classic formulation from Zienkiewicz and Bettess [17]. Fig. 4 presents some snapshots of the final solution for the case with initial guess design. For the same case, Fig. 5 shows the evolution history of the objective function along the iterations. In this case, the objective function, ω 1 increased from 125.03Hz to 152.41Hz, an increase of almost 22%.  This example aims to maximize the natural frequencies of a tunable device (shown in Fig. 6), which can be set opening or closing its superior fluid domain edge. The closed cavity condition is represented by the hard wall boundary condition ( ∇   p   f   ·   n      f     = 0 , thicker edge line in Fig. 6) and the open cavity is set defining the imposed pressure boundary condition (   p   f   = 0 ) [17]. Both open and closed configurations present different natural frequencies. Numerically, closed cavities present rigid body motion and a zero eigenvalue, which is not of real practice interest and is disregarded here.  The system shown in Fig. 6 is modeled with 99,200 finite elements with a thickness of 0.2m and plane stress condition. The solid Young׳s modulus used is 70GPa, the density is 2700kg/m3 and Poisson׳s ratio is taken as 0.3. The fluid domain has density of 1000kg/m3 and the speed of sound in the medium of 1450m/s. The model is defined with an structural initial guess design as shown in Fig. 6. Fig. 7  presents the first three resonant frequencies of the model for both open and closed configuration.  For the BESO method starting with the initial guess design, the evolutionary ratio is set as ER = 1 % and the prescribed volume fraction   V   s   = 50 % . The other parameters are set as   r   min   = 25  mm ,   AR   max   = 1 % ,   x   min   = 0.0001 , τ = 0.0001 and, finally, the penalty factor p=3. Fig. 8 presents the structural topology solution considering maximization of the first natural frequency, ω 1, for both open and closed fluid cavity configuration. The difference in the topology solutions is expected since the first vibration mode of the coupled system is altered while closing the fluid cavity. This might be related with shifting vibration modes by structural modification. Here, closed fluid cavities can change significantly the practical vibration modes of the coupled system and topology optimization can be used to design structures in order to avoid resonance modes as much as possible. Fig. 9 presents the evolutionary history of the objective function, ω 1, for the open and closed devices. In these cases, the increase ratios on ω 1 are 64% for the open configuration and 52% for the closed configuration.  This example aims to verify the natural frequencies maximization of a water tank model, shown in Fig. 10 . A similar example is discussed in Fig. 2 of the reference paper [17]. Disregarding surface waves, a free surface condition is imposed at the upper edge of the fluid domain as   p   f   = 0 and the hard-wall condition, ∇   p   f   ·   n   f   = 0 , at the inferior and the right edge of the domain. The design domain is considered to have an inclined edge. A solid non-design domain is considered, as represented in Fig. 10. This also can be an initial approximation for a water dam design problem.  With the initial guess design, BESO started with an evolutionary ratio ER = 1 % until a prescribed volume fraction   V   s   = 35 % . The other BESO parameters are set as   r   min   = 75  mm ,   AR   max   = 1 % ,   x   min   = 0.0001 , τ = 0.0001 and p=3. In this example, multiple frequencies maximization is explored. The model is discretized with 76,800 finite elements. The solid Young׳s modulus used is 17GPa, the density is 2400kg/m3 and Poisson׳s ratio is taken as 0.3. The fluid domain has density of 1000kg/m3 and the speed of sound in the medium of 1450m/s. Fig. 11 presents the topology solutions for ω 1 maximization and for both   ω   1   +   ω   2   maximization, as well as the evolutionary history of the objective function for each case.  Considering only the first natural frequency maximization, the value ω 1 increased from 129.50Hz to 205.93Hz, representing an increase of 59%, while the second natural frequency suffered a significant reduction. For the case of multiple frequencies maximization, ω 1 increased from 129.50Hz to 200.97Hz, representing an increase of 55%, almost as the purely ω 1 maximization. In addition, ω 2 did not suffer from the same reduction as in the first case and the objective function   ω   1   +   ω   2   increased from 447.07Hz to 508.29, representing an increase of 14%.  For this example, the fluid–structure interfaces do not change their location, even though, the relation between stiffness and mass summing the coupled contributions of both acoustic and structure fields is changing while structural elements are removed. To illustrate this change, Fig. 12 presents the first two vibration modes for the acoustic field considering the initial guess design and the topologies after the optimization cases. This characterizes the dependency of the responses (eigenmodes) on the coupled acoustic–structure model also for fixed fluid–structure interfaces.   CONCLUSIONS   This paper applied the BESO method developed in [14] to the maximization of the first natural frequencies of acoustic–structure systems. Coupled models under free vibration were designed considering moving multiphysics interfaces as well as fixed boundaries.  The first example consisted of a clamped beam vibrating between two acoustic domains. The solution found is in accordance with results in the literature. In the second example, a tunable device was explored. Closed fluid cavities drastically change the resonance frequencies of the coupled systems, dropping at least one vibration mode to zero frequency, i.e., eliminating it in practical examples. Thus, the coupled modes change. Both open and closed configurations were analyzed considering the first natural frequency maximization. The last example considered a water tank model with fixed solid–fluid boundaries. Even though the interface and the fluid field were kept fixed, it was shown that the pressure modes in the fluid changed from one case to another. This characterizes the coupled dependency of the acoustic–structure model on the vibration modes and, consequently, in the optimization of acoustic–structure free vibration problems.  To the best of the authors׳ knowledge, the combination of acoustic–structure free vibration problems and the evolutionary optimization methods is considered for the first time in this paper. The discrete nature of the BESO method present potential to handle complex multiphysics problems, since the moving interfaces can be explicitly evaluated in each step of the optimization. Thus, with the virtual explosion of the multiphysics optimization problems, the evolutionary methods might be of useful application in science and industrial matters.   ACKNOWLEDGMENTS   The authors are grateful to FAPESP (Sao Paulo Research Foundation) for the financial support for this work [2011/09730-6,2013/08293-7,2013/20022-9].   REFERENCES", "highlights": "This paper aims to extend the evolutionary methods of topology optimization to free vibration problems of acoustic–structure systems. The interacting fluid and structure fields are governed by the acoustic wave equation and the linear elasticity, respectively. Both domains are solved with the finite element method. The coupling conditions are the equilibrium and kinematic compatibility at the acoustic–structure interfaces. The proposed bi-directional evolutionary structural optimization (BESO) method seeks to maximize the first natural frequencies of the acoustic-structural model by switching elements into solid, fluid or void condition. It allows the acoustic–structure boundaries to be modeled and modified straightforwardly, addressing design-dependent loads on the topology optimization problem with simple finite element formulations. The proposed methodology extension is justified by various possible applications to free vibration of acoustic–structure systems such as tanks/reservoirs, acoustic-structural devices, passengers compartments in automobiles and aircrafts and pipelines. Numerical results show that the evolutionary methods can be applied to this kind of multiphysics problem effectively and efficiently."}