{"id": "S0168874X15000426", "article": "MAIN-TITLE A wave-based model reduction technique for the description of the dynamic behavior of periodic structures involving arbitrary-shaped substructures and large-sized finite element models   HIGHLIGHTS          The wave finite element method is used for modeling periodic structures.      Structures are made up of arbitrary-shaped substructures having large-sized FE models.      An efficient eigenproblem is proposed to compute the wave modes accurately.      Fast computation of the wave modes is achieved using a model reduction technique.      Large CPU time savings are obtained when computing the forced response of periodic structures.          KEYPHRASES   Wave finite element method  Periodic structures  Model reduction  Structural dynamics   Predicting the dynamic behavior of complex periodic structures like those encountered in engineering applications, by means of accurate and fast numerical tools, constitutes an open industrial challenge. Popular examples of those periodic structures are aircraft fuselages, chassis frames, phononic crystals, and so on. In many cases, these systems are made up of arbitrary-shaped substructures which are identical to each other and are assembled along one straight direction. Also, those substructures are usually described by means of large-sized FE models, which makes the conventional FE method and related component mode synthesis (CMS) techniques quite inefficient for assessing the dynamic behavior of a whole periodic structure at a reasonable computational cost. The need to reduce the CPU times involved in the computation of the forced response of this kind of periodic structures relates the motivation of the present paper. This issue is addressed here by means of the wave finite element (WFE) method combined with an original model reduction technique.  Originally, the WFE method has been initiated to describe the wave propagation along one-dimensional periodic elastic systems [1,2]. Later on, it has been applied to multi-layered waveguides [3,4], fluid-filled pipes [5,6] and truss beams [7]. The computation of the forced response of bounded elastic waveguides — i.e., periodic structures which are made up of straight substructures — subject to Neumann and Dirichlet boundary conditions (BCs) has been addressed in several ways using the WFE method [8–11]. The procedure consists in assessing the kinematic and mechanical fields of a structure by means of numerical wave modes traveling in right and left directions. Their computation follows by considering a generalized eigenproblem that is expressed from the mass and stiffness matrices of a particular substructure. Besides, the study of coupled systems involving elastic waveguides and elastic junctions has been proposed in [12], while that of truly periodic structures — i.e., structures composed of complex substructures like those encountered in engineering applications — has been proposed in [13]. Actually, there exist two main WFE-based strategies to compute the forced response of periodic structures. These are labeled as dynamic stiffness matrix (DSM) approach and wave amplitudes (WA) approach, and respectively involve expressing the condensed dynamic stiffness matrix of a periodic structure in terms of wave modes [8], or the vectors of wave amplitudes of the right-going and left-going modes [9,12,13].  The feature of the WFE method is that it makes use of the FE model of one single substructure only, rather than considering the full FE model of a whole periodic structure. This makes the WFE method quite fast for describing the dynamic behavior of periodic structures when compared to the conventional FE method and FE-based CMS methods like the Craig–Bampton (CB) method [14]. A proof of this interesting feature is given in [12] along with a qualitative comparison between the WFE method and other numerical wave-based methods.  It should be emphasized, however, that the WFE method has to face several severe issues. One of these is the consideration of periodic structures that contain arbitrary-shaped substructures, i.e., substructures which are not necessarily symmetric with respect to their mid-plane. The issue lies in the computation of the wave modes traveling in right and left directions along a periodic structure, which may not be exactly coherent to each other due to numerical dispersion effects. This particularly means that the wave velocities of a pair of wave modes traveling in opposite directions may not be exactly the same. It has been shown in [13] that this can be the source of ill-conditioned problems, which may greatly impact the description of the dynamic behavior of the structure. As a second issue, the consideration of substructures whose left and right cross-sections contain many degrees of freedom (DOFs) yields a large-sized generalized eigenproblem whose computation at many discrete frequencies may be extremely cumbersome, hence discrediting the WFE method in front of the conventional FE-based approaches.  The aforementioned issues are addressed throughout the present paper. One feature of this work is the use of a generalized eigenproblem based on the so-called S +   S   − 1   transformation to compute the wave modes with accurate precision. In this context, exact analytical relations can be considered so as to ensure the coherence between the right-going and left-going wave modes. Notice that this technique is not new as already proposed in [15,16] within the framework of palindromic quadratic eigenvalue problems. Its potentiality to predict the dynamic behavior of engineering periodic structures has never been investigated so far, however. Besides, the Lanczos method [17] is used to speed up the computation of the WFE eigenproblem with a view to calculating a reduced number of wave modes only. To achieve this task, an error indicator already proposed in [18] is considered to select in an a priori process the number of wave modes that need to be computed. As a second feature of this work, an efficient model reduction technique is proposed which consists in partitioning a whole periodic structure into one central structure surrounded by two extra substructures. In doing so, a few wave modes are only required for modeling the central periodic structure, hence enabling the computation of those wave modes to be achieved in a very fast way by means of the Lanczos method. In this framework, the extra substructures are the same as those composing the whole periodic structure and are modeled by means of the conventional FE method. It is shown that this WFE-based model reduction technique yields a large decrease of the CPU times for assessing the dynamic behavior of periodic structures like those mentioned above. To summarize, the novelties of the present work are described as follows:  (i) To assess the potentiality of the S +   S   − 1   transformation technique — i.e., which involves exact analytical relations to ensure the coherence between right-going and left-going waves — for accurately predicting the wave modes traveling along periodic structures composed of arbitrary-shaped substructures, and further their frequency response functions (FRFs).  To propose an efficient wave-based model reduction technique which can be used for modeling periodic structures composed of substructures with large-sized FE models, and which involves partitioning a whole periodic structure into one central structure surrounded by two extra substructures.  The rest of the paper is organized as follows. In Section 2, the basics of the WFE method for describing the wave propagation along a one-dimensional periodic structure are recalled. The strategy to compute the wave modes by means of a generalized eigenproblem based on the S +   S   − 1   transformation is proposed. Besides, the basics of the DSM and WA approaches are recalled. The advantages and drawbacks of both methods are also discussed. In Section 3, the WFE-based model reduction technique, which consists in partitioning a whole periodic structure into one central structure surrounded by two extra substructures, is fully developed. Within that framework, reduced models that concern the DSM and WA approaches are derived. Numerical experiments are finally brought in Section 4 that concern a 2D structure as well as a 3D stiffened shell with a periodic distribution of longitudinal and circumferential stiffeners.  The basics of the WFE method for describing waves which travel in right and left directions along a one-dimensional periodic structure — i.e., which is composed of identical substructures along a certain straight direction (see Fig. 1 ) — are recalled hereafter.  Within the present framework, the structures are assumed to be linear, elastic and damped by means of a constant loss factor η. Also, they involve excitation sources and kinematic/mechanical fields which are assumed to be harmonic time-dependent, i.e., of the form g ( ω ) exp ( i ω t ) where ω denotes the pulsation. Besides, the substructures are modeled by means of the same FE mesh with the same number (say, n) of DOFs over their left and right boundaries. In matrix form, the dynamic equilibrium equation of a given substructure is expressed in the frequency domain as  (1)  Dq = F ,   where D is the dynamic stiffness matrix of the substructure which remains the same for all the substructures. It is expressed as D = −   ω   2   M + ( 1 + i η ) K where M and K refer to the mass and stiffness matrices, respectively. Also in Eq. (1), q and F are, respectively, the vectors of nodal displacements/rotations and nodal forces/moments of the substructure. The key idea behind the WFE method is to express a relation which links the kinematic/mechanical quantities on the right boundary of the substructure to those on its left boundary. From Eq. (1), it is expressed as [19]   (2)    u   R   =   Su   L   ,   where   u   R   and   u   L   are 2 n × 1 state vectors, expressed as  (3)    u   R   = [       q   R         F   R       ] ,    u   L   = [       q   L       −   F   L       ] .   In Eq. (3), the subscripts L and R denote the DOFs which belong to the left and right boundaries of the substructure, respectively. Also, S is a 2 n × 2 n matrix expressed as  (4)  S = [     −   D   LR   ⁎ − 1     D   LL   ⁎     −   D   LR   ⁎ − 1         D   RL   ⁎   −   D   RR   ⁎     D   LR   ⁎ − 1     D   LL   ⁎     −   D   RR   ⁎     D   LR   ⁎ − 1       ] ,   where   D   ⁎   refers to the dynamic stiffness matrix of the substructure condensed on its left and right boundaries. Notice that the matrix S is symplectic [2], which means that   S   T   JS = J , where  (5)  J = [     0     I   n       −   I   n     0     ] .   Also, the matrix S is d-periodic (d being the length of each substructure), i.e., it remains invariant under a translation of length d.  Besides, the coupling conditions at an interface, labeled as ( k ) , between two consecutive substructures k − 1 and k are expressed as   u   R   ( k )   =   u   L   ( k )   , which results from the continuity of the displacements/rotations and the action–reaction law for the forces/moments. Thus the following equation can be derived which links the kinematic/mechanical quantities on the left boundaries of the substructures k − 1 and k:  (6)    u   L   ( k )   =   Su   L   ( k − 1 )   ,   where the superscript ( k − 1 ) denotes the interface between the substructures k − 2 and k − 1 . According to Bloch׳s theorem [20] and Eq. (6), the state vector   u   L   ( k )   can be expanded as   u   L   ( k )   =   ∑   j   exp ( − i   β   j   d )   Q   j   ( k − 1 )     ϕ   j   , where   {   ϕ   j   }   j   are the right eigenvectors of the matrix S. Also, the eigenvalues of S are expressed as   μ   j   = exp ( − i   β   j   d ) , where   {   β   j   }   j   have the meaning of wavenumbers. Besides, the eigenvectors   {   ϕ   j   }   j   have the meaning of wave shapes that occur on the substructure boundaries and “propagate” along the whole structure from substructure to substructure. Each wave shape can be partitioned as follows:  (7)    ϕ   j   = [       ϕ   q j         ϕ   F j       ] ,   where   ϕ   q j   and   ϕ   F j   are n × 1 vectors of displacement/rotation components and force/moment components, respectively. The parameters   { (   μ   j   ,   ϕ   j   ) }   j   are referred to as the wave modes of the periodic structure. In fact, there are twice as many wave modes as the number of DOFs n used to discretize each substructure boundary. Also, due to the symplectic nature of the matrix S, its eigenvalues come in pairs as (   μ   j   , 1 /   μ   j   ) . This particularly means that the set   { (   μ   j   ,   ϕ   j   ) }   j   can be partitioned into n right-going wave modes   { (   μ   j   ,   ϕ   j   ) }   j = 1 , … , n   for which |   μ   j   | < 1 , and n left-going wave modes   { (   μ   j   ⋆   ,   ϕ   j   ⋆   ) }   j = 1 , … , n   for which   μ   j   ⋆   = 1 /   μ   j   , with |   μ   j   ⋆   | > 1 .  A common way to compute the eigensolutions of the matrix S is to consider the following generalized eigenproblem [2,9]:  (8)    Nw   j   =   μ   j     Lw   j   ,   where  (9)  L = [       I   n     0     −   D   LL   ⁎     −   D   LR   ⁎       ] ,  N = [     0     I   n         D   RL   ⁎       D   RR   ⁎       ] ,   and  (10)    w   j   = [       ϕ   q j         μ   j     ϕ   q j       ] .   The determination of the wave shapes simply follows as   ϕ   j   =   Lw   j   . One feature of the generalized eigenproblem (8) is that it is well conditioned, which is explained since the eigenvectors   {   w   j   }   j   involve displacement/rotation components only, as opposed to the classic eigenvectors   {   ϕ   j   }   j   where displacement/rotation and force/moment components, whose values can be largely disparate, are to be considered together. It should be pointed out that the generalized eigenproblem (8) is usually prone to slight numerical dispersion effects for evaluating the wave modes, which means that the computed eigenvalues for the left- and right-going wave modes may not be exactly linked as   μ   j   ⋆   = 1 /   μ   j   . As explained in [13], this yields ill-conditioned matrix systems for computing the forced response of periodic structures. To solve this issue, a regularization procedure has been proposed in [9] regarding periodic structures composed of symmetric substructures, i.e., substructures which are symmetric with respect to their mid-plane. The procedure consists in computing the right-going wave modes, and expressing the left-going wave modes in closed-form by means of the following analytical relations: (i)   μ   j   ⋆   = 1 /   μ   j   ; (ii)   ϕ   q j   ⋆   = R   ϕ   q j   and   ϕ   F j   ⋆   = − R   ϕ   F j   , where R is a symmetry transformation matrix. It has been proved to be relevant for computing the forced response of structures with accurate precision [12].  Problems arise when non-symmetric substructures are of concern, which is due to the fact that the aforementioned analytical relations (ii) are not valid anymore. To address this issue, a procedure has been proposed in [21] which provides a general closed-form expression of the relations between the left-going and right-going wave shapes. In this framework, a generalized eigenproblem based on a so-called S +   S   − 1   transformation is considered (see Section 2.2.2).  A generalized eigenproblem based on the S +   S   − 1   transformation is proposed for computing the wave modes efficiently. Although the procedure has been analyzed in previous works [21,15], its potentiality to assess the wave modes traveling along complex periodic structures, and further their dynamic behavior, has never been investigated so far. The procedure described in [21,15] is based on the following generalized eigenproblem, which is quite different from Eq. (8):  (11)    N   ′     w   j   ′   =   μ   j     L   ′     w   j   ′   ,   where  (12)    L   ′   = [     0     I   n         D   LR   ⁎     0     ] ,    N   ′   = [       D   RL   ⁎     0     − (   D   LL   ⁎   +   D   RR   ⁎   )   −   I   n       ] ,   and  (13)    w   j   ′   = [       ϕ   q j         1     μ   j       D   RL   ⁎     ϕ   q j       ] .   In Eq. (11), the eigenvalues   {   μ   j   }   j   are the same as those of the matrix S (see Section 2.1). One feature of the eigenproblem (11) is that it preserves in theory the symplectic structure of the problem, i.e., the left-going and right-going wave modes are retrieved as   μ   j   ⋆   = 1 /   μ   j   . This may be explained since the following relation holds [21,15]:  (14)    L   ′     JL   ′ T   =   N   ′     JN   ′ T   .   From Eq. (13), the eigenvectors of the matrix S are expressed as  (15)    ϕ   j   = [       I   n     0       D   RR   ⁎       I   n       ]   w   j   ′   ,    ϕ   j   ⋆   = [       I   n     0       D   RR   ⁎       I   n       ]   w   j   ′ ⋆   ,   where   {   w   j   ′ ⋆   }   j   denote the eigenvectors associated to the eigenvalues   {   μ   j   ⋆   }   j   which are such that |   μ   j   ⋆   | > 1 . To derive Eq. (15), one has used the fact that   ϕ   F j   =   D   RR   ⁎     ϕ   q j   + ( 1 /   μ   j   )   D   RL   ⁎     ϕ   q j   and   ϕ   F j   ⋆   =   D   RR   ⁎     ϕ   q j   ⋆   + ( 1 /   μ   j   ⋆   )   D   RL   ⁎     ϕ   q j   ⋆   , which results from the dynamic equilibrium equation of a substructure, i.e.,   F   R   =   D   RR   ⁎     q   R   +   D   RL   ⁎     q   L   .  Notice that the eigenvectors   {   w   j   ′   }   j   and   {   w   j   ′ ⋆   }   j   are partitioned into displacement/rotation and force/moment components whose values can be largely disparate, meaning that the eigenproblem (11) is likely to be ill-conditioned. To solve this issue, the so-called S +   S   − 1   transformation of the eigenproblem (11) is considered [16], which yields an eigenproblem whose eigenvalues are of the form   λ   j   =   μ   j   + 1 /   μ   j   , i.e.,  (16)  (  (   N   ′     JL   ′ T   +   L   ′     JN   ′ T   ) −   λ   j     L   ′     JL   ′ T    )   z   j   = 0 ,   where  (17)    N   ′     JL   ′ T   +   L   ′     JN   ′ T   = [       D   RL   ⁎   −   D   LR   ⁎     (   D   LL   ⁎   +   D   RR   ⁎   )     − (   D   LL   ⁎   +   D   RR   ⁎   )     D   RL   ⁎   −   D   LR   ⁎       ] ,   and  (18)    L   ′     JL   ′ T   =   N   ′     JN   ′ T   = [     0   −   D   RL   ⁎         D   LR   ⁎     0     ] .   One feature of the eigenproblem (16) is that it involves skew-symmetric matrices which are useful for speeding up the computation of the eigensolutions. Also, the eigenvectors   {   z   j   }   j   are expressed in terms of displacement/rotation components only. It is worth recalling that the eigenvalues of the eigenproblem (11) (or (8)) come in pairs as (   μ   j   ,   μ   j   ⋆   = 1 /   μ   j   ) , meaning that the eigenvalues of the eigenproblem (16) are double, i.e., (   λ   j   ,   λ   j   ⋆   =   λ   j   ) . By considering the fact that   λ   j   =   μ   j   + 1 /   μ   j   , each pair of eigenvalues (   μ   j   ,   μ   j   ⋆   ) can be found analytically by solving a quadratic equation of the form  (19)    x   2   −   λ   j   x + 1 = 0 ,   where it is understood that the relation   μ   j   ⋆   = 1 /   μ   j   can be verified with accurate precision. Also, there exist closed-form expressions linking the eigenvectors of the eigenproblem (16) to those of the eigenproblem (11) (see [21]):  (20)    w   j   ′   = J (   L   ′ T   −   μ   j   ⋆     N   ′ T   )   z   j   ,    w   j   ′ ⋆   = J (   L   ′ T   −   μ   j     N   ′ T   )   z   j   .   A proof of this result follows from the following factorizations of Eq. (16):  (21)  (    N   ′   J (   L   ′ T   − ( 1 /   μ   j   )   N   ′ T   ) −   μ   j     L   ′   J (   L   ′ T   − ( 1 /   μ   j   )   N   ′ T   )  )   z   j   = 0 ,      (22)  (    N   ′   J (   L   ′ T   −   μ   j     N   ′ T   ) − ( 1 /   μ   j   )   L   ′   J (   L   ′ T   −   μ   j     N   ′ T   )  )   z   j   = 0 ,   which means that J (   L   ′ T   − ( 1 /   μ   j   )   N   ′ T   )   z   j   and J (   L   ′ T   −   μ   j     N   ′ T   )   z   j   are eigenvectors of the eigenproblem (11) for the eigenvalues μ j and   μ   j   ⋆   = 1 /   μ   j   , respectively. Once the eigenvectors   {   w   j   ′   }   j   and   {   w   j   ′ ⋆   }   j   are computed, the wave shapes   {   ϕ   j   ′   }   j   and   {   ϕ   j   ′ ⋆   }   j   are determined from Eq. (15). Remark For large-scale structures, it can be interesting to compute a reduced number of eigenvalues and eigenvectors, only. For instance, by considering a parameter α > 1 , it is readily seen from the relation   λ   j   =   μ   j   + 1 /   μ   j   that if 1 / α < |   μ   j   | < α , then |   λ   j   | < α + 1 . So, choosing an eigensolver to compute those eigenvalues λ  j which are such that |   λ   j   | < α + 1 , for a given α > 1 , also provides the eigenvalues μ  j which are such that 1 / α < |   μ   j   | < α .   INTRODUCTION   The basics of the WFE method for computing the forced response of periodic structures are recalled hereafter. Emphasis will be placed on the study of periodic structures whose left and right ends are connected to elastic subsystems, as shown in Fig. 2 , because they will be of primary concern in the wave-based model reduction technique proposed in Section 3.  In fact, there exist two main strategies for computing the forced response of a periodic structure, namely the dynamic stiffness matrix (DSM) approach and the wave amplitude (WA) approach. The DSM approach focuses on expressing a matrix relation to link the vector of forces/moments to that of displacements/rotations on the left and right ends of the structure. This yields a super-element formulation which appears to be completely similar to that proposed by the conventional FE method. The difference between the WFE and FE procedures lies in the use of wave modes for expressing the DSM [3,8]. On the other hand, the WA approach focuses on assessing the wave reflection/transmission coefficients at the BCs while considering the spatial variation of the wave amplitudes along the structure. This leads to the derivation of linear matrix systems whose resolution provides the vectors of amplitudes of the right-going and left-going wave modes [12].  While the DSM approach appears to be easy of use as dealing with the conventional matrix equations of the FE method, the WA approach involves wave-based formulations which need to be investigated on a case-by-case basis. In contrast, the WA approach involves matrix systems which are rather simple and well-conditioned compared to those provided by the DSM approach. This is explained because the WA approach deals with vectors of wave amplitudes whose variation along the structure is governed in a very simple way in terms of diagonal matrices. Also, the computation of the WA-based matrix systems requires less CPU times than the DSM approach. For the sake of clarity, the basics of the DSM and WA approaches are recalled hereafter.  The framework of the DSM approach is to consider the following matrix equation, which links the DOFs on the left and right ends of a periodic structure made up of N substructures:  (23)  [       F   L   ( 1 )         F   R   ( N + 1 )       ] =   D   s   [       q   L   ( 1 )         q   R   ( N + 1 )       ] ,   where the superscripts ( 1 ) and ( N + 1 ) denote the left and right ends of the structure, respectively. Also,   D   s   is the dynamic stiffness matrix of the structure which is condensed on its left and right ends. It is expressed as (see Appendix A for further details)  (24)    D   s   = [       D   LL   ⁎     0     0     D   RR   ⁎       ] + [       D   LR   ⁎     0     0     D   RL   ⁎       ] [       Φ   q   ⋆     μ   N − 1     Φ   q   ⋆ − 1       Φ   q   μ   Φ   q   − 1         Φ   q   ⋆   μ   Φ   q   ⋆ − 1       Φ   q     μ   N − 1     Φ   q   − 1       ] ×   [       Φ   q   ⋆     μ   N     Φ   q   ⋆ − 1       I   n         I   n       Φ   q     μ   N     Φ   q   − 1       ]   − 1   ,   where   Φ   q   and   Φ   q   ⋆   are square n × n matrices defined as   Φ   q   = [   ϕ   q 1   ⋯   ϕ   q n   ] and   Φ   q   ⋆   = [   ϕ   q 1   ⋆   ⋯   ϕ   q n   ⋆   ] . Also, μ is a n × n diagonal matrix whose components relate the eigenvalues for the right-going wave modes (see Section 2.1), i.e., μ = diag   {   μ   j   }   j = 1 , … , n   . Notice that the 2-norm [17] of the matrix μ is less than one, i.e., ∥ μ   ∥   2   < 1 , which is explained because ∥ μ   ∥   2   = max |   μ   j   | < 1 by convention (see below Eq. (7)).  The dynamic stiffness matrix   D   s   of the periodic structure can be readily assembled with the dynamic stiffness matrices of other elastic subsystems as this is usually done in the FE method, with a view to expressing a global dynamic stiffness matrix   D   t   . For instance, consider the global structure shown in Fig. 2, composed of three subparts — i.e., a subsystem 1 with a dynamic stiffness matrix   D   1   , a periodic structure with N substructures which is modeled by means of the dynamic stiffness matrix   D   s   (Eq. (24)), and a subsystem 2 with a dynamic stiffness matrix   D   2   . In this case, the global dynamic stiffness matrix   D   t   of the coupled system is expressed as  (25)    D   t   =   L   1   T     D   1     L   1   +   L   s   T     D   s     L   s   +   L   2   T     D   2     L   2   ,   where   L   1   and   L   2   are Boolean incidence matrices which “map” the DOFs in the local coordinate spaces of the subsystems 1 and 2, respectively, to the global coordinate space of the coupled system. Also,   L   s   is a Boolean incidence matrix which maps the DOFs on the left and right boundaries of the periodic structure, in its local coordinate space, to the global coordinate space of the coupled system. Notice that the subsystems 1 and 2 can be subject to arbitrary vectors of prescribed displacements/rotations and forces/moments. As a result, the dynamic equilibrium equation of the coupled system is expressed as  (26)    D   t   q = F ,   where q represents the global vector of displacements/rotations which takes into account the DOFs of the subsystems 1 and 2, as well as the DOFs on the left and right boundaries of the periodic structure. Also, F represents a global vector of forces/moments which reflects the excitation sources applied to the coupled system. The determination of the global vector of displacements/rotations hence follows by solving the linear system (26), i.e., q =   D   t   − 1   F .  Consider a periodic structure composed of N substructures and denote as ( k ) ( k = 1 , … , N + 1 ) a given substructure boundary, i.e., either the interface between two consecutive substructures or a limiting end of the whole periodic structure. Within the WFE framework, the vectors of displacements/rotations and forces/moments on the substructure boundary (k) are estimated by means of a wave expansion as follows [13]:  (27)    q   ( k )   =   Φ   q     μ   k − 1   Q +   Φ   q   ⋆     μ   N + 1 − k     Q   ⋆   ,  ±   F   ( k )   =   Φ   F     μ   k − 1   Q +   Φ   F   ⋆     μ   N + 1 − k     Q   ⋆   ,   where   Φ   q   ,   Φ   q   ⋆   ,   Φ   F   and   Φ   F   ⋆   are square n × n matrices defined as   Φ   q   = [   ϕ   q 1   ⋯   ϕ   q n   ] ,   Φ   q   ⋆   = [   ϕ   q 1   ⋆   ⋯   ϕ   q n   ⋆   ] ,   Φ   F   = [   ϕ   F 1   ⋯   ϕ   F n   ] and   Φ   F   ⋆   = [   ϕ   F 1   ⋆   ⋯   ϕ   F n   ⋆   ] . It has been proved in [9] that these matrices are full rank, which means that they can be inverted without difficulty. Also, in Eq. (27), Q and   Q   ⋆   are vectors of wave amplitudes at the left and right ends of the whole periodic structure, respectively. Finally, the sign ahead of F results from the choice of description considered, i.e., it is negative when the left boundary of a substructure is of concern, and positive for the right boundary.  The determination of the vectors of wave amplitudes Q and   Q   ⋆   involves considering the BCs on the left and right ends of the whole periodic structure. For instance, regarding the case shown in Fig. 2 when the left and right ends of the periodic structure are connected to extra elastic subsystems, the BCs are expressed as (see Appendix B for further details)  (28)  −   F   L   ( 1 )   = D   q   L   ( 1 )   +   D   q     q   0   +   D   F     F   0   ,  −   F   R   ( N + 1 )   =   D   ⋆     q   R   ( N + 1 )   +   D   q   ⋆     q   0   ⋆   +   D   F   ⋆     F   0   ⋆   ,   where D and   D   ⋆   denote the dynamic stiffness matrices of the subsystems which are condensed on the interface DOFs. Also,   D   q   and   D   q   ⋆   (resp.   D   F   and   D   F   ⋆   ) are matrices which reflect the effects of vectors of prescribed displacements/rotations (   q   0   ,   q   0   ⋆   ) (resp. vectors of prescribed forces/moments (   F   0   ,   F   0   ⋆   )) that may be applied to the subsystems.  By considering the wave expansion (27), the BCs can be expressed in wave-based form as follows:  (29)  Q = C   μ   N     Q   ⋆   + F ,    Q   ⋆   =   C   ⋆     μ   N   Q +   F   ⋆   ,   where C and   C   ⋆   are n × n scattering matrices whose components relate the reflection coefficients for the wave modes incident to the boundaries, while F and   F   ⋆   are n × 1 vectors which relate the effects of the excitation sources. Expressions for C ,   C   ⋆   , F and   F   ⋆   follow from the aforementioned BCs, i.e.:  (30)  C = −   [ D   Φ   q   −   Φ   F   ]   − 1   [ D   Φ   q   ⋆   −   Φ   F   ⋆   ] ,    C   ⋆   = −   [   D   ⋆     Φ   q   ⋆   +   Φ   F   ⋆   ]   − 1   [   D   ⋆     Φ   q   +   Φ   F   ] ,      (31)  F = −   [ D   Φ   q   −   Φ   F   ]   − 1   [   D   q     q   0   +   D   F     F   0   ] ,    F   ⋆   = −   [   D   ⋆     Φ   q   +   Φ   F   ]   − 1   [   D   q   ⋆     q   0   ⋆   +   D   F   ⋆     F   0   ⋆   ] .   By considering the wave-based BCs, Eq. (29), a whole matrix equation is established as follows:  (32)  AQ = F ,   where  (33)  A = [       I   n     − C   μ   N       −   C   ⋆     μ   N       I   n       ] ,  Q = [     Q       Q   ⋆       ] ,  F = [     F       F   ⋆       ] .   Solving the matrix equation (32) yields the vectors of wave amplitudes as Q =   A   − 1   F . The feature of the proposed wave-based formulation is that the matrix A is likely to be well-conditioned, as explained in [9,12]. Hence, it can be inverted without difficulty. Finally, once the vectors of wave amplitudes are computed, the vectors of nodal displacements/rotations and forces/moments of the periodic structure can be estimated by means of the wave expansion (27).  As it is well known, waves traveling along a structure like the one shown in Fig. 1 can be classified into weakly evanescent, which would be propagative if there were no damping, and strongly evanescent, i.e., which decay exponentially from the excitation sources. So, one may assume that far from the sources these evanescent waves are weakly contributing to the structure dynamics. Besides, one expects a large amount of CPU times to be saved, e.g., when expressing the dynamic stiffness matrix of a periodic structure in wave-based form as in Eq. (24), rather than assembling the elementary FE matrices of all the substructures explicitly. This constitutes one interesting feature of the WFE method, which remains however verified provided that a reasonable number of wave modes are used for expressing the dynamic stiffness matrix of the structure. The issue may be viewed as to overcome the computation of a full set of wave modes that may be extremely cumbersome in case when the substructures have large-sized FE models. More generally, the determination of the FRF of a periodic structure by means of the WFE method requires the following numerical tasks to be carried out at several discrete frequencies [13]:  (i) Computation of the 2 n × 2 n condensed dynamic stiffness matrix   D   ⁎   of a substructure (Section 2.1).  Computation of the 2 n × 2 n eigenproblem (16).  Computation of the 2 n × 2 n dynamic stiffness matrix of the structure (Eq. (24) or (25)), or the 2 n × 2 n matrix A (Eq. (33)), and its inverse.  The strategy to determine the number m of wave modes to be computed by means of the Lanczos method may be carried out by considering an error analysis like the one proposed in [18] (see Section 3.3). Notice that this number can be large to ensure the convergence of the WFE method for describing the vectors of nodal displacements/rotations and forces/moments of the structure. This is understood because high-order wave shapes, which are associated to strongly evanescent waves, are usually required to describe the BCs of the structure on its left and right ends. This is explained because BCs usually involve stress fields which can be locally sharp in space, as well as highly fluctuating. One attempt which solves this issue is to partition the whole periodic structure into three parts as shown in Fig. 3 . Here, a central periodic structure consisting of N − 2 substructures is considered which is surrounded by two extra substructures. Such a central periodic structure is analyzed by means of the WFE method (Section 2.3), while the extra substructures are modeled by means of the FE method and are treated as BCs like those involved in Eq. (25), or Eqs. (30) and (31). The motivation behind this partitioning is that the stress fields induced by the BCs on the left and right ends of the whole system are expected to be smooth over the interfaces between the central structure and the extra substructures. In other words, the number of wave modes that is required for modeling the central periodic structure is expected to be much smaller than that required in case of no extra substructures. This means CPU time savings regarding the computation of wave modes by means of the Lanczos method. Such a model reduction strategy, consisting in partitioning a whole periodic structure into one central structure modeled by means of a few wave modes and surrounded by two extra FE substructures, constitutes the main originality of the present work. The related reduced modelings are developed in Section 3.2 regarding both the DSM and WA approaches. Also, the selection process of the wave modes that need to be retained for modeling the central periodic structure is analyzed in Section 3.3 in accordance with past studies [18].  Prior to any rigorous derivation, a simple qualitative analysis is proposed here to quantify the error made when some strong evanescent wave modes are neglected in the WFE-based formulations.  Consider the central periodic structure as shown in Fig. 3, which is enclosed between the substructure boundary (1) — namely, the right boundary of the left extra substructure — and the substructure boundary ( N − 1 ) — namely, the left boundary of the right extra substructure. Assume that the excitation sources occur on the left boundary of the left extra substructure, and the right boundary of the right extra substructure, only. Denote as Q the vector of wave amplitudes at the left end of the left extra substructure, and   Q   ⋆   the vector of wave amplitudes at the right end of the right extra substructure. By considering the wave expansion (27), the vectors of displacements/rotations and forces/moments along the central periodic structure are expressed as  (34)    q   ( k )   =   Φ   q     μ   k   Q +   Φ   q   ⋆     μ   N − k     Q   ⋆   ,  ±   F   ( k )   =   Φ   F     μ   k   Q +   Φ   F   ⋆     μ   N − k     Q   ⋆   ,   where 1 ≤ k ≤ N − 1 . Eq. (34) can also be written as  (35)    q   ( k )   =   ∑   j = 1   n   (    μ   j   k     q   j   +   μ   j   N − k     q   j   ⋆    ) =   ∑   j = 1   n     μ   j   (    μ   j   k − 1     q   j   +   μ   j   N − 1 − k     q   j   ⋆    ) ,      (36)  ±   F   ( k )   =   ∑   j = 1   n   (    μ   j   k     F   j   +   μ   j   N − k     F   j   ⋆    ) =   ∑   j = 1   n     μ   j   (    μ   j   k − 1     F   j   +   μ   j   N − 1 − k     F   j   ⋆    ) ,   where   q   j   =   Q   j     Φ   q j   ,   q   j   ⋆   =   Q   j   ⋆     Φ   q j   ,   F   j   =   Q   j     Φ   F j   and   F   j   ⋆   =   Q   j   ⋆     Φ   F j   ⋆   . Since the integer k is such that 1 ≤ k ≤ N − 1 , one has k − 1 ≥ 0 and N − 1 − k ≥ 0 , and then |   μ   j     |   k − 1   ≤ 1 and |   μ   j     |   N − 1 − k   ≤ 1 . This is explained because |   μ   j   | < 1 by convention (see below Eq. (7)). Let us denote as     q   ¯     ( k )   and     F   ¯     ( k )   the parts of the vectors of displacements/rotations and forces/moments which are induced by strongly evanescent wave modes, only. Denote as   { (     μ   ¯     j   ,     ϕ   ¯     j   ) }   j = 1 , … , n − m   and   { (     μ   ¯     j   ⋆   ,     ϕ   ¯     j   ⋆   ) }   j = 1 , … , n − m   those evanescent wave modes which are such that   { (     μ   ¯     j   ,     ϕ   ¯     j   ) }   j = 1 , … , n − m   ⊂   { (   μ   j   ,   ϕ   j   ) }   j = 1 , … , n   and   { (     μ   ¯     j   ⋆   ,     ϕ   ¯     j   ⋆   ) }   j = 1 , … , n − m   ⊂   { (   μ   j   ⋆   ,   ϕ   j   ⋆   ) }   j = 1 , … , n   where m > 1 . From Eqs. (35) and (36),     q   ¯     ( k )   and     F   ¯     ( k )   are expressed as  (37)      q   ¯     ( k )   =   ∑   j = 1   n − m       μ   ¯     j   (      μ   ¯     j   k − 1       q   ¯     j   +     μ   ¯     j   N − 1 − k       q   ¯     j   ⋆    ) ,      (38)  ±     F   ¯     ( k )   =   ∑   j = 1   n − m       μ   ¯     j   (      μ   ¯     j   k − 1       F   ¯     j   +     μ   ¯     j   N − 1 − k       F   ¯     j   ⋆    ) .   Thus, by invoking the norms of     q   ¯     ( k )   and     F   ¯     ( k )   , this yields  (39)  ∥     q   ¯     ( k )   ∥ ≤   ∑   j = 1   n − m   |     μ   ¯     j   | (  ∥     q   ¯     j   ∥ + ∥     q   ¯     j   ⋆   ∥  ) ,      (40)  ∥     F   ¯     ( k )   ∥ ≤   ∑   j = 1   n − m   |     μ   ¯     j   | (  ∥     F   ¯     j   ∥ + ∥     F   ¯     j   ⋆   ∥  ) ,   where ∥ · ∥ denotes the 2-norm. Since highly evanescent wave modes are of concern, one expects |     μ   ¯     j   | ≪ 1 . To summarize, it seems logical from Eqs. (39) and (40) to neglect these wave modes.   INTRODUCTION   The WFE-based reduced models, which use the aforementioned concept of a central periodic structure that is modeled by means of the WFE method and surrounded by two extra substructures (Fig. 3), are developed in the subsequent sections. Section 3.2.2 addresses the use of the DSM approach (see Section 2.3.2) for modeling the central periodic structure, while Section 3.2.3 deals with the WA approach (see Section 2.3.3). The key idea behind the proposed reduced models is to expand the vectors of displacements/rotations and forces/moments of the central periodic structure onto a reduced basis of wave shapes   {     ϕ   ˜     j   }   j = 1 , … , m   ∪   {     ϕ   ˜     j   ⋆   }   j = 1 , … , m   , as explained in Section 3.1. This will be detailed in Section 3.2.3. The strategy to determine the number m of right-going and left-going wave modes, which need to be computed by means of the Lanczos method (cf. Section 3.1), will be developed in Section 3.3.  By expanding the vectors of displacements/rotations and forces/moments of the structure onto the reduced wave basis   {     ϕ   ˜     j   }   j = 1 , … , m   ∪   {     ϕ   ˜     j   ⋆   }   j = 1 , … , m   , the dynamic stiffness matrix of the central periodic structure — namely,   D   s   r   — can be approximated as   D   s   r   ≈     D   ˜     s   r   , where     D   ˜     s   r   is defined so that  (41)  [         F   ˜     L   ( 1 )           F   ˜     R   ( N − 1 )       ] =     D   ˜     s   r   [         q   ˜     L   ( 1 )           q   ˜     R   ( N − 1 )       ] .   Here,     q   ˜     L   ( 1 )   and     F   ˜     L   ( 1 )   (resp.     q   ˜     R   ( N − 1 )   and     F   ˜     R   ( N − 1 )   ) refer to the approximated vectors of displacements/rotations and forces/vectors, respectively, on the left (resp. right) end of the central structure. The derivation of the dynamic stiffness matrix     D   ˜     s   r   follows from that of   D   s   (Appendix A), i.e.:  (42)      D   ˜     s   r   = [       D   LL   ⁎     0     0     D   RR   ⁎       ] + [       D   LR   ⁎     0     0     D   RL   ⁎       ] [         Φ   ˜     q   ⋆       μ   ˜     N − 3       Φ   ˜     q   ⋆ +         Φ   ˜     q     μ   ˜       Φ   ˜     q   +           Φ   ˜     q   ⋆     μ   ˜       Φ   ˜     q   ⋆ +         Φ   ˜     q       μ   ˜     N − 3       Φ   ˜     q   +       ] ×   [         Φ   ˜     q   ⋆       μ   ˜     N − 2       Φ   ˜     q   ⋆ +       I   m         I   m         Φ   ˜     q       μ   ˜     N − 2       Φ   ˜     q   +       ]   − 1     where     Φ   ˜     q   and     Φ   ˜     q   ⋆   are n × m rectangular matrices defined so that     Φ   ˜     q   = [     ϕ   ˜     q 1   ⋯     ϕ   ˜     q m   ] and     Φ   ˜     q   ⋆   = [     ϕ   ˜     q 1   ⋆   ⋯     ϕ   ˜     q m   ⋆   ] ; also   μ   ˜   is a m × m diagonal matrix defined as   μ   ˜   = diag   {     μ   ˜     j   }   j = 1 , … , m   ; finally,     Φ   ˜     q   +   and     Φ   ˜     q   ⋆ +   are the left pseudo-inverses of     Φ   ˜     q   and     Φ   ˜     q   ⋆   , which are defined so that     Φ   ˜     q   +   =   [     Φ   ˜     q   H       Φ   ˜     q   ]   − 1       Φ   ˜     q   H   and     Φ   ˜     q   ⋆ +   =   [     Φ   ˜     q   ⋆ H       Φ   ˜     q   ⋆   ]   − 1       Φ   ˜     q   ⋆ H   , where the superscript H is the conjugate transpose.  The dynamic stiffness matrix     D   ˜     s   r   is to be assembled with the dynamic stiffness matrices of the left and right extra substructures (Fig. 3) to express the dynamic stiffness matrix     D   ˜     s   of the whole periodic structure, i.e., the one composed of N substructures. This is done by following the same method as in Eq. (25). Ultimately, the dynamic stiffness matrix     D   ˜     s   of the whole periodic structure might be assembled with those issued from other components with a view to modeling complex coupled systems.  It is worth pointing out that the computation of the dynamic stiffness matrix     D   ˜     s   r   of the central periodic structure can be achieved in a very fast way, as opposed to the conventional reduction techniques like the Craig–Bampton (CB) method. Indeed, the proposed reduced modeling invokes a few wave modes which are solutions of an eigenproblem with a small size ( 2 n × 2 n ), even though those few wave modes need to be computed at several discrete frequencies. This leads to the consideration of small matrices of eigenvectors   {     ϕ   ˜     j   }   j   and   {     ϕ   ˜     j   ⋆   }   j   which do not necessitate excessive memory storage. On the other hand, the CB method usually involves fully populated matrices of static modes and fixed interface modes with a large number of rows — indeed, these are linked to the number of internal DOFs of the whole structure which can be large in case when a large number of substructures are dealt with — hence requiring high memory storage. Besides, as it is well known for complex structures, a large number of fixed interface modes are usually required to achieved the convergence of the CB solutions, i.e., their computation necessitates high CPU times. These concepts will be clearly highlighted in Section 4.3.  From Eq. (27), the approximated vectors of nodal displacements/rotations and forces/moments on a substructure boundary ( k ) ( 1 ≤ k ≤ N − 1 ) along the central periodic structure are expressed as  (43)      q   ˜     ( k )   =     Φ   ˜     q       μ   ˜     k − 1     Q   ˜   +     Φ   ˜     q   ⋆       μ   ˜     N − 1 − k       Q   ˜     ⋆   ,  ±     F   ˜     ( k )   =     Φ   ˜     F       μ   ˜     k − 1     Q   ˜   +     Φ   ˜     F   ⋆       μ   ˜     N − 1 − k       Q   ˜     ⋆   ,   where     Φ   ˜     q   = [     ϕ   ˜     q 1   ⋯     ϕ   ˜     q m   ] ,     Φ   ˜     q   ⋆   = [     ϕ   ˜     q 1   ⋆   ⋯     ϕ   ˜     q m   ⋆   ] ,     Φ   ˜     F   = [     ϕ   ˜     F 1   ⋯     ϕ   ˜     F m   ] and     Φ   ˜     F   ⋆   = [     ϕ   ˜     F 1   ⋆   ⋯     ϕ   ˜     F m   ⋆   ] . Also note that, within the present framework,   Q   ˜   (resp.     Q   ˜     ⋆   ) is to be understood as the vector of wave amplitudes of the right-going (resp. left-going) wave modes at the left (resp. right) end of the central structure. The computation of   Q   ˜   and     Q   ˜     ⋆   follows from the following reduced matrix equation (cf. Eq. (32)):  (44)    A   ˜     Q   ˜   =   F   ˜   ,   where  (45)    A   ˜   = [       I   m     −   C   ˜       μ   ˜     N − 2       −     C   ˜     ⋆       μ   ˜     N − 2       I   m       ] ,    Q   ˜   = [       Q   ˜           Q   ˜     ⋆       ] ,    F   ˜   = [       F   ˜           F   ˜     ⋆       ] .   In Eq. (45),   C   ˜   and     C   ˜     ⋆   are m × m scattering matrices which relate the coupling conditions with the extra substructures. Also,   F   ˜   and     F   ˜     ⋆   are m × 1 vectors which relate the excitation sources on the left and right ends of the central periodic structure, respectively. The expressions of   C   ˜   ,     C   ˜     ⋆   ,   F   ˜   and     F   ˜     ⋆   follow from the use of the matrices     Φ   ˜     q   ,     Φ   ˜     q   ⋆   ,     Φ   ˜     F   and     Φ   ˜     F   ⋆   in Eqs. (30) and (31), rather than   Φ   q   ,   Φ   q   ⋆   ,   Φ   F   and   Φ   F   ⋆   , i.e.:  (46)    C   ˜   = −   [ D     Φ   ˜     q   −     Φ   ˜     F   ]   +   [ D     Φ   ˜     q   ⋆   −     Φ   ˜     F   ⋆   ] ,      C   ˜     ⋆   = −   [   D   ⋆       Φ   ˜     q   ⋆   +     Φ   ˜     F   ⋆   ]   +   [   D   ⋆       Φ   ˜     q   +     Φ   ˜     F   ] ,      (47)    F   ˜   = −   [ D     Φ   ˜     q   −     Φ   ˜     F   ]   +   [   D   q     q   0   +   D   F     F   0   ] ,      F   ˜     ⋆   = −   [   D   ⋆       Φ   ˜     q   +     Φ   ˜     F   ]   +   [   D   q   ⋆     q   0   ⋆   +   D   F   ⋆     F   0   ⋆   ] ,   where the superscript + denotes the left pseudo-inverse. Also, D and   D   ⋆   stand for the condensed dynamic stiffness matrices of the extra substructures. Recall that the extra substructures are completely similar to those composing the central periodic structure, i.e., their dynamic stiffness matrices D and   D   ⋆   can be readily obtained from a previous analysis.  The selection of the number m of right-going and left-going wave modes in the central periodic structure that need to be computed from the Lanczos method is addressed here using the strategy proposed in [18]. In this work, it is suggested to bound the relative errors, for the vectors of nodal displacements/rotations and forces/moments, as follows:  (48)    ∥     q   ˜     ( k )   −   q   ( k )   ∥   ∥   q   ( k )   ∥   ≤   E   s   ,    ∥     F   ˜     ( k )   −   F   ( k )   ∥   ∥   F   ( k )   ∥   ≤   E   s    ∀ k ,   where  (49)    E   s   = max {  [  (   ϵ   1   E   +   ϵ   2   E   ) +   ∥   A   s   ∥   1 − ∥   A   s   ∥   (   ϵ   1   A   +   ϵ   2   A   )  ]   1 + ∥   A   s   ∥   1 − ∥   A   s   ∥   ,   [  (   ϵ   1     E   ⋆     +   ϵ   2     E   ⋆     ) +   ∥   A   ⋆ s   ∥   1 − ∥   A   ⋆ s   ∥   (   ϵ   1     A   ⋆     +   ϵ   2     A   ⋆     )  ]   1 + ∥   A   ⋆ s   ∥   1 − ∥   A   ⋆ s   ∥    } .   Notice that the error bound   E   s   involves matrix terms (namely, A and   A   ⋆   ) and vector terms (namely, B,   B   ⋆   ,   E   s   and   E   s   ⋆   ), which appears to be more relevant than only analyzing the vectors of wave amplitudes. Within the present framework, those matrix/vector terms are expressed as  (50)  A = C   μ   N − 2     C   ⋆     μ   N − 2   ,    A   ⋆   =   C   ⋆     μ   N − 2   C   μ   N − 2   ,      (51)  B = C   μ   N − 2     F   ⋆   + F ,    B   ⋆   =   C   ⋆     μ   N − 2   F +   F   ⋆   ,      (52)    E   s   = (    ∑   p = 0   s − 1     A   p    ) B ,    E   s   ⋆   = (    ∑   p = 0   s − 1     A   ⋆ p    )   B   ⋆   ,   where ( C , F ) and (   C   ⋆   ,   F   ⋆   ) are scattering matrices and vectors of excitation sources that relate the coupling conditions between the central structure and the extra substructures, see Eqs. (30) and (31). Also, in Eq. (52), s is an integer defined so that  (53)  s = max {  u : ∥   A   u   ∥ ≥ 0.1  and  ∥   A   ⋆ u   ∥ ≥ 0.1  } .   Besides, in Eq. (49),   ϵ   1   E   ,   ϵ   2   E   ,   ϵ   1     E   ⋆     and   ϵ   2     E   ⋆     are error parameters expressed as  (54)    ϵ   1   E   =   ∥     E   ˜     s   −   L   ˜     E   s   ∥   ∥   E   s   ∥   ,    ϵ   2   E   =   ∥   L   r     E   s   ∥   ∥   E   s   ∥   ,      (55)    ϵ   1     E   ⋆     =   ∥     E   ˜     s   ⋆   −   L   ˜     E   s   ⋆   ∥   ∥   E   s   ⋆   ∥   ,    ϵ   2     E   ⋆     =   ∥   L   r     E   s   ⋆   ∥   ∥   E   s   ⋆   ∥   ,      (56)    ϵ   1   A   =   ∥     A   ˜     s     L   ˜   −   L   ˜     A   s   ∥   ∥   A   s   ∥   ,    ϵ   2   A   =   ∥   L   r     A   s       L   ˜     T   ∥   ∥   A   s   ∥   ,      (57)    ϵ   1     A   ⋆     =   ∥     A   ˜     ⋆ s     L   ˜   −   L   ˜     A   ⋆ s   ∥   ∥   A   ⋆ s   ∥   ,    ϵ   2     A   ⋆     =   ∥   L   r     A   ⋆ s       L   ˜     T   ∥   ∥   A   ⋆ s   ∥   ,   where the notation   ·   ˜   indicates that vectors and matrices are expressed using reduced sets of wave shapes. Also,   L   r   and   L   ˜   are Boolean matrices that localize, respectively, the rejected and retained wave modes. It should be emphasized that the mathematical expression of the error bound   E   s   , Eq. (49), remains valid provided that the following two assumptions are verified: (i) the spectral radii of the matrices A and   A   ⋆   are less than unity, i.e., ρ ( A ) < 1 and ρ (   A   ⋆   ) < 1 ; (ii) ∥     A   ˜     s   ∥ ≤ ∥   A   s   ∥ and ∥     A   ˜     ⋆ s   ∥ ≤ ∥   A   ⋆ s   ∥ .  One of the features of the proposed error analysis is that the error bound   E   s   is to be computed at the maximum discrete frequency considered within the frequency band of interest, only, as explained in [18]. The strategy behind the selection process of the wave modes consists in expressing the error bound   E   s   as a function of the size m of the reduced sets of wave shapes   {     ϕ   ˜     j   }   j = 1 , … , m   and   {     ϕ   ˜     j   ⋆   }   j = 1 , … , m   . For this purpose, a preliminary task is considered where the right-going wave modes   { (   μ   j   ,   ϕ   j   ) }   j   are ranked in descending order with respect to the magnitudes |   μ   j   | , while the left-going wave modes   { (   μ   j   ⋆   ,   ϕ   j   ⋆   ) }   j   are ranked in ascending order with respect to the magnitudes |   μ   j   ⋆   | . The motivation behind this ranking procedure reflects the need to retain the wave modes which are propagating or are close to becoming propagating, it being understood that these modes are likely to contribute to the dynamic behavior of the structure. In other words, the convergence of the WFE-based reduced models might be favored by ranking the wave modes in such a way. The selection strategy hence follows by selecting the smallest number m for which the value of the error bound   E   s   shrinks under a certain small tolerance threshold.  It should be emphasized that the proposed selection strategy requires all the wave modes to be computed at the maximum discrete frequency considered within the frequency band of interest, with a view to expressing the matrices (A,   A   ⋆   ) and the vectors (   E   s   ,   E   s   ⋆   ) in Eqs. (54)–(57). This constitutes a numerical task which may be time consuming especially when the substructures of concern have large-sized FE models. To overcome this issue, it is proposed to express these matrices/vectors using an intermediate reduced basis   {     ϕ   ^     j   }   j = 1 , … ,   n   ^     ∪   {     ϕ   ^     j   ⋆   }   j = 1 , … ,   n   ^     , which contains a reasonably large number 2   n   ^   < 2 n of wave shapes. Here, the wave shapes   {     ϕ   ^     j   }   j = 1 , … ,   n   ^     and   {     ϕ   ^     j   ⋆   }   j = 1 , … ,   n   ^     represent those with the   n   ^   − th largest magnitudes |   μ   j   | and the   n   ^   -th smallest magnitudes |   μ   j   ⋆   | , respectively. For instance, one may choose the integer   n   ^   so that   n   ^   ≈ n / 3 . The relevance of this assumption lies in the fact that highly evanescent wave modes are likely to be weakly contributing to the dynamic behavior of the structure, as outlined in Section 3.1. The consideration of such an intermediate reduced basis   {     ϕ   ^     j   }   j   ∪   {     ϕ   ^     j   ⋆   }   j   enables the computational time associated to the mode selection strategy to be lowered, hence becoming negligible compared to that required by the computation of the forced response of the structure. In this framework, the error parameters occurring in Eq. (49) are to be expressed as follows:  (58)    ϵ   1   E   →   ∥     E   ˜     s   −   L   ˜       E   ^     s   ∥   ∥     E   ^     s   ∥   ,    ϵ   2   E   →   ∥   L   r       E   ^     s   ∥   ∥     E   ^     s   ∥   ,      (59)    ϵ   1     E   ⋆     →   ∥     E   ˜     s   ⋆   −   L   ˜       E   ^     s   ⋆   ∥   ∥     E   ^     s   ⋆   ∥   ,    ϵ   2     E   ⋆     →   ∥   L   r       E   ^     s   ⋆   ∥   ∥     E   ^     s   ⋆   ∥   ,      (60)    ϵ   1   A   →   ∥     A   ˜     s     L   ˜   −   L   ˜       A   ^     s   ∥   ∥     A   ^     s   ∥   ,    ϵ   2   A   →   ∥   L   r       A   ^     s       L   ˜     T   ∥   ∥     A   ^     s   ∥   ,      (61)    ϵ   1     A   ⋆     →   ∥     A   ˜     ⋆ s     L   ˜   −   L   ˜       A   ^     ⋆ s   ∥   ∥     A   ^     ⋆ s   ∥   ,    ϵ   2     A   ⋆     →   ∥   L   r       A   ^     ⋆ s       L   ˜     T   ∥   ∥     A   ^     ⋆ s   ∥   ,   where the notation   ·   ^   indicates that vector/matrix terms are expressed using the intermediate reduced basis   {     ϕ   ^     j   }   j   ∪   {     ϕ   ^     j   ⋆   }   j   . In Eqs. (58)–(61),   L   r   and   L   ˜   are to be understood as Boolean matrices that localize, respectively, the rejected and retained wave modes among the set   { (     μ   ^     j   ,     ϕ   ^     j   ) }   j   ∪   { (     μ   ^     j   ⋆   ,     ϕ   ^     j   ⋆   ) }   j   .  Finally note that the error bound (Eq. (49)) may be evaluated for some few integers m = p   Δ   n   (p=1,…,P) to improve further the computational speed of the wave mode selection process. Here,   Δ   n   and P are integers defined so that   Δ   n   > 1 , P   Δ   n   ≈   n   ^   and P   Δ   n   ≤   n   ^   .  The strategy to determine the number m of wave modes to be computed from the Lanczos method is summarized as follows:  1. Compute the wave modes   { (     μ   ^     j   ,     ϕ   ^     j   ) }   j = 1 , … ,   n   ^     and   { (     μ   ^     j   ⋆   ,     ϕ   ^     j   ⋆   ) }   j = 1 , … ,   n   ^     for   n   ^   ≈ n / 3 , by means of the eigenproblem (16) and the Lanczos method, at the maximum frequency within the frequency band of interest. Within the Lanczos framework, the wave modes   { (     μ   ^     j   ,     ϕ   ^     j   ) }   j   and   { (     μ   ^     j   ⋆   ,     ϕ   ^     j   ⋆   ) }   j   are to be sought as those with the largest magnitudes |     μ   ^     j   | and the smallest magnitudes |     μ   ^     j   ⋆   | , respectively.  Rank the wave modes   { (     μ   ^     j   ,     ϕ   ^     j   ) }   j   in descending order with respect to the magnitudes |     μ   ^     j   | , and conversely, rank the wave modes   { (     μ   ^     j   ⋆   ,     ϕ   ^     j   ⋆   ) }   j   in ascending order with respect to the magnitudes |     μ   ^     j   ⋆   | .  Plot the error bound   E   s   by means of Eq. (49) and Eqs. (58)–(61), as a function of the number m ( m =   Δ   n   , 2   Δ   n   , … ) of the right/left-going wave modes retained.  Select the integer m as soon as the value of the error bound   E   s   shrinks under a certain small tolerance threshold.   INTRODUCTION   To highlight the efficiency of the proposed reduction method (Section 3), two test cases are investigated that concern: (i) a 2D periodic structure undergoing plane stresses (see Fig. 1); (ii) a 3D cylindrical shell with a periodic distribution of longitudinal and circumferential stiffeners (see Fig. 10). Both structures exhibit substructures which are not symmetric. The first test case is rather simple; it aims at proving that a large reduction of the size of the wave mode basis can be achieved for modeling a periodic structure. In contrast, the second test case is complex as involving a FE model with 629,748 DOFs, and an eigenproblem (16) with a size of 2376×2376. The motivation here consists in proving that the WFE method yields a large decrease of the CPU times for computing the frequency forced response of the structure, in comparison with the conventional FE method.  For the sake of conciseness, the first test case is analyzed by means of the DSM approach depicted in Section 3.2.2, while the second one is investigated by means of the WA approach (Section 3.2.3). Within the framework of the DSM and WA approaches, the FRFs of the structures are computed using   MATLAB   ®   . These are compared with reference results issued from the conventional FE method when the FRFs are computed using a commercial FE software.  As a first example, the frequency forced response of a 2D periodic structure, undergoing plane stresses, is investigated (see Fig. 1). The whole periodic structure is made up of N=15 identical substructures whose dimensions are shown in Fig. 4 . Each substructure is meshed by means of 2D linear elements whose nodes exhibit horizontal and vertical displacement DOFs. Also, the structure exhibits the following material characteristics: Young׳s modulus of 210GPa, density of 7800kg/m3, Poisson׳s ratio of 0.3 and a loss factor of 0.001. Also, its thickness is 0.001m. The structure is excited by a unit point force acting along the horizontal x-direction at the bottom corner of the left end; also, it is clamped over its right end.  The DSM approach proposed in Section 3.2.2 is used to compute the FRF of the structure — i.e., the frequency evolution of the modulus of the displacement at the location of the input force — over a frequency band [1Hz, 2000Hz]. For this purpose, the reduction method proposed in Section 3 is investigated. It consists in dividing the whole periodic structure into one central structure having N − 2 = 13 substructures, which is surrounded by two extra-substructures (Fig. 3). The FRF of the whole structure is computed by considering different numbers m of right-going and left-going wave modes. The related results are displayed in Fig. 5 along with the reference FE solution, i.e., which is issued from a commercial FE software. Here, a moderately dense mesh is used as shown in Fig. 4, which leads to n=22 DOFs over the left/right boundary of each substructure. As it can be seen, considering m=2 right/left-going wave modes of the central structure is clearly not enough. However, considering three or more wave modes (i.e., m ≥ 3 ) yields the expected results with accurate precision. This might be explained by investigating the first four propagation constants (see Table 1 ) — namely, μ 1, μ 2, μ 3 and μ 4 — at 2000Hz, among all the 22 propagation constants whose moduli are less than one. Here, it appears that two waves are slowly damped, one is moderately decreasing while the last one is strongly decreasing, i.e., the amplitude |   μ   4   | is very small. This means that the third wave mode should be kept, while the subsequent modes may be ignored.  By considering the wave mode selection strategy proposed in Section 3.3, this yields the same tendencies, i.e., the error bound   E   s   is almost 140% when m=2, and less than 2% when m ≥ 3 . For the sake of clarity, the true relative errors between the WFE and FE solutions are displayed in Fig. 6 . As it can be seen, the relative error of the WFE solution with m=2 right/left-going wave modes exceeds 100%, while that with m ≥ 3 wave modes is less than 5%, and even less than 1% for most frequencies. This appears to be completely coherent with the theoretical error bound   E   s   , hence giving credit to the proposed reduction method.  To highlight further the efficiency of the reduction method, additional simulations have been made, as follows.  Consider the case when the whole structure is partitioned into a left periodic structure made up of N − 1 = 14 substructures, and a right extra substructure. Assume that the periodic structure is modeled by means of a reduced number m of right/left-going wave modes, while the right extra substructure is modeled by means of the conventional FE method. The related FRF is displayed in Fig. 7 , when different numbers m of wave modes are dealt with. As shown in Fig. 7, the WFE solution does not match the reference FE curve even though half the wave modes are kept (i.e., m=11). Convergence is reached when all the wave modes are kept, only. This highlights the fact that near the excitation source, almost the full wave mode basis is needed to recover the dynamic behavior of the system.  Besides, a quite similar analysis is proposed by considering a right periodic structure, with N − 1 = 14 substructures, and a left extra substructure. Again, it is assumed that the periodic structure is modeled by means of a reduced number m of right/left-going wave modes, while the left extra substructure is modeled by means of the conventional FE method. The FRF of the whole periodic structure is shown in Fig. 8 . In this case the convergence of the WFE solution is achieved when half the wave modes are kept (i.e., m=11). From this point of view, the WFE method appears to be more accurate when compared to the last case, which might be explained by the fact that the clamped BC is uniform over the right end of the system, i.e., it can be described by means of a few low-order wave shapes.  Finally, Fig. 9 highlights the results concerning a single periodic structure with N=15 substructures, modeled by means of a reduced number m of right/left-going wave modes, i.e., with no extra substructures. As expected, the accuracy of the WFE method cannot be demonstrated when m < n , meaning that the full wave basis is required to ensure the convergence of the WFE solution.  To summarize, it has been highlighted that partitioning a whole periodic structure into one central structure and two extra substructures yields an efficient reduction method allowing the central structure to be described in terms of a fairly small number of wave modes. Such a reduction method appears to be very promising in terms of CPU time savings, especially when large-sized models are dealt with. The relevance of the procedure is demonstrated in Section 4.3.  As a second example, the harmonic behavior of a complex 3D periodic structure is analyzed by means of the WA approach (Section 3.2.3), over a frequency band [0.5Hz, 150Hz]. The structure under concern consists of a stiffened cylindrical shell, as shown in Fig. 10 . It is composed of N=20 identical substructures, each of these being made up of eighteen longitudinal flat stiffeners and one circumferential L-shaped stiffener.  The cylindrical shell and the stiffeners share the following characteristics: Young׳s modulus of 70GPa, density of 2700kg/m3, Poisson׳s ratio of 0.3, loss factor of 0.005, thickness of 0.002m. The length and the external diameter of the whole structure are 10m and 3m, respectively. Also, the longitudinal stiffeners have a height of 0.05m, while the circumferential L-shaped stiffener has a height and a width of 0.1m. The substructures are meshed in the same manner, i.e., by means of 2D triangular shell elements with three nodes and six DOFs per node that incorporate 3D displacements/rotations. As a whole, each substructure is meshed using 32,616 DOFs, which are partitioned into n=1188 DOFs on each left/right cross-section and 30,240 internal DOFs. Also, the total number of DOFs used to model the whole periodic structure is 629,748, which appears to be large. Such a fine mesh is considered here with a view to correctly describing the local stress fields which can be sharp in the vicinity of the corners between the shell and the stiffeners [22,23]. In fact, it will be proved below that the consideration of a coarser mesh yields erroneous results.  Besides, the periodic structure is subject on its left end to vertical point forces of magnitude F=1000N acting in opposite directions on the cross-section DOFs of two diametrically opposed longitudinal stiffeners (Fig. 10). Regarding the right end of the periodic structure, the cross-section DOFs of the longitudinal stiffeners are translationally fixed and rotationally free, while the cross-section DOFs of the cylindrical shell are free. The FRF of the periodic structure is estimated using 300 discrete frequencies which are equally spaced over the frequency band [0.5Hz, 150Hz].  Prior to the computation of the wave modes, the condensed dynamic stiffness matrix   D   ⁎   of a substructure (Section 2.1) needs to be assessed at each discrete frequency involved within the frequency band of concern. As explained in [13], the computation of   D   ⁎   can be sped up in a drastic way by means of the CB method, i.e., by considering the static modes of the substructure (with respect to its left and right boundaries) and a reduced set of fixed interface modes. A rough estimate of the number of fixed interface modes to be retained can be obtained by performing a convergence analysis of the WFE method for expressing the FRF of the periodic structure in the vicinity of the maximum frequency of the frequency band of interest — i.e., 150Hz in the present case. This yields almost 1000 fixed interface modes that need to be considered.  The computation of the wave modes follows by considering the eigenproblem (16). The Lanczos method enables one to compute a reduced set of wave modes, only. For this purpose, the wave mode selection process proposed in Section 3.3 is considered. Here, the number of retained wave modes is determined when the value of the error bound   E   s   shrinks under a tolerance threshold of 10%. This provides m=125 right/left-going wave modes to be retained, which represents almost 10% of the total number n=1188 of wave modes involved when the eigenproblem (16) is solved directly. As a result, the computation of those few wave modes can be sped up drastically.  The FRF of the periodic structure is displayed in Fig. 11 . Here, the magnitude of the radial displacement is assessed at a measurement point located 1.5m far from the excitation sources, along the longitudinal direction. The solution issued from the WA approach (Section 3.2.3) is computed using   MATLAB   ®   and compared to the solution issued from a conventional FE software. As it can be seen, the WFE and FE solutions (black and violet curves) perfectly match to each other, hence giving credit to the proposed approach. In terms of CPU times, it takes around 5826s with the WFE method to compute the FRF of the structure using   MATLAB   ®   and an   Intel   ®   Core™ i7-3720QM processor, against 13,618s with a commercial FE software and the same processor. This means 57% time savings in benefit of the WFE method.  Also, in Fig. 11, the FRF which is issued from a coarse FE mesh of the periodic structure is shown (red curve). In this case, the number of DOFs involved is 195,588 which appears to be three times less than that of the original mesh. As it can be seen, large differences occur between the fine mesh- and coarse mesh-based solutions, even at low frequencies. As was previously explained, those differences are due to the fact that a coarse mesh fails to interpolate the stress fields around the corners — i.e., between the shell and the stiffeners — accurately. This gives credit to the fine mesh proposed, and thus to the WFE method for modeling periodic structures having large-sized FE models. To summarize, it is shown that the WFE method constitutes an efficient numerical tool to assess the dynamic behavior of complex periodic structures. In fact, the WFE method appears to be much faster than the FE method, while keeping almost the same level of accuracy.  Notice that the WFE method can be easily implemented in   MATLAB   ®   , which is partly explained because it involves matrices of small sizes which do not necessitate excessive memory storage, as explained in Section 3.2.2. Additional comparisons may be achieved with the CB method to highlight further the computational efficiency of the proposed approach. Within the CB framework, the whole periodic structure is modeled by means of static modes and fixed interface modes, understood that the left and right cross-sections of the whole periodic structure relate those fixed interfaces. Preliminary simulations have shown that almost 1000 fixed interface modes are needed for modeling a single substructure, meaning that at least a similar number of fixed interface modes are required for modeling the whole structure. This means high memory storage requirement as well as high CPU times for computing these modes. Indeed, even by using a commercial FE software, this takes more than 10 , 000  s which appears tremendous compared to the total CPU times involved in the WFE method with   MATLAB   ®   .  A model reduction technique has been proposed within the framework of the WFE method for the description of the dynamic behavior of structures with one-dimensional periodicity. Two WFE-based procedures have been investigated for this purpose — namely, the DSM and WA approaches — which make use of wave modes for assessing the kinematic and mechanical fields of structures. An efficient generalized eigenproblem based on the so-called S +   S   − 1   transformation has been proposed for computing the wave modes traveling in right and left directions along a periodic structure composed of arbitrary-shaped substructures. To overcome the issue of large CPU times when solving this eigenproblem directly, the Lanczos method has been applied with a view to calculating a reduced number of wave modes only. An error indicator has been proposed for selecting in a priori process those wave modes which mostly contribute to the structure dynamics. It has been shown that the efficiency of the procedure can be greatly improved by partitioning the whole periodic structure into one central structure surrounded by two extra substructures. The feature of this technique lies in the use of a few wave modes for modeling the central structure, hence enabling the CPU times associated to the computation of the WFE eigenproblem to be largely decreased. On the other hand, the extra substructures are modeled using the conventional FE method. The relevance of this reduction technique has been clearly validated regarding a 2D periodic structure. Also, it has been successfully applied for modeling a 3D periodic stiffened shell that contains several substructures with large-sized FE models. It has been shown that the proposed model reduction technique yields large CPU time savings compared to the conventional FE method.  Denote as   u   ( 1 )   and   u   ( N + 1 )   the 2 n × 1 state vectors on the left and right ends of a periodic structure composed of N substructures, expressed as  (A.1)    u   ( 1 )   = [       q   L   ( 1 )       −   F   L   ( 1 )       ] ,    u   ( N + 1 )   = [       q   R   ( N + 1 )         F   R   ( N + 1 )       ] .   Those state vectors can be expanded onto the basis of wave modes as follows (cf. Eq. (27)):  (A.2)    u   ( 1 )   = Φ Q +   μ   N     Φ   ⋆     Q   ⋆   ,    u   ( N + 1 )   =   μ   N   Φ Q +   Φ   ⋆     Q   ⋆   ,   where Φ = [   ϕ   1   , … ,   ϕ   n   ] and   Φ   ⋆   = [   ϕ   1   ⋆   , … ,   ϕ   n   ⋆   ] . Assume that the wave shapes are normalized in the following sense   ϕ   j   ⋆ T   J   ϕ   j   =   ϕ   j   T   J   ϕ   j   ⋆   = 1   ∀ j . By considering the orthogonality properties of the wave modes — i.e.,   ϕ   k   ⋆ T   J   ϕ   j   =   ϕ   k   T   J   ϕ   j   ⋆   = 0   ∀ k ≠ j and   ϕ   k   T   J   ϕ   j   =   ϕ   k   ⋆ T   J   ϕ   j   ⋆   = 0   ∀ k  [2] — it turns out that the wave amplitudes can be expressed as follows:  (A.3)    Q   j   =   ϕ   j   ⋆ T     Ju   ( 1 )   ,    Q   j   ⋆   =   ϕ   j   T     Ju   ( N + 1 )    ∀ j ,   and  (A.4)    μ   j   N     Q   j   =   ϕ   j   ⋆ T     Ju   ( N + 1 )   ,    μ   j   N     Q   j   ⋆   =   ϕ   j   T     Ju   ( 1 )    ∀ j .   This yields the following matrix relations that link the state vectors between the left and right ends of the structure:  (A.5)    Φ   ⋆ T     Ju   ( N + 1 )   =   μ   N     Φ   ⋆ T     Ju   ( 1 )   ,      (A.6)    Φ   T     Ju   ( 1 )   =   μ   N     Φ   T     Ju   ( N + 1 )   .   By partitioning the state vectors into displacement/rotation and force/moment components (see Eq. (3)), this yields  (A.7)  −   Φ   F   ⋆ T     q   R   ( N + 1 )   +   Φ   q   ⋆ T     F   R   ( N + 1 )   =   μ   N   (  −   Φ   F   ⋆ T     q   L   ( 1 )   −   Φ   q   ⋆ T     F   L   ( 1 )    ) ,      (A.8)  −   Φ   F   T     q   L   ( 1 )   −   Φ   q   T     F   L   ( 1 )   =   μ   N   (  −   Φ   F   T     q   R   ( N + 1 )   +   Φ   q   T     F   R   ( N + 1 )    ) ,   that is,  (A.9)    μ   N     Φ   q   ⋆ T     F   L   ( 1 )   +   Φ   q   ⋆ T     F   R   ( N + 1 )   = −   μ   N     Φ   F   ⋆ T     q   L   ( 1 )   +   Φ   F   ⋆ T     q   R   ( N + 1 )   ,      (A.10)    Φ   q   T     F   L   ( 1 )   +   μ   N     Φ   q   T     F   R   ( N + 1 )   = −   Φ   F   T     q   L   ( 1 )   +   μ   N     Φ   F   T     q   R   ( N + 1 )   .   In matrix form, Eqs. (A.9) and (A.10) are written as  (A.11)  [       μ   N     Φ   q   ⋆ T       Φ   q   ⋆ T         Φ   q   T       μ   N     Φ   q   T       ] [       F   L   ( 1 )         F   R   ( N + 1 )       ] = [     −   μ   N     Φ   F   ⋆ T       Φ   F   ⋆ T       −   Φ   F   T       μ   N     Φ   F   T       ] [       q   L   ( 1 )         q   R   ( N + 1 )       ] .   It is worth noting that the matrices   Φ   F   and   Φ   F   ⋆   can be expressed as follows:  (A.12)    Φ   F   = − (    D   LL   ⁎     Φ   q   +   D   LR   ⁎     Φ   q   μ  ) =   D   RR   ⁎     Φ   q   +   D   RL   ⁎     Φ   q     μ   ⋆   ,      (A.13)    Φ   F   ⋆   = − (    D   LL   ⁎     Φ   q   ⋆   +   D   LR   ⁎     Φ   q   ⋆     μ   ⋆    ) =   D   RR   ⁎     Φ   q   ⋆   +   D   RL   ⁎     Φ   q   ⋆   μ .   Eqs. (A.12) and (A.13) are readily obtained from the dynamic equilibrium equation of a substructure,   D   ⁎   being the dynamic stiffness matrix of the substructure condensed on its left and right ends (see Section 2.1). Introducing Eqs. (A.12) and (A.13) into Eq. (A.11) leads to  (A.14)  [       μ   N     Φ   q   ⋆ T       Φ   q   ⋆ T         Φ   q   T       μ   N     Φ   q   T       ] [       F   L   ( 1 )         F   R   ( N + 1 )       ] = [       μ   N     Φ   q   ⋆ T     D   LL   ⁎   +   μ   N − 1     Φ   q   ⋆ T     D   RL   ⁎       Φ   q   ⋆ T     D   RR   ⁎   + μ   Φ   q   ⋆ T     D   LR   ⁎         Φ   q   T     D   LL   ⁎   + μ   Φ   q   T     D   RL   ⁎       μ   N     Φ   q   T     D   RR   ⁎   +   μ   N − 1     Φ   q   T     D   LR   ⁎       ] [       q   L   ( 1 )         q   R   ( N + 1 )       ] = [       μ   N     Φ   q   ⋆ T       Φ   q   ⋆ T         Φ   q   T       μ   N     Φ   q   T       ] [       D   LL   ⁎     q   L   ( 1 )         D   RR   ⁎     q   R   ( N + 1 )       ] + [       μ   N − 1     Φ   q   ⋆ T     μ   Φ   q   ⋆ T       μ   Φ   q   T       μ   N − 1     Φ   q   T       ] [       D   RL   ⁎     q   L   ( 1 )         D   LR   ⁎     q   R   ( N + 1 )       ]   Multiplying Eq. (A.14) by the inverse of the matrix occurring on its left-hand side leads to  (A.15)  [       F   L   ( 1 )         F   R   ( N + 1 )       ] = [       D   LL   ⁎     q   L   ( 1 )         D   RR   ⁎     q   R   ( N + 1 )       ] +   [       (   Φ   q   ⋆ T   )   − 1     μ   N     Φ   q   ⋆ T       I   n         I   n       (   Φ   q   T   )   − 1     μ   N     Φ   q   T       ]   − 1   × [       (   Φ   q   ⋆ T   )   − 1     μ   N − 1     Φ   q   ⋆ T       (   Φ   q   ⋆ T   )   − 1   μ   Φ   q   ⋆ T         (   Φ   q   T   )   − 1   μ   Φ   q   T       (   Φ   q   T   )   − 1     μ   N − 1     Φ   q   T       ] [       D   RL   ⁎     q   L   ( 1 )         D   LR   ⁎     q   R   ( N + 1 )       ] .   As a result, the dynamic stiffness matrix of the periodic structure is expressed as  (A.16)    D   s   = [       D   LL   ⁎     0     0     D   RR   ⁎       ] +   [       (   Φ   q   ⋆ T   )   − 1     μ   N     Φ   q   ⋆ T       I   n         I   n       (   Φ   q   T   )   − 1     μ   N     Φ   q   T       ]   − 1   × [       (   Φ   q   ⋆ T   )   − 1     μ   N − 1     Φ   q   ⋆ T       (   Φ   q   ⋆ T   )   − 1   μ   Φ   q   ⋆ T         (   Φ   q   T   )   − 1   μ   Φ   q   T       (   Φ   q   T   )   − 1     μ   N − 1     Φ   q   T       ] [       D   RL   ⁎     0     0     D   LR   ⁎       ] .   Alternatively,   D   s   can be expressed by taking the transpose of Eq. (A.16). Since the matrix   D   s   is symmetric, this yields  (A.17)    D   s   = [       D   LL   ⁎     0     0     D   RR   ⁎       ] + [       D   LR   ⁎     0     0     D   RL   ⁎       ] × [       Φ   q   ⋆     μ   N − 1     Φ   q   ⋆ − 1       Φ   q   μ   Φ   q   − 1         Φ   q   ⋆   μ   Φ   q   ⋆ − 1       Φ   q     μ   N − 1     Φ   q − 1       ]   [       Φ   q   ⋆     μ   N     Φ   q   ⋆ − 1       I   n         I   n       Φ   q     μ   N     Φ   q   − 1       ]   − 1   .      Consider a periodic structure whose left and right ends are connected to two elastic subsystems 1 and 2 as shown in Fig. 2. Here, the subsystems 1 and 2 undergo prescribed displacements/rotations (vectors   q   0   and   q   0   ⋆   , respectively) and prescribed forces/moments (vectors   F   0   and   F   0   ⋆   , respectively). Also, due to action–reaction law, the subsystems are subject to vectors of forces/moments −   F   L   ( 1 )   and −   F   R   ( N + 1 )   , respectively, on the coupling interfaces with the periodic structure. As a result, the dynamic equilibrium of each subsystem can be expressed in matrix form as follows:  • Subsystem 1:  (B.1)  [       (    D   1    )   LL       (    D   1    )   LI       (    D   1    )   LB         (    D   1    )   IL       (    D   1    )   II       (    D   1    )   IB         (    D   1    )   BL       (    D   1    )   BI       (    D   1    )   BB       ] [       q   L         q   1 I         q   0       ] = [     −   F   L   ( 1 )         F   0         F   1 B       ] ,      Subsystem 2:  (B.2)  [       (    D   2    )   RR       (    D   2    )   RI       (    D   2    )   RB         (    D   2    )   IR       (    D   2    )   II       (    D   2    )   IB         (    D   2    )   BR       (    D   2    )   BI       (    D   2    )   BB       ] [       q   R         q   2 I         q   0   ⋆       ] = [     −   F   R   ( N + 1 )         F   0   ⋆         F   2 B       ] .       REFERENCES", "highlights": "The wave finite element (WFE) method is investigated to describe the dynamic behavior of periodic structures like those composed of arbitrary-shaped substructures along a certain straight direction. Emphasis is placed on the analysis of non-academic substructures that are described by means of large-sized finite element (FE) models. A generalized eigenproblem based on the so-called S +   S   − 1   transformation is proposed for accurately computing the wave modes which travel in right and left directions along those periodic structures. Besides, a model reduction technique is proposed which involves partitioning a whole periodic structure into one central structure surrounded by two extra substructures. In doing so, a few wave modes are only required for modeling the central periodic structure. An error indicator is also proposed to determine in an a priori process the number of those wave modes that need to be considered. Their computation hence follows by considering the Lanczos method, which can be achieved in a very fast way. Numerical experiments are carried out to highlight the relevance of the proposed reduction technique. A comprehensive validation of the technique is performed on a 2D periodic structure. Also, its efficiency in terms of CPU time savings is highlighted regarding a 3D periodic structure that exhibits substructures with large-sized FE models."}