{"id": "S0168874X16300117", "article": "MAIN-TITLE A coupled constitutive model for fracture in plain concrete based on continuum theory with non-local softening and eXtended Finite Element Method   HIGHLIGHTS          We investigate fracture in concrete elements.      We use a coupled continuous and discontinuous constitutive model for concrete.      The effective transition algorithm between non-local models and XFEM is formulated.      We compare numerical results with experiments.          KEYPHRASES   Continuous–discontinuous cracks  Damage mechanics  Elasto-plasticity  Non-locality  XFEM   Fracture is the salient feature of concrete-like materials. It is responsible for both strength and stiffness reductions and precedes the structure failure. At the beginning, a thin zone composed of diffused micro-cracks is formed, called a fracture process zone (FPZ) or a localized zone [1]. Later, during further deformation, a distinct discrete macro-crack emerges. An adequate description of fracture in numerical FE calculations (composed of localized zones and macro-cracks) is extremely important to obtain physically realistic outcomes [2].  Within continuum mechanics, there exist two main approaches to describe cracks. The first one describes them in a smeared sense as strain localized zones of micro-cracks with a certain finite width. The material behaviour may be described using e.g. enhanced elasto-plastic, damage mechanics or smeared crack and coupled constitutive laws [2]. These formulations include material softening and have to be equipped with a characteristic length of micro-structure to preserve the well-posedness of BVPs and the mesh-insensitivity of FE results and to properly capture the width, inclination and spacing of localized zones. A characteristic length can be included by means of e.g. non-local, gradient and micro-polar theories. As an alternative, displacement jumps (discontinuities) along cracks may be introduced while keeping the remaining region as a continuous one. The oldest solutions used interface elements which were defined along finite element edges. The modern ones allow for considering displacement jumps in the interior of finite elements using embedded discontinuities or XFEM (eXtended Finite Element Method) [3,4], the latter based on a concept of the partition of unity. A smeared approach is more appropriate when describing a micro-crack formation process while a discontinuous one allows for a more realistic simulation of a discrete macro-crack propagation. The application of a continuum description at the fracture onset provides automatically a algorithm to determine directions of the smeared crack growth. It also updates the set of dominant active cracks (e.g. their direction) if necessary. Such a modification usually cannot be achieved with XFEM. In contrast, the regularized continuum often fails to properly simulate the final deformation stage with almost zero stress conditions. Usually, one approach is solely used to simulate a fracture process in concrete during the entire deformation process [4]. A combination of a continuous and discontinuous approach makes it possible to realistically capture all stages of concrete fracture occurring in experiments [5].  One of the first coupled continuous–discontinuous crack descriptions was formulated by Jirásek and Zimmerman [6]. They tried to remove the stress locking observed in simulations with both smeared and conventional embedded crack models. In order to avoid this pathological behaviour, a delayed embedded crack model (DEC) was used in which a transition from a smeared crack approach into an embedded displacement discontinuity formulation occurred at a certain degradation stage. As a regularization technique with respect to the load–displacement diagram, a crack band approach was used in a continuum regime. A softening curve in a discrete regime was tuned to ensure a smooth and energy conserving transition. Moreover, in order to eliminate the observed mesh-induced directional bias, they postulated a coupling of an isotropic damage model enhanced by integral non-local theory with embedded cracks. Wells et al. [7] combined the traction-free XFEM with a viscoplastic constitutive law with softening. The regularization of a boundary value problem at high loading velocities was assured by a visco-plastic constitutive model by Perzyna [8]. Simone et al. [9] proposed a numerical model with a transition from an implicit gradient-damage model into XFEM. The transition point was assumed at the fully damaged state, so again traction-free discontinuities were being inserted in a discrete regime. Comi et al. [10] formulated a constitutive law based on a coupling of an integral non-local damage model with XFEM using cohesive cracks. They analysed carefully the transition process and used their model to simulate mode-I problems. Cazes et al. [11] developed a thermodynamically motivated algorithm to construct a cohesive law equivalent to a differential non-local model. Seabra et al. [12] formulated a model for ductile fracture which a combined isotropic continuum damage law enhanced by a non-local integral formulation with macro-cracks defined by XFEM. These macro-cracks were inserted at the final failure stage, so solely traction-free discontinuities were considered. Cuvilliez et al. [13] used an implicit gradient model together with cohesive interface elements to simulate the behaviour of quasi-brittle materials. Recently, Tamayo-Mas and Rodriguez-Ferran [14] presented a coupling between a gradient enhanced model based on smoothed displacements and XFEM with cohesive tractions. All models described above assumed a transition process at the material point at a specified time moment. The second group of coupled formulations assumed a diffuse nature of this phenomenon. Moonen at el. [15] formulated a general continuous–discontinuous framework based on a ׳time-continuity׳ concept introduced by Papoulia et al. [16]. It allowed for a gradual transition from a continuous to discrete crack description. Benvenuti et al. [17] formulated the REXFEM (the regularized XFEM) approach to simulate a transition point from a continuous to discontinuous displacement. They replaced a standard Heaviside jump function by a continuous regularized Heaviside function with a parameter called a regularization length. It allowed for simulating localized zones of a finite width. They also proposed a new integration technique when calculating the stiffness matrix of finite elements. REXFEM was later used by Benvenuti [18] and Benvenuti and Tralli [19] to capture a smooth transition from a local continuum damage model to cohesive discontinuous cracks.  In all above papers isotropic damage constitutive laws were used only (elasto-plastic laws were not employed). Specimens under tensile dominated (mode I) loading were solely simulated under 2D conditions (uniaxial tension, three-point bending or wedge splitting test). Thus the mixed-mode failure modes were not investigated. No convergence analyses and detailed numerical performances of algorithms used have been carried out which are particularly important when switching from a smeared description to discontinuity for large tractions (far from a traction-free state).  The main aim of our research group is to formulate a reliable coupled constitutive model for concrete under monotonic and cyclic loading which links a continuous and discontinuous fracture description defined within continuum mechanics. In a continuous phase, an elasto-plastic-damage constitutive model with non-local softening will be used [20,21]. In turn, a discontinuous displacement jump will be described by XFEM [4]. This paper presents a coupled quasi-static constitutive model for numerical simulations of two-dimensional (2D) plain concrete under quasi-static monotonic loading (thus the stiffness recovery was not needed to be taken into account). Tensile dominated loading was considered only. Branching and crossing of cracks were not taken into account. In the continuous phase, two different constitutive laws were assumed: the elasto-plastic model with a Rankine criterion or isotropic damage model with non-local softening. In the discontinuous phase, XFEM was used. The proposed model was implemented into the commercial FE code Abaqus/Standard [22]. Several benchmark simulations were performed under a dominated mode-I (e.g. uniaxial tension and bending) and mixed-mode conditions (shear-tension) in order to assess the numerical robustness and physical validity of the model. Attention was laid on a smooth transition from plasticity/damage with non-local softening to XFEM with respect to oscillations emerging on load–displacement and stress–strain curves. The transition point between a non-local model and XFEM was determined with the help of the Digital Image Correlation (DIC) technique during three-point bending experiments on notched concrete beams [21].  As compared to other coupled models, the innovative points are: a) numerical analyses of mixed-failure modes for concrete (in the literature mainly the mode I was studied), b) a comparison of numerical results with experiments on concrete beams with respect to displacement and strain evolutions in a fractured zone, c) an improved transition algorithm with respect to existing ones dealing with a continuous–discontinuous transition in order to avoid unwanted oscillations on load–displacement curves and d) a careful study of transition algorithms for 2 different continuum laws (elasto-plastic and damage) with non-local softening and XFEM.  The paper is organized as follows. In Section 2, two continuum constitutive laws enriched by an integral non-local theory are presented. The general information about the Extended Finite Element Method (XFEM) with a description of a discrete cohesive law and a crack propagation algorithm is given in Section 3. The formulation of a transition phase from a continuous to discontinuous approach is described in Section 4. Section 5 includes the details of the implementation and other numerical issues. The results of numerical tests are analysed in detail in Section 6. The final conclusions are listed in Section 7.  An elasto-plastic model was defined within a standard plasticity theory. In a tensile regime the classical Rankine criterion was used [2,23,24]. The yield function f was:  (1)   F = f −   σ   t    ( κ )  =  max  {    σ   1   ,   σ   2   ,   σ   3    }  −   σ   t    ( κ )  ,    where σ 1, σ 2 and σ 3 are the principal stresses, σ  t is the tensile yield stress and κ is the hardening/softening parameter (equal to the maximum principal plastic strain   ε   1   p   in uniaxial cases). An associated flow rule f=g was assumed. A linear or an exponential curve was chosen to describe softening under tension:  (2)     σ   t    ( κ )  =  max  {  0 ,   f   t    (  1 −  κ    κ   u      )   }    or    σ   t    ( κ )  =   f   t   exp  (  −  κ    κ   u      )  ,    where the parameter κ  u controls the slope of a softening curve (it can be interpreted as an intersection point of a tangent line from the peak point with a horizontal axis). This curve was chosen to obtain a better agreement with XFEM for a 1-dimensional case (Section 6). It should be noted that a formulation with this simple exponential softening curve produces very similar results to ones obtained with more sophisticated curves, e.g. the non-linear curve by Hordijk [25] which was calibrated with the aid of laboratory experiments. The cases with active two or three yield planes of the Rankine criterion were taken into account by applying a standard multi-surface plasticity model with the Koiter׳s rule to calculate increments of plastic strains. The only difference was that the hardening parameter κ was the same for all active yield planes (the plastic multipliers dλ  i were however independent for each active surface ׳i׳). Although the choice of a plasticity theory to simulate concrete under tension raises some controversies (e.g. unphysical origin, lack of the stiffness reduction), the Rankine׳s criterion provides realistic results under monotonic loading [2] and is still widely used (e.g. in commercial FE codes).  The second constitutive law was defined within continuum isotropic damage mechanics [5,20,26]. The initiation and propagation of micro-cracks was described by a scalar damage parameter D. The virgin state with the elastic stiffness corresponds to D=0 while a completely cracked material was captured by D=1. The damage variable D can be interpreted as an indicator of the mechanical degradation of the material. It acts as a stiffness reduction factor:  (3)     σ   i j   =  (  1 − D  )    C   i j k l   e     ε   k l   .       Note that isotropic damage causes a degradation of Young׳s modulus only while Poisson׳s ratio remains not affected. The growth of the variable D was controlled by a monotonically increasing damage history parameter κ which was defined as the maximum of the equivalent strain measure  ε ˜  reached during the entire load history (it is totally a different quantity than the κ-parameter in plasticity):  (4)   κ  ( t )  =   max   τ ≤ t    {   ε ˜   ( τ )   }  .       During loading, the parameter κ grows, and during unloading and reloading, it remains constant. The equivalent strain  ε ˜  is a scalar which takes into account the sensitivity of a degradation process to different principal strain components. Here a definition proposed by Jirásek [26] for tension (equivalent to the Rankine criterion in plasticity) was used:  (5)    ε ˜  =   max  {    σ   i   e f f    }   E  ,    where   σ   i   e f f   are the principal values of the effective stress tensor defined as:  (6)     σ   i j   e f f   =   C   i j k l   e     ε   k l   ,       In order to describe the evolution of the damage variable D, an exponential softening law was used:  (7)   D = 1 −     κ   0    κ   (  1 − α + α   e   − β  (  κ −   κ   0    )     )  ,       wherein κ 0 – the initial value of the damage threshold parameter κ, and α and β – the material parameters. The parameters α and β were calibrated based on a force–displacement curve in softening from uniaxial tension tests.  Standard constitutive laws are not able to properly describe strain softening of materials when using FEM. Since these models contain no information about the size and spacing of localized zones, their enrichment by a characteristic length of micro-structure is absolutely necessary. A characteristic length restores also the well-posedness of boundary value problems and makes the FE results mesh-independent [27,28].  In the paper, this model enrichment was performed by means of a non-local theory in the integral format [27] which is based on a spatial weighted averaging of a local tensor or scalar state variables. The non-local averaging can be applied only to internal variables coupled with a dissipative process or softening of materials. The influence of the material neighbouring points in determining the state of the analyzed point is taken into account. As a consequence, the principle of local action is not valid any more. In the calculations within elasto-plasticity, the softening parameter κ was assumed to be non-local [28] using the so-called over-non-local formulation:  (8)    κ ¯   ( x )  =  (  1 − m  )  κ  ( x )  + m    ∫ V   ω  (  ‖  x − ξ  ‖  )  κ  ( ξ )  d ξ     ∫ V   ω  (  ‖  x − ξ  ‖  )  d ξ    ,    where   κ ¯   ( x )   is the non-local softening parameter, m is the additional non-locality parameter, V denotes the body volume, x are the coordinates of the considered point, ξ are the coordinates of the surrounding points and ω stands for the weighting function. For m=0, a local formula is retrieved and for m=1, a classical non-local model is recovered. In order to obtain mesh-independent results, the parameter m has to be greater than 1 (a classic non-local model with m=1 does not fully regularizes a boundary value problem) [2,28]. This non-local parameter was used next to define the tensile yield stress σ  t . The Gaussian function was chosen to calculate the weighing function:  (9)   ω  ( r )  =  1  π   l  2    exp  (  −   (   r l   )  2   )  ,    where r denotes a distance between considered two material points and l is a characteristic length of micro-structure which determines the size of localized zones (note that in plasticity the geometry of localized zones depends also on the non-locality parameter m). Although the Gaussian function has an unbounded support (for any distance r it returns a non-zero value), the averaging is restricted practically to a small area around each material point (the influence of points at the distance of r=3l is only of 0.01%). In the simulations the truncation radius was taken as rmax =3l. The calculations with the larger values of rmax provided the identical results. The softening non-local parameter near boundaries and at both sides of a localized zone was always calculated with the aid of Eqs. (8) and (9) (which satisfy the normalizing condition). Other approaches to a non-local averaging were proposed by Polizzotto [29], Borino et al. [30] and Jirásek et al. [31].  In the simulations within isotropic damage, the equivalent strain measure  ε ˜  was replaced by its non-local counterpart  ε ¯   [27] in Eq. (4) [2]:  (10)    ε ¯   ( x )  =    ∫ V   ω  (  ‖  x − ξ  ‖  )   ε ˜   ( ξ )  d ξ     ∫ V   ω  (  ‖  x − ξ  ‖  )  d ξ    ,       A characteristic length of micro-structure may be estimated e.g. by means of displacement measurements on the beam surface using the non-invasive Digital Image Correlation (DIC) technique [21].  The method assumes that a displacement field is discontinuous across the crack just after its initiation. It is based on a local partition of unity (PUM) concept by Melenk and Babuška [32]. It enables adding ‘ad hoc’ extra terms to a standard FE displacement field interpolation. These extra functions are responsible for capturing displacement jumps. In XFEM cracks do not have to be placed along finite element edges; they may pass through elements without a remeshing need. Due to a local nature of the enrichment, extra displacement degrees of freedom are solely introduced in finite elements cut by a discontinuity. They are gradually added to subsequent finite elements when a crack propagates. The formulation used in the paper follows (with some improvements and modifications) the original concept by Wells and Sluys [33]. In order to describe jumps in the displacement field, the so-called shifted-basis enrichment was used [34]. The shifted-basis enrichment simplifies the implementation of XFEM (two types of the finite elements exist only). Moreover the total nodal displacements are equal to the standard displacements. The details of the derivation can be found in Zi and Belytschko [34] and Tejchman and Bobiński [2].  Two constitutive laws have to be defined to describe the behaviour of a solid body with a cohesive crack. In a non-cracked region, a linear elastic relationship was defined for XFEM. For a coupled formulation, the continuum constitutive law of Sections 2.1 and 2.2 was assumed. Second, the softening cohesive law which links tractions t with displacement jumps [[ u ]] on the discontinuity was defined. Here the following format of the loading function was chosen:  (11)   f  (  [ [   u   n   ] ] , κ  )  = [ [   u   n   ] ] - κ ,       with the history parameter κ equal to the maximum normal displacement jump [[u  n ]] achieved during a loading history. The softening phase of the normal component of the traction vector was described using either a linear relationship:  (12)     t   n   =   D   f     f   t    (  1 −     f   t   κ   2   G   f      )        or an exponential one:  (13)     t   n   =   D   f     f   t   exp  (  −     f   t   κ     G   f      )  ,    wherein G  f - the fracture energy and D  f - the correction term defined as:  (14)     D   f   = 1 − exp  (  − κ     d   f     f   t       G   f      )  ,    where d  f is the so-called drop factor [35]. This factor improves the convergence during tension-compression changes. With increasing d  f , the term D  f approaches 1. As a third alternative a softening curve assembled from linear segments was also used. A set of n points (κ (ι), t  n  (ι)) was defined with a linear interpolation of the t  n value between points. During unloading, the secant stiffness was used with a return to the origin (damage format). In a compressive regime, the penalty stiffness in a normal direction was used (which depended upon the drop factor d  f ). In a tangential direction, a linear relationship between a displacement jump [[u  s ]] and traction t  s was assumed with the stiffness T  S .  In a coupled model, the crack propagation was governed by the algorithm described in Section 4. Since some results with the pure XFEM are presented in the paper for comparison purposes, the crack propagation procedure used in these simulations will be also described in this section. A new crack could be activated or an existing crack could propagate if the standard Rankine criterion (σ  max >f  t ) was fulfilled at least in one point of the element at the front of a crack tip. The direction of a crack extension was asumed to be perpendicular to the direction of the maximum principal stress of the stress vector σ tip at the crack tip. These stresses were calculated as the averaged values [33]:  (15)     σ   t i p   =  ∫ V   σ w d V  ,       wherein V denotes the semi-circle domain at the front of a crack tip and w denotes the averaging function. The function w was defined in 2D calculations as [33]:  (16)   w  ( r )  =  1   (  2 π  )    l   a v   2     exp  (  −     r  2    2   l   a v   2      )  ,    where r is the distance from the crack tip and l  av is the averaging length related to the size of finite elements (note that this averaging operation is not intended to introduce an additional characteristic length of micro-structure into a constitutive model). If the direction of the crack propagation is known in advance, a fixed value may be obviously applied [2].  Initially, in all finite elements (integration points), a continuum constitutive law with non-local softening (elasto-plastic or isotropic damage constitutive model) was solely active. A new crack segment was created in elements if the following condition for the continuum softening parameter κ (described by Eq. (1) for the elasto-plastic model or by Eq. (4) for the damage model) was fulfilled in any of element׳s integration points at the front of a crack tip:  (17)   κ >   κ   c d   ,    where κ  cd is the transitional softening parameter. In some cases, the examination of this condition in the finite element only at the front of the crack tip may cause a locking or a delay of the crack growth. Therefore an extended version of the crack growth criterion was also formulated. In this approach the inequality given by Eq. (17) was checked both in all integration points of the finite element at the front of the crack tip and in all integration points in a circle section with the radius l  crk and angle φ  crk . This section was symmetrically located along the extension of the last crack segment ( Fig. 1).  The direction of a discrete crack propagation p was determined by (similarly as by Wells et al. [7]):  (18)   p  ( x )  =  ∫ V   κ ( ξ ) w (  ‖   p ¯   ‖  )   p ¯   ‖   p ¯   ‖    d V ,    where  p ¯  is the direction from the crack tip x to any point ξ in V and w denotes the weight function defined by Eq. (16). The more advanced algorithms may be also used to determine this direction, as e.g. the medial axis method proposed by Tamayo-Mas and Rodriguez-Ferran [14].  A proper description of a switch from a continuous degradation mechanism to a cohesive crack development requires the fulfilling of two principles: the dissipated energy balance and stress equilibrium [10,14]. The first idea assumes that the energy dissipated with a continuous model is equal to the energy dissipated in a coupled continuous–discontinuous model. Usually this equivalence is derived from an one-dimensional bar analysis and then it is adopted to a general case. Since the proposed model was used for tension dominated problems only, the activation of a discrete crack depended on the behaviour under tension in one normal direction. Thus the same 1D procedure was used here. In the simulations of the Nooru-Mohamed test with curved cracks, the zero shear stiffness was assumed (the consideration of shear terms require the fracture energy definition under shear).    Fig. 2 shows the general stress–displacement diagrams obtained for a bar under tension. The transition point ׳T׳ is characterized by the tensile stress σ  init . The total energy G  f (per unit area) is a sum of the dissipated energy G  d and remaining energy G  r (not yet dissipated). These energies are different for the both analysed continuum laws for the same value of the stress σ  init . This comes from the fact that material softening of an isotropic damage model is connected with the stiffness degradation, while for an elasto-plastic constitutive model this stiffness is intact. As a consequence, the elastic strain energies are also different (they are the parts of the remaining energies G  r ).  Let us consider the bar with the length L, cross-area A and Young modulus E. Its continuum (bulk) elongation u  bulk is equal to  (19)     u   b u l k   =  ∫ 0 L   ε d l =   ∫ 0 L    σ   (  1 − D  )  E   d l =  P  E A     ∫ 0 L    1  1 − D   d l  .       It can be reformulated as (K is the secant stiffness of the bar):  (20)     u   b u l k   =  P K   with  K =   E A     L   e f f       and    L   e f f   =  ∫ 0 L    1  1 − D   d l  .       After inserting a discrete crack, the total elongation of the bar u is the sum of the elongation of the bulk (continuum) material u  bulk and displacement jump in the crack [[u]]. Applying Eq. (20), the following formula is obtained for [[u]]:  (21)   [ [ u ] ] = u −  P K  .       This formula allows for a curve definition of the traction t - displacement jump [[u]] for a cohesive crack equivalent to a force–displacement diagram from a continuum damage model. In simulations a set of discrete points was defined to reproduce this curve. Eq. (21) provides the same results if the sufficiently large bar׳s length L is taken in order to capture the entire localization zone. The identity of force–displacement diagrams guaranties the equilibrium of dissipated energies in both approaches. Note that after inserting a discrete crack, the degradation in bulk points ceases and a softening mechanism in cohesive cracks is active only. Therefore the secant stiffness K is constant after a crack creation although its value depends on a distribution of the damage parameter D along the bar. Moreover the displacement jump at the moment of the crack creation [[u  init ]] is equal to zero, so the secant stiffness may be evaluated as:  (22)   K =     P   i n i t       u   i n i t     ,    where P  init and u  init are the force and total displacement at the crack creation (this formula comes directly from the definition of K). If an explicitly defined softening curve in XFEM was assumed, e.g. the exponential relationship given by Eq. (13), then the extra data about the remaining energy G  r have to be provided. This was done by defining the remaining energy G  r - traction t relationship based on force–displacement curves from pure continuum analyses.  In contrast to damage model, there is no a stiffness change in bulk points while switching from a continuous to discrete approach. After the crack creation there is elastic unloading in the entire bar. There is not a growth of plastic strains and deformation in the bulk is elastic. The incremental bulk stiffness becomes elastic:  (23)   d   u   b u l k   =   d P L   E A   .       As a consequence, a special technique is not required to preserve the dissipated energy amount. In order to obtain the same response in plasticity and XFEM in the material softening region, the fracture energy G  f from XFEM had to be related with the ultimate softening parameter κ  u in plasticity. However in softening plasticity, the slope of a force–displacement curve depends not only on κ  u and f  t but also on the non-local parameters m and l. The solution is to perform some numerical simulations and to fit these values. Such a comparison of the force–displacement curves in uniaxial tension was performed and the following relationship was identified for linear softening (with the parameter m=2):  (24)     G   f   = 0.95   f   t   m l   κ   u         and exponential softening:  (25)     G   f   = 1.89   f   t   m l   κ   u   .       The numerical constants in Eqs. (24) and (25) not depend on the characteristic length l, tensile strength f  t and softening parameter κ  u . However, they decrease with increasing non-locality parameter m. Such a calibration process enabled us to calculate the identical force–displacement curves and to dissipate the same energy amount.  The second principle requires the equilibrium of stresses in a newly cracked finite element. The stresses in new integration points were calculated by interpolating values from old integration points. The same procedure was performed for strains and state variables. The initial tractions t  n   init and t  s   init were computed by projecting continuum stresses onto a crack segment line at the crack creation moment. In the elasto-plastic-XFEM coupling, the initial displacement jumps were determined at the moment of the crack creation: [[u  n   init ]] and [[u  s   init ]]. They were not zero because the discrete softening process did not start with the tensile strength value. They depended upon the initial traction values (Fig. 2). The starting softening parameter κ in XFEM was also modified by adding [[u  n   init ]]. With the damage-XFEM coupling, the softening curve was defined with the algorithm given in Section 4.3.  The coupled elasto-plastic-XFEM constitutive model requires 10 material constants: E and v in elasticity, m, l, f  t and κ  u in softening plasticity and G  f , d  f , and T  S in XFEM plus the transitional parameter κ  cd . In the coupled damage-XFEM formulation, 10 material constants have to be also declared: E and v in elasticity, κ 0, α and β in damage softening, G  f , d  f , and T  S in XFEM and κ  cd . In addition a set of points to describe the degradation in XFEM has to be specified.   IMPLEMENTATION   The 2D coupled constitutive law was implemented into the commercial finite element code Abaqus/Standard [22]. The user elements were defined with the aid of the UEL subroutine (note that in pure non-local simulations, the use of the user material UMAT procedures with standard elements is sufficient). The independent FORTRAN module was written to handle non-local data. The following convergence criteria were assumed [22]:  (26)     r   max   ≤ 0.01   q   ˜      and      c   max   ≤ 0.01  Δ    u   max   ,    where r  max is the largest residual out-of-balance force,  q ˜  denotes the average value of the components of all element force vectors and externally applied forces (the so-called spatial average force), c  max is the largest correction of the displacement and Δu  max denotes the largest change of the displacements in the increment.  In the elasto-plastic constitutive approach, the influence of neighbouring points when calculating the softening parameter was estimated by taking local softening parameters from the previous global iteration [36]. The increment of the non-local softening parameter was calculated as:  (27)    Δ      κ   ¯     i   ( k )   =  Δ    κ   i   ( k )   + m  (      ∑   j    ω  (    r   i j    )   Δ    κ   j   ( k − 1 )     V   j        ∑   j    ω  (    r   i j    )    V   j      −  Δ    κ   i   ( k − 1 )    )  ,    where superscript (k) is the global iteration counter, i and j denote the integration points numbers, r  ij is the distance between the integration points i and j and V  j is the volume associated with the integration point j. This approach ׳freezes׳ the influence of neighbouring points and restores a local character of the plasticity algorithm at the integration point level. A symmetric elastic global stiffness matrix was defined for this material since the calculations with a full Newton–Raphson method resulted in a poor convergence in a softening regime due to the fact that the determination of a tangent stiffness matrix within a non-local theory is virtually impossible. In the non-local damage model, the same approximated algorithm was applied. Although the equivalent strains to be averaged are explicitly calculated from the known total strains, this approach simplifies the implementation and provides the same results as the original precise method. In commercial codes (e.g. Abaqus) such information (values of total strains) is known to the programme but not to the users. In order to gather information about current values of total strains, an extra loop over finite elements is required before calculating the material behaviour in the specimen (it can be done by defining the extra mesh with the same topology as the basic one). Alternatively, the values from the previous iteration may be used.  When using XFEM, two types of finite elements were defined: un-cracked (standard) and cracked ones. In the cracked finite elements a special integration scheme for calculating strains, stresses, internal force vectors and stiffness matrices was developed. Three integration points for 3-node triangles were defined [37]. In quadrilaterals, totally 12 integration points were assumed [38]. For both finite elements, two integration points on a discontinuity line were also chosen. The displacement jump degrees of freedom were defined as the rotational degrees of freedom in the element (in order to activate non-standard degrees of freedom in Abaqus). A standard Abaqus iteration algorithm was extended to handle the crack segment creation in finite elements. The new crack segments could be created at the increment end after a converged configuration was found. Then a restart procedure was applied and the actual increment was re-calculated to find a new converged configuration. By default, a crack could be extended by one segment only. The entire procedure was repeated as long as new cracks were created in a converged configuration. If new crack segments were not added, the next increment started.  In order to insert this algorithm into Abaqus/Standard, some special tricks were applied. One node user-elements with no stiffness and zero force were assumed in nodes with defined boundary conditions. These elements transferred the information on imposed displacement/boundary conditions from the input data to the algorithm (in order to exclude some degrees of freedom from the equilibrium control). The data of residuum forces and displacement corrections were gathered independently of Abaqus (they were taken from the user elements). It allowed for an independent control of a convergence process and for detecting converged iterations. In order to drive a convergence process in Abaqus and to enable extending cracks without starting a new increment, another user element was added which had no stiffness and returned a very large force vector in iterations when the convergence (start of a new increment) was not permitted. An extra module was written to visualize a crack pattern. The same algorithm was used in simulations with a coupled model.  The initial numerical simulations using the coupled model with an intuitive assumption of the automatic transfer of the material degradation from a continuous to a discrete crack resulted in very serious convergence problems. Therefore some modifications were proposed with explicitly defined mechanisms for de-activating softening (plasticity or damage growth) in a continuum region. The first numerical idea was to switch off softening in all continuum points lying in the zone in a direction perpendicular to a newly created crack segment ( Fig. 3a). The width of this zone was taken as 6×l (it depends generally on a constitutive law chosen) to embrace all integration points within active softening. However, this method turned out to be improper in a bending test with the elasto-plastic-XFEM coupling (Section 6.2), so its generalization was proposed. The switch off process was performed solely in the integration points which were located at least d  mix from the crack tip T (Fig. 3b). This new quantity was called the length of a mixed zone. For each segment end node I, the distance d  I from the crack tip T measured along the crack/polyline was determined. If this distance was larger than dmix for the both segment end points, then the softening de-activation was performed in integration points perpendicular to this segment. In the Fig. 3a the distances d  P and d  Q are larger than dmix (d  P >d  Q ); thus integration points perpendicular to the segment PQ are switched-off. However d  R is smaller than dmix , so non-local softening is still active in integration points perpendicular to the segment QR. Two more changes were also performed. In bulk integration points in cracked finite elements, a linear elastic behaviour was allowed only (even in cracked elements in a mixed zone for the non-zero value of d  mix ). Moreover, to find a proper begin configuration, two phases were defined in some simulations. First the calculations were performed within linear elasticity in all bulk integration points and with active softening in integration points of discrete cracks only (like ‘pure’ XFEM). After finding the convergence, the calculations were continued with active softening in bulk integration points until the final converged configuration was found.  Summing up, 4 following numerical algorithms were examined in our paper which have not been used yet (a digit indicates the phase number):  • algorithms ׳A׳ – the standard implicit algorithms with no plasticity/damage in bulk integration points in finite elements with crack segments (without the switch off process). The one-phase (standard) ׳A1׳ and two-phase ׳A2׳ methods were tested,  algorithm ׳B1׳ – one-phase method with a softening switch off approach and linear elasticity in bulk integration points in cracked elements,  algorithm ׳C2׳ – two-phase method with a softening switch off approach.  For a given increment, the general algorithm can be described as follows:  1. start a new increment  phase I (present in algorithms ׳A2׳ and ׳C2׳ only):  assume (temporarily) a linear elastic constitutive law in bulk integration points (material with no softening) and standard material behaviour (without modifications) in discrete cracks (like ׳pure׳ XFEM),  execute global equilibrium equations until the convergence is found (Eq. 26).  phase II:  a. restore a standard material definition (with softening) in bulk integration points (if phase I was present),  execute global equilibrium equations until the convergence is found (Eq. 26).  crack growth:  initialize the crack counter k=0,  increase the crack counter k=k+1,  define the set of integration points in which the crack activation criteria will be examined: in the finite element at the front of the crack tip (default option) only or with the extra integration points in the section with the radius l  crk and angle φ  crk ,  check the growth criterion (Eq. 17) in all selected integration points,  if Eq. (17) is not fulfilled in any of these integration points, return to the point 4b,  calculate the crack propagation direction,  insert a new crack segment, define the cracked integration scheme and transfer strains, stresses and all state variables,  turn off softening in integration points in cracked finite element (only in algorithms ׳A1׳, ׳A2׳ and ׳B1׳),  i. for each segment take the start point I and calculate the distance d  I from the crack tip. If this distance is larger than d  mix , switch off non-local softening in perpendicular integration points (this step is not present in the algorithms ׳A1׳ and ׳A2׳),  if it is not the last crack, return to the point 4b,  repeat the points 4a–4j as long as at least one crack segment is created in any of cracks,  if one new segment was at least added in the last execution of the point 4, return to the point 1 (restart the increment).  increment end.  By default, in the calculation of non-local quantities in integration points (using Eqs. 8 or 10) with the active degradation mechanics, the influence of neighbouring integration points with the switch off softening was also taken into account ( Fig. 4a). This method was called here a ׳full-circle׳ approach. Within elasto-plasticity, such points had no impact on the nominator (Δκ=0), but within damage they also influenced the final nominator. In the both constitutive laws this assumption modified the final value of the denominator in Eqs. (8) or (10). Alternatively, a ׳half-circle׳ approach was defined in which no terms from switched off points were taken into account when calculating non-local quantities (Fig. 4b). After inserting a new crack segment, non-local interactions between integration points lying at the opposite side of cracks were eliminated. Any crack segment was treated as a barrier in non-local summations (the so-called shading effect [31]). This issue is very important in simulations without an active switch off mechanism. However, for the mixed length d  mix equal to zero or to a very small distance, its influence was insignificant.  The width of the plane specimen was 100mm and height 150mm ( Fig. 5). All nodes along the bottom were fixed in a vertical direction. The tensile deformation was imposed by enforcing the vertical displacement increment of all nodes along the upper edge by the same amount of Δu=0.1 mm. In order to preserve the specimen stability, the bottom mid-node was fixed in a horizontal direction. The modulus of elasticity was equal to E=30GPa, Poisson׳s ratio was ν=0 (in order to closely reproduce a 1D state) and the tensile strength f  t =3MPa. Linear softening was assumed in both regimes. In plasticity the ultimate softening parameter was equal to κ  u =1.74·10−3. The characteristic length was l=10mm and non-locality parameter m=2. To induce strain localization, a zone of weak elements (with the tensile strength reduced to 2.99MPa) was assumed at the specimen mid-height. Its height was equal to 10mm. In XFEM, the fracture energy was G  f =100N/m, drop factor d  f =104 and tangential stiffness T  S =1012 N/m3. The drop factor assumed resulted in almost identical original and modified traction-separation laws in a normal direction. A large tangential stiffness was chosen to exclude non-controlled tangential displacements after the crack׳s creation across the entire specimen. The simulations were carried out with the transition point in a softening regime equal to κ  cd =0.88·10−3 (corresponding to 50% of the tensile strength f  t ). The other transition points (at 75% and 25% of the tensile strength) were also examined but the results were similar. Two families of regular FE-meshes were defined which consisted of n  c -columns and 1.5n  c -rows of finite cells. Each cell was composed of one 4-node quad element (mesh family ׳Q4׳) or of two 3-node linear triangles (mesh family ׳T3׳). The plane stress conditions were assumed.    Fig. 6 presents the computed force–displacements diagrams obtained for different the mesh families and mesh densities. The starting point of a discrete crack was defined manually along the left edge at the mid-point of a finite element in a weak zone (for the odd n  c -values this point was placed precisely at the mid-height of the specimen, while for the even n  c -values it was slightly shifted). A smooth transition between two crack descriptions was obtained. Next the simulations were repeated but the starting point of a discrete crack was moved manually towards the finite element upper node (20% of the finite element edge length). The calculated curves are shown at Fig. 7. The both parts (before and after the crack creation) are parallel but some unphysical jumps occurred. These jumps are larger for the quad meshes than for the triangular ones (with the same number of finite cells).  Almost no jumps were obtained with the T3 mesh consisting of 40×60 cells (a smooth transition with the Q4 mesh was solely for the mesh of 70×105 cells). The source of these strange behaviour is the profile of the vertical normal stress along the specimen. In general, the distribution of the vertical stress should be uniform but this is not true within a non-local approach. In a localized zone some oscillations appeared (especially near the zone edges) and the vertical stress became non-uniform. Even after applying the very strict convergence criteria, the result improvement was insignificant. If a discrete crack was placed at the mid-point of the element/cell, oscillations were eliminated and a smooth transition on a force–displacement curve happened. Other cases with a shift of a starting point resulted again in some jumps on the force–displacement curve. These oscillations might be reduced by using the higher-order finite elements, like 6-node triangles or 8-node quads [39].  In a tension test, the crack was created across the entire specimen width immediately after its initiation. Therefore the propagation algorithm was not used in the simulations described above and a discrete crack was placed along then specimen width when a transition criterion in the left edge element was satisfied. The calculations were carried out with the algorithm ׳B1׳ and different lengths d  mix : 0cm, 1cm, 2cm and 5cm to verify the general algorithm (Section 5). Except of some coarse meshes, in the majority of simulations, the crack was always created within one time increment and the identical results were achieved. The one-phase algorithm ׳A1׳ was not able to find converged results despite a direct crack insertion (standard: gradual segment by a segment growth or immediate – entire crack at the same time). In contrast, the 2-phase algorithm ׳A2׳ provided the proper results.  The simulations of a tension test were repeated using a coupled isotropic damage model. The same elastic parameters were assumed: E=30 GPa and ν=0. In the damage model, the initial threshold was taken as κ 0=10−4 (it corresponded to the tensile strength f  t =3MPa). The exponential softening with the parameters α=1.0 and β=1000 was applied. These values ensured that the total dissipated energy per unit area in this test was 99.7N/m (very close to the assumed 100N/m in XFEM). The characteristic length was again equal to l=10mm. The following 3 various transition points were analysed: κ  cd =0.0005 (equal approximately do 0.75Pmax , where Pmax is the maximum vertical force P), κ  cd =0.001 and κ  cd =0.002. In these transition points the damage parameter D was equal to 0.87, 0.96 and 0.99, respectively. In a discontinuous regime, 2 softening curves were taken: the first one derived from the force–displacement curve obtained in a tension test with a ‘pure’ damage model and the second one based on an exponential softening curve (Eq. 7) with the parameters re-scaled to dissipate a correct energy amount after cracking.  The computed force–displacement diagrams when using the derived segment line softening law are presented in Fig. 8a. All three curves are almost identical; a transition point is invisible. The total dissipated energy per unit area is equal to the assumed value 100N/m for all transition points. In contrast, the application of the explicitly defined exponential softening law (Eq. 7) did not produce the proper results (Fig. 8b). The change of a softening mechanism created a visible kink on the force–displacement diagrams. The assumed exponential relationships in both damage mechanics and XFEM did not provide the same force–displacement curves. Thus, a more sophisticated definition in a discrete regime would be required to obtain a better agreement with a curve from a continuum damage model. Despite this fact, the total dissipated energy per unit area was again equal to 100N/m that confirmed a correct definition of the transition algorithm. Comi et al. [10] used a similar coupling to simulate tension in a double-edge-notched specimen. However they obtained smooth force–displacement curves with the transition point located at the very high damage level (with D>0.99; the almost stress-free state). In all other cases a sudden drop was observed on the force–displacement diagram in their model.  The geometry of the concrete beam under plane stress conditions is shown in Fig. 9. Due to a problem symmetry, a localized zone and discrete crack were formed along the vertical symmetry axis. The imposed final vertical displacement was equal to u  fin =0.4 mm. The Young modulus and Poisson ratio were assumed as E=30GPa and v=0.2. The tensile strength was taken as f  t =3.0MPa. In plasticity, the exponential softening curve with the parameter κ  u =1.05·10−3 was chosen. The characteristic length was equal to l=10mm and the non-locality parameter was m=2. In XFEM, the exponential softening scheme with the fracture energy G  f =120N/m was assumed and the shear stiffness was T  s =0N/m3. The default transition point was κ  cd =7.28·10−3 that corresponded to the 50% of the tensile strength. Three different finite element meshes were defined: coarse, medium and fine with 600, 1260 and 2280 4-node quad elements, respectively. In the mid-region, the refined meshes were assumed with 20, 40 and 80 elements along the vertical symmetry axis for a coarse, medium and fine mesh, respectively. If not specified, the numerical calculations were carried out with a medium FE mesh.  First, some series of simulations were carried out with the algorithms ׳B1׳ and ׳C2׳ and d  mix =0 and with the ‘full-circle’ and ‘half-circle’ averaging method. Since convergence problems occurred, very loose convergence criteria had to applied (up to 10% error in Eq. 26). The computed force–displacement diagrams are depicted in Fig. 10. Some pronounced force jumps were obtained for simulations using a ‘full-circle’ approach for both algorithms. These jumps can be significantly reduced by adopting a ‘half-circle’ averaging method, but they still exist especially in a later deformation stage. It turned out that the assumption of d  mix equal approximately to the characteristic length l significantly improved results ( Fig. 11). The jumps on force–displacement diagrams were smaller as compared to the previous results of Fig. 10. Their values decreased with decreasing finite element size. The algorithm ׳C2׳ provided a smoother response than the algorithm ׳B1׳ for coarse meshes. For fine meshes their response was also smooth. However, the change of the curve inclination was detected on the load–displacement diagram. It corresponded to the time increment, in which the first crack segment was created (the beam bottom). At this point, a discrete crack always occurred in several finite elements (based on the profile of the softening parameter  κ ¯  along the crack growth line in the vertical symmetry axis). The averaging method (Eq. 8) did not ensure that the maximum the parameter  κ ¯  was at the bottom point but it reached its maximum at the certain distance from the bottom edge. The activation of a discrete crack at the bottom of the finite element caused a development of a discrete crack in several finite elements lying above it. This kink of the force–displacement diagram came also from the fact that the assumed softening curves in the elasto-plastic model and XFEM did not ensure the identical response in the bending test although they resulted in the same force–displacement curves during uniaxial tension. The vertical profile of the parameter  κ ¯  can be improved by introducing a weight function proposed by Krayani et al. [40], in which the distance from the external boundaries of the specimen was taken into account. It allows for obtaining a more uniform crack growth (creation of individual crack segments in different times). The influence of this modification on the force–displacement curves is negligible. In the algorithm ׳B1׳, the crack growth was spread in time, i.e. each new crack segment (except of the first group of 3 segments for the medium mesh) was created in the different time (in total 34 crack segments were created in 32 time increments). This development is more realistic and similar to the performance of the ‘pure XFEM’. In the algorithm ׳C2׳, a discrete crack growth was solely concentrated in 7 time increments (with 36 crack segments inserted). However, this difference had no impact on the calculated curves.  The influence of the different parameter d  mix on results is described in Fig. 12. Except of the results with d  mix =0 cm, the outcomes were similar. The algorithm ׳C2׳ turned out to be very sensitive to the value of d  mix . The calculations with d  mix =1cm were solely carried out without numerical problems. For the remaining values, some loose convergence criteria had to be applied to obtain a solution. The studies with the algorithms ׳A1׳ and ׳A2׳ provided results very similar to the outcomes with the algorithm ׳B1׳ and large d  mix values. The influence of the shear stiffness T  S on the results was also examined. Due to the problem symmetry, the calculations with the stiffness T  S =1012 N/m3 provided the same results as the original simulations with T  S =0N/m3.  Finally, the influence of the transition point   κ   c d   was investigated (algorithm ׳B1׳). Three different values of   κ   c d   were chosen: 3.02·10−3, 7.28·10−3 and 14.56·10−3 corresponding to 75%, 50% and 25% of the tensile strength in softening, respectively. The mixed zone length was d  mix =1cm. Despite a different location of a transition point on the force–displacement curve, its shape remained always the same ( Fig. 13).    Fig. 14 shows the evolution of the softening parameter  κ ¯  and the discrete crack in the central part of the beam for the different vertical displacement u. At the beginning, a smeared localized zone formed until the softening parameter  κ ¯  reached the transition point   κ   c d   in the finite element at the bottom edge. Then a first segment of the discrete crack was created. With increasing imposed vertical displacement, the next crack segments were added. With increasing length of the discrete crack, a softening mechanism in integration points in the localized zone was gradually turned off. The entire deformation tended to concentrate in the discrete crack while the neighbouring continuum points experienced unloading (no increase of the softening parameter  κ ¯  ).  The convergence analysis of our simulations with a coupled model showed its medium time effectiveness. For the identical medium mesh, convergence criteria and time-stepping algorithm, the ‘pure’ XFEM simulations required 777 global equilibrium iterations, ‘pure’ non-local plasticity simulations needed 1׳678 iterations, while in the calculations with the coupled model 5׳331 and 14׳397 iterations were carried out for the algorithm ׳B1׳ and ׳C2׳, respectively. At least 500 time increments were required to complete the numerical test. In the coupled approach, the increments just after a crack segment creation needed many iterations to converge. After two or three “consuming” increments, usually about 3 iterations were executed in next increments until the further crack segment was inserted.  The three-point bending was also numerically analysed using a coupled constitutive law with isotropic damage. The geometry of the specimen and elastic material constants remained unchanged. For the damage model, the initial threshold was taken as κ 0=10−4 (equivalent to the tensile strength f  t =3MPa). The exponential softening with parameters α=1.0 and β=825 were applied. In uniaxial tension these values provided the total dissipated energy per unit area of 120.8 N/m (very close to the assumed value of 120N/m in XFEM). The characteristic length was equal to l=10mm. The default transition point was taken as κ  cd =0.0010. In the formulation of the discrete model, a softening curve was changed only; a curve obtained from the force–displacement curve in tension with pure damage was adopted.  The simulations showed that the best results were obtained by taking the ‘full-circle’ algorithm ‘B1’ with d  mix =0cm (it is opposite to the results with the elasto-plastic law). The calculated force–displacement diagrams for the various meshes are shown in Fig. 15a. For the coarse mesh only, the force–displacement curve exhibited some small jumps (especially in later deformation stages). When decreasing the mesh size, the curves became smoother. The influence of the transition point on the force–displacement diagrams is demonstrated in Fig.15b. All curves are smooth (except of κ  cd =0.0005, where a discrete crack starts when the vertical force reaches its maximum value). In general, individual crack segments were created in different time increments (there is no creation of several segments after the insertion of the first crack segment). The numerical performance of the damage-XFEM coupling was better than of the plasticity-XFEM one. The total iterations number was equal to 4׳510 and was comparable to 3׳663 iterations needed to finish the simulations within pure damage.  Some similar observations were made by Simone et al. [9] who used a gradient enhanced isotropic damage model coupled with the traction-free XFEM. They observed some drops on the force–displacement diagrams in simulations of the four-point bending of the beam with a notch and the single-edge notched four-point-shear loading test. It was explained as a consequence of the incorrect energy dissipation. This dissipation was caused by the presence of high residuum stresses despite the degradation parameter D close to 1. They also observed some bumps on the force–displacement curve in a compact-tension test. The reason was the location of the point with the maximum hardening parameter κ not at the crack tip but far away from it. A discrete crack propagated through several finite elements (identically as reported here for the elasto-plastic material and algorithm ‘C2’). A non-smooth response was also obtained by Comi et al. [10] when simulating a wedge-splitting test.  In these laboratory mixed-mode condition tests, a square-shaped double edge notched (DEN) concrete specimen subjected to different combinations of shear and tensile loads under the force/displacement control was examined [41]. The length and height of the largest specimen were 200mm, and the thickness was 50mm ( Fig. 16). Two notches with dimensions of 25×5mm2 were located in the mid-points of vertical edges. The loading was prescribed by rigid steel frames glued to concrete. Several deformation scenarios were analysed. The most popular is the complex loading path no ׳4׳ and it was also simulated in the paper. During the analysed load scenario, the horizontal shear force P  s was applied until it reached a specified value, while the horizontal edges were free (vertical force P=0). Then the horizontal shear force remained constant and the vertical tensile displacement was prescribed. Three various shear forces were applied: P  s =5kN (path ׳4a׳), P  s =10kN (path ׳4b׳) and P  s =27.5kN (path ׳4c׳) - the maximum shear force carried by a concrete specimen. In the experiment, two curved cracks with an inclination depending upon the shear force were obtained (for the small value of P  s – the cracks were almost horizontal and for the large value of P  s – the cracks were strongly curved). To evaluate the quality of crack patterns, a measure called the crack height h  c was introduced (Fig. 16c). It was defined as a vertical distance between a horizontal line connecting notches and the most far-distant point lying on crack lines. In the experiment, the height h  c , calculated as an average value for 4 cracks, was equal to 1.5cm (range 1.1–2.0cm), 3.5cm (range 2.7–4.3cm) and 5.3cm (range 4.3–6.5cm) for the horizontal shear force of 5kN, 10kN and 27.5kN, respectively.  In all simulations with the elasto-plastic model with non-local softening under plane stress conditions, the following elastic constants were assumed: Young׳s modulus E=32.8GPa and Poisson׳s ratio v=0.2. The strength parameters f  t or κ 0 were determined by a trial and error method to obtain the best agreement with experimental peak forces. The same procedure was used to choose parameters describing softening. The tensile strength was chosen as f  t =2.3MPa, In simulations with non-local plasticity with the exponential softening and parameter k  u =0.0042, the characteristic length was equal to l=2mm and non-locality parameter was m=2 (after [28]). The value of l was based mainly on experimental results performed by Skarżynski and Tejchman [21, 42, 43] using the Digital Image Correlation (DIC) technique, in which the width of a localized zone in notched concrete beams under three-point bending was determined as 5–6mm. The calculated width of a localized zone with l=2mm was about 6mm. In XFEM the fracture energy was G  f =75N/m and the shear stiffness was taken as T  s =0N/m3 by default. Two finite element meshes were assumed: with the 33׳832 3-node constant strain triangle elements and with the 16׳825 4-node quad elements. The maximum size of finite elements in a localized zone was not greater than 1.5mm (for the effective regularization with l=2mm). The possibility of cracking at the top-right and bottom-left corners was excluded by assuming a linear elastic relationship there (such unwanted outcomes were obtained in experiments and numerical simulations) [44,45]. All three loading paths: ‘4a’, ‘4b’ and ‘4c’ were numerically analyzed. No calculations were performed with a damage-XFEM coupled model. Isotropic damage constitutive laws like this used in this paper cannot provide a realistic crack pattern in a tension-compression regime [2,4].  Some initial simulations were performed with constitutive laws using a ‘pure’ elasto-plastic model and a pure XFEM ( Fig. 17) for the path ׳4b׳ (P  s =10kN). For both approaches, the computed force–displacement diagrams were close to the experimental ones and proper crack patterns were obtained. For the plasticity model the crack height h  c was equal 2.8cm (slightly smaller than the experimental value of 3.5cm). The only drawback of the calculated cracks was that they were too straight near the starting notches. In turn, the XFEM simulations resulted in too curved cracks (their height was 4.6cm). The change of the fracture energy slightly influenced their height only.  The next simulations were carried out using a coupled constitutive model using 3 different transition points κ  cd : 1.32·10−3, 2.91·10−3 and 5.82·10−3. The algorithm ׳B1׳ with d  mix =2mm was used with the convergence tolerance equal to 0.02 in Eq. (26). The averaging length l  av was 7.5mm. The crack growth criterion was checked in the circle section with the angle φ  crk =30° and radius l  crk =5mm ahead the crack tip. Fig. 18 presents the force–displacement curves and crack trajectories. The calculated curves are in good accordance with the experimental values, although after the creation of the first discrete crack the change of the inclination of the diagrams can be detected. For the larger values of transition point κ  cd , the curve becomes less smooth and some small jumps occur. The calculated crack heights were equal to 3.2cm, 2.8cm and 2.6cm for the transition point: 1.32·10−3, 2.91·10−3 and 5.82·10−3, respectively. If a discrete crack is not created too early, the obtained crack patterns exactly follow the non-local softening parameter field in the specimen. For the smallest value of the κ  cd , the small deviation from of the crack height comes from the fact that there is no a ׳descending׳ part in the crack (the tip is the maximum distant point at the distance h  cr ). Despite these discrepancies, the coupled constitutive model allows for obtaining the smaller and more realistic crack heights than the pure XFEM approach.  Some parametric studies were also performed. First, the effect of the mixed zone length d  mix was studied ( Fig. 19a). With d  mix =0 (no mixed zone), several jumps were produced. Only the use of non-zero values of d  mix allowed for obtaining a smooth response of crack–displacement curves. For all three values of d  mix , the very similar crack patterns were obtained. The force–displacement curves with the different value of l  crk are depicted in Fig. 19b. When a crack growth activation criterion was checked only in a finite element at the front of the crack tip (l  crk  =0), the first crack segment was only created. Then the crack growth was locked and no more new segments were developed. For the larger value of l  rck (5mm or 10mm), the first discrete crack appeared earlier and a full development of a discrete crack pattern was achieved. Again several convergence problems occurred similarly to problems observed in the three-point bending test. Despite of loose convergence tolerances, many iterations were required to find a converged configuration, especially just after inserting a new crack segment.  Finally, the simulations with the different value of the shear force (paths ׳4a׳ and ׳4c׳) were executed. Fig. 20 presents the calculated force–displacement diagrams and crack patterns. For the shear force P  s =5kN, the very good agreement between numerical and experimental curves was achieved. For the maximum shear force P  s =24.4kN, despite some discrepancies and jumps, the compressive nature of the vertical force was properly reproduced. The crack height was equal to 1.8cm and 4.9cm for the paths ׳4a׳ and ׳4c׳, respectively. It was very close to the values within elasto-plasticity (2.2cm and 5.2cm) while the ׳pure׳ XFEM provided the heights 3.1cm and 7.4cm [4].  The simulations with the pure XFEM model and pure elasto-plastic model (assuming the minimum number of 200 increments to complete the numerical job) required about 1500 and 4500 iterations, respectively to be completed (with the standard convergence criteria of 0.01) [4]. The simulations with the coupled constitutive models generally needed 10–12 times more iterations than the XFEM calculations. The convergence might be improved by using a more sophisticated non-zero shear stiffness definition. By taking T  s =1012 N/m3 and defining the shear traction as t  s =T  s ·t  n /f  t [[u  s ]], the total number of iterations was reduced by 25%. The positive shear stiffness did not change the shape of the force–displacement diagram but was responsible for a slightly stiffer response during the final simulation part (the residual force increased solely from 0.21kN with the zero shear stiffness up to 0.86kN with the positive one for P  s =10kN).  Finally, a single-edge notched (SEN) concrete beam under four-point shear loading (anti-symmetric loading) [46] was numerically analysed ( Fig. 21). The length and height of the beam were equal to 440mm and 100mm, respectively. The depth of the notch was 20mm and its thickness was 5mm. The beam thickness was assumed as 100mm. In the experiments, a curved crack starting from the lower-right part of the notch towards a point to the right of the lower right support was observed [46].  In the elasto-plastic simulations, the elastic modulus was E=35GPa, Poisson ratio ν=0.2 and tensile strength f  t =2.5MPa. In plasticity, the exponential softening curve with the parameter κ  u =6.0·10−3 was chosen. The characteristic length was equal to l=1.5mm and non-locality parameter was m=2. In XFEM, the exponential softening scheme with the fracture energy G  f =90N/m was chosen and the shear stiffness was T  s =0N/m3. The transition point was κ  cd =4.16·10−3 (50% of the tensile strength). The algorithm ׳B1׳ with d  mix =2mm was used with the convergence tolerance equal to 0.02 in Eq. (26). The averaging length l  av was 6.0 mm. The crack growth criterion was checked in the circle section with the angle φ  crk =30° and radius l  crk =6mm ahead the crack tip. The mesh consisted of 12׳416 4-node quad finite elements (the size of the elements was 1.25mm). In the experiment, the deformation was induced by linearly increasing the distance δ 2 (Fig. 21) due to a snap-back behaviour of the vertical displacements at the points where the forces were applied. In the simulations the alternative solution was used, namely a crack mouth sliding displacement (CMSD) was chosen as a driven variable and the so-called indirect displacement control method [2] was implemented into the programme Abaqus Standard.    Fig. 22 presents the calculated results for the coupled model. The maximum force from numerical simulations is in a satisfactory agreement with the experiments. The difference between numerical and experimental force–displacement curves in a softening regime is a consequence of the fracture energy G  f assumed in XFEM (90N/m). Although this value is slightly larger than this obtained from Eq. (25) (85N/m), the calculations of the Schlangen test with the ׳pure׳ XFEM resulted in a softer force–displacement response as compared to simulations within elasto-plasticity. For a better agreement, the fracture energy should be larger. Several jumps on the calculated force–displacement diagrams were obtained. These jumps may be reduced by taking the greater value of d  mix . This fact suggests that for the assumed characteristic length, the size of finite elements could be smaller in order to obtain smoother force–displacement curves. The computed crack is straight as in other simulations within elasto-plasticity [47] and is not curved as in the experiment and in the calculations with the ׳pure׳ XFEM. A more advanced continuum constitutive law should be used to improve the crack׳s shape. The pure XFEM calculation required 839 iterations only while for the pure elasto-plastic model the total number of iterations was 6׳062. The simulations with the coupled model required solely twice more iterations to complete the calculation as compared to the calculations within elasto-plasticity (12׳749 iterations).  The last simulation was performed with the non-zero shear thickness T  s =1012 N/m3 and the shear traction as t  s =T  s ·t  n /f  t [[u  s ]]. A similar force–displacement relationship was obtained as for calculations with a zero shear stiffness. The calculated curve was smoother. The total number of iterations was slightly larger – 13׳527.  Summing up, a general framework for a coupled continuous and discontinuous constitutive law was presented. It allows for the use of different continuum constitutive laws like damage or elasto-plastic models. However other alternative constitutive laws may also be adopted. Several numerical algorithms were formulated and their performance was carefully examined in the failure mode-I and under mixed mode conditions. The proposed coupling proved its ability for describing diffuse-discrete cracks.  In order to determine the transition point κ  cd , an experimental notched concrete beam under three-point bending was again simulated. The geometry of the beam was taken from Le Bellego et al. [48]. The beam (the so-called small-size beam from experiments) was 8cm height and 32cm long (the span length was 24cm). The load was applied under the displacement control at the centre of the top edge. In the middle of the bottom edge, a notch was formed ( Fig. 23).  The local data obtained from numerical simulations were compared with the experimental results of displacements on the concrete surface measured with the aid of the Digital Image Correlation (DIC) technique [21]. Fig. 24 presents the force-CMOD curve and contours of horizontal normal strains from experiments. In the experiment the crack mouth open displacement (CMOD) was measured indirectly as the difference of the horizontal displacements of two point lying at the opposite sides of the notch at the bottom of the beam in the initial distance of 5cm. The experimental results allowed for determining a displacement and strain field before the creation of a discrete macro-crack above the notch and a macro-crack width. In the first stage (Fig. 24B, point ׳1׳) some micro-crack regions developed in different regions. At the peak (Fig. 24B, point ׳2׳) a dominating localized zone formed. At the point ׳3׳, the start of a discrete macro-crack was detected. A fully developed macro-crack was observed at the point ׳4׳.  The following elastic material parameters were assumed in calculations: E=30GPa and v=0.2. The tensile strength was f  t =2.1MPa. In plasticity, the exponential softening curve with the parameter κ  u =0.004 was chosen. The characteristic length was equal to l=2mm and non-locality parameter was m=2. In XFEM, the exponential softening scheme with the fracture energy G  f =70N/m was assumed. The algorithm ׳B1׳ (d  mix =2mm) was used with the convergence tolerance equal to 0.02 in Eq. (26). The FE-mesh consisted of 10348 4-node quad elements. In a localized zone, the finite elements׳ size was smaller than 0.5mm.  First, the transition softening parameter κ  cd , being equivalent to the characteristic points ‘3’ and ‘4’ in Fig. 24A, was determined from comparisons with the experimental vertical force. The transition point was κ  cd =2.77·10−3 (it corresponded to the tensile yield stress equal to 50% of the tensile strength f  t ). The full development of a macro-crack in the point ‘4’ was approximately equivalent to the transition parameter κ  cd =6.44·10−3 (0.2f  t ). The growth of a macro-crack started with the non-zero tensile yield stress in the simulations. It was a cohesive macro-crack and tractions could be transferred across its faces.    Fig. 25 presents the force–displacement diagrams and horizontal displacements and strains in the localized zone along the horizontal above the notch from the numerical simulations and experiments. A perfect match of the curve P=f(CMOD) was obtained in softening just after the peak (in this area the macro-crack was detected) (Fig. 25A). Some differences occurred in the final tests stage. Other discrepancies can be also detected when analyzing the initial stiffness of both curves (which was higher in the experiment). A satisfactory agreement was achieved when reproducing the displacement field before the macro-crack formation (Fig. 25B). The horizontal displacement difference for two points located before the moment of the macro-crack detection was equal to 0.035mm and 0.032mm in the experiment and numerical calculation, respectively. Due to the gradual mechanism of the deformation transfer from the bulk to discrete crack in the numerical algorithm, a sudden jump of horizontal displacements observed in the experiment was not properly reproduced. In contrast, the horizontal strains in simulations were underestimated as compared to the experimental outcome (Fig. 25C). It is caused by a different localized zone width. While in the experiment, the width of the localized zone was equal to 4mm, in the numerical calculations it was equal to 6mm. The same displacement jump (as in the experiment) was spread over the larger distance. As a consequence, the smaller horizontal strain was obtained. In order to improve the strain profiles, the smaller characteristic length l should be assumed (with a modification of the parameter κ  u for preserving the same fracture energy).  The ongoing research numerical works focus on two aims: the improvement of the 2D model formulation and an identification of a transition point based on a comparison of numerical results and experiments using DIC or x-ray micro-tomography [49]. The numerical improvement will concern a more advanced definition of the averaging scheme in non-local plasticity to obtain a more gradual transition form a continuous to discontinuous mode. In addition, statistical numerical calculations will be performed [50–52] to capture the real shape of a localized zone (Fig. 24).   CONCLUSIONS   A coupled continuous–discontinuous constitutive model was presented in order to realistically describe fracture in plain concrete (localized zones and cracks). The model preserves the well posedness of the boundary value problem in crack descriptions using both integral non-local theory and XFEM at the continuous and discrete level. Its ability to capture a change in a fracture description of a localized zone/crack without energy losses was successfully examined under uniaxial and mixed stress state conditions. The coupled model was able to reflect basic properties of concrete specimens and to reproduce satisfactorily a complex crack geometry during a mixed failure mode in the Nooru-Mohamed test with respect to their shape. The calculated displacements and strains in a fractured zone were in agreement with the experimental ones. An approximate value of a transition point between a continuous to discontinuous formulation was identified with the aid of the analysis of experimental results using the DIC technique.  Algorithmic aspects of the coupled model were carefully studied and the numerical performance of the algorithm was examined in detail. An efficient algorithm was developed to activate discrete cracks with non-zero traction forces. A new method was proposed to include a mixed zone of an active continuous and discontinuous description of the crack growth at the same time in order to avoid numerical oscillations. The method proposed significantly improved the existing solutions with coupled constitutive models with respect to the reduction of emerging bumps on load–displacement diagrams in the entire softening regime. It also allowed for applying different continuum constitutive laws (e.g. isotropic damage and elasto-plastic models).  The one-phase algorithm ׳B1׳ was found to be the best choice in simulations with coupled constitutive laws. This method allowed for switching off non-local softening in integration points perpendicular to a newly created crack segment. The proper choice of a mixed zone length was a crucial issue. For coupled laws within elasto-plasticity, it should be approximately equal to a characteristic length while a zero value should be defined within continuum damage mechanics. Such assumptions allowed to obtain smooth force–displacement curves with a time distributed crack propagation history.  In spite of improvements, the proposed algorithm was however characterized by a slow convergence in more complex BVPs. Another issue to be solved was a possible blockade of a discrete crack growth caused by the simultaneous coexistence of a smeared and discrete degradation mechanism in the same area. The examination of a crack activation criterion in the region ahead the crack tip (with more finite elements) can be regarded as a partial solution only. These aspects require further investigation and some improvements to formulate a numerically fully efficient coupled continuum-discrete constitutive law.   ACKNOWLEDGEMENTS   Research work has been carried out as a part of the Project: “Innovative resources and effective methods of safety improvement and durability of buildings and transport infrastructure in the sustainable development” financed by the European Union (POIG.01.01.02-10-106/09-01) and of the Project \"Experimental and numerical analysis of coupled deterministic-statistical size effect in brittle materials\" financed by the National Science Centre (NCN) (UMO-2013/09/B/ST8/03598).  The calculations were carried out at the Academic Computer Centre in Gdańsk (TASK).   REFERENCES", "highlights": "The paper presents a constitutive model for concrete which combines a continuous and discontinuous fracture description. In a continuum regime, two different constitutive laws were used. First, a plasticity model with a Rankine failure criterion and an associated flow rule was used. Second, a constitutive law based on isotropic damage mechanics was formulated. In order to capture the width of a localized zone and to obtain mesh-independent results, both models were equipped with a characteristic length of micro-structure by applying a non-local theory of an integral format. In order to describe a macro-crack as a displacement jump along/across a localized zone, the eXtended Finite Element Method (XFEM) was used. A transition algorithm between a non-local continuum model and XFEM was formulated. The implementation details of a coupled approach were given. The performance of two coupled models were numerically analysed based on several 2D benchmarks with a dominating mode-I (e.g. uniaxial tension and bending) and under mixed-mode conditions. The numerical results were compared with our experimental ones. The advantages of a continuous–discontinuous coupling in describing crack patterns were outlined."}