{"id": "S0168874X15000141", "article": "MAIN-TITLE Isogeometric analysis of topologically complex shell structures   HIGHLIGHTS          The isogeometric analysis methodology for topologically complex shell structures is presented.      Isogeometric analysis of topologically complex shell structures is performed by using trimmed NURBS surfaces and exact normal vectors.      The basic concept of the Trimmed Surface Analysis is adopted and appropriately modified to shell structures.      The exact normal vectors, which are directly calculated by NURBS surface expression are used in the shell formulation based on the Reissner–Mindlin degenerated shell element.      The analytic derivatives of the direction vectors, which are directly calculated by NURBS surface expression are also employed in the shell formulation.      With numerical examples, it is shown that the present method for topologically complex shell structures, which cannot be treated by the conventional isogeometric analysis without multiple patches, gives appropriate solutions.          KEYPHRASES   Isogeometric analysis  Reissner–Mindlin degenerated shell  Topologically complex shell structures  Single NURBS patch  Exact normal vectors   Isogeometric analysis [1] has shown great success on the various engineering fields such as, structural analysis [2–5], contact problems [6–8], fluid analysis [9–12], fluid–structure interaction problems [13,14], structural vibration analysis [15], optimization [16–20], just to name a few. Also the studies on shell structures have been performed by many researchers with the affirmative features of the isogeometric analysis [21–42].  Kirchhoff–Love shell theory is based on the assumption that the shell is thin enough to neglect transverse shear deformations. In the governing equation, rotations of the shell are described by the second derivatives of the displacements. Thus this theory requires at least   C  1  continuity at the interfaces of the elements. In this regard, the isogeometric analysis is suited for the Kirchhoff–Love shell since the necessary continuity is fulfilled by NURBS expression. J. Kiendl et al. [25,26] developed the isogeometric Kirchhoff–Love shell and dealt with the shell structures comprised of multiple patches by the bending strip method. Nguyen-Thanh et al. [30] introduced the approach for isogeometric analysis of thin shells using polynomial splines over hierarchical T-meshes. In these cases, however, it is difficult to impose rotation boundary conditions explicitly and additional schemes are required to connect the multiple patches.  In Reissner–Mindlin shell and Naghdi shell, transverse shear deformations are taken into account. In the research works by Rho and Cho [21,22], the assumed strain element and assumed natural strain element based on the Naghdi theory were proposed with B-spline basis functions. The proposed method was a pioneering research work on the analysis of geometrically exact shell structures, and it reduces the severe locking troubles. Uhm and Youn [24] presented the isogeometric linear shell formulation using the Reissner–Mindlin theory. They applied T-spline refinements into the shell analysis. Benson et al. [28] proposed the degenerated solid Reissner–Mindlin shell for isogeometric analysis and dealt with linear elastic and nonlinear elasto-plastic problems. Dornisch et al. [33,40] developed the shell formulation with the exactly calculated direction vectors. They accounted the new approach to calculate exact nodal direction vectors and exact nodal basis systems. Hosseini et al. [34,42] developed the isogeometric solid-like shell element for nonlinear analysis. The shell element represents a complete three-dimensional shell by spline basis functions (NURBS or T-splines) for the mid-surface of the shell and Lagrange shape functions for the thickness direction. With this approach, not only the exact shell geometry is described but also the accurate prediction of three-dimensional stress fields becomes possible. Hah et al. [43] applied hierarchically superimposing local refinements for the Reissner–Mindlin shell, and the results show affirmative convergences. Benson et al. [36] proposed the blended isogeometric shell which combines the Kirchhoff–Love theory with the Reissner–Mindlin theory. In the method, the Reissner–Mindlin formulation is used locally where the constraints need to be enforced.  As mentioned above, the various research works on the isogeometric shell have been successfully conducted. However, mostly simple shell structures have been handled. The serious limitation of the researches is that they could not treat topologically complex shell structures, since they are based on the conventional isogeometric approach. Due to the tensor-product nature of NURBS description, only four-sided domains can be treated. Thus the analysis domain of a topologically complex shell needs to be divided into multiple NURBS patches, and additional schemes are required for sewing the patches. However in the CAD industry, topologically complex surfaces are often modeled by employing trimming techniques. If the information of the topologically complex surface is exported in IGES file or STEP file, the information of the untrimmed NURBS surface and the trimming curves is described separately. With this motivation, there are some attempts to handle the topologically complex surface without constructing multiple patches. First of all, the isogeometric method which can analyze two-dimensional trimmed surface was proposed by Kim et al. [2,3,44], and it was named as Trimmed Surface Analysis (TSA). They developed the special schemes for numerical integration and for imposition of boundary conditions considering the trimmed domain boundaries which are described by the trimming curves. With the method, any complex geometry can be analyzed efficiently using only a single NURBS patch. Since this method can save cost and effort for dividing and joining patches, it is very useful and practical for the isogeometric analysis. Cho et al. [23] proposed the shell element based on the Naghdi shell theory with exact geometric representations by NURBS. Also trimmed surface geometries are handled with the information of the surface and the information of the trimming curves. Unlike the above-mentioned research works by Kim et al., however, the trimmed parametric domain is divided and then the structural mesh generation is applied to the divided domains. The numerical integration is simpler than that of the works by Kim et al., but structural mesh generation considering the trimmed surface geometry is additionally required. Schmidt et al. [32] proposed the isogeometric analysis which can handle trimmed NURBS surfaces with the local reconstruction technique. In this method, the trimmed NURBS patches are reconstructed by the interpolation method or the least square approximation with the information of the trimming curves. The method is quite effective to handle trimmed NURBS surfaces and to apply an arbitrarily shaped loading area onto the surface. However, the trimmed boundaries are still not exactly described, and the accuracy of the reconstructed patch boundaries is dependent on the number of sampling points. Another try was conducted by Wang et al. [45]. In the research, the main idea is the same as that of the research works by Kim et al., but the mappings for numerical integration are quite different. Also, compound shell structures are handled by degree-of-freedom coupling of the intersected surfaces.  In the present paper, the isogeometric analysis methodology for topologically complex shell structures is presented. The basic concept of the TSA is adopted and appropriately modified so as to handle the topologically complex shell structures. The complex domain of the shell structure can be treated efficiently with a single patch, and the higher continuity can be maintained throughout the domain, while the continuity decreases at the patch boundaries when the domain is constructed by multiple patches. In the case of using multiple patches, the patch partitioning may affect the solution at the geometrically sensitive areas, such as sharp corners. However, the patch partition dependency is naturally omitted in the present method. Besides, the present method is expected as an appropriate analysis method for the shape and topology optimization of shell structures where the complex topologies of the shell structures are frequently handled.  For the shell formulation, the degenerated shell element based on the Reissner–Mindlin shell theory is employed. In the conventional FEM using the Reissner–Mindlin shell theory, the normal vector of an arbitrary point is calculated by interpolating of the neighboring nodal normal vectors. And the local basis systems are set with the interpolated normal vectors. Unlike the conventional FEM, the surface normal vector can be computed directly and exactly at any point in isogeometric analysis due to the higher-order smoothness of NURBS. Nevertheless, in most isogeometric Reissner–Mindlin based shell formulation, normal vectors are still calculated by interpolating of the normal vectors of the relevant control points. The local basis systems are also defined with the interpolated normal vectors. For these reasons, in this paper, the exact surface normal vectors and their analytic derivatives are calculated using the characteristic of NURBS. The local basis systems on the shell surface are defined based on the exact normal vectors for the shell formulation.  The outline of the paper is as follows. In Section 2, the basics of NURBS and trimmed NURBS surface are presented. The details of the isogeometric shell formulation based on Reissner–Mindlin theory with exact normal vectors is described in Section 3. The shell formulation is validated with benchmark problems. In Section 4, TSA is extended to topologically complex shell structures and the details are described. Numerical examples are handled with the present method, and the results are discussed. Section 5 closes the paper with the concluding remarks.  Non-uniform rational B-spline (NURBS) is a tool used widely for modeling geometries in computer-aided design (CAD). NURBS is more flexible and effective to describe geometries than B-splines since it is weighted and rational form of B-spline. The NURBS curve and surface are defined as Eqs. (1) and (2), respectively.  (1)  C ( u ) =    ∑  i = 1  n   R  i , p   ( u )  w i   P i     ∑  j = 1  n   R  j , p   ( u )  w j    =  ∑  i = 1  n   N i  ( u )  P i    where   P   i   is the i th control point,   w   i   is the individual weight for   P   i   , and n is the total number of control points.   R   i , p   ( u ) is the i th one-dimensional B-spline basis function of order p with knot value u .  (2)  S ( s , t ) =    ∑  i = 1  n   ∑  j = 1  m   R  i , p   ( s )  R  j , q   ( t )  w  i j    P  i j      ∑  k = 1  n   ∑  l = 1  m   R  k , p   ( s )  R  l , q   ( t )  w  k l     =  ∑  i = 1  n   ∑  j = 1  m   N  i j   ( s , t )  P  i j     where   P   i j   is the bidirectional net of control points and   w   i j   is the relevant weight. n and m are the numbers of control points in each parametric direction s and t, respectively. p and q are the orders of B-spline basis functions.  In Eqs. (1) and (2),   N   i   ( u ) represents the one-dimensional NURBS basis function for the curve and  N  i j   ( s , t ) represents the two-dimensional NURBS basis function for the surface.  Isogeometric analysis invokes the isoparametric concept that the same basis functions, e.g. NURBS basis functions, are employed not only for geometric description, also for approximation of field variables. The procedure of isogeometric analysis is summarized as follows:  1) The information of an analysis model such as the coordinates and weights of control points, the order of basis functions and the knot vectors is exported into the form of IGES, STEP, etc.  The physical and parametric domains of the analysis model are defined by the exported information. Additional mesh generation of the model is not required for analysis. The elements of the analysis model are directly defined by the knot spans in the parametric domain, and they uniquely match with the elements in the physical domain. Degrees of freedom (DOFs) are employed to the control points.  To obtain sufficient DOFs for accurate analysis, refinement of the analysis domain can be simply performed by knot insertions. During the knot insertion process, the geometry exactness is preserved.  For numerical integration of the analysis domain, classical Gaussian quadrature rules are used. In the integration process, the integration points in the master domain are mapped to the parametric domain, then to the physical domain.  The boundary and load conditions are imposed as in the conventional FEM. At the boundaries of the domain, Knonecker delta properties are satisfied.  Trimming techniques are the effective ways for creating arbitrary complex topological geometries in CAD systems. As depicted in Fig. 1, the trimmed surface geometry is defined in the physical domain and in the parametric domain separately. In CAD programs, a virgin untrimmed surface can be cut out with trimming curves as the cutters by trimming techniques. The trimming curves can be drawn onto the surface by various methods, e.g. straight projecting the curve onto the surface, pulling the curve in the surface normal direction onto the surface, creating the shortest possible curve between two points on the surface, etc. After the virgin untrimmed surface is cut by trimming techniques, the information of the trimmed surface geometry can be exported to the standard IGES file or STEP file. In the exported IGES file, the physical domain and the parametric domain of the trimmed surface geometry are described. Also, the information of trimming curves for the parametric domain and for the physical domain is provided separately. The trimming curves in the physical domain are mapped to those in the parametric domain, and vice versa. Consequently, we can have the untrimmed surface and the trimming curves in the parametric domain and in the physical domain, separately.  To distinguish the removed parts and the remained parts, there is the orientation rule for the trimming curves in CAD programs. The right-side region following the heading direction of the trimming curve is the removed part, and the left-side region is the remained part as shown in Fig. 1(b).  Isogeometric analysis has many favorable features for shell analysis. The physical geometry of a shell structure can be expressed exactly and smoothly by NURBS expression, and the NURBS parameters themselves become the curvilinear coordinates on the shell surface. The surface normal vector can be calculated exactly at an arbitrary point on the smoothly expressed surface. Also, higher-order continuities are guaranteed throughout the domain.  In the present research, the degenerated shell element based on Reissner–Mindlin shell theory is employed for isogeometric analysis. By using the Reissner–Mindlin shell formulation where the rotational DOFs are explicitly defined, imposing rotation boundary conditions is easer and intuitive. Also it is suitable for the analysis domain which is constructed of multiple patches that have   C  0  continuity at the interfaces.  For the degenerated shell element in isogeometric analysis, the mid-surface of the shell structure is described by NURBS surface. Since the control points of the shell structure do not lie on the surface in general as shown in Fig. 2, how to define local basis systems and how to impose rotational DOFs are the issues in isogeometric shell analysis. There are several ways to define the local basis systems on a shell surface, the projection method is applied in the present research. As can be seen in Fig. 2, each control point   P   i   is projected on the shell surface and the projected point   P   i   ′   becomes the origin of the local basis system.  Defining surface normal vectors is a very crucial issue for shell analysis, especially at integration points for numerical integration. In the conventional FEM and most of the isogeometric analysis based on Reissner–Mindlin shell theory, the normal vector of any arbitrary point is calculated by interpolating the neighboring nodal normal vectors. Thus the accuracy of normal vectors deteriorates more as rising complexity of surface geometry and as increasing the mesh size.  Recently, the isogeometric shell analysis with exactly calculated direction vectors was researched by Dornisch et al. [33]. In this research, the error of the angle and length of the interpolated direction vectors is investigated. They found out that the interpolation of direction vectors does not maintain the length and the orthogonality of the local basis systems, and it has influence on locking. By their proposed interpolation scheme, the orthonormality of the interpolated basis system is achieved at every integration point and the accuracy of solution is improved. However, the normal vectors of the shell surface are still calculated by interpolation. Solving the linear algebra equations for obtaining the exact nodal direction vectors and nodal basis systems requires extra computational cost.  In the shell formulation of the present research, the nodal rotations are interpolated but the exact normal vectors are used. A unit normal vector at an arbitrary point a on the shell surface can be naturally obtained by Eq. (3) if the knot values (   s   a   ,    t   a   ) of the point are known. Since the normal vector is calculated by the derivatives of surface with respect to the parameters s and t , it has   C   p − k − 1   continuity throughout the domain. Here k is the knot multiplicity.  (3)    v   3 a   =   v   3   (   s   a   ,   t   a   ) =  {        l   3 a           m   3 a           n   3 a        }  =     V   3 a     ‖    V   3 a    ‖   =   S   ,   s   (   s   a   ,   t   a   ) × S   ,   t   (   s   a   ,   t   a   )   ‖  S   ,   s   (   s   a   ,   t   a   ) × S   ,   t   (   s   a   ,   t   a   )  ‖     where S ( s , t ) =   ∑   i   n     ∑   j   m     N   i j   ( s , t )   P   i j   and S   ,   s   ( s , t ) = ( ∂ S / ∂ s ) ,  S   ,   t   ( s , t ) = ( ∂ S / ∂ t )    Other unit direction vectors are defined as  (4)     If   e 2  ×  v  3 a   ≠ 0 ,       v  1 a   =  v 1  (  s a  ,  t a  ) =      l  1 a        m  1 a        n  1 a       =  e 2  ×  v  3 a        v  2 a   =  v 2  (  s a  ,  t a  ) =      l  2 a        m  2 a        n  2 a       =  v  3 a   ×  v  1 a            If   e 2  ×  v  3 a   = 0 ,       v  2 a   =  v 2  (  s a  ,  t a  ) =      l  2 a        m  2 a        n  2 a       =  v  3 a   ×  e 1       v  1 a   =  v 1  (  s a  ,  t a  ) =      l  1 a        m  1 a        n  1 a       =  v  3 a   ×  v  2 a             where   e   1   ,   e   2   and   e   3   are the unit base vectors of the global coordinate system.  In the degenerate shell element based on Reissner–Mindlin theory [24,27], the position vector and the displacement vector are expressed by interpolating the discretized nodal values as Eqs. (5) and (6), respectively.  (5)  x =  {     x     y     z     }  = ∑    N   i   ( s , t )     P   i   + ζ ∑    N   i   ( s , t )     v   3 i       t   i    2    where  P i  =     P  x i     P  y i     P  z i     T  is the coordinates of the i th control point.   t   i   is the thickness of the shell and   v   3 i   is the normal vector at the projected point from   P   i   . ζ is the coordinate in thickness direction.  (6)  u =  {     u     v     w     }  = ∑    N   i   ( s , t )   {        u   i           v   i           w   i        }  + ζ  ∑    N   i   ( s , t )    μ   i       t   i    2   {        α   i           β   i        }    where     μ   i   = [ −   v   2 i      v   1 i   ] =  [      −   l   2 i         l   1 i         −   m   2 i         m   1 i         −   n   2 i         n   1 i        ]       In the present research, however, the exact normal vector and other direction vectors as represented in Eqs. (3) and (4) are employed to describe the position vector and the displacement vector. The direction vectors are functions of the parameter s and t , and it is differentiable with respect to s and t . Thus, dissimilar to the expressions Eqs. (5) and (6), the position and displacement vectors with the exact direction vectors can be represented as Eqs. (7) and (8).  (7)  x =  {     x     y     z     }  = ∑    N   i   ( s , t )     P   i   + ζ   v   3   ( s , t ) ∑    N   i   ( s , t )      t   i    2       (8)  u =  {     u     v     w     }  = ∑    N   i   ( s , t )   {        u   i           v   i           w   i        }  + ζ μ ( s , t ) ∑    N   i   ( s , t )      t   i    2   {        α   i           β   i        }       The isogeometric shell formulation requires integration through the shell thickness direction. The master element is introduced for numerical integration. The integration points in the master element are properly mapped to the parametric domain and then to the physical domain as described in Fig. 3.  The transformation equation R is  (9)     R :  {  ξ ,  η ,  ζ  }  →  {  s ,  t ,  ζ  }      s =  ξ 2   (    s   2   −   s   1    )  +  1 2   (    s   2   +   s   1    )      t =  η 2   (    t   2   −   t   1    )  +  1 2   (    t   2   +   t   1    )      ζ = ζ         The transformation equation S is defined as  (10)     S :  {  s ,  t ,  ζ  }  →  {  x ,  y ,  z  }      x = ∑    N   i   ( s , t )     P   i   + ζ   v   3   ( s , t ) ∑    N   i   ( s , t )      t   i    2          Strains in terms of displacements derivatives are expressed as  (11)    {    ε   x      ε   y      ε   z      γ   x y      γ   y z      γ   z x    }  T  = H   {  u   ,   x    u   ,   y    u   ,   z    ⋯  w   ,   z    }  T    where   H =  [     1   0   0   0   0   0   0   0   0     0   0   0   0   1   0   0   0   0     0   0   0   0   0   0   0   0   1     0   1   0   1   0   0   0   0   0     0   0   0   0   0   1   0   1   0     0   0   1   0   0   0   1   0   0     ]       The derivatives of displacements with respect to x , y and z in the right-hand side of Eq. (11) are  (12)   {      u   ,   x         u   ,   y         u   ,   z         v   ,   x        ⋮      w   ,   z        }  =  [        J   − 1      0   0     0      J   − 1      0     0   0      J   − 1        ]   {      u   ,   ξ         u   ,   η         u   ,   ζ         v   ,   ξ        ⋮      w   ,   ζ        }  =  [         J   S    − 1      0   0     0       J   S    − 1      0     0   0       J   S    − 1        ]   {      u   ,   s         u   ,   t         u   ,   ζ         v   ,   s        ⋮      w   ,   ζ        }  = Γ  {      u   ,   s         u   ,   t         u   ,   ζ         v   ,   s        ⋮      w   ,   ζ        }    where ξ , η and ζ are the coordinates in the master element.  Considering the transformations from the master element to the physical element as represented in Eqs. (9) and (10), the Jacobian J is expressed as  (13)  J =   J   R     J   S   =  [      s   ,   ξ       t   ,   ξ      0      s   ,   η       t   ,   η      0     0   0   1     ]   [      x   ,   s       y   ,   s       z   ,   s         x   ,   t       y   ,   t       z   ,   t         x   ,   ζ       y   ,   ζ       z   ,   ζ        ]     where  (14)    J   R   =  [       1 2  (   s   2   −   s   1   )    0   0     0     1 2  (   t   2   −   t   1   )    0     0   0   1     ]         (   s   1   ,    t   1   ) , (   s   2   ,    t   1   ) , (   s   2   ,    t   2   ) and (   s   1   ,    t   2   ) are knot values of vertices of an element, and  (15)    J   S   =  [      ∑    N   i , s     P   x i    + ζ  (    l   3 , s   ∑    N   i    +   l   3   ∑    N   i , s     )      t   i    2      ∑    N   i , s     P   y i    + ζ  (    m   3 , s   ∑    N   i    +   m   3   ∑    N   i , s     )      t   i    2      ∑    N   i , s     P   z i    + ζ  (    n   3 , s   ∑    N   i    +   n   3   ∑    N   i , s     )      t   i    2        ∑    N   i , t     P   x i    + ζ  (    l   3 , t   ∑    N   i    +   l   3   ∑    N   i , t     )      t   i    2      ∑    N   i , t     P   y i    + ζ  (    m   3 , t   ∑    N   i    +   m   3   ∑    N   i , t     )      t   i    2      ∑    N   i , t     P   z i    + ζ  (    n   3 , t   ∑    N   i    +   n   3   ∑    N   i , t     )      t   i    2          l   3   ∑    N   i        t   i    2        m   3   ∑    N   i        t   i    2        n   3   ∑    N   i        t   i    2       ]       since  (16)     x   ,   s   = ∑    N   i , s   ( s , t )    P   i   + ζ  (    v   3 , s   ( s , t ) ∑    N   i   ( s , t )  +   v   3   ( s , t ) ∑    N   i , s   ( s , t )   )      t   i    2      x   ,   t   = ∑    N   i , t   ( s , t )    P   i   + ζ  (    v   3 , t   ( s , t ) ∑    N   i   ( s , t )  +   v   3   ( s , t ) ∑    N   i , t    ( s , t )  )      t   i    2      x   ,   ζ   =   v   3   ( s , t ) ∑    N   i   ( s , t )      t   i    2          Since the mid-surface of the shell structure is expressed by NURBS, the direction vectors are continuous in the parametric domain and the physical domain. Also they are differentiable with respect to the parameters s and t . Thus their derivatives can be obtained as Eqs. (17) and (18).  (17)       v   3 , s   =   {   (  S   ,   s s   × S   ,   t   + S   ,   s   × S   ,   s t    )  ⋅  |  S   ,   s   × S   ,   t    |  −  (  S   ,   s   × S   ,   t    )  ⋅  |  S   ,   s s   × S   ,   t   + S   ,   s   × S   ,   s t    |   }     ‖  S   ,   s   × S   ,   t    ‖  2          v   3 , t   =   {   (  S   ,   s t   × S   ,   t   + S   ,   s   × S   ,   t t    )  ⋅  |  S   ,   s   × S   ,   t    |  −  (  S   ,   s   × S   ,   t    )  ⋅  |  S   ,   s t   × S   ,   t   + S   ,   s   × S   ,   t t    |   }     ‖  S   ,   s   × S   ,   t    ‖  2            (18)       v   1 , s   =   e   2   ×   v   3 , s   ,    v   2 , s   =   v   3 , s   ×   v   1   +   v   3   ×   v   1 , s    ( if    e   2   ×   v   3   ≠ 0 )       v   2 , s   =   v   3 , s   ×   e   1   ,    v   1 , s   =   v   2 , s   ×   v   3   +   v   2   ×   v   3 , s    ( if    e   2   ×   v   3   = 0 )         The derivatives of displacements with respect to s , t and ζ in Eq. (12) are expressed as  (19)       u   , s   = ∑    N   i , s   ( s , t )    u   i   + ζ  (    μ   , s   ( s , t ) ∑    N   i   ( s , t )  + μ ( s , t ) ∑    N   i , s   ( s , t )   )      t   i    2   {        α   i           β   i        }        u   , t   = ∑    N   i , t   ( s , t )    u   i   + ζ  (    μ   , t   ( s , t ) ∑    N   i   ( s , t )  + μ ( s , t ) ∑    N   i , t   ( s , t )   )      t   i    2   {        α   i           β   i        }        u   , ζ   = μ ( s , t ) ∑    N   i   ( s , t )      t   i    2   {        α   i           β   i        }          Thus,  (20)   {      u   ,   s         u   ,   t         u   ,   ζ         v   ,   s        ⋮      w   ,   ζ        }  = ∑    R   i     {        u   i           v   i           w   i           α   i           β   i        }  = ∑  [        N   i , s      0   0    − ζ  (    l   2 , s   ∑    N   i    +   l   2   ∑    N   i , s     )      t   i    2      ζ  (    l   1 , s   ∑    N   i    +   l   1   ∑    N   i , s     )      t   i    2          N   i , t      0   0    − ζ  (    l   2 , t   ∑    N   i    +   l   2   ∑    N   i , t     )      t   i    2      ζ  (    l   1 , t   ∑    N   i    +   l   1   ∑    N   i , t     )      t   i    2       0   0   0    −   l   2   ∑    N   i        t   i    2        l   1   ∑    N   i        t   i    2       0      N   i , s      0    − ζ  (    m   2 , s   ∑    N   i    +   m   2   ∑    N   i , s     )      t   i    2      ζ  (    m   1 , s   ∑    N   i    +   m   1   ∑    N   i , s     )      t   i    2       ⋮   ⋮   ⋮   ⋮   ⋮     0   0   0    −   n   2   ∑    N   i        t   i    2        n   1   ∑    N   i        t   i    2       ]   {        u   i           v   i           w   i           α   i           β   i        }       Finally, the strain-displacement relation becomes by combination of the equations from Eqs. (11)–(20),  (21)    {    ε   x      ε   y      ε   z      γ   x y      γ   y z      γ   z x    }  T  = ∑    B   i      {    u   i      v   i      w   i      α   i      β   i    }  T    where B = T H Г R , and T is the coordinate transformation matrix.  The local stress-strain relation for an isotropic and homogeneous material is stated as  (22)    σ   local   =  {        σ   1           σ   2           σ   3           τ   12           τ   23           τ   31        }  =  [       E  1 −   ν  2          ν E   1 −   ν  2       0   0   0   0        ν E   1 −   ν  2         E  1 −   ν  2       0   0   0   0     0   0   0   0   0   0     0   0   0     E  2 ( 1 + ν )      0   0     0   0   0   0      5 E   12 ( 1 + ν )      0     0   0   0   0   0      5 E   12 ( 1 + ν )        ]   × {        ε   1           ε   2           ε   3           γ   12           γ   23           γ   31        }  =   D   local     ε   local     where   D   local   is the constitutive matrix in the local coordinate system.  Eq. (22) fulfils the stress condition   σ   3   = 0 and provides plane stress condition in thickness direction.  The global stress-strain relation is stated as  (23)    σ   global   =   D   global     ε   global   =   T  T    D   local   T   ε   global        The element stiffness matrix K e is constructed as  (24)    K   e   = ∭    B  T    D   local   B  d Ω  =  ∫  − 1  1    ∫  − 1  1    ∫  − 1  1     B  T    D   local   B  | J |     d ξ  d η  d ζ  =  ∑  k = 1   NINT       B   k   T    D   local     B   k    |    J   k    |    W   k      where NINT is the total number of Gaussian integration points, and   W   k   is the weight for the integration point.  In this section, the Reissner–Mindlin shell formulation with exact direction vectors for isogeometric analysis is validated through the benchmark problems; Pinched cylinder with rigid diaphragm problem and Scordelis–Lo roof problem.  Pinched cylinder with rigid diaphragm from the shell obstacle course in [46] is solved. The description of the problem is shown in Fig. 4(a). A pair of vertical concentrated load is applied at the diametrically opposite location of the cylinder surface in inward direction. The both sides of the cylinder are supported by rigid diaphragms (   u   x   =   u   z   =   θ   y   = 0 ). Young׳s modulus is E = 3.0 ×   10  6  and Poisson׳s ratio is ν = 0.3 . The length, radius and thickness are L = 600 , R = 300 and t = 3.0 , respectively. Due to the symmetric shape, one eighth of the cylinder, as shown in Fig. 4(b), is modeled and analyzed.    Fig. 5 represents the convergence curves by the present shell formulation when p = 2 ,  3 ,  4 , and they are compared with two reference values. For the vertical displacement at the point A, one of the reference values is Flugge׳s analytic solution   u   A   = 1.8248 ×   10   − 5   . The other one is the converged numerical solution by NASTRAN with QUAD8 elements   u   A   = 1.8541 ×   10   − 5   in [21]. By the statement in the literature [21], transverse shear deformation is not considered in Flugge׳s analytic solution. Thus the numerical solution by NASTRAN is converged at the slightly higher value than the analytic solution. As can be seen in Fig. 5, the results by the present method reaches to the slightly higher value than the analytic solution, but very close to the FEM result (NASTRAN).  For comparison with the results of Dornisch et al. [33], the results when p = 2 ,  4 ,  5 by the present method are normalized to 1.83 ×   10   − 5   and plotted with the results by Dornisch et al. in Fig. 6. As can be seen from the figure, it is shown that the accuracy and the convergence rate of the present formulation are quite close to those of the research by Dornisch et al. However, the results of the present method are not exactly converged to a certain value and they become slightly higher over the reference as rising the number of elements. The comment on this phenomenon is also stated in [47]. This is because the transverse displacement of Reissner–Mindlin shell under a concentrated load is singular and it goes to infinity [48]. Also, in both methods, slow convergence rate is observed when p = 2 due to the locking phenomena. The locking is remarkably reduced with p > 2 without any treatment.  Scordelis–Lo roof under the self-weight is analyzed with the shell formulation with exact direction vectors. Fig. 7(a) shows the geometry of the Scordelis–Lo roof. The both curved ends of the roof are supported by rigid diaphragms and the rest edges are left freely. The roof is subject to a uniform vertical gravity ( g = 90 per unit area). The radius R , length L , thickness t and angle θ are 25, 50, 0.25 and 80, respectively. The material properties are E = 4.32 ×   10  8  and ν = 0.0 . Due to the symmetry, one quarter model is used for analysis as shown in Fig. 7(b). The reference converged numerical solution of the vertical displacement at the point A is   u   A   = 0.3024  [46].    Fig. 8 represents the convergence curves of the solution by the present shell formulation, and they are compared with the reference value. The results by the present method converge to 0.3020395, slightly lower than the reference value   u   A   = 0.3024 .  To compare the results when p = 2 ,  4 ,  6 by the present method with the results of Dornisch et al. [33], the results are plotted together in Fig. 9. It can be seen that both the methods show almost identical convergences, but the solutions converge to the different values which are slightly lower than the reference value. The converged value of the results by Dornisch et al. is   u   A   = 0.3020247 .   DISCUSSION   In the results of the benchmark problems, the present shell formulation with exact normal vectors and their derivatives gives appropriate solutions. The locking phenomena are gradually decreased as increasing the order of NURBS basis functions. Comparing the results with those of the research by Dornisch et al., the convergence tendencies in the two methods are similar in the pinched cylinder problem and in the Scordelis–Lo roof problem. However, the results by the present shell formulation converge to the very slightly softer solutions. In the present method, the derivatives of displacements are more accurate since the analytic derivatives of the direction vectors are applied in the shell formulation.  In terms of locking, since the objective of our research is focused on the efficient isogeometric analysis of topologically complex shell structures using TSA, locking treatment is out of the purpose of the present method. However, there are a lot of research works to alleviate locking for isogeometric shell analysis such as solid-shell element with assumed natural strain method [41], degenerated Naghdi shell element with assumed strain method [22,23,49], improved numerical integration [47], hierarchic shell element [38], continuum shell element [42], etc. We believe that the present method will give more accurate solutions with the above-mentioned shell elements. In isogeometric analysis, NURBS basis functions are used for interpolation of both the translational displacements and the rotations. However, the control points of the shell surface are not located on the surface in general, and the normal vectors are defined on the surface. Thus using the same basis functions for the translational displacements and the rotations causes locking since the NURBS basis function is not interpolative. Therefore the study on the interpolation method of the rotations for reducing locking is one of the meaningful future works in the isogeometric shell analysis.  In this section, the basic concept of TSA is adopted to the present shell formulation. In the parametric domain of the trimmed surface geometry, some of the elements are trimmed by the trimming curves as depicted in Fig. 1. The one side of each of the trimmed elements is a portion of the trimming curve. Thus the NURBS curve side of the trimmed element should be considered in the mapping for numerical integration. The TSA is carried out by the following sequential procedures. For more details, see [2,3].  • Searching of trimmed elements: Using the information of trimming curves, the trimmed elements and untrimmed elements are searched out. Since there is no analytical relationship between the NURBS surface and the trimming curves, special searching schemes for the trimmed elements are required.  Classification of trimmed elements: All the trimmed elements are classified into three groups according to how many vertices of the trimmed element are located in the void region.  Decomposition of trimmed element into integration cells: The trimmed element is decomposed into integration cells according to its trimmed shape. The intersection points of the trimmed element and the trimming curves are found by Newton method. Then using the intersection points, the trimmed element is decomposed into ‘right-angled triangular cell’ and ‘triangular cell with NURBS curve’ for numerical integration.  Stiffness matrix construction.  Since the mid-surface of a shell structure is still described by NURBS surface, TSA can be simply adopted. Thus the processes of trimmed elements searching and integration cell decomposition are the same as those of two-dimensional TSA. The main difference is the integration through the shell thickness direction. Therefore the transformation from the master element to the physical element is different.  For imposing boundary conditions on the trimming curves or on the area described by the trimming curve, special imposition schemes are required due to following reasons. First, Kronecker delta property is not satisfied within the NURBS patch. Second, the control points of trimming curves have no analytical relationship with the surface control points which have DOFs, i.e. the surface and the trimming curves are defined independently in the CAD programs. See [3,32] for the details of the boundary condition impositions on the trimming curves or on the area described by the trimming curve.  The trimmed element is decomposed into integration cells, i.e. the right-angled triangular cell and the triangular cell with NURBS curve, for numerical integration. The right-angled triangular cell is integrated by Gaussian quadrature with the triangular master element. The triangular cell with NURBS curve is integrated by the NURBS-enhanced integration scheme [50] considering the NURBS curve side of the element.  The transformation relations of the right-angled triangular cell are described in Fig. 10. To apply Gaussian quadrature, the master element is introduced for the mapping of the integration points. (   s   1   ,    t   1   ) , (   s   2   ,    t   2   ) and (   s   3   ,    t   3   ) are the coordinates of the three vertices of the element in the parametric domain.  (25)     R :  {  ξ ,  η ,  ζ  }  →  {  s ,  t ,  ζ  }      s =   s   1    (  1 − ξ − η  )  +   s   2   ξ +   s   3   η     t =   t   1    (  1 − ξ − η  )  +   t   2   ξ +   t   3   η     ζ = ζ         The transformation process S is the same as Eq. (10).  The Jacobian matrix of the right-angled triangular integration cell is the same as Eq. (13).  The transformation relations of the triangular cell with NURBS curve is described in Fig. 11. To apply Gaussian quadrature, the master element is introduced for the mapping of the integration points. For numerical integration considering the NURBS curve side, the NURBS-enhance integration scheme [50] is applied. The integration cell has two straight boundaries and one NURBS curve boundary. (   s   1   ,    t   1   ) , (   s   2   ,    t   2   ) and (   s   3   ,    t   3   ) are the coordinates of the three vertices of the integration cell in the parametric domain.   u   1   and   u   2   are the knot values of the vertices on the NURBS curve boundary. The transformation R is expressed as Eq. (26) by triangular linear shape functions which are defined in the domain   T   e   . The three vertices in the domain   T   e   are set to (0, 0), (1, 0) and (0, 1) in X Y coordinates.  (26)     R :  {  X ,  Y ,  ζ  }  →  {  s ,  t ,  ζ  }      s =   s   1   Y +   s   2   ( 1 − X − Y ) +   s   3   X     t =   t   1   Y +   t   2   ( 1 − X − Y ) +   t   3   X     ζ = ζ         Since the coordinates of the NURBS curve in the parametric domain   C   pa   ( u ) are known from the IGES file, the coordinates of the NURBS curve in the domain   T   e     ϕ ( u ) are simply obtained by the inverse of the transformation R as  (27)  ϕ ( u ) =   R   − 1   ⋅   C   pa   ( u )      The cubic master element (   [  − 1 ,  1  ]  ×  [  − 1 ,  1  ]  ×  [  − 1 ,  1  ]   ) is transformed to the rectangular domain   ψ   e    (   [    u   1   ,    u   2    ]  ×  [  0 ,  1  ]  ×  [  − 1 ,  1  ]   )  , and then to the curved triangular domain   T   e   . The transformation procedures P and Q are expressed as Eqs. (28) and (29), respectively.  (28)     P :  {  ξ ,  η ,  ζ  }  →  {  u ,  r ,  ζ  }      u =  ξ 2   (    u   2   −   u   1    )  +  1 2   (    u   2   +   u   1    )      r =  η 2  +  1 2      ζ = ζ         (29)     Q :  {  u ,  r ,  ζ  }  →  {  X ,  Y ,  ζ  }      X =   ϕ   X   ( u ) ( 1 − r )     Y =   ϕ   Y   ( u ) ( 1 − r ) + r     ζ = ζ      where   ϕ   X   and   ϕ   Y   are the coordinates of the NURBS curve in the domain   T   e   .  The transformation process S is the same as Eq. (10). Thus the Jacobian of the triangular cell with NURBS curve is expressed as  (30)  J =   J   P      J   Q      J   R      J   S   =  [      u   ,   ξ       r   ,   ξ      0      u   ,   η       r   ,   η      0     0   0   1     ]   [      X   ,   u       Y   ,   u      0      X   ,   r       Y   ,   r      0     0   0   1     ]   [      s   ,   X       t   ,   X      0      s   ,   Y       t   ,   Y      0     0   0   1     ]   [      x   ,   s       y   ,   s       z   ,   s         x   ,   t       y   ,   t       z   ,   t         x   ,   ζ       y   ,   ζ       z   ,   ζ        ]       In this section, two examples are considered to access the accuracy of the analysis result by the present method, i.e. TSA of shell structures. The first example model is a quarter cylinder with two holes, and the second one is a vehicle fender.    Fig. 12(a) shows the geometry of the model. The model is a quarter of a cylinder along the circumference direction, and it has two holes on the surface as shown. The mid-surface of the quarter cylinder is modeled by a NURBS surface and the two holes are described by the two closed trimming curves which are projected from two circles in x y plane. The length   L   1   , radius   R   1   and angle of the quarter cylinder θ are 200, 100, 90, respectively. The thickness t equals to 1 and the radius of the circles in x y plane for the holes   R   2   is 30. The distances of the hole centers from the side y = 0 in x y plane are   L   2   = 45 and   L   3   = 155 , respectively. The material properties are E = 7.0 ×   10  4  and ν = 0.33 . As the boundary conditions, one straight edge is fixed and the opposite edge is fixed vertically. The edge load in x-direction F = 1 per unit length is applied on the right straight edge.  For TSA of the shell structure, quadratic NURBS basis functions are used for both the geometric representation and the analysis. The number of elements per the surface edge is 62 and the total number of the control points is 4096. Fig. 13 shows the parametric domain and the physical domain of the model. As shown in the figure, the control points corresponding to the removed region (void region) are not engaged to analysis. Thus the total number of the active control points for analysis is 3648, not 4096. To validate the analysis result by the present method, the same model is analyzed by the commercial FEM code ABAQUS and the result is compared with that by the present method. By importing the IGES file of the quarter cylinder to ABAQUS, the same model geometry can be treated. In the analysis by ABAQUS, the model is discretized by 25,131 elements with S8R5 shell element which has 8 nodes and 5 DOFs. To release locking phenomena, reduced integration is applied. The total number of nodes is 1,00,977 to obtain the converged solution. From   Figs. 14–16 the results by the present method and those by ABAQUS are compared. Comparing the results, the contours in each of the displacement fields are nearly identical and the maximum values of the results by the two methods are very close, even though the number of DOFs in the present method is much less than that in ABAQUS.  A vehicle fender is considered for the second example. Fig. 17 describes the geometry of the model and its boundary conditions. This model is composed by a complex curved surface and two unclosed trimming curves. The mid-surface of the vehicle fender is modeled by a NURBS surface and the two trimmed boundaries are described by the two trimming curves which are projected from x y plane.   L   1   ,   L   2   ,   L   3   and R of the model are 1100, 350 and 550, respectively. The thickness equals to 2, and the material properties are E = 21.0 ×   10  5  and ν = 0.3 . As boundary conditions, the left and right edges are fixed and the surface pressure P = 0.01 per unit area is applied.  For TSA of the model, cubic NURBS basis function is used for both the geometric representation and the analysis. The shell surface is discretized by 40 × 64 elements. The total number of the control points is 2881. Fig. 18 shows the parametric domain and the physical domain of the model. The number of the active control points which are engaged to analysis is 1912, not 2881. The results are compared with those by ABAQUS with the same model. In the analysis by ABAQUS, the model is discretized by 17,934 elements (S8R5) to obtain the converged solution. The total number of nodes is 71,407. Fig. 19, Fig. 20 and Fig. 21 represent the results by the present method and those by ABAQUS. In each of the displacement fields, the contours are nearly identical, but the maximum and minimum values by the present method is slightly higher than those by ABAQUS. However, it is noted that the present method gives the relevant solutions, even though the curvature of the vehicle fender is very complex and the number of DOFs in the present method is much less than that in ABAQUS.  In the present work, the isogeometric analysis of topologically complex shell structure is presented. Through the present method, any topologically complex shell geometry can be analyzed without employing multiple NURBS patches nor dividing / joining the patches. A lot of effort and cost for preparing multiple shell patches are greatly reduced, and the higher continuity is preserved throughout the analysis domain. By employing the normal vectors and their derivatives, which are calculated directly and exactly, in the shell formulation, the errors from using interpolated normal vectors are eliminated and the computational cost for normal vector interpolation is not required. The shell formulation is validated by linear elastic benchmark problems, and the results show reasonable convergences. With two numerical examples, it is confirmed that the present method for topologically complex shell structures which cannot be treated by the conventional isogeometric analysis without multiple patches, gives appropriate solutions.  Shape optimization of topologically complex shell structures and topology optimization of shell structures by using the present method are our future works. The present method is expected to be a suitable analysis method for the above-mentioned optimizations where topologically complex geometries are frequently treated. This is the reason why the basic Reissner–Mindlin shell model is used in the present method. However, the shell element used in the present method is limited to isotropic linear elasticity and small deformations. Thus the present method, i.e. isogeometric analysis of topologically complex shell structures, is needed to be further developed with the other efficient shell models. It is obvious that there are excellent isogeometric shell models developed recently, e.g. hierarchical shell model [38], solid-shell model [37], and blended shell model [36], etc. With the shell models, we expect that the present method will give more accurate solutions and will be applied to various problems.   ACKNOWLEDGMENTS   This work was partially supported by the National Research Foundation of Korea (NRF) grant funded by the Korea government (MSIP) (No. 20100028680) and the NRF grant funded by the Korea government (MSIP) (No. 20110015469).   REFERENCES", "highlights": "In the conventional isogeometric analysis, a topologically complex shell structure is required to be modeled using multiple NURBS patches. In the CAD industry, however, the topologically complex shell structure is conveniently and efficiently created via trimming techniques rather than constructing multiple untrimmed NURBS patches. With this feature, the isogeometric analysis which enables to handle the topologically complex shell structure with a single NURBS patch is presented in this paper. In the present method, the information of the topologically complex shell structure composed of the untrimmed surface and trimming curves is directly utilized into isogeometric shell analysis. For numerical integration, a special integration scheme is adopted considering the inside or the outside of the trimmed boundaries which are described by the trimming curves. For the shell formulation, the degenerated shell element based on the Reissner–Mindlin theory is employed. The exact surface normal vectors and their analytic derivatives are adopted into the formulation. The shell formulation is validated with linear elastic benchmark problems. Then linear elastic problems of topologically complex shell structures are dealt with using the proposed procedures, and the effectiveness is illustrated."}