{"id": "S0168874X14001048", "article": "MAIN-TITLE Wave propagation analysis in laminated composite plates with transverse cracks using the wavelet spectral finite element method   HIGHLIGHTS          Wavelet spectral finite element for waves in composites with transverse cracks.      Transverse crack modeled in wavenumber–frequency domain.      Computationally efficient and accurate results obtained for high frequency waves.          KEYPHRASES   Wave propagation  Composites  Spectral finite element  Transverse crack  Structural health monitoring   Composite structures are increasingly used in aerospace, automotive, and many other industries due to several advantages over traditional metals such as superior specific strength and stiffness, lower weight, corrosion resistance, and improved fatigue life [1]. One of the main concerns that restrict wider usage of composites is the damage mechanisms which are not well understood. Most common damage types are delamination between plies, fiber–matrix debonding, fiber breakage, and matrix cracking resulting from fatigue, manufacturing defects, foreign object impact, etc. Currently available non-destructive evaluation (NDE) methods such as ultrasonic, radiography, and eddy-current are time consuming, expensive, and may need structural disassembly for inspection. In addition, these techniques are not suitable for damage detection during operational conditions such as aircraft or space structures in service. Therefore, a structural health monitoring (SHM) system capable of performing diagnostics online and efficiently is urgently needed. In recent years, Lamb wave based SHM techniques have been widely investigated for damage detection in composite structures [2–10].  SHM is essentially an inverse problem where the measured data are used to predict the condition of the structure. Therefore, to be able to differentiate between damage and structural features, prior information is required about the structure in its undamaged state. This is typically in the form of a baseline data obtained from the “healthy state” to use as reference for comparison with the test case. Alternatively, a mathematical model, such as a conventional finite element (FE) simulation, may be used to predict the structural response for comparison purposes. However, small damages such as transverse cracks (resulting from fiber breakage in composite structures) need high frequency Lamb waves for detection. Lowe et al. [11] observed a sinusoidal variation of the reflection coefficient with the ratio of notch width to A 0 mode wavelength and determined that the reflection coefficient is maximized for small notch depths when the ratio stands at 0.5. In another observation, the reflection coefficient is maximized for the notch depth to A 0 mode wavelength ratio of 0.3–0.4. These observations suggest that the diagnostic signal wavelength should be comparable to damage size for SHM. Therefore, high frequency excitation signals are generally used in SHM to identify minute damages present in structures. However, for high frequency excitation FE mesh size should be sufficiently refined (usually at least 20 nodes per wavelength) in order to reach acceptable solution accuracy which leads to large system size and computational cost. Thus FE simulation becomes prohibitive for SHM, especially onboard diagnostics with limited resources. The spectral finite element method (SFEM) yields models that are many orders smaller than FE, making it highly suitable for wave propagation based SHM. The transverse crack model developed here would be useful for understanding interactions between Lamb waves and cracks, optimizing excitation (interrogation) signal for damage detection, and inference of damage type (based on damage–wave interaction features).  The SFEM is essentially a finite element method formulated in the frequency domain, which uses the exact solution to the wave equations as its interpolating function. The frequency domain formulation of SFEM enables direct relationship between output and input through the system transfer function (or, frequency response function). In SFEM, nodal displacements are related to nodal tractions through frequency-wave number dependent stiffness matrix and mass distribution is captured exactly to derive the accurate elemental dynamic stiffness matrix. Consequently, in the absence of any discontinuities, one element is sufficient to model a plate structure of any length. Fast Fourier transform based spectral finite element (FSFE) method was popularized by Doyle [12], who formulated FSFE models for isotropic 1-D and 2-D waveguides including elementary rod, Euler Bernoulli beam, and thin plates. Gopalakrishnan et al. [13] extensively investigated FSFE models for beams and plates-with anisotropic and inhomogeneous material properties. The FSFE method is very efficient for wave motion analysis and it is suitable for solving inverse problems. However, the required assumption of periodicity in time approximation results in “wraparound” problem for smaller time window, which totally distorts the response. In addition, for 2-D problems, FSFE are essentially semi-infinite, that is, they are bounded only in one direction [12]. Thus, the effect of lateral boundaries cannot be captured and this can again be attributed to the global basis functions of the Fourier series approximation of the spatial dimension. The 2-D wavelet transform based spectral finite element (WSFE) method presented by Mitra and Gopalakrishnan [14–16] overcomes the “wraparound” problem and can accurately model 2-D plate structures of finite dimensions.  Considerable work has been done for FE modeling of damages in composite plates [17,18]; however, only a few researchers have approached the problem using the spectral finite element method. Palacz et al. [19] presented a spectral element to analyze transverse crack in isotropic rod. Gopalakrishnan and associates have formulated FSFE models for (open and non-propagating) transverse cracks and delaminations in composite beams and plates [20,21]. Levy and Rice [22] have shown that the slope discontinuity at both sides of a crack due to the bending moments is proportional to the bending compliance of the crack and nominal bending stress. Using the expressions given in [22], Khadem and Rezaee [23] obtained slope discontinuity at both sides of the hypothetical boundary along the crack in terms of the characteristics of the crack. Krawczuk et al. [9] used these expressions to model a transverse crack using Fourier based spectral element for isotropic plates. In a similar approach, Chakraborty et al. [24] modeled wave propagation in a shear deformable composite laminate with transverse crack using Fourier based spectral finite element method. However, FSFE technique suffer from the ‘wraparound’ problem and cannot model finite structures, as noted earlier.  This study develops WSFE model for a non-propagating and open transverse crack in shear deformable laminated composite plates. The developed model has the ability to simulate wave propagation in 2D finite structures with transverse cracks, without the ‘wraparound’ problem of the FSFE method. In this procedure, the plate with one crack is divided into two sub-elements, one on either side of the crack. The placement of crack is parallel to one of the major axes (X or Y). Following the concept of crack flexibility [22,23], a discontinuity is introduced at the crack interface on the angular displacements about the axis parallel to the crack. The crack flexibility depends on crack parameters: length, depth at the center, and shape of the crack. A continuity condition is imposed at crack interface for all other angular and linear displacements, as followed by other researchers [9,24]. Composite laminates with multiple cracks are modeled similarly and the WSFE results are validated with conventional FE analysis using Abaqus®.  The rest of paper is organized as follows. In the next section, the WSFE modeling of shear deformable composite laminates is introduced briefly. Next, the transverse crack formulation using WSFE is presented. The accuracy and efficiency of the WSFE modeling of crack is demonstrated by comparisons with FSFE and FE simulations. Efficient simulation of multiple cracks using WSFE is discussed. Concluding remarks are given in Section 5.  The 2-D WSFE presented by Gopalakrishnan and Mitra [16] overcomes the “wraparound” problem present in FSFE and can accurately model plate structures of finite dimensions. This is due to the use of compactly supported Daubechies scaling functions [25] as basis for approximation of the time and spatial dimensions. However, the WSFE plate formulation in [16] is based on the classical laminated plate theory (CLPT) [26]. The CLPT based formulations exclude transverse shear deformation and rotary inertia resulting in significant errors for wave motion analysis at high frequencies, especially for composite laminates which have relatively low transverse shear modulus [27,28]. Wave propagation in composite laminates based on the first order shear deformation theory (FSDT) [26], which accounts for transverse shear and rotary inertia, yields accurate results comparable with 3-D elasticity solutions and experiments even at high frequencies [27,28]. For isotropic materials FSDT is known to be exceptionally accurate down to wavelengths comparable with the plate thickness h, whereas CLPT is of acceptable accuracy only for wavelengths greater than, say, 20h [29]. FSDT based 2-D WSFE model for pristine composite laminates developed by the present authors is reported in [30,31]. Here, extensive time and frequency domain results are presented to show the significance of FSDT based spectral element formulation. The key steps in 2D WSFE element formulation for shear deformable composite laminates are presented below and the reader is referred to [30] for further details.  Consider a laminated composite plate of thickness h with the origin of the global coordinate system at the mid-plane of the plate and Z axis being normal to the mid-plane as shown in Fig. 1(a). Fig. 1(b) shows the corresponding nodal representation with degrees of freedom (DOFs). Using FSDT, the governing partial differential equations (PDEs) for wave propagation have five degrees of freedom: u ,  v ,  w ,  ϕ ,  and ,  ψ . The terms u(x, y, t) and v(x, y, t) are mid-plane (z=0) displacements along X and Y axes; w(x, y, t) is transverse displacement in Z direction, and ψ ( x , y , t ) and ϕ ( x , y , t ) are the rotational displacements about Y and X axes, respectively. The displacements w, ϕ and ψ do not change along the thickness (Z direction). The quantities (N  xx , N  xy , N  yy ) are in-plane force resultants, (M  xx , M  xy , M  yy ) are moment resultants, and (Q  x , Q  y ) denote the transverse force resultants.  There are five governing equations of motion for wave propagation as reported in the authors׳ previous work [30], but only one EOM is presented here for conciseness. The first EOM based on the FSDT displacement field is given by [26],  (1)    A   11       ∂  2  u   ∂   x  2    + 2   A   16       ∂  2  u   ∂ x ∂ y   +   A   66       ∂  2  u   ∂   y  2    +   A   16       ∂  2  v   ∂   x  2    + (   A   12   +   A   66   )     ∂  2  v   ∂ y ∂ x   +   A   26       ∂  2  v   ∂   y  2    +   B   11       ∂  2  ϕ   ∂   x  2    + 2   B   16       ∂  2  ϕ   ∂ x ∂ y   +   B   66       ∂  2  ϕ   ∂   y  2    +   B   16       ∂  2  ψ   ∂   x  2    + (   B   12   +   B   66   )     ∂  2  ψ   ∂ y ∂ x   +   B   26       ∂  2  ψ   ∂   y  2    =   I   0       ∂  2  u   ∂   t  2    +   I   1       ∂  2  ϕ   ∂   t  2      where the stiffness constants A  ij , B  ij , D  ij and the inertial coefficients I 0, I 1 and I 2 are defined as  (2)  [   A   i j   ,   B   i j   ,   D   i j   ] =  ∑  q = 1     N   p       ∫    z   q       z   q + 1         Q ¯    i j   [ 1 , z ,   z  2  ] d z   ,   {    I   0   ,   I   1   ,   I   2    }  =  ∫  − h / 2   h / 2     {  1 , z ,   z  2   }  ρ  d z    The term    Q ¯    i j   is the stiffness of the qth lamina in laminate coordinate system, N  p is the total number of laminae (plies), ρ is the mass density, and K is the shear correction factor. The associated natural boundary conditions are,  (3)    N   n n   =   n   x   2     N   x x   +   n   y   2     N   y y   + 2   n   x     n   y     N   x y   ,    N   n s   = −   n   x     n   y     N   x x   +   n   x     n   y     N   y y   + (   n   x   2   −   n   y   2   )   N   x y     Q   n   =   Q   x     n   x   +   Q   y     n   y     M   n n   =   n   x   2     M   x x   +   n   y   2     M   y y   + 2   n   x     n   y     M   x y   ,    M   n s   = −   n   x     n   y     M   x x   +   n   x     n   y     M   y y   + (   n   x   2   −   n   y   2   )   M   x y     where n and s denote coordinates normal and tangential to the plate edge, respectively; and n  x and n  y are unit normal into X and Y directions, respectively. The boundary conditions at edges parallel to Y axis can be derived by setting n  x to 1 and n  y to zero. Then   N   n n   and   N   n s   become the specified normal and shear forces into X and Y directions,   M   n n   and   M   n s   are the specified moments about Y and X axes, and   Q   n   is the applied shear force in Z direction. Force and moment resultants are expressed in terms of the stiffness constants A  ij , B  ij , D  ij and displacements [26]. Without loss of generality in all essential aspects of the problem, a laminate composed of an arbitrary number of orthotropic layers such that the axes of material symmetry are parallel to the X–Y axes of the plate (hence A 16=A 26=A 45=B 16=B 26=D 16=D 26=0) is considered for further analysis.  The governing PDEs (Eq. (1)) and boundary conditions (Eq. (3)) have three variables (x, y, and t), and derivatives with respect to them, making it very complex to solve. Therefore, Daubechies compactly supported scaling functions [25] are used to approximate the time variable which reduces the set of equations to PDEs in x and y only. Compactly supported scaling functions have only a finite number of filter coefficients with non-zero values, which enables easy handling of finite geometries and imposition of boundary conditions. The use of Daubechies compactly supported wavelets to solve partial differential wave equations is explained in detail in [14].  Let the time-space variable u(x, y, t) be discretized at n points in the time window (0, t  f ) and τ =0, 1, …, n−1 be the sampling points, then t = Δ t τ where Δ t is the time interval between two sampling points. The function u(x, y, t) can be approximated at an arbitrary scale as  (4)  u ( x , y , t ) = u ( x , y , τ ) =   ∑ k     u   k   ( x , y )   φ ( τ − k ) ,  k ∈ Z   where   u   k   ( x , y ) are the approximation coefficients at a certain spatial dimension (x and y) and φ  ( τ )  are scaling functions associated with Daubechies wavelets. The other translational and rotational displacements v(x, y, t), w(x, y, t), ϕ ( x , y , t ) and ψ(x, y, t) are transformed similarly. The next step is to substitute these approximations into Eq. (1). The approximated equation is then multiplied with translations of the scaling function ( φ ( τ − j ) ,  for  j = 0 , 1 , … , n − 1 ) and inner product is taken on both sides of the equation. The orthogonal property of Daubechies scaling function results in the cancelation of all the terms except when j=k and yields n simultaneous equations.  (5)    A   11    {      ∂  2    u   j     ∂   x  2     }  + (   A   66   +   A   12   )  {      ∂  2    v   j     ∂ y ∂ x    }  +   B   11    {      ∂  2    ϕ   j     ∂   x  2     }  + (   B   12   +   B   66   )  {      ∂  2    ψ   j     ∂ y ∂ x    }  +   A   66    {      ∂  2    u   j     ∂   y  2     }  +   B   66    {      ∂  2    ϕ   j     ∂   y  2     }  =   I   0     [    Γ  1   ]  2    u   j   +   I   1     [    Γ  1   ]  2    ϕ   j     where   Γ  1  is the first-order connection coefficient matrix obtained after using the wavelet extrapolation technique for non-periodic extension. Connection coefficients are the inner product between the scaling functions and its derivatives [32]. The wavelet extrapolation approach of Williams and Amaratunga [33] is used for the treatment of finite length data before computing the connection coefficients. This method uses polynomials to extrapolate the coefficients lying outside the finite domain and it is particularly suitable for approximation in time and the ease to impose initial values. This extrapolation technique addresses one of the serious problems with Fourier based SFE method, namely, the ‘wraparound’ problem caused by treating the boundaries as periodic extensions. By solving the ‘wraparound’ problem, WSFE method is able to handle short waveguides and smaller time windows efficiently. Next, the coupled PDEs are decoupled using eigenvalue analysis of   Γ  1  following the procedure in [14]. The final decoupled form of the reduced PDEs given in Eq. (5) can be written as  (6)       A   11        ∂  2     u ^    j     ∂   x  2     + (   A   66   +   A   12   )      ∂  2     v ^    j     ∂ y  ∂ x    +   B   11        ∂  2     ϕ ^    j     ∂   x  2     + (   B   12   +   B   66   )      ∂  2     ψ ^    j     ∂ y  ∂ x    +   A   66        ∂  2     u ^    j     ∂   y  2     +   B   66        ∂  2     ϕ ^    j     ∂   y  2         = −   I   0     γ   j   2      u ^    j   −   I   1     γ   j   2      ϕ ^    j   ,  j = 0 , 1 , … , n − 1      where    u ^    j   is given by    u ^    j   =   Φ   − 1     u   j   , Φ is the eigenvector matrix of   Γ  1  and i   γ   j   ( i =   − 1   ) are the corresponding eigenvalues. Following exactly similar steps, the other governing PDEs and the natural boundary conditions are transformed to PDEs in spatial dimensions (x and y) only. It should be mentioned here that the sampling rate Δ t should be less than a certain value to avoid spurious dispersion in the simulation using WSFE. In Mitra and Gopalakrishnan [15], a numerical study has been conducted from which the required Δ t can be determined depending on the order N of the Daubechies scaling function and frequency content of the load.  The next step is to further reduce each of the transformed and decoupled PDEs given by Eq. (6) (and similarly for the other transformed governing equations and boundary conditions) to a set of coupled ordinary differential equations (ODEs) using Daubechies scaling function approximation in one of the spatial (Y) dimension. Similar to time approximation, the time transformed variable    u ^    j   is discretized at m points in the spatial window (0, L  Y ), where L  Y is the length in Y direction. Let ζ =0, 1, …, m−1 be the sampling points, then y = Δ Y ζ where Δ Y is the spatial interval between two sampling points.  The function    u ^    j   can be approximated by scaling function φ  ( ζ )  at an arbitrary scale as  (7)     u ^    j   ( x , y ) =    u ^    j   ( x , ζ ) =   ∑ l      u ^    l j   ( x )   φ ( ζ − l ) ,  l ∈ Z   where    u ^    l j   are the approximation coefficients at a certain spatial dimension x. The other four displacements    v ^    j   ( x , y ) ,    w ^    j   ( x , y ) ,    ϕ ^    j   ( x , y ) ,  and     ψ ^    j   ( x , y ) are similarly transformed. Following similar steps as the time approximation, substituting the above approximations in Eq. (6) and taking inner product on both sides with the translates of scaling functions φ ( ζ − i ) , where i=0, 1, …, m−1 and using their orthogonality property (which results in the cancelation of all the terms except when i=l), we get m simultaneous ODEs. Eq. (1), which is temporally reduced in Eq. (6), can be spatially reduced as  (8)    A   11       d  2     u ^    i j     d   x  2    + (   A   66   +   A   12   )  1  Δ Y    ∑  l = i − N + 2   l = i + N − 2      d    v ^    l j     d x     Ω   i − l   1    + (   B   12   +   B   66   )  1  Δ Y    ∑  l = i − N + 2   l = i + N − 2      d    ψ ^    l j     d x     Ω   i − l   1      + B   11       d  2     ϕ ^    i j     d   x  2    +   A   66    1  Δ   Y  2     ∑  l = i − N + 2   l = i + N − 2       u ^    l j     Ω   i − l   2    +   B   66    1  Δ   Y  2     ∑  l = i − N + 2   l = i + N − 2       ϕ ^    l j     Ω   i − l   2    = −   I   0     γ   j   2      u ^    i j   −   I   1     γ   j   2      ϕ ^    i j     where N is the order of Daubechies wavelet and   Ω   i − l   1   and   Ω   i − l   2   are the connection coefficients for first- and second-order derivatives [32].  It can be seen from the ODE given by Eq. (8) that similar to time approximation, even here certain coefficients    u ^    i j   near the vicinity of the boundaries (i=0 and i=m−1) lie outside the spatial window (0, L  Y ) defined by i=0, 1,…, m−1. Here, after expressing the unknown coefficients lying outside the finite domain in terms of the inner coefficients considering periodic extension, the ODEs given by Eq. (8) can be written as a matrix equation:  (9)    A   11    {      d  2     u ^    i j     d   x  2     }  + (   A   66   +   A   12   ) [   Λ  1  ]  {    d    v ^    i j     d x    }  +   B   11       d  2     ϕ ^    i j     d   x  2    + (   B   12   +   B   66   ) [   Λ  1  ]  {    d    ψ ^    i j     d x    }  +   A   66     [   Λ  1  ]  2  {    u ^    i j   } +   B   66     [   Λ  1  ]  2   {     ϕ ^    i j    }  = −   I   0     γ   j   2   {    u ^    i j   } −   I   1     γ   j   2   {    ϕ ^    i j   }   where   Λ  1  is the first-order connection coefficient matrix obtained after periodic extension.  The coupled ODEs given by Eq. (9) are decoupled using eigenvalue analysis similar to that done in temporal approximation. Let the eigenvalues be i   β   i   ( i =   − 1   ) , then the decoupled ODEs corresponding to Eq. (9) are given by  (10)    A   11       d  2     u ˜    i j     d   x  2    − i   β   i   (   A   66   +   A   12   )   d    v ˜    i j     d x   +   B   11       d  2     ϕ ˜    i j     d   x  2    − i   β   i   (   B   12   +   B   66   )   d    ψ ˜    i j     d x   −   β   i   2     A   66      u ˜    i j   −   β   i   2     B   66      ϕ ˜    i j   = −   I   0     γ   j   2      u ˜    i j   −   I   1     γ   j   2      ϕ ˜    i j     where    u ˜    i j   (and similarly other transformed displacements) are given by    u ˜    i j   =   Ψ   − 1      u ^    i j   ; Ψ is the eigenvector and i   β   i   are the eigenvalues of connection coefficient matrix   Λ  1  . Exactly the same procedure is followed to obtain decoupled form for the other EOMs as presented in [30]. The natural boundary conditions (Eq. (3)) are also transformed (temporal and spatial approximations) similarly. The final decoupled ODEs are used for 2D WSFE formulation.  The 2D WSFE has five degrees of freedom per node,    u ^    i j   ,    v ˜    i j   ,    w ˜    i j   ,    ϕ ˜    i j   ,  and     ψ ˜    i j   , as shown in Fig. 1(b). The decoupled ODEs presented above are solved for    u ^    i j   ,    v ˜    i j   ,    w ˜    i j   ,    ϕ ˜    i j   ,    ψ ˜    i j   and the final displacements u(x, y, t), v(x, y, t), w(x, y, t), ϕ ( x , y , t ) and ψ ( x , y , t ) are obtained using inverse wavelet transform twice for spatial Y dimension and time. For further steps, the subscripts j and i are dropped for simplified notations and all of the following equations are valid for j=0, 1,…, n−1 and i=0, 1,…, m−1 for each j. Let us consider the displacement vector  d ˜  as follows,  (11)   d ˜  =  {       u ˜  ( x )        v ˜  ( x )        w ˜  ( x )        ϕ ˜  ( x )        ψ ˜  ( x )      }    Since the final set of equations (that is, Eq. (10) and the decoupled form of other EOMs) is ordinary equations with constant coefficients, we assume a solution of  d ˜  as  (12)   d ˜  =    d ˜    0     e   − i κ x   ,     d ˜    0   =  {         u ˜    0   ( x )          v ˜    0   ( x )          w ˜    0   ( x )          ϕ ˜    0   ( x )          ψ ˜    0   ( x )      }    where κ stands for the wavenumber. Substituting Eq. (12) into the Eq. (10), the set of equations can be posed in Polynomial Eigenvalue Problem (PEP) form [13]. PEP uses the concept of the latent roots and right latent eigenvector of the system matrix (also called the wave matrix) for computing the wavenumber and the amplitude ratio matrix. The PEP of above Eq. (10) and other EOMs can be expressed as,  (13)  {   A   2     κ  2  +   A   1   κ +   A   0   } {    d ˜    0   } = 0   The matrices   A   2   ,    A   1   ,    A   0   are given in the Appendix.  The wavenumbers κ are obtained as eigenvalues of the PEP given by Eq. (13). Similarly, the vector    d ˜    0   is the eigenvector (representing wave amplitudes) corresponding to each of the wavenumbers. The solution of Eq. (13) gives a 5×10 eigenvector matrix of the form  (14)  [ R ] = [   {   d   0   }   1   ,   {   d   0   }   2   , … ,   {   d   0   }   10   ]   and the solution,  d ˜  can be written as  (15)  {  d ˜  } = [ R ] [ Θ ] { a }   where [ Θ ] is a diagonal matrix with the diagonal terms   diag [ Θ ] = {   e   −   k   1   x   ,   e   −   k   1   (   L   X   − x )   ,   e   −   k   2   x   ,   e   −   k   2   (   L   X   − x )   ,   e   −   k   3   x   ,   e   −   k   3   (   L   X   − x )   ,   e   −   k   4   x   ,   e   −   k   4   (   L   X   − x )   ,   e   −   k   5   x   ,   e   −   k   5   (   L   X   − x )   }   Here,   { a }  T  = {   C   1   ,   C   2   , ⋯ ,   C   10   } are the unknown coefficients which can be determined as described in [30]. Finally, the transformed nodal forces {    F ˜   e  } and transformed nodal displacements {    u ˜   e  } are related by  (16)  {    F ˜   e  } = [    K ˜   e  ] {    u ˜   e  }   where [    K ˜   e  ] is the exact elemental dynamic stiffness matrix. The solution of Eq. (16) and the assembly of the elemental stiffness matrices to obtain the global stiffness matrix are similar to the FE method. One major difference is that the time integration in FE uses a suitable finite difference scheme; however, the SFEM performs dynamic stiffness generation, assembly, and solution through a double do-loop over frequency and horizontal wavenumber. Although this procedure is computationally expensive, the problem size in SFEM is very small which keeps overall low computational cost. Another major difference is that unlike FE method, SFEM deals with only one dynamic stiffness matrix and hence matrix operation and storage require minimum computations.  Although the WSFE method is applicable to general laminates, this study considers symmetric laminates wherein bending-extension coupling does not exist. For symmetric laminates, the equations of motion decouple into two sets of equations governing in-plane and transverse motions. The present model considers transverse motion of such laminates. A schematic diagram of the plate element with a crack (penetrating part-through the thickness and non-propagating) is shown in Fig. 2. The length of the element in the X direction is   L   x   and the plate has finite dimension of   L   y   in the Y direction. The crack is located at a distance of   L   1   from the left edge of the plate (origin of the coordinate system) and has a length of 2c in the Y direction.  Two sets of nodal displacements  {    w   1   ,   ϕ   1   ,   φ   1    }   and   {    w   2   ,   ϕ   2   ,   φ   2    }  are assumed on the left and right hand side of a hypothetical boundary along the crack. In the wavenumber–frequency domain, these displacements are represented as {    w ˜    1   ,    ϕ ˜    1   ,    φ ˜    1   }  and  {    w ˜    2   ,    ϕ ˜    2   ,    φ ˜    2   } and expressed by  (17)   {         w ˜    1            ϕ ˜    1            ψ ˜    1        }  =   [ R ]   3 X 6     [   Θ   1   ]   6 X 6     {   C   1   }   6 X 1   ,   {         w ˜    2            ϕ ˜    2            ψ ˜    2        }  =   [ R ]   3 X 6     [   Θ   2   ]   6 X 6     {   C   2   }   6 X 1     where   [ R ]   3 × 6   is the amplitude ratio matrix, and  (18)    [   Θ   1   ]   6 × 6   = diag [   e   − i   k   1   x   ,   e   − i   k   2   x   ,   e   − i   k   3   x   ,   e   − i   k   1   (   L   1   − x )   ,   e   − i   k   2   (   L   1   − x )   ,   e   − i   k   3   (   L   1   − x )   ]   [   Θ   2   ]   6 × 6   = diag [   e   − i   k   1   (   L   1   + x )   ,   e   − i   k   2   (   L   1   + x )   ,   e   − i   k   3   (   L   1   + x )   ,   e   − i   k   1   ( L − (   L   1   + x ) )   ,   e   − i   k   2   ( L − (   L   1   + x ) )   ,   e   − i   k   3   ( L − (   L   1   + x ) )   ]   are square matrices containing exponential terms. A total of 12 unknown constants of {   C   1   } and {   C   2   } are to be determined using the boundary conditions. These constants can be expressed as a function of the nodal spectral displacements using the boundary conditions as follows,  1. At the left edge of the element ( x = 0 )    (19)     w ˜    1   =    q ˜    1   ,     ϕ ˜    1   =    q ˜    2   ,     ψ ˜    1   =    q ˜    3        At the crack interface ( x =   L   1   for {    w ˜    1   ,    ϕ ˜    1   ,    ψ ˜    1   } and x = 0 for {    w ˜    2   ,    ϕ ˜    2   ,    ψ ˜    2   } )       w ˜    1   =    w ˜    2   ,     ψ ˜    1   =    ψ ˜    2   (Continuity of transverse displacement and slope about X-axis across the crack).       ϕ ˜    1   −    ϕ ˜    2   = θ   M   x x   (Discontinuity of slope about Y-axis across the crack).      M   x x 1   =   M   x x 2   ,    M   x y 1   =   M   x y 2   (Continuity of bending moments).  (20)    Q   x 1   =   Q   x 2    ( Continuity  of  shear  force ) .      At the right edge of the element ( x = L −   L   1    for     w ˜    2   ).  (21)     w ˜    2   =    q ˜    4   ,     ϕ ˜    2   =    q ˜    5   ,     ψ ˜    2   =    q ˜    6        The terms    q ˜    1   , .. . ,    q ˜    6   are nodal spectral displacements at the two ends. The term θ is the non-dimensional bending flexibility of the plate along the crack edge. (The method to calculate θ is given in Section 3.1) The quantities   M   x x 1   ,   M   x y 1   and   Q   x 1   are the bending moments and shear force expressed in displacement terms, and   M   x x 2   ,   M   x y 2   ,   Q   x 2   are obtained similarly. These boundary conditions can be expressed in the matrix form as  (22)  [ M ] { C } =  [        M   1      0        M   2         M   3        0      M   4        ]  { C } =  {        u   1        0     0        u   2        }    where   u   1   =   {    q ˜    1   ,    q ˜    2   ,    q ˜    3   }  T  ,   u   2   =   {    q ˜    4   ,    q ˜    5   ,    q ˜    6   }  T  ,   M   1   ,   M   4   ∈   ℂ   3 X 6   ,   M   2   ,   M   3   ∈   ℂ   6 X 6   and C =   {   C   1   ,   C   2   }  T     The shear force and bending moments at the left and right boundaries of the plate can be written as,  (23)   {        V   x 1   ( 0 )         M   x x 1   ( 0 )         M   y y 1   ( 0 )         V   x 2   ( L )         M   x x 2   ( L )         M   y y 2   ( L )      }  =  {         Q ˜    1            M ˜    x x 1            M ˜    y y 1            Q ˜    2            M ˜    x x 2            M ˜    y y 2        }  =  [        P   1      0     0      P   2        ]  { C } ,    P   1   ,   P   2   ∈   C   3 X 6     Sub-matrices   M   i   ,  i = 1 ,  .. . ,  4 and   P   1   ,   P   2   can be found in the Appendix. Combining Eqs. (22) and (23),  (24)    {    Q ˜    1   ,    M ˜    x x 1   ,    M ˜    y y 1   ,    Q ˜    2   ,    M ˜    x x 2   ,    M ˜    y y 2   }  T  = [  K ˜  ]  {       u   1         u   2       }    where  K ˜  is the frequency dependent dynamic stiffness matrix of the spectral plate element with transverse (open and non-propagating) crack and is given by  (25)  [  K ˜  ] =  [        P   1      0     0      P   2        ]  [       N   1         N   4       ] ,  where  N = [       N   1         N   2         N   3         N   4       ] =   [ M ]   − 1     Here the stiffness matrix  K ˜  is a square matrix with dimensions of 6×6. The sub matrices P  j (j=1, 2) and N  i (i=1, …, 4) have dimensions of 6×12 and 12×3 consecutively.  The bending flexibility of the plate with a crack can be expressed in dimensionless form [9,22–24] as,  (26)  θ (  y ¯  ) =  (    6 H     L   y      )    α   b b   0   f (  y ¯  ) F (  y ¯  ) ;   y ¯  =  y    L   y       where H is the thickness of the plate, F (  y ¯  ) is a correction function and   α   b b   0   is the dimensionless bending compliance coefficient at the crack center given by  (27)    α   b b   0   =  (   1 H   )   ∫ 0    h   0      ξ   ( 1.99 − 2.47 ξ + 12.97   ξ  2  − 23.117   ξ  3  + 24.80   ξ  4  )  2   d h , ξ =  h H    for the range, 0 < ξ < 0.7 . Here h is the depth of crack at any given y and   h   0   is the central crack depth. The crack shape function f (  y ¯  ) is defined as,  (28)  f (  y ¯  ) =   e   −   (  y ¯  −    y ¯    0   )  2  (   e  2  / 2    c ¯   2  )   ;   c ¯  =  c    L   y     ,     y ¯    0   =     y   0       L   y       where e is the base of natural logarithm. The correction factor F (  y ¯  ) is given as,  (29)  F (  y ¯  ) =   2 c / H + 3 ( ν + 3 ) ( 1 − ν )   α   b b   0   [ 1 − f (  y ¯  ) ]   2 c / H + 3 ( ν + 3 ) ( 1 − ν )   α   b b   0            Fig. 3 presents the variation of θ for a few different values of crack parameters.  Now, in order to obtain the slope discontinuity ( θ (  y ¯  )   M   x x   in Eq. (20)) one would require the knowledge of bending moment at the crack location which is not known a priori. Therefore an initial assumption is made that the bending moment of the cracked plate is not greatly disturbed from that of the undamaged plate at the crack location. Using this, a first approximation of the displacement and stress field for the cracked plate can be obtained. This new result can be used again to replace M  xx , and this iteration can be continued until the convergence is achieved [24]. In this work, no iteration is performed as the objective is to show the qualitative change induced in the displacement field due to the presence of a crack.   RESULTS AND DISCUSSIONS   The formulated 2D WSFE is used to study transverse wave propagation in several composite laminates (graphite-epoxy, AS4/3501) having single and multiple part-through the thickness cracks. WSFE results are first compared with Fourier transform based spectral finite element results. Validations with (conventional) FE are performed using Abaqus®standard implicit simulations employing nine-node shell elements with reduced integration (S9R5), which is shear flexible and able to model multiple layers [34]. In the numerical examples provided, the properties of graphite-epoxy, AS4/3501 are taken as follows: E 1=144.48GPa, E 2=E 3=9.63GPa, G 23=G 13=G 12=4.128GPa,   ν   23   =0.3,   ν   13   =   ν   12   =0.02, and ρ =1389kgm−3. Time domain responses are studied using two types of input excitations, namely sinusoidal tone burst and impulse ( Fig. 4).  Tone burst is essentially a windowed sinusoidal signal with a limited number of frequencies around the center frequency and it is narrow banded in the frequency domain. This type of input is used when a minimal number of frequencies are desired in the response to minimize wave dispersion. On the other hand, impulse excitation consists of multiple frequencies (due to the broadband nature in frequency domain) which cause multiple wave fronts being propagated through a waveguide. The spatial distribution of the input load along the Y-axis (in Fig. 2) is given by  (30)  F ( Y ) =   e   −   ( Y / α )  2      where α (as specified for each analysis) is a constant and can be varied to change Y-distribution of the load. The 2D WSFE is formulated with Daubechies scaling function of order N=22 for temporal and N=4 for spatial approximations. The time sampling rate is Δ t =1–2µs (as specified for each analysis), while the spatial sampling rate Δ Y is varied according to Δ Y =   L   Y   / ( m − 1 ) depending on L  Y and the number of spatial discretization points m.  Wave propagation analysis of finite length structures using conventional spectral finite element analysis based on Fourier transform (FSFE) requires the structures to be damped or use of a throw-off element to dissipate energy out of the system [12,13]. In addition, the time window should be large enough to remove the wraparound problem associated with FSFE. The time window is dependent on the value of damping and the length of the structure, and it is required to be higher for lightly damped short length structures. WSFE is completely free from these constraints and the accuracy of solution is independent of such time window restrictions or energy dissipation by means of damping or throw-off elements [14]. Fig. 5 shows a composite plate (with transverse crack) considered for wave motion analysis using FSFE and the current WSFE formulation. The plate considered here is semi-infinitely long into X direction and a crack is placed at L 1=0.5m distance away from the free end. Relatively large lateral spatial window (L  Y =5m) is chosen due to the Fourier series representation of the spatial dimension in FSFE where finite lateral boundary conditions cannot be imposed. A symmetric ply sequence of [0]10 with each ply having a thickness of 1mm is considered. Time sampling rate is set at Δ t =2µs with the number of spatial discretization points m=64 ( Δ Y =  5 /  64    m ) and α = 0.1 in Eq. (30). Fig. 6 shows transverse velocities at the tip of the plate due to a tone burst input load at the same location (edge AB in Fig. 5). The incident tone burst appears first in the response and the second wave packet with relatively smaller amplitude is the reflection from the crack. As mentioned earlier, the FSFE solution is highly dependent upon analysis time window as illustrated in Fig. 6. Three time windows of 1024μs, 2048μs, and 4096μs are used for FSFE solutions, whereas the time window of 1024μs is sufficient to obtain accurate WSFE results. It is observed that for T  w =1024μs, FSFE solution is highly distorted and spurious wave components appear. The accuracy of FSFE results gradually increase with increasing time windows of 2048μs (Fig. 6(b)) and 4096μs (Fig. 6(c)). The FSFE prediction using the largest time window (T  w =4096μs) is free from spurious distortions and matches WSFE results very well. Thus, the developed WSFE method yields substantial reduction in computational cost as the time window is directly related to the system size.  The developed 2D WSFE model for transverse crack is validated with FE simulations using Abaqus® standard implicit direct solver [34]. Fig. 7 shows the graphite-epoxy, AS4/3501, cantilever laminate used in this numerical example. The dimensions of the laminate are   L   X   =   L   Y   = 0.5  m with a ply sequence of [0]10 where each ply has a thickness of 1mm. Responses are presented for the two types of inputs, tone burst and unit impulse (shown in Fig. 4). The tone burst has a central frequency of 20kHz, while the unit impulse has duration of 50μs and occurs between 100 and 150μs, with a frequency content of 44kHz. For WSFE analysis, time sampling rate is Δ t =1µs with the number of spatial discretization points m=64 ( Δ Y =  1 /  64    m ). The input load is applied along edge AB with the load variation given by Eq. (30) with α =0.05.  The FE simulation in Abaqus® exploits symmetry of the problem about the centerline (parallel to edges AC and BD) and models half-plate. The model has 7688, 9-noded shell elements (S9R5) with the total number of nodes equal to 31,250 ensuring the model captures all the modes at the given excitation frequency. The crack is modeled using 62 line spring elements (LS6) developed for modeling part-through cracks in shells [34]. The crack depth is 50% of the laminate thickness (that is, 0.005m). Fig. 8 shows the comparison of WSFE and FEM results at the tip and middle of the plate with the crack located in the middle of plate (L 1=0.25m) and the tone burst input. It is observed that the formulated 2D WSFE element with transverse crack captures the wave scattering due to the crack and the results match very well with FE simulations. For the response at the plate tip (Fig. 8(a)), the incident wave (the first wave packet) propagates through the plate and part of this forward propagating wave is reflected due to the crack. This partial reflection is observed as the second wave packet with relatively smaller amplitude. The rest of the incident wave propagates beyond the crack and reflects completely from the fixed boundary (CD in Fig. 7), which is the third wave packet. The response at the center of the plate (Fig. 8(b)) shows that WSFE accurately captures the incident wave followed by the fixed boundary reflection.    Fig. 9 shows the response of 2D WSFE with transverse crack has excellent match with FE simulation for the impulse input load. For the tip response (Fig. 9(a)), the incident impulse occurs between 100 and 150µs, gets partially reflected from the crack around 400µs, and the fixed boundary reflection starts to appear around 700µs. The broad-band response at the center of the plate (Fig. 9(b)) also shows excellent match with FE including the fixed boundary reflection. Computational efficiency is one key advantage of WSFE over conventional FEM. For the results presented in Fig. 8, computational time for WSFE and FE (Abaqus®) simulations were 26s and 4102s, respectively (PC with 8-core, i7 processor). Thus, WSFE resulted in reduction of computational time by more than 2 orders of magnitude, even though only half-plate was modeled in Abaqus® using symmetry of the problem.  The WSFE formulation presented in this paper may be used to identify presence and location of cracks through wave scattering due to a crack. The cantilever plate and loads used in the previous section are used for the numerical results given here. Fig. 10 shows the transverse velocities at the plate tip (which is also the excitation point) due to a tone burst input. For the healthy case (Fig. 10(a)), the first wave packet is the incident wave and the second larger wave packet is the reflection from the fixed boundary which arrives 582µs after the excitation. Based on this arrival time, the group velocity of the flexural wave mode at this excitation frequency is calculated to be 1718m/s. In the damaged plate response (Fig. 10(b)), there is an additional wave packet with smaller amplitude, which appears soon after the incident wave. Comparing this with the healthy plate response, it can be inferred that the additional wave packet is reflection from the crack. This reflected wave from the crack appears approximately 290µs after the incident wave. With the group velocity data available (1718m/s) the distance to the crack can now be determined to be ( 1718 × 290 E − 06 / 2 ) = 0.25  m . Therefore the crack location can be determined when time of flight of reflected wave is used along with group velocity data. Fig. 11 shows the response of the plate for the same tone burst input with crack placed at 0.15m and 0.35m away from the tip (excitation point). In these responses too, the arrival time of additional wave packets indicate that they originate from the crack. In addition, when the crack is placed very close to the tip (Fig. 11(b)), there are multiple reflections occurring before the fixed boundary reflection arrives.    Fig. 12 shows the response for an impulse input load at the tip with crack placed at 0.15m, 0.25m, and 0.35m from the excitation point. A consistent reflection of the input impulse from the crack is observed for all three locations of the crack. As indicated in the figure, the presence of crack does not change peak amplitude or the group velocity at which the pulse is propagated. However, there is an additional reflection from the crack arriving before reflection from the fixed boundary.  The dynamic stiffness matrix of WSFE can be assembled in the frequency-wavenumber domain to study the presence of multiple cracks within a laminate. This assembling procedure is similar to the conventional FE method, except that the frequency domain approach is used [19,31]. A numerical example is presented here to demonstrate the ability of 2D WSFE method to simulate multiple cracks efficiently. Here a laminate with thickness and ply layup sequence different from above examples is used in order to show the flexibility of the model to analyze more general situations. An 8-ply graphite-epoxy, AS4/3501, laminate with a layup sequence of [0/90]2S is considered. The laminate with two transverse cracks ( Fig. 13(a)) is divided into two sub-laminates along a dashed line as shown in Figs. 13(b) and (c). The placement of this dashed line is somewhat arbitrary given that it is somewhere in between the two cracks. The in-plane dimensions are L  X1=L  X2=0.5m, and L  Y =1.0m while the thickness is kept at 0.008m. The distance to crack 1 along the X-axis from the origin of its local coordinate system (n 1) is 0.375m and the distance to crack 2 from n 3 is 0.25m.  The dynamic stiffness matrix of each element (sub-laminate) is represented by Eq. (16). During assembly, nodes n 2 and n 3 coincide and the dynamic stiffness matrix for a laminate with two cracks is obtained. A tone burst load is applied at the tip of the laminate (at node n 4 in Fig. 13(c)) which has a spatial distribution given by Eq. (30) with α = 0.03 . Fixed boundary conditions are applied at the left edge of the laminate (node n 1).    Fig. 14 shows the transverse velocity response at the tip of laminate for three different cases: (a) healthy, (b) crack 1 present, and (c) both crack 1 and crack 2 present. For the healthy plate, the responses show the excitation wave packet (point n 4) and its reflection from the fixed boundary (point n 1), When crack 1 is introduced, there is an additional reflection arriving from the crack. When both cracks are present, distinct responses from the two cracks are clearly observed (Fig. 14(c)). Fig. 15 shows the transverse velocity response of each material point on the laminate along a straight line connecting nodes n 4 and n 1. The input tone burst excited at the tip starts propagating towards the left as shown in Fig. 15(a). This wave packet interacts with crack 1 resulting in wave transmission and reflection due to the nature of the boundary created by the crack (Fig. 15(b)). The transmitted wave continues propagating towards the left, while the reflected wave heads towards the tip of the plate. The transmitted portion of the forward propagating wave is again scattered by crack 2 (Fig. 15(c)). The propagation direction of the incident wave packet is indicated by a solid arrow, while the reflected wave packet is indicated by a dashed arrow with a number to identify the crack causing the reflection. Following the same procedure, even more complex situations with multiple cracks may be simulated using WSFE, without much increase in computational time. Fig. 16 visualizes the entire laminate for the same case (as discussed in Fig. 15), showing transverse wave propagation and scattering due to the two cracks. Reflections from the lateral boundaries are observed in Fig. 16(c), which is a clear advantage of WSFE over FSFE.  A 2-D wavelet spectral finite element (WSFE) was presented for accurate modeling of high frequency wave propagation in anisotropic composite laminates with a transverse, non-propagating crack. The governing PDEs based on FSDT for laminated composite plates were used accounting for transverse shear strains and rotary inertia to produce accurate results for wave motion at high frequencies. Daubechies compactly supported, orthonormal scaling functions were employed for temporal and spatial approximations of the governing PDEs and the resulting equations were solved exactly to obtain the shape functions used in the element formulation. Since the developed element captured the exact inertial distribution, a single element was sufficient to model a laminate of any dimension in the absence of discontinuities. Further, due to the compact nature of Daubechies scaling functions, the WSFE was able to model finite waveguides without the signal ‘wraparound’ problem (associated with Fourier transform based spectral finite element). A transverse crack having an arbitrary length, depth, and located parallel to any one side of the plate was modeled in the wavenumber–frequency domain by introducing bending flexibility of the plate along the crack edge. The bending flexibility of the plate with crack was presented as a function of crack parameters, that is, crack length and depth at the center. Numerical examples using sinusoidal tone burst and broadband unit impulse excitations showed excellent agreement with conventional finite element simulations using shear flexible elements in Abaqus®. WSFE resulted in reduction of computational time by more than 2 orders of magnitude, even though only half-plate was modeled in Abaqus® using symmetry of the problem. WSFE modeling of transverse crack showed superiority over the FSFE results which showed signal distortions due to the “wrap around” problem for shorter time windows. To model multiple cracks within a laminate, the dynamic stiffness matrix of elements in the frequency-wavenumber domain were assembled, similar to the conventional finite element method. Time of flight estimations of waves reflected from cracks were successfully used to determine crack locations.   ACKNOWLEDGMENT   The authors gratefully acknowledge partial funding for this research through AFOSR Grant no. FA9550-09-1-0275 (Program Managers – Dr. Victor Giurgiutiu and Dr. David Stargel).  Matrices for polynomial eigenvalue problem (Eq. (13))     A   2   =  [      −   A   11      0   0   0   0     0    −   A   66      0   0   0     0   0    − K   A   55      0   0     0   0   0    −   D   11      0     0   0   0   0    −   D   66        ]          A   1   =  [     0    − β (   A   12   +   A   66   )    0   0   0      − β (   A   12   +   A   66   )    0   0   0   0     0   0   0    − i K   A   55      0     0   0    i K   A   55      0    − β (   D   12   +   D   66   )      0   0   0    − β (   D   12   +   D   66   )    0     ]          A   0   =  [      −   β  2    A   66   +   γ  2    I   0      0   0   0   0     0    −   β  2    A   22   +   γ  2    I   0      0   0   0     0   0    −   β  2  K   A   44   +   γ  2    I   0      0    − i β K   A   44        0   0   0    −   β  2    D   66   − K   A   55   +   γ  2    I   2      0     0   0    i β K   A   44      0    −   β  2    D   22   − K   A   44   +   γ  2    I   2        ]       Boundary condition matrices (Eq. (22)).     M   1   =  (        R   11         R   12         R   13         R   14     e   − i   k   1     L   1           R   15     e   − i   k   2     L   1           R   16     e   − i   k   3     L   1             R   21         R   22         R   23         R   24     e   − i   k   1     L   1           R   25     e   − i   k   2     L   1           R   26     e   − i   k   3     L   1             R   31         R   32         R   33         R   34     e   − i   k   1     L   1           R   35     e   − i   k   2     L   1           R   36     e   − i   k   3     L   1          )          M   4   =  (        R   11     e   − i   k   1   L         R   12     e   − i   k   2   L         R   13     e   − i   k   3   L         R   14         R   15         R   16           R   21     e   − i   k   1   L         R   22     e   − i   k   2   L         R   23     e   − i   k   3   L         R   24         R   25         R   26           R   31     e   − i   k   1   L         R   32     e   − i   k   2   L         R   33     e   − i   k   3   L         R   34         R   35         R   36        )          M   2   ( 1 , 1 : 3 ) =   R   1 , 1 : 3     e   − i   k   1 : 3     L   1       M   2   ( 1 , 4 : 6 ) =   R   1 , 4 : 3     M   2   ( 2 , 1 : 3 ) = (   R   2 , 1 : 3   + i θ (   k   1 : 3     D   11     R   2 , 1 : 3   + β   D   12     R   3 , 1 : 3   ) )   e   − i   k   1 : 3     L   1       M   2   ( 2 , 4 : 6 ) = (   R   2 , 4 : 6   + i θ ( −   k   1 : 3     D   11     R   2 , 4 : 6   + β   D   12     R   3 , 4 : 6   ) )   M   2   ( 3 , 1 : 3 ) =   R   3 , 1 : 3     e   − i   k   1 : 3     L   1       M   2   ( 3 , 4 : 6 ) =   R   3 , 4 : 3     M   2   ( 4 , 1 : 3 ) = −   A   55   ( i   k   1 : 3     R   1 , 1 : 3   −   R   2 , 1 : 3   )   e   − i   k   1 : 3     L   1       M   2   ( 4 , 4 : 6 ) =   A   55   ( i   k   1 : 3     R   1 , 4 : 6   +   R   2 , 4 : 6   )   M   2   ( 5 , 1 : 3 ) = − i (   k   1 : 3     D   11     R   2 , 1 : 3   + β   D   12     R   3 , 1 : 3   )   e   − i   k   1 : 3     L   1       M   2   ( 5 , 4 : 6 ) = i (   k   1 : 3     D   11     R   2 , 4 : 6   − β   D   12     R   3 , 4 : 6   )   M   2   ( 6 , 1 : 3 ) = − i   D   66   (   k   1 : 3     R   3 , 1 : 3   + β   R   2 , 1 : 3   )   e   − i   k   1 : 3     L   1       M   2   ( 6 , 4 : 6 ) = i   D   66   (   k   1 : 3     R   3 , 4 : 6   − β   R   2 , 4 : 6   )                M   3   ( 1 , 1 : 3 ) = −   R   1 , 1 : 3     e   − i   k   1 : 3     L   1           M   3   ( 1 , 4 : 6 ) = −   R   1 , 4 : 3     e   − i   k   1 : 3   ( L −   L   1   )         M   3   ( 2 , 1 : 3 ) = −   R   2 , 1 : 3     e   − i   k   1 : 3     L   1           M   3   ( 2 , 4 : 6 ) = −   R   2 , 4 : 6     e   − i   k   1 : 3   ( L −   L   1   )         M   3   ( 3 , 1 : 3 ) =   R   3 , 1 : 3     e   − i   k   1 : 3     L   1           M   3   ( 3 , 4 : 6 ) =   R   3 , 4 : 3     e   − i   k   1 : 3   ( L −   L   1   )               M   3   ( 4 , 1 : 3 ) =   A   55   ( i   k   1 : 3     R   1 , 1 : 3   −   R   2 , 1 : 3   )   e   − i   k   1 : 3     L   1           M   3   ( 4 , 4 : 6 ) = −   A   55   ( i   k   1 : 3     R   1 , 4 : 6   +   R   2 , 4 : 6   )   e   − i   k   1 : 3   ( L −   L   1   )         M   3   ( 5 , 1 : 3 ) = i (   k   1 : 3     D   11     R   2 , 1 : 3   + β   D   12     R   3 , 1 : 3   )   e   − i   k   1 : 3     L   1           M   3   ( 5 , 4 : 6 ) = i ( −   k   1 : 3     D   11     R   2 , 4 : 6   + β   D   12     R   3 , 4 : 6   )   e   − i   k   1 : 3   ( L −   L   1   )         M   3   ( 6 , 1 : 3 ) = i   D   66   (   k   1 : 3     R   3 , 1 : 3   + β   R   2 , 1 : 3   )   e   − i   k   1 : 3     L   1           M   3   ( 6 , 4 : 6 ) = i   D   66   ( −   k   1 : 3     R   3 , 4 : 6   + β   R   2 , 4 : 6   )   e   − i   k   1 : 3   ( L −   L   1   )                         P   1   ( 1 , 1 : 3 ) = −   A   55   ( − i   k   1 : 3     R   1 , 1 : 3   +   R   2 , 1 : 3   )       P   1   ( 1 , 4 : 6 ) = −   A   55   ( i   k   1 : 3     R   1 , 4 : 6   +   R   2 , 4 : 6   )   e   − i   k   1 : 3     L   1           P   1   ( 2 , 1 : 3 ) = i (   k   1 : 3     D   11     R   2 , 1 : 3   + β   D   12     R   3 , 1 : 3   )       P   1   ( 2 , 4 : 6 ) = i ( −   k   1 : 3     D   11     R   2 , 4 : 6   + β   D   12     R   3 , 4 : 6   )   e   − i   k   1 : 3     L   1           P   1   ( 3 , 1 : 3 ) = i   D   66   (   k   1 : 3     R   3 , 1 : 3   + β   R   2 , 1 : 3   )       P   1   ( 3 , 4 : 6 ) = i   D   66   ( −   k   1 : 3     R   3 , 4 : 6   + β   R   2 , 4 : 6   )   e   − i   k   1 : 3     L   1                 P   2   ( 1 , 1 : 3 ) =   A   55   ( − i   k   1 : 3     R   1 , 1 : 3   +   R   2 , 1 : 3   )   e   − i   k   1 : 3   L         P   2   ( 1 , 4 : 6 ) =   A   55   ( i   k   1 : 3     R   1 , 4 : 6   +   R   2 , 4 : 6   )       P   2   ( 2 , 1 : 3 ) = − i (   k   1 : 3     D   11     R   2 , 1 : 3   + β   D   12     R   3 , 1 : 3   )   e   − i   k   1 : 3   L         P   2   ( 2 , 4 : 6 ) = − i ( −   k   1 : 3     D   11     R   2 , 4 : 6   + β   D   12     R   3 , 4 : 6   )       P   2   ( 3 , 1 : 3 ) = − i   D   66   (   k   1 : 3     R   3 , 1 : 3   + β   R   2 , 1 : 3   )   e   − i   k   1 : 3   L         P   2   ( 3 , 4 : 6 ) = − i   D   66   ( −   k   1 : 3     R   3 , 4 : 6   + β   R   2 , 4 : 6   )              REFERENCES", "highlights": "This paper presents a newly developed wavelet spectral finite element (WFSE) model to analyze wave propagation in anisotropic composite laminate with a transverse surface crack penetrating part-through the thickness. The WSFE formulation of the composite laminate, which is based on the first-order shear deformation theory, produces accurate and computationally efficient results for high frequency wave motion. Transverse crack is modeled in wavenumber–frequency domain by introducing bending flexibility of the plate along crack edge. Results for tone burst and impulse excitations show excellent agreement with conventional finite element analysis in Abaqus®. Problems with multiple cracks are modeled by assembling a number of spectral elements with cracks in frequency-wavenumber domain. Results show partial reflection of the excited wave due to crack at time instances consistent with crack locations."}