{"id": "S0168874X15000645", "article": "MAIN-TITLE A microscale bone remodeling simulation method considering the influence of medicine and the impact of strain on osteoblast cells   HIGHLIGHTS          Proliferation, differentiation and drugs influence were considered.      A so called domain separated method (DSM) was proposed to establish FE mesh model.      Formation rate was calculated based on vitro cell experiment data.      Several interesting sets of bone remodling simulations results were presented.          KEYPHRASES   Bone remodeling  Microscale  Medicine influences   In the human body, cancellous bones are spongy-like structures consisting of interlaced rod-type or plate-type trabecular bone [1]. This type of bone is the primary component of pressure-bearing bones such as the spinal bones and the femoral head. The evolution of bone microstructure is a process wherein stimuli affect the osteoclast cells and osteoblast cells, which are closely associated with bone resorption and formation, respectively [2]. The bone microstructure evolution process is also often referred to as the bone remodeling process. The bone remodeling process is an important physiological mechanism that helps keep the bone structure functional and stable [3]. Once the dynamic balance of bone remodeling is broken, the patient may suffer osteoporosis or sclerosis. Mechanical stimulus plays a very important role in the remodeling process [4]. When the mechanical stimulus, known as strain, drops below a certain threshold, the osteoclast cells are activated and begin to absorb bone. Conversely, when the stimulus becomes higher than the threshold but remains within the physiological range, the activated osteoblast cells begin to format new bone [5]. Under some extreme circumstances when the stimulus is within a pathologic range, the bone matrix cracks, and a bone fracture occurs.  The bone remodeling simulation method can be divided into two categories: macroscale and microscale according to the size of the simulation object. Macroscale bone remodeling [6,7] mainly focuses on the density redistribution inside the bone structure. Assuming the relationship between the density and elastic module, the density variation is calculated in accordance with the mechanical stimulus, which in this case, is the strain energy density. This method was frequently used to predict bone remodeling long after an orthopedic surgery [8,9] or implant [10–12]. Because the macroscale bone remodeling method only updated the density, it was incapable of simulating the morphological evolution of the bone structure. Concurrently, the microscale bone remodeling method deals primarily with the microstructure configuration [13,14], which is continuously evolving during remodeling. Depending on the mechanical stimulus, the bone matrix surfaces were either swallowed or grew outward. This resorption and formation mechanism led to a microstructure evolution.  In macroscale bone remodeling simulation, the relationship between the mechanical stimulus and resorption/formation is relatively simple. A piecewise linear function is usually applied to describe the relationship [15,16]. More specifically, a ‘lazy zone’ [17] represents the interval at which the resorption rate and the formation rate remain in equilibrium. At the same time, increased mechanical stimulus enhances the formation, and decreased mechanical stimulus leads to local bone resorption. As density is used to represent the local microstructure and the mechanical stimulus distribution in the bone matrix (trabecular bone) is unattainable, the piecewise function involving the mechanical stimulus of each element is a successful simplification. However, in microscale bone remodeling simulation method, the mechanical stimulus distribution in the bone matrix (trabecular bone) is available, and a more complicated function based on remodeling mechanism is adopted [13,18–20].  Scholars have proposed disparate mechanical stimuli as the basis for bone remodeling simulation methods. These include strain energy density (SED) [10–12], strain energy density rate (SED-R) [13,14], non-uniformity of the stress/strain distribution [21], etc. However, many osteoblast in vitro experiments [22] have shown that strain is the mechanical stimulus that influences proliferation [23] and differentiation [24]. Additionally, a low-frequency (0.2–1Hz) alternating strain stimulus was more effective than a constant strain stimulus [25].  In this study, a microscale bone remodeling simulation method was proposed, and a corresponding governing equation was established. The equivalent strain was used as the mechanical stimulus; the proliferation and differentiation effect of the osteoblast cells affected by the equivalent strain were also considered, as was the influence of the different physiological conditions on the formation/resorption rate.  This paper is organized as follows: a description of the governing equation and the solving scheme are given in Section 2. Several different numerical examples are presented in Section 3. The discussion and conclusions follow in Sections 4 and 5, respectively.  In this section, the governing equation and solving scheme are detailed.  Based on different mechanical strain, bone remodeling reveals varying characteristics in different stages. When the stimulus is lower than a threshold, the formation speed is lower than the absorption speed, and bone mass decreases. When the stimulus reaches a certain magnitude, the formation speed is higher than the absorption speed, and bone mass increases [4]. The threshold strain is equivalent to the very strain at which the formation speed equates to the absorption speed. Moreover, each bone inner boundary element is considered (Fig. 2) as a virtual remodeling site.  At any time t, the bone mass variation rate in each remodeling site of the current micro-structure configuration is the combination of the formation and resorption, as outlined below  (1)      d   m t o t     d t   =     d   m b l     d t   +     d   m c l     d t     where d  mcl and d  mbl are the contribution of resorption and formation to the bone mass variation, respectively. Because resorption has nothing to do with mechanical strain,  (2)      d   m c l     d t   = −   r   c l     where r  cl is the resorption rate in each virtual remodeling site. And Eq. (2) was identical to the work of [13]. However, the osteoclast cells are sensitive to specific medicine (Denosumab) and hormones (Testosterone), so an impact factor η is introduced into Eq. (2):  (3)      d   m c l     d t   = − ( 1 + η )   r   c l    and    r   c l   = n   P   c l   ρ      The value of η is in the range of [−1,+∞), theoretically, and the upper and lower bounds represent infinitely enhancing and completely inhibiting bone resorption, respectively. According to the different types of medicine and the condition of the patient, η should be set to an appropriate value. n is the osteoclast cell density (the osteoclast cell number per a virtual remodeling site), P  cl is the resorption rate per each osteoclast cell. ρ is the true density of the bone material.  When the strain of the osteoblast cell is larger than the threshold strain K  tr and less than the failure strain K  f , the formation rate in each virtual remodeling site is  (4)      d   m b l     d t   = ( 1 + λ )   τ   i   N   P     K   t r     ρ  and    τ   i   = P (   ε   i   ) ⋅ N (   ε   i   )    K   f   ≥   ε   i   ≥   K   t r     where ε  i is the mechanical strain of the osteoblast cell i caused by the adhesion bone matrix. P  Ktr is the formation rate of a single osteoblast cell under threshold strain K  tr . N is the number of osteoblast cells per the virtual remodeling site. τ  i is the ratio of the formation rate between the current strain and the threshold strain. And τ  i includes two parts: differentiation and proliferation. The osteoblast cell differentiates to osteocytes when it matures; during this process, the osteoblast cell secretes matrix and fiber, which turn into bone matrix. Thus, the differentiation factor P(ε  i ) can be used to represent the formation rate ratio of a single osteoblast cell between the current strain ε  i and the threshold strain K  tr . Moreover, the total osteoblast cell numbers increase because of proliferation. Accordingly, N(ε  i ) is defined as the ratio of total osteoblast cells between the current ε  i strain and the threshold strain K  tr . Based on the study of Yang [22], proliferating cell nuclear antibody (PCNA) and alkaline phosphatase (ALP) activities are chosen as the indexes for proliferation and differentiation, respectively. Two normalized piecewise functions are used to describe these effects based on the experiment data.  Similar to η, λ is the theoretical medicine influence on the osteoblast cell in the range of [−1,+∞). The upper and lower bounds represent the infinitely enhancing and completely inhibiting bone formation, respectively. According to the different types of medicine and the condition of the patient, λ should be set to an appropriate value.  When the mechanical strain of the basal bone matrix is larger than the failure strain K  f , the matrix is damaged.  When the mechanical strain is lower than the threshold strain K  tr , the osteogenesis effect is still active but is always less than the formation effect under the threshold strain. This concept is outlined as follows:  (5)      d   m b l     d t   = ( 1 + λ )     ε   i       K   t r     N   P     K   t r     ρ  and    ε   i   <   K   t r   .      The bone remodeling governing equation is a function of time and strain. A forward Euler integration method was implemented to solve the equation. At the current time t  n , the strain field can be calculated through the Abaqus/standard using the microstructure configuration under certain mechanical loading. The resorption and formation is calculated per the governing equation. Then, a time step Δt  n is determined based on the average single element resorption/formation period, as in Eq. (8). The microstructure configuration at time t  n+1=Δt  n +t  n is updated. Until the configuration is stable, the process outlined above is repeated. See the flow chart below for the solving scheme in Fig. 1.  The microstructure evolution simulation is the most important subprocedure. There are two main steps in this subprocedure: (1) According to Eq. (1), the mass variation rate d  mtot /d  t is calculated based on the strain of the adhesion bone matrix as determined by the Abaqus/standard; (2) based on d  mtot /d  t , it can be determined whether the current bone matrix element will be swallowed by the osteoclast cells and become void or if it will grow to form new bone matrix elements. In the microstructure evolution subprocedure, the resorption phase and the formation phase co-exist. The resorption phase deals primarily with the bone matrix inner boundary element {E  i } of the current configuration, and the formation phase focuses on the outer boundary of the void elements { E   ′   i   }, which is connected with the bone matrix element and has the potential of becoming a bone matrix element. Thus, for every microstructure alteration, two collections {E  i } and { E   ′   i   } need to be updated by iterating all elements. Fig. 2 gives a visual representation of the inner boundary and outer boundaries. There are only two types of elements, i.e., bone matrix elements and void elements. Furthermore, there are only three different ways for any two elements to be directly connected, i.e., concurrent, collinear and coplanar (existing in 3D). Thus, the void elements which directly connect with the bone matrix are both the inner boundary of the void element and the outer boundary of the bone matrix elements, marked with a slash in the figure. The boundary element search algorithm is outlined below. It is worth mentioning that subscript i, j and k all represent element labels in the following sections.  As previously mentioned, the two collections, {E  i } and { E   ′   i   }, are the inner boundary of the bone matrix elements and the inner boundary of the void elements, both of which require updating for each configuration. This search algorithm is valid for both collections because they are complementary, as seen in Fig. 2. The search process for the inner boundary of the void elements is as follows:  (1) Assigning a flag value for each element e  i , as  (6)    F     e   i     =  {      − 1     if    e   i    is  void      1    if    e   i    is  bone  matrix            For any element e  i with a flag value F  ei =−1, all of the connected elements e  i,j can be determined. Then, if the flag value of any of the related elements is opposite to the element e  i , i.e., F  ei,j =1, then the element e  i belongs to the inner boundary of the void elements.  The resorption phase is relatively simple. A temporary configuration should be obtained by deleting the bone matrix elements that were swallowed by the osteoclast cells from the current configuration. The discriminant of the bone matrix inner boundary element E  i whether swallowed or not is  (7)   {        F     E   i     = 1     if    P   i   ⋅   Δ   t   +   m   v o x e l   > 0         F     E   i     = − 1     if    P   i   ⋅   Δ   t   +   m   v o x e l   ≤ 0        and    Δ   t   =  1  2 M    ∑  i = 1  M   (      m   v o x e l       P   i      )    where M is the total number of bone matrix elements in collection{E  i }, m  voxel is the bone mass of a single element (voxel), and P  i is the mass variation rate of element E  i . Eq. (7) shows that when the element E  i is completely swallowed, the element changed from bone matrix to void. However, when element E  i is partially swallowed, the element remains bone matrix. More specifically, each element has a status flag value of either 1 (bone matrix) or −1 (void). Thus, the flag value must be switched to identify the element as void or bone matrix. Moreover, in Abaqus/standard, if the element has flag value −1, it will not appear in the finite element mesh model. Therefore, only the bone matrix elements are included in the calculation file for Abaqus/standard.  A unified step time must be determined. In this study, the step time Δt  n of current step t  n was determined by Eq. (8)   (8)  Δ   t   n   =  max ( Δ   t   n   r   , Δ   t   n − 1   f   )   where Δ   t   n   r   and Δ   t   n − 1   f   are the resorption step time of the current time t  n and the formation step time of the last time t  n−1, respectively.  The formation phase then proceeds according to the temporary configuration. Initially, the new collections of {E  i } and { E   ′   i   } are updated according to the temporary configuration. Then the mass variation rate P  i can be calculated for each bone matrix inner boundary element E  i . And for each void element E   ′   i   , the mass variation rate P   ′   i   is the summation of all contributions from the connected bone matrix element E  k , i.e., P   ′   i   = Σ P   ′   i , k   , where P   ′   i , k   is partial of P  k which stands for the element E  k . Thus, the new configuration can be updated after every potential void element is processed. The allocation algorithm of the mass variation rate will be listed in the following paragraph.  The allocation algorithm is used to distribute the total mass variation rate of the current bone elements (the inner boundary element of the bone matrix) to the related void elements for further calculation. The main concept underlying this method is that the allocated mass variation rate is related to the distance between the void elements and the bone elements. As seen in Eq. (9), P  i is the total mass variation rate of the bone matrix inner boundary element E  i , which can be calculated with Eqs. (4) and (5). W  j is the weight of the connected void element E   ′   j   , W  T is the total weight of all related void elements, l  i,j is the distance between void element E   ′   j   and the bone matrix inner boundary element E  i . There are only three values for l  i,j : 1,  2  and  3  , which represent the coplanar, collinear and concurrent relations between E  i and E   ′   j   .  (9)    W   j   = 1 /   l   i , j      W   T   = ∑    W   j       P   j , i   ′   =   P   i   ⋅   W   j   /   W   T   .       RESULTS   In this section, the idealized microstructure configuration, the semi-idealized microstructure configuration, and the real microstructure configuration simulations are carried out.  Three different types of microstructure were used: an idealized microstructure, a space truss (semi ideal microstructure), and real bone microstructure, the latter being derived from Micro CT images through the proposed domain separated method (DSM). Four types of circumstances were simulated, and the results showed the rationality and efficiency of the proposed remodeling simulation method. In addition, the equivalent elastic modulus was calculated using the microstructure configurations obtained in real bone microstructure remodeling stimulations under different external loads. Data points expressing the relationship between porosity and elastic modulus were thus obtained.  The idealized microstructure configuration has various characteristics that are consistent with real bone microstructure configurations: (1) the bone matrix microstructure configuration has a similarity with different porosity; (2) the bone matrix microstructure and pore microstructure configurations are complementary, and they should fill the entire space; (3) the bone microstructure and the pore microstructure are similar in that the bone microstructure is formed by the trabecular connected with each other, and the cavity is connected and filled with soft tissue.  Two remodeling simulations are carried out against two forms of the idealized microstructure under isometric triaxial stimulus (see Fig. 3 for partial results). Fig. 3(e) and (f) shows the evolution of form I (Fig. 3(c)) and II (Fig. 3(d)) of the idealized microstructure. When the porosities are equal, the evolution results of form I and form II are actually the same structure. When the summation of the two porosities equals 1, the remodeling result of form I and form II remain complementary. Thus, the simulation microstructure adheres to the description of the idealized microstructure.  An orthogonal space truss configuration formed with a multiple semi-idealized microstructure is calculated using the proposed method under a different stimulus. Fig. 4 shows some interesting results.  The initial microstructure configuration can be seen in Fig. 4(a). The other sub-figures are the stable final configurations under different stimuli. When under torque stimulus (Fig. 4(b)), the microstructure evolved into a hollow cylinder. The corresponding overall porosity increased as the radius increased. Under the shear stimulus (Fig. 4(c)), the microstructure eventually evolved into parallel surfaces with several pores. When under stimulus of the same form with different magnitude, the final configurations varied greatly (Fig. 4(d) and (e)): the strain stimulus magnitude decreased, and the plate-like trabecular bone, after becoming thinner, gradually formed into the rod-like trabecular bone with a hollow section in the middle of the plate-like trabecular. When under triaxial stimulus, which is lower along the lateral direction, the microstructure eventually evolved into a parallel plate arrangement [26]. Because stimuli are simple, the final steady microstructure configurations can be predicted and show the applicability of the proposed method from another side.  The Micro CT experiment is a commonly used method to determine the micro-structure configuration without damaging the specimen. The specimens were prepared via the following steps. First, a femur was cut into small pieces with a manual bone saw, and the soft tissue was eliminated through a high-purity alcohol and distilled water rinse. The pieces were then soaked in a liquid of formalin and alcohol for two weeks. Finally, the pieces were removed and air-dried. The experiment was carried out in Wuhan University Stomatological Hospital on a CT50 SCANCO Micro CT scanner with 20μm resolution. One of the specimens is shown in Fig. 5(a).  Each slice image file has a 1024×1024 voxel, and one slice image is shown in Fig. 5(b). With the Mimics software, a triangle discrete 3D model (Fig. 5(c)) was constructed from the slice images. Then, the entire model was cut into cubes with lengths of 1mm, shown as in Fig. 5(d). DSM was used to discrete the cubes with orthogonal hexahedron elements. The main principle of DSM is to establish a pre-discrete domain first, followed by separation of the domain into two parts: bone and void.  The key phase of DSM is to separate the pre-discrete domain with the 3D STL model. For example, for the cube marked in red in Fig. 5(d), a pre-discrete domain with 1003 hexahedron elements was initially established (Fig. 5(f)). Then, a self-coding intersection detection program was used to mark the hexahedron elements which intersected with the triangle elements in the 3D STL model. Then, it was simple to divide the remaining hexahedron elements into two collections, bone and void, as shown in Fig. 5(g). The red and blue elements represent bone and void, respectively. If the element sizes need adjustment, the domain simply needs to be pre-meshed with the appropriate elements in advance.  Three sets of simulations were carried out based on realistic bone micro-structure. The simulation focused on the impact of the strain stimulus with different intensities. The second set focused on the impact of different physiological conditions, which can reveal the influence of drugs on the bone remodeling process. The third set focused on generating a large amount of samples to provide data points for the elastic modulus – porosity curve.  The simulation parameters used to determine the impact of the strain stimulus intensity on the bone remodeling process are available in Table 1.  When under a threshold strain stimulus, the formation rate and resorption rate of each virtual remodeling site are balanced because n·P  cl =N·P  Ktr .  In this section, the impact of the strain stimulus on the bone microstructure remodeling is discussed. The drug influences represented by λ and η are set to 0. The initial configuration is shown in Fig. 6(a); some configurations and their apparent time in the remodeling process are shown in Fig. 6(c)–(e).  When compared to the initial microstructure, the overall bone mass increased and the porosity decreased under 0.002GPa stimulus. More specifically, the overall bone mass first increased before reaching a peak value on day 135. This overshoot phenomenon was consistent with a morphological study of bone development in pigs [30]. At the same time, the 0.001GPa stimuli could cause bone loss and an increase in porosity. In this instance, the overshoot phenomenon did not occur during the simulation period, and the bone mass variation rate gradually slowed.  After the bone mass variation rate decreased significantly on day 700, the porosity slightly increased under both types of stimuli. This suggests that the microstructure configuration evolved towards an optimal configuration containing less mass but identical stiffness. The evolution variation rate in this phase is very low because the microstructure configuration already adapted to the specific external load and continued to optimize.  Taken together, these findings indicate that real human bone microstructure is not the theoretical minimum flexibility structure. Rather, this is the evolutionary process moving towards an optimized configuration. This simulation occurs under a constant stimulus, but the microstructure configuration did not achieve the minimum compliance structure, even on day 1200. Moreover, the stimulus inside the human body is vibrational, and the internal physiological environment is not stable. These factors mean that the microstructure configuration of human bone is always undergoing a dynamic evolutionary process.  The total computational cost was compared for each configuration in simulation I and II with 44 steps. The computational software environment is Microsoft Visual Studio 2008 with an Intel Visual Fortran Compiler, Professional Edition 11.1 and Abaqus/standard 6.10-1. The hardware environment is an Intel Core i5-2410 2.3GHz CPU with 8Gb of memory. The results are listed in Table 2. It is clear that the lower the porosity, the more time it costs because the most computational cost was spent in solving the strain/stress distribution; the computational costs were directly determined by the total element numbers in the FE mesh model.  In the second simulation, the influence of the drug on the bone remodeling process was investigated. Two circumstances with different physiological conditions were simulated. Denosumab, the commonly used drug for treating osteoporosis, was considered. A fully human monoclonal antibody, Denosumab binds to RANKL by lowering the chance of RANKL binding with RANK receptors on osteoclasts and osteoclast precursors. This, in turn, inhibits the synthesis, activity, and lifespan of the existing osteoclasts [31].  The influence of the drug on the resorption was represented by the parameter η, as in Eq. (3). When its value was equal to 0, no drug was used; when the value was greater than 0, the drug enhanced the resorption efficacy of osteoclast cells; when the value was less than 0, the drug inhibited resorption. The value was set to −0.5 in this section to show that the Denosumab treatment could decrease the resorption rate to half of the original level.  As shown in Fig. 6(b), the Denosumab treatment significantly increased the bone mass. The porosity decreased from 70.9%, which represents the no-drug case, to 62.2% for the Denosumab treatment case on day 1000. The porosity differential between the two cases reached 8% on day 400, and then it remained stable. This finding was consistent with clinical statistical studies of Denosumab [32,33]. Although the bone mineral density (BMD) variations were the focused measurement in those studies, they are comparable to the porosity used in this study because the BMD is directly proportional to the CT value, and the CT value is directly proportional to the apparent density related to porosity.  Another application of the microscale bone remodeling simulation method is the generation of enough random bone microstructure samples to provide a significant amount of data for stochastic study. Using the equivalent elastic module as an example Many relationship models for the elastic module and porosity had been proposed. The most widely used models were the power and exponential models [34], which were used for Eqs. (10) and (11), respectively:  (10)  E =   E   0     ( 1 − ϕ )  2       (11)  E =   E   0   exp  (    − 2 ϕ   1 − ϕ    )       The porosity distribution areas of the bone specimen used in the mechanical experiment were comparatively concentrated [35], and the quantity was also limited in reality, shown with marks ‘+’, ‘×’ and ‘⁎’ in Fig. 7. The elastic module-porosity data points obtained from the mechanical experiments based on bone specimens share the same disadvantage. However, enough microstructure samples with different porosities could be obtained through microscale bone remodeling simulating based on real microstructures by adjusting the external load. Because widely distributed porosity data points are desired, a total of 16 different initial configurations were obtained through DSM and simulated under two different magnitude displacement loads on the top: one load was 0.00001mm, which led to serious bone mass loss; the other load was 0.003mm, which ensured bone mass growth without bone matrix failure. Based on the obtained microstructure samples, enough representative volume elements (RVEs) could be established. RVE [36,37] analysis is a commonly used method for equalization and homogenization, and it is capable of acquiring the equivalent elastic module of a material with the acknowledgement of its microstructure configuration. By applying a strain boundary condition, the equivalent elastic module could be obtained through RVE analysis.  The bone remodeling simulation under microscale data was distributed in the interval [0, 1]. The power model (black line) and exponential model (red line) match the partial data points in the [0, 0.3] and [0.5, 1.0] intervals, respectively. Overall, however, these two models are not reasonably accurate.   DISCUSSION   In this paper, the effects of strain on the proliferation and differentiation of osteoblast cells was introduced; the influence of the drug on the formation/resorption rate was also introduced into the remodeling simulation. According to the equivalent strain for the bone matrix, the remodeling was divided into three phases. (1) In the physiological phase (200–6000με) the formation rate was calculated with the strain stimulus impact on the proliferation and differentiation of the osteoblast cells based on the experimental data. (2) In the disuse phase (0–200με), the formation rate is linear to the equivalent strain. (3) In the pathologic phase (>6000με), the bone matrix element was damaged. Using Abaqus/standard as a strain/stress distribution solver, the Euler forward method was implemented to solve the governing equations.  The trabecular bone grows along the direction perpendicular to the principal stresses in order to adapt to the stresses [3], and it strives to achieve an optimal structure. An optimization algorithm combined with a macroscale bone remodeling method was used by other researchers to calculate the optimal density distribution of the bone structure [38]. This method did not correlate with real time. When the convergence criteria were satisfied after appropriate iterations, the solution was deemed to be optimal. Thus, the microstructure configurations obtained through the optimization algorithm are the optimal structure adapted to the specified load. This, however, does not reflect the randomness of the bone microstructure. Furthermore, the randomness is not reflected because the stiffness of the optimal microstructure configuration is always higher when the porosity is the same.  Concurrently, the proposed method correlates with real time. The step time of each increment was determined by the element (voxel) size and the mass variation (formation/resorption) rate. The microstructure configurations obtained through this method show that the configuration evolved during the entire bone remodeling process. Thus, these configurations can reflect the characteristics of real bone microstructure. At the same time, the stabilized configuration (obtained through the Euler forward method) and the optimal configuration (obtained with an optimization algorithm) shared the same characteristic: a compliance-minimized structure.  The signal attenuation function involved in many bone remodeling simulation studies [13,18–20] is not appropriate for this study. In those studies, the mechanical stimulus (strain energy density, strain energy density rate, the asymmetry of stress distribution, etc.) of a point on the bone matrix surface is the summation of all signals created by sensors (osteocyte) within a certain range. The mechanical stimulus used in this study is the equivalent strain of the bone matrix, which, it should be noted, only affects the local osteoblast cells. However, during the formation of a new bone matrix, the osteogenesis rate of a specific void element is related to all of the adjacent bone matrix elements. Likewise, the contribution weight is inversely proportional to the distance.   CONCLUSIONS   Based on three different types of microstructure, the idealized microstructure, the semi-idealized structure (space truss structures) and the actual bone microstructure, the remodeling processes under different external loads were simulated. The following conclusions have been made:  (1) Under an equal triaxial stress external load, the idealized structure maintained its topological characteristics during the entire remodeling period.  Under a different external load, the space truss structure remodeling revealed a strong adaptability to the external load. The microstructure was always evolving to withstand the external load with minimum mass by disconnecting the old trabeculae and reconstructing new trabeculae to form a new structure.  Through the remodeling simulation of the real bone microstructure, it was found that (a) the bone microstructure evolved over a long process into an optimal structure. After 3 years, the structure continues to evolve in the optimal structure, even under a single load. It is not hard to imagine that because of the diversity of the external load and internal metabolism perpetually changing in the human body, the bone microstructure will always continue along the evolutionary path to an optimal structure. (b) Denosumab, which is an inhibitor to osteoclast cell activity, can effectively improve bone mineral density and reduce porosity. These findings show that the method proposed can accommodate drug treatment effects. (c) The proposed method can be used to generate enough random specimens for statistical analysis. These specimens involve a wide porosity distribution range because of the diversity of the external load. This range compensates for the bone material experiment disadvantages to specifically include the number limitation and the comparatively concentrated porosity of the real bone specimens.  The main difference between microscale and macroscale bone remodeling simulation is the size of the structure and the discrete element. The resolution of the image data obtained from the CT scan experiments is at the millimeter level. The resolution of the image data obtained from the micro CT experiments, which, unlike the CT, contain too much radiation for the human body and can only scan an in vitro sample at the micrometer level. High-resolution peripheral quantitative computed tomography (HR-pQCT) allows for the quantification of the trabecular and cortical structure in vivo, and it includes a capability for generating images at a hundred micron resolution. This makes the bone remodeling simulation method under microscale suitable for macro structures, which is the future research of this study.   ACKNOWLEDGMENTS   This work was supported by the National Natural Science Foundation of China through the Project no. 11172110.  Supplementary data associated with this article can be found in the online version at 10.1016/j.finel.2015.04.007.     Video 1  0.001GPa distributed tangential stress on the top.          Video 2  0.001GPa distributed tangential stress on the top with treatment of Denosumab.          Video 3  0.002GPa distributed tangential stress on the top.        REFERENCES", "highlights": "Bone remodeling is an evolutionary process of microstructure configuration that occurs under a variety of external stimulations. Critical to the process are the osteoblast and osteoclast cells, which relate to bone formation and absorption. Unlike osteoclast cells, the osteoblast cells are sensitive to mechanical strain, which indicates that mechanical strain plays a key role in the bone remodeling process. In this paper, a modified governing equation for bone remodeling is proposed to simulate the remodeling process at a microscale. Equivalent strain was used as the stimulus, and the influence of medicine was taken into account. A forward Euler integration method and a strain distribution solver, Abaqus/standard, were used to solve the governing equation. Three sets of simulations were conducted based on the idealized microstructure configuration, the semi-idealized microstructure configuration (the space truss structure) and the actual bone microstructure configuration derived from a Micro-CT scan experiment. The results indicate that mechanical load eventually determines the microstructure configuration as bone structure attempts to support the mechanical load with minimal mass. The simulation confirms that Denosumab, which has been wildly used to treat osteoporosis, effectively increased bone density and decreased porosity. Furthermore, bone microstructure samples were obtained through the simulation to provide the elastic module – porosity data points. All of the simulations indicated that the proposed method was reasonable and effective."}