{"id": "S0168874X15000700", "article": "MAIN-TITLE An extended finite element method for pipe-embedded plane thermal analysis   HIGHLIGHTS          A extended finite element is proposed for the pipe embeded thermal analysis.      Using the proposed method can avoid the difficulty of modeling refined meshes and effectively improve the solving speed.      The enrichment shape function is constructed based on the theoritical solution.      The Dirichlet boundary condition inside the element is transformed into in-element Robin boundary.      Multiple-pipes problems can be solved by the proposed method.          KEYPHRASES   Thermal analysis  Extended finite element  Cooling pipe  Enrichment shape function   Multi-scale problems are always involved in every aspect of engineering field. Heat exchanger with water-circulating pipes embedded in large-scale structures is one of the application cases. They are widely utilized in the field of thermal engineering, civil engineering and mechanical engineering, such as water cooling pipe in computing clusters [1,2], pipe-cooler in nuclear power plant [3], heat pump embedded underground [4,5], pipe-heating system in buildings [6] and so on. One significant case is the cooling pipes used in mass concrete engineering [7–14], which is the main motivation of this work. Concrete releases considerable heat due to the hydration reaction of the cement, and causes temperature gradient near the air-side surface. The temperature gradients are the main causes of thermal cracks that can seriously damage the structure. Active pipe cooling is the most widely applied method to reduce temperature gradient and consequently to avoid or diminish thermal cracks.  Finite element method (FEM) is the most applied numerical approach for thermal analysis of cooling pipe embedded problems because of its quick and stable benchmark. The pipe diameter is relatively smaller than concrete size and sharp temperature gradient is generated around the pipe in the cross plane normal to the pipe axis. In conventional finite element analysis, extremely refined meshes have to be generated around the pipe axis to obtain precise thermal field. Numerous numerical studies have been conducted to analyze the temperature field in mass concrete embedded with cooling pipes [15–24]. Among them, Zhu was the first to systematically propose a finite element flow for the pipe-cooling problem with a refined network of FEM meshes near the pipe [15]. Kim developed a 3D program for the thermal analysis of pipe-cooling systems by marking the pipes as line elements connected by FEM nodes [18]. Liu proposed a heat-fluid coupling method in his work and the cooling pipe is simulated by several line elements chained together considering the heat flow of water [19].  All the above-mentioned FEM simulations are based on refined meshes conforming to the pipe geometry. However, the huge difference between the diameter (about 20−40mm) and the length (about 1−2m) of the pipe makes the discretization of the domain demanding and cumbersome because the meshes have to conform to the pipe geometry with acceptable aspect ratios. Besides for a 3D problem, the pipes are embedded in grid-like coils, making the meshing procedure more difficult, especially when the structure is large and complex-shaped such as arch dams [25]. Moreover, there are many cases in which multiple pipes are used, making the analysis process very costly in time and computable resources.  In this paper, an extended finite element method (XFEM) [26–28] is proposed to simulate the thermal field around the cooling pipes using coarse meshes, avoiding the difficulty of generating refined conforming meshes. Advantages of the proposed XFEM is that it could make the numerical meshes independent from the domain to be discretized, which is achieved by integration of a priori knowledge of the solution field and the enrichment shape functions. The paper is organized as follows. Firstly, the governing equation of the problem is given in Section 2. The XFEM formulation is introduced to approximate the discontinuous thermal gradient field in Section 3. Secondly, the enrichment shape function is constructed on the basis of the analytical solution in Section 4. The cooling-pipe boundary condition and the quadrature scheme for discontinuous element are also discussed in details in this section. Finally, a series of numerical cases are carried out in Section 5 in which the validity and efficiency of the method are shown.  The temperature variation along the axial direction of the pipe is considerably smaller than that in the radial direction. Thus this study focuses on the 2D cooling problem in the cross section normal to the pipe axis, as shown in Fig. 1. The governing equation of the problem can be expressed as follows:  (1)      ρ c   ∂ T   ∂ τ   = ∇  (  λ ∇ T  )  + Q  ( τ )      in  Ω     ,   where T is the temperature scalar, τ is the time, ρ is the density of concrete, c is the specific heat capacity of concrete, Q  ( τ )  is the internal heat source of concrete, and λ is the heat conductivity tensor, which is considered isotropic in this study and denoted as a scalar λ .  Metal pipes are always applied in thermal engineering for their good heat conductivity. Dirichlet boundary condition, which is also known as the first type boundary condition is imposed on the pipe wall,  (2)      T =   T   w    ( τ )      o n    Γ   p       ,   where   T   w   is the water temperature and   Γ   p   is the wall of the cooling pipe.  The internal heat source of concrete is induced by the hydration heat, which can be expressed as  (3)  Q  ( τ )  = ρ c χ  ( τ )  ,   where χ  ( τ )  is the adiabatic temperature rise of concrete. The hydration heat in concrete increases very quickly at the early age, and then decreases gradually with the age, which is always expressed in an exponential form [29]:  (4)  χ  ( τ )  =   χ   0    (  1 −   e   − m τ    )  ,   where   χ   0   is the maximum temperature rise of concrete under adiabatic condition, m is the parameter that represents the heat generation rate.  Initially, we suppose that the water is not running in the cooling pipes. Therefore, the temperature field is uniform on the concrete domain, which provides the following:  (5)      T =   T   0    ( x )      when  τ = 0     ,   where   T   0    ( x )  is the initial temperature of the concrete.  Generally the temperature field is approximated by the conventional FEM, as shown in the following equation:  (6)    T   a p p x    ( x )  =  ∑  i = 1   i ∈ S      Ν   i    ( x )    T   i    .   where S is the set of nodes in the concrete domain,   Ν   i    ( x )  is the standard Lagrangian shape function associated with the ith node,   T   i   is the nodal temperature variable, and   T   a p p x    ( x )  is the approximation of temperature at position x .  As aforementioned, refined meshes are required in the conventional FEM to obtain a precise thermal field. In order to avoid the cumbersome meshing job, we propose to approximate the temperature field by XFEM, with which the approximation space is extended to high dimensions. The temperature can then be expressed as follows:  (7)    T   a p p x   =  ∑  i = 1   i ∈ S     ∑  j = 1     m   i        φ   i     Ψ   i j       T ˜    i j    =  ∑  i = 1   i ∈ S     ∑  j = 1     m   i        ϕ   i j       T ˜    i j    .   where    T ˜    i j   is the enriched degrees of freedom (dof), i is the node number,   m   i   is the dimension of the local approximation space, φ is the partition of unity function,   Ψ   i j   is the function of j-th dimension approximation space on node i, and   T   i j   is the enriched nodal temperature variable. For convenience, the Lagrangian shape function N is used as the partition of unity function.   Ν   i     Ψ   i j   is called the enriched shape function, which should be carefully constructed based on the distribution properties of the field. Here we denote the product as ϕ .  For XFEM, the meshes do not have to conform to the cooling pipes. The pipe can be located anywhere inside the enriched element, provided that the pipe position is given. This only affects the expression of the enriched shape function Ν Ψ . Thus mesh generation in XFEM can be a lot easier without consideration of the strong constraint of the cooling pipes.  Metal is a good thermal conductor with high conduction ability. The thickness of the pipe wall embedded in concrete is extremely small (approximately 2mm). Therefore, the thermal resistance of the pipe walls can be completely omitted, which means that the concrete temperature on the metal pipe wall can be directly regarded as the water temperature. This is a typical Dirichlet boundary condition, as indicated in Eq. (2). Generally refined meshes are required in cooling-pipe problem with Dirichlet condition which can be solved by predefining the nodal values on the boundary.  With the aim to construct an element without conforming to the pipe, we have to find a way to deal with the Dirichlet condition inside an element which is very difficult to handle in Generalized FEM (GFEM) or XFEM because the prescribed value cannot be directly assigned to the enriched nodes [30–32]. We propose to convert the Dirichlet condition into Robin boundary condition, which is also known as the third type boundary condition.  For the concrete located near the pipe wall at radius r , the radial flux rate of heat transfer can be expressed as  q ̇  = λ  (  d T / d r  )  . The heat flux of the whole circle can be obtained by  Q ̇  = 2 π r  q ̇  . Then the flux of a narrow concrete annulus encircling the pipe wall with an inner radius of   r   0   and an outer radius of   r   0   + Δ r ( as shown in Fig. 2) can be expressed as follows by integrating the flux through the whole annulus,  (8)   ∫    r   0       r   0   + Δ r     Q ̇   1 r  d r  =  ∫    r   0       r   0   + Δ r    2 π λ d T  .      (9)   q ̇  =   Q ̇   2 π   r   0     =   λ  (    T   c   −   T   w    )      r   0    ln  [   (    r   0   + Δ r  )  /   r   0    ]    .   where   r   0   is the pipe radius,   T   c   is the concrete temperature at the position of radius   r   0   + Δ r , and   T   w   is the temperature on the pipe wall, which is equal to the water temperature.  Compared with the formula of Robin boundary condition,  q ̇  = β  (  ∂ T / ∂ n  )  , Eq. (9) can be regarded as a Robin condition with β denoted as follows:  (10)  β =  λ    r   0    ln  [   (    r   0   + Δ r  )  /   r   0    ]    .      Given the above convection parameter, the boundary condition on   Γ   p   [i.e., Eq. (2)] is equivalent to the boundary condition on   Γ   β   , and it can be expressed as follows:  (11)        ∂ T   ∂ n   = β  [  T −   T   w    ( τ )   ]      on    Γ   β       ,   where   Γ   β   is the concrete circle with an radius of   r   0   + Δ r sharing the same center of the cooling pipe.  Applying the approximation of Eq. (7), as well as the variation rule, the governing equation of the problem [Eqs. (1) and (10)] considering the internal heat source can be written as follows:  (12)  HT  ( τ )  + P  T ̇   ( τ )  + Q  ( τ )  = 0 ,   where  (13)  H =   ∑  e ∈ Ω      K  e    +   ∑  e ∈   Γ   β        K   p   e     .      (14)  P =   ∑  e ∈ Ω      M  e    .      (15)  Q =   ∑  e ∈ Ω      F   θ     +   ∑  e ∈   Γ   β        F   p     .      The matrix of the above can be expressed as follows,  (16)    K  e  =  ∫    Ω   e       (  ∇ ϕ  )  λ   (  ∇ ϕ  )  T  d Ω  ,      (17)    K   p   e   =  ∫    Γ   β       ( ϕ )  β   ( ϕ )  T  d Γ  .      (18)    M  e  =  ∫    Ω   e      ρ c  ( ϕ )    ( ϕ )  T  d Ω  .      (19)    F   θ   =  ∫    Ω   e      ρ c  ( ϕ )    ∂ θ   ∂ τ   d Ω  .      (20)    F   p   =  ∫    Γ   β      ρ c  ( ϕ )  β   T   w   d Γ  .      An implicit backward-Euler time-integration scheme ( ξ = 1 ) is applied for the temporal discretization of Eq. (12), resulting in  (21)   (  H +  1  Δ τ   P  )  T  ( τ )  +  (  −  1  Δ τ   P  )  T  (  τ − Δ τ  )  + F  ( τ )  = 0 .      As shown by Eq. (21), the thermal field of any time can be deduced incrementally from the initial temperature field which is given by Eq. (5).  An important issue in the construction of the enriched element is to select appropriate enrichment shape function, which is denoted as Ψ in Eq. (7). In this study, the enrichment is built from the analytical solution of an idealized problem.  In this section, the analytical solution of a 2D heat transfer problem in a hollow cylinder is derived (see Fig. 3). The outer radius of the cylinder,   r   b   , can be considered as half the spatial distance between two neighboring cooling pipes. The inner radius   r   0   can be considered as the radius of the cooling pipe. The initial temperature of the cylinder is uniformly   T   0   and the temperature on the inner circle is constantly   T   w   . The governing equation of the problem can be written in the following equation set:  (22)   {         ∂ θ   ∂ τ   =  λ  ρ c    (      ∂  2  θ   ∂   r  2    +  1 r    ∂ θ   ∂ r    )  ,       r   0   < r <   r   b   , τ > 0       B . C .     θ = 0 ,     r =   r   0         B . C .       ∂ θ   ∂ r   = 0 ,     r =   r   b         I . C .     θ =   θ   0   ,       r   0   ≤ r ≤   r   b   , τ = 0       .   where  (23)   {      θ = T −   T   w           θ   0   =   T   0   −   T   w         .      The temperature excess θ is introduced here to make the problem homogeneous, which is convenient in obtaining an analytical solution.  Using the method of separation of variables, the problem can be solved through the following equations (Details of the solution procedure are provided in Appendix A.  (24)  θ  (  r , ε  )  =   θ   0    ∑  i = 1  ∞     C   i     R   i    ( r )    e   − ε   (    k   i     r   b    )  2     .   where  (25)  ε =   λ τ   ρ c   r   b   2     .      (26)    C   i   =   2   r   0     r   b       k   i     r   b         R   i   ′   (   r   0   )     r   b   2     [   R   i   (   r   b   ) ]  2  −   r   0   2     [   R   i   ′   (   r   0   ) ]  2    .      (27)    R   i    ( r )  =   Y   0   (   k   i     r   0   )   J   0   (   k   i   r ) −   J   0   (   k   i     r   0   )   Y   0   (   k   i   r ) .      In the above equations,   k   i   is the i-th root of the following characteristic equation,  (28)    J   0   ( k   r   0   )   Y   1   ( k   r   b   ) −   Y   0   ( k   r   0   )   J   1   ( k   r   b   ) = 0 .      In the above equations,   J   0   ,   J   1   are the zero-order and first-order Bessel functions of the first kind respectively, and   Y   0   ,   Y   1   are the zero-order and first-order Bessel functions of the second kind respectively.  As deduced above, the analytical solution of the problem is an infinite series which is difficult to adopt in practical calculation. Based on the previous calculation experience, we know that the exponential term in Eq. (24) decays obviously with k  i . Thus only the first term in Eq. (24) is taken into account in the analytical solution, as shown by Eq. (29),  (29)    θ   [ 1 ]    (  r , ε  )  =   θ   0     C   1     R   1    ( r )    e   − ε   (    k   1     r   b    )  2    .      For a specified characteristic time factor ε , the error between   θ   [ 1 ]   and θ is estimated by the following expression:  (30)  e r r o r  ( ε )  =  1  n u m    ∑  j = 1   n u m      |    θ   [ 1 ]    (  j     r   b   −   r   0     n u m   +   r   0   , ε  )  − θ  (  j     r   b   −   r   0     n u m   +   r   0   , ε  )   |   θ  (  j     r   b   −   r   0     n u m   +   r   0   , ε  )     .   where n u m is the total number of discretization points along the radius between   r   0   and   r   b   . To investigate the feasibility of using only the first term rather than the full series, numerical experiments are conducted with different combinations of ε and   r   b   /   r   0   . The area is divided into 100 parts, i.e., n = 100 , in each experiment. The errors are shown in Table 1.  It can be seen from Table 1 that the relative error is less than 1% when ε is larger than 0.12. It means that during the time phase ε ≥ 0.12 , the full series θ can be reasonably replaced by only the first term   θ   [ 1 ]   . In thermodynamics, we call such time as a regular regime. Taking   r   b   /   r   0   = 100 as an example, the comparison of the temperature profiles of θ and   θ   [ 1 ]   at different ε is shown in Fig. 4, where the two appear to be nearly the same in the regular regime.  The practical duration corresponding to the regular regime ( ε = 0.12 ) in a typical pipe-cooling concrete application case is calculated by Eq. (25). In the calculation λ = 10.0   kJ /  (  mh ° C  )  , ρ = 2500   kg /   m  3  , c = 1.0   kJ /  (  kg ° C  )  ,   r   b   = 0.75   m , and   r   b   /   r   0   = 100 . We can see from the calculation results that ε = 0.12 is equivalent to τ = 16.875   h in this situation. This duration is extremely short in the construction stage of concrete engineering, as some construction stages would last years long. For most thermal simulations of massive concrete, the time increment is usually set to be one day or even longer. Thus, it is appropriate to apply the regular regime form of the solution numerically in such concrete cooling problems.  From the regular regime form of the analytical solution   θ   [ 1 ]    (  r , ε  )  , we find that the temperature ratio of two arbitrary position is independent on the reduced time parameter ε , as shown in the following equation:  (31)      θ   [ 1 ]    (    r   1   , ε  )      θ   [ 1 ]    (    r   2   , ε  )    =     R   1    (    r   1    )      R   1    (    r   2    )    =     Y   0   (   k   1     r   0   )   J   0   (   k   1     r   1   ) −   J   0   (   k   1     r   0   )   Y   0   (   k   1     r   1   )     Y   0   (   k   1     r   0   )   J   0   (   k   1     r   2   ) −   J   0   (   k   1     r   0   )   Y   0   (   k   1     r   2   )   .   where   r   1   and   r   2   are two arbitrary radii inside   r   b   . Thus the time factor is no longer needed to be considered, providing a simple way to mimic the curvilinear field near the pipe. For a specific time, the temperature at the position where r =   r   b   is used as a reference, as shown in Fig. 5. The temperature difference between each position and the reference temperature is employed to describe the field, as shown in the following equation:  (32)  f  ( r )  =     θ   [ 1 ]    (  r , ε  )  −   θ   [ 1 ]    (    r   b   , ε  )      θ   [ 1 ]    (    r   b   , ε  )    =     Y   0   (   k   1     r   0   )   J   0   (   k   1   r ) −   J   0   (   k   1     r   0   )   Y   0   (   k   1   r )     Y   0   (   k   1     r   0   )   J   0   (   k   1     r   b   ) −   J   0   (   k   1     r   0   )   Y   0   (   k   1     r   b   )   − 1 .      Thus the enrichment shape function   Ψ   i j   is established as follows:  (33)  Ψ = s p a n  {  1 , f  ( r )   }  .   where r is the radial distance in the polar coordinate system with the cooling pipe as the origin. In finite element analysis, r should be transformed into the global rectangular system X−Y or X−Y−Z as shown in Fig. 6, where the radius can be expressed as follows:  (34)  r = | | x −   x   O   | | .   where x is the position in the global coordinate system, and   x   O   is the position of the pipe center.    Fig. 7 presents the shape of the enrichment function f  ( r )  in a quad element with the pipe at the center. It can be seen that the enrichment shape function distributes nonlinearly over the element, with a rapid variation near the pipe.  The enrichment is built from the regular form (Eq. (32)) of the solution of the idealized problem (Eq. (22)). However, the application of the Bessel functions can consume a lot of computation time and cannot be implemented easily in programming. So here we propose to approximate the enrichment by elementary mathematical functions.  After many trials, the exponential formula is chosen for its good performance in approximation to Eq. (32), which can be expressed as follows:  (35)  f  ( r )  = −   e   − b  (  r /   r   b    )    .   where b is the parameter determined by the characteristic ratio of   r   b   /   r   0   . Table 2 shows the value of b calibrated for reference. Fig. 8 shows the comparison of the results between the proposed exponential enrichment and the regular form of the solutions, taking   r   b   /   r   0   = 100 as an example. In addition to the advantage of the exponential form that it can effectively approximate the analytical solution, another advantage is that the differential and integral calculus is very easy to implement in programming, providing a lot of convenience in programming when shaping the stiffness matrix as abovementioned in Eq. (16).  With the introduction of enrichment, the cooling pipe can be located inside the element, and an inherent weak discontinuity is thus generated in the shape function over the whole element. The standard Gauss quadrature scheme should be modified to satisfy the feature of the discontinuous gradient field. The idea of sub-domain integration [33,34] is employed to solve the problem. As an example, an enriched quadratic element is divided into 4 triangles by connecting the pipe center with four nodes. Each triangle is integrated as a standard triangular element and summed up to the stiffness matrix of the quadratic element. Fig. 9 shows a typical layout of subdomain integration points by Hammer quadrature rule which is used in the integration for triangular elements [35]. The weight of each integration point   W   int   Q u a d   should be revised as follows,  (36)    W   int   Q u a d   =   W   int   T r i       S   T r i       S   Q u a d     .   where   W   int   T r i   is the weight of Hammer quadrature rule,   S   T r i   is the area of the triangle where the point is located, and   S   Q u a d   is the area of the whole quadratic element.  The accuracy of the XFEM is verified by comparing the XFEM results with conventional FEM results of four numerical cases.  The first verification case is a concrete square 1.5m in side length cooled by one cooling pipe 0.0084m in radius embedded at its center. Table 3 shows the material properties of the concrete. For conventional FEM modeling, the square is represented by conforming meshes as shown in Fig. 10. For XFEM modeling, the square is represented by one XFEM-enriched element as shown in Fig. 11.  The initial temperature of the concrete square is uniformly 20°C. The water temperature inside the cooling pipe is maintained constant at 4°C during the whole cooling process of 100 days (T  w =4°C). The boundary edges of the concrete square are supposed to be adiabatic. The time step of each increment is 1d. Hydration heat is not considered in this case.  Temperature data on five nodes in the refined meshes denoted as points 1−5 in Fig. 10 are selected to make comparisons with the XFEM model, in which the temperature data are interpolated by the enriched shape function. The temperature results of the five points with respect to the time obtained from both models are presented in Fig. 12. Table 4 provides the correlation coefficients at the five different points.  It can be seen from Fig. 12(a) − (e) that,  • The XFEM results of point 1−5 have good agreements with the conventional FEM results with refined conforming meshes respectively, thereby illustrating the validity of the proposed method.  In the enriched element, the temperature gradient near the cooling pipe can be correctly calculated by the proposed interpolation function. Two degrees of freedom (dofs) on each node can sufficiently express the curvilinear field inside the element.  The accuracy at the initial time of the calculation is not as satisfactory as that at later time. Here, we assume that the following three reasons might be included in this situation: (a) The difference between the first-term of the series and the full series is larger at early time than later time, which can be found in Fig. 4. (b) The backward-difference scheme [25] which is used for time-dependent interpolation is not accurate enough because the temperature varies fiercely at the beginning of the cooling process. c. Initially, the enriched temperature freedom is set to zero, whereas the conventional freedom is set to T 0. More studies need to done to find out which is the exact reason.  The second verification case is similar to the first case, except for the cooling water temperature (T  w ) which in this case is not constant during the whole cooling process. T  w is maintained at 10°C in the first 50 days, and then 4°C in the remaining 50 days.    Fig. 13 shows the comparison of the temperature of points 1, 3 and 5 obtained from the XFEM model and the refined conventional FEM model. It can be seen from Fig. 13 that the temperature curve has an obvious turning point when the cooling boundary is changed. It can also be seen from Fig. 13 that the XFEM result has a good agreement with the conventional FEM results with refined conforming meshes, which verifies the reliability of the proposed method in the case of a changing cooling boundary.  The third verification case is similar to the first case except that the hydration heat in the concrete is considered. In this case a time-dependent internal heat source is distributed uniformly in the concrete and the adiabatic temperature rise is expressed by an exponential form mentioned in Eq. (4) with parameters   χ   0   = 20  ° C and m = 0.1 . Changes of the cooling water temperature with time are shown in Table 5.    Fig. 14 shows the comparison of the temperature of point 2 and point 4 obtained from the XFEM model and the refined conventional FEM model. It can be seen from Fig. 14 that the concrete temperature is effectively controlled and cooled by pipe-cooling. The early-age hydration releases heat quickly, causing the temperature rise in the concrete even with the cooling boundary. It can also be seen from Fig. 14 that the XFEM results agree well with the conventional FEM results with refined conforming meshes. It verifies the reliability of the proposed enriched finite element in the case of internal heat source.  In this case the pipes are distributed in 7×7 grids. The outer boundary of the problem is adiabatic. The time step of each increment is 1d. The vertical and horizontal spacing between each two adjacent pipes is 1.5m. The water temperature in each pipe is different, which is given by the following equation,  (37)    T   w    (  x , y , τ  )  =  (  16 − 0.1 τ  )  + 0.1   (    y − 0.75   1.5    )  2  + 0.1  (    x − 0.75   1.5    )  .   where x , y are the coordinates of the pipe center, and τ is the time. The internal heat source is uniformly distributed in the whole concrete region with exponential parameters   χ   0   = 20  ° C and m = 0.1 in Eq. (4).    Fig. 15(a) illustrates the refined conforming FE meshes with totally 6728 nodes and 6272 elements. Fig. 15(b) shows the non-conforming meshes used in the XFEM model, which is a simple 7×7 grid. All the pipes are numbered as shown in Fig. 15(b).    Fig. 16 shows the comparison between the conventional FEM results and the XFEM results at three typical points. It can be seen from Fig. 16 that the proposed XFEM can yield results similar to that of the conventional FEM. Results with sufficient accuracy can be obtained by XFEM with no need of generating refined conforming meshes.  From the previous four numerical tests, it is convincing that accurate results with coarse meshes can be obtained with the proposed XFEM. There are two temperature dofs on each node in the enriched element, which means that there are 8 dofs in total in one enriched element. The proposed method has an apparent speed advantage in solving the linear equation set compared with the conventional FEM model with refined meshes, which have a total of 152 dofs. Although more time is needed because more Gauss points are required for the proposed enriched element to shape the element׳s stiffness matrix, the shaping process of different elements is adaptable for parallel computing. Given enough degrees of parallelism, the proposed method should have speed advantage for solving large-scale problem.  The proposed idea and method not only can be applied in concrete cooling with pipes, but also can potentially be employed in many similar engineering cases, such as numerical modeling of localized laser heating [35,36], ground source heat pump [37,38] and metal welding [39,40].  In this study, only the 2D problem is discussed because the temperature mainly varies on the cross section normal to the pipe axis. The method could also be applied in 3D analysis by extending the shape function along the pipe axis, which will be studied in the future.  The shape function in XFEM is modified from its traditional form in the conventional FEM, causing difficulty in plotting the contours through the standard post-processing software packages. At present the problem is solved by dividing one enriched element into several sub-elements and delivering them into the post-processing software separately. The dividing scheme and advanced post-processing techniques are still under study, and the results might be available in our future papers.   CONCLUSIONS   In this study, XFEM was implemented to calculate the discontinuous gradient thermal field in concrete with cooling pipe. The enriched shape function was modified based on the analytical solution. In addition, the boundary condition and numerical integration scheme were discussed in this paper. The refined conforming meshes are not required in the proposed method, thus making modeling and equation solving more convenient. Comparing XFEM results of four typical cases (constant cooling boundary, varying cooling boundary, internal heat source and multiple pipe condition) with conventional FEM results with refined conforming meshes, good agreements are observed between the two methods, indicating that XFEM has good accuracy and reliability compared with the conventional FEM.   ACKNOWLEDGEMENT   This work is supported by the National “973” Researching Project of China (No. 2013CB035902), National Nature Science Foundation of China (No. 51279087 and No. 51339003) and Research Project of State Key Laboratory of Hydroscience and Engineering of Tsinghua University (SKLHSE-2015-C-02).  As proposed in the main text, the analytical problem can be written as follows.  (38)        ∂ θ   ∂ τ   =  λ  ρ c    (      ∂  2  θ   ∂   r  2    +  1 r    ∂ θ   ∂ r    )  ,       r   0   < r <   r   b   , τ > 0     ,      (39)      θ = 0 ,     r =   r   0       ,      (40)        ∂ θ   ∂ r   = 0 ,     r =   r   b       ,      (41)      θ =   θ   0   ,       r   0   ≤ r ≤   r   b   ,  τ = 0     .      The temperature can be regarded as the product generated by two variables: time and location, which is expressed as,  (42)  θ  (  r , τ  )  = R  ( r )  Φ  ( τ )  .   where R  ( r )  is the function related to the radius and Φ  ( τ )  is the function related to the time. Substitute the above temperature expression into the governing equation of Eq. (38), we can obtain,  (43)    c ρ  λ      d Φ  ( τ )    d τ     Φ  ( τ )    =       d  2  R  ( r )    d   r  2    +  1 r    d R  ( r )    d r     R  ( r )    .      The two variables have been successfully separated by the above equation, which can yield two independent equations as follows.  (44)    d Φ  ( τ )    d τ   −  λ  c ρ   K Φ  ( τ )  = 0 .      (45)      d  2  R  ( r )    d   r  2    +  1 r    d R  ( r )    d r   − K R  ( r )  = 0 .   where K is an unknown constant.  Eq. (44) is the typical Helmholtz equation and Eq. (45) is the typical Bessel equation. They both have classic solutions:  (46)  Φ  ( τ )  =   e   −  λ  ρ c     k  2  τ   .      (47)  R  ( r )  = A   J   0   ( k r ) + B   Y   0   ( k r ) .   where A, B and k are the parameters that need to be determined.  Introducing the temperature components of Eqs. (46) and (47) into the two boundary conditions, i.e., Eqs. (39) and (40), the characteristic equation can be obtained as follows,  (48)    J   0   ( k   r   0   )   Y   0   ′   ( k   r   b   ) −   Y   0   ( k   r   0   )   J   0   ′   ( k   r   b   ) = 0 .   where value of infinite series of k can be solved.  By the boundary condition of Eq. (39), we can obtain the basic expression of A and B, which can give the form of R(r) as  (49)    R   i    ( r )  =   Y   0   (   k   i     r   0   )   J   0   (   k   i   r ) −   J   0   (   k   i     r   0   )   Y   0   (   k   i   r ) .      Finally introducing Eqs. (49) and (46) into the initial condition, i.e., Eq. (41), we can obtain the analytical solution of the problem as follows.  (50)  θ  (  r , τ  )  =   θ   0    ∑  i = 1  ∞     2   r   0     r   b       k   i     r   b         R   i   ′   (   r   0   )     r   b   2     [   R   i   (   r   b   ) ]  2  −   r   0   2     [   R   i   ′   (   r   0   ) ]  2      R   i    ( r )    e   −   λ τ   ρ c   r   b   2       (    k   i     r   b    )  2     .   where  (51)    R   i   ′    ( r )  =   Y   0   (   k   i     r   0   )   J   1   (   k   i   r ) −   J   0   (   k   i     r   0   )   Y   1   (   k   i   r ) .       REFERENCES", "highlights": "In thermal analysis of concrete with cooling pipes by conventional FEM (finite element method), extremely refined conforming meshes have to be generated around the pipe axis to obtain precise temperature field. It makes the meshing process demanding and cumbersome, especially in 3D cases. To avoid the difficulty of refining meshes in conventional FEM, an extended finite element method (XFEM) is proposed in this paper with which thermal analysis with pipes can be performed on coarse meshes instead of refined conforming meshes. The enrichment shape function is constructed in the proposed XFEM based on analytical solution and the Dirichlet boundary condition of the cooling pipe is numerically approximated by in-element Robin boundary condition. Thermal analysis of a concrete slab with a cooling pipe in the center is performed by XFEM with coarse meshes and by conventional FEM with refined conforming meshes respectively. The results demonstrate that the temperature field obtained by XFEM has a comparable accuracy level with the conventional FEM. The accuracy and reliability are further validated with three other numerical cases including the varying cooling boundary case, the internal heat source case and the multiple-pipe case.   temperature (°C)  density (kg/m3)  boundary wall of cooling pipe  water temperature (°C)  approximation space  maximum adiabatic temperature rise (°C)  radial distance (m)  pipe radius (m)  outer radius of concrete cylinder (m)  Bessel function of first kind  time increment (day)  stiffness matrix of heat transfer  thermal load matrix  Element  specific heat capacity (kJ/kg°C)  thermal conductivity (kJ/m°Cday)  concrete domain  equivalent boundary  conventional Lagrangian shape function  enriched shape function  parameter representing the heat generation rate  convective coefficient (kJ/m2 °Cday)  excess temperature (°C)  Bessel function of second kind  characteristic time factor (day)  initial temperature (°C)  mass matrix of heat transfer  time (d)"}