{"id": "S0968090X15002648", "article": "MAIN-TITLE Variable speed limit: A microscopic analysis in a connected vehicle environment   HIGHLIGHTS          This paper develops a new VSL control algorithm in a CV environment.      Multi-criteria optimization is adopted to optimize for mobility, safety and sustainability.      In case of 100% CV, the new VSL approach outperformed the uncontrolled scenario consistently.      In case of 100% CV, optimum improvements were obtained when optimizing for safety alone.      In case of lower % CV, multi-criteria optimization is crucial to realize optimum and balanced benefits.          KEYPHRASES   Variable speed limit  Connected vehicle  Sustainability  Macroscopic  Microscopic  Optimization   Variable Speed Limit (VSL) systems are Intelligent Transportation System (ITS) solutions that enable dynamic changes of posted speed limits in response to prevailing traffic, incidents and/or weather conditions. VSL systems utilize traffic speed, volume detection, and road weather information systems to determine the appropriate speeds at which drivers should be traveling, given the current traffic and road conditions. Changes in posted speed limits are indicated by displays on overhead or roadside variable message signs. VSL systems have great potential to be used as an incident management tool and have significant impact on traffic operations, congestion management, safety and environmental sustainability on major roadways. The main benefits of VSL implementation can be summarized as follows:  1.  Improvements in safety: Which is achieved by the reduction of speed differences among vehicles traveling in the same lane and/or adjacent lanes. This reduction in speed variance synchronizes drivers’ behavior and discourages lane changing behavior, thereby decreases the probability of collisions (Abdel-Aty et al., 2006).   Resolving traffic breakdown: When traffic is close to capacity, any disruption in the traffic stream can lead to traffic breakdown. VSL can restore freeway capacity by slowing down traffic that would otherwise enter bottleneck locations, thereby delaying or in some cases preventing occurrence of traffic flow breakdowns (Hegyi, 2004).   Improved throughput and environmental benefits: Since congestion is also associated with increased fuel consumption and emissions, the capability of VSL in improving traffic flow also results in environmental benefits (Zegeye et al., 2010).  The VSL control strategies developed so far can be divided into two broad categories: reactive rule-based approaches and proactive approaches. Reactive rule-based VSL strategies have limited potential, due to their reliance on simplistic localized control logic; whereas network-wide coordinated proactive VSL control strategies have the inherent capability of acting proactively, while anticipating the complex behavior of dynamic systems. The majority of the developed proactive VSL strategies, however, have been based on the 2nd order macroscopic traffic flow model and utilized aggregate data (such as average speed, flow and density) from point detection technology. Deployment of such technologies corresponds to high installation, maintenance and communication costs, as well as high failure rates (Herrera et al., 2010). Moreover, this relatively coarse aggregation of data obscures many features of interest, such as any possible changes in the traffic state within the aggregation interval (Wu and Liu, 2014). In addition, these macroscopic models used for VSL design do not reflect the behavior of individual drivers in a traffic stream. When traffic is in congested state, any disturbance in the flow can create shockwaves that may result in traffic breakdown. Such shockwaves result from microscopic driver behavior, such as sudden deceleration, merging or lane changing, leading to uneven headways. The use of a macroscopic traffic model cannot completely reflect the occurrence of such disturbances (Khondaker and Kattan, 2015).  The current strategy of VSL design can be improved in a Connected Vehicle environment where the wireless communication system acts as the next generation of new sensors. More specifically, Vehicle to Vehicle (V2V) and Vehicle to Infrastructure (V2I) communication initiatives (moving close to deployment) will provide a basis to detect individual vehicle trajectories. These data at a microscopic or individual vehicle level can be used as more accurate input to design advanced traffic control devices aiming to reduce congestion and enhance safety on roadways. The main advantage of using microscopic data is that the behavior of drivers can be described in detail. For instance, the analysis of individual trajectory data is important to identify the location and magnitude of shock wave formation that can be created at the individual vehicle level, such as a vehicle changing lanes or coming to a sudden stop. This step is crucial to activate advanced traffic control devices in a timely fashion. Consequently, studies that focus on individual driver’s behavior (e.g., acceleration/deceleration, lane changing, over passing, etc.) rather than aggregate behavior are needed to develop the next generation of advanced and robust traffic control devices.  This paper has taken a further step toward developing a VSL control strategy by using traffic data at the microscopic/individual vehicle level to achieve concurrent sustainability objectives. This is the first study, to our knowledge, to incorporate driver behavior (acceleration/deceleration and compliance to posted speed limit) in designing a proactive VSL system that is formulated as a multi-objective optimization function to simultaneously optimize mobility, safety and environmental sustainability. In this research, improvement of network efficiency has been measured in terms of minimizing Total Travel Time (TTT) of all the vehicles in the network. A surrogate safety measure, Time To Collision (TTC), has been used to capture the instantaneous safety between each individual pair of vehicles. For assessing the environmental benefit, VT-Micro model developed by Rakha et al. (2004) has been used which has the capability of performing the evaluations of environmental aspects of traffic management, operations and ITS strategies at microscopic level. Rather than using a fixed driver’s compliance rate, the algorithm incorporated real-time driver’s compliance to adjust the optimal speed limit values. The developed approach has been tested using the VISSIM microsimulation tool via an integrated VISSIM-COM (Component Object Model)-MATLAB interface.  This rest of the paper is organized as follows: In Section 2, a detailed literature review on VSL control strategy is presented. Section 3 provides an overview of the adopted methodology, including the traffic flow, safety model, VT-Micro model, objective function, and optimization method that have been used in this study. Section 4 describes a case study that has been done using the proposed approach, followed by simulation results in Section 5. Section 6 presents the conclusions and scope for future research.   LITERATURE REVIEW   Early VSL studies were mainly formulated as simple reactive rule-based logic. In those approaches, real-time VSL decisions were changed based on preselected thresholds of traffic flow, occupancy or mean speed. The main objectives of these approaches were harmonization of speed differences and stabilization of traffic flow. Examples of such systems were developed by Zackor (1979), Smulders (1990), Smulders and Helleman (1998), Rama (1999), and Piao and McDonald (2008). These studies were successful in showing the effectiveness of VSL systems in harmonizing traffic and mainly improving safety.  The literature on the effectiveness of VSL systems on the simultaneous improvement of both mobility and safety has been of mixed results (Lee et al., 2006; Abdel-Aty et al., 2006, 2007; Allaby et al., 2006). Findings differed from one location to another based on congestion level and network topology. Lee et al. (2006) showed that real-time VSL systems could reduce crash potential, but at the expense of higher travel times. On the other hand, Abdel-Aty et al. (2006) indicated that VSL systems provide a significant reduction in crash probability only for non-congested conditions. However, no substantial safety benefit was associated with the application of VSL for congested conditions. In addition to improved safety, Park and Yadlepati (2003), Lavansiri (2003), Pei-Wei et al. (2004) and Lyles et al. (2004) showed the effectiveness of some VSL systems in improving throughput and reducing travel time for vehicles traveling through work zones. In a recent study, Talebpour et al. (2013) studied the impact of early shockwave detection on breakdown formation and safety using speed harmonization as a control strategy in a Connected Vehicle environment. A reactive algorithm based on drivers’ cognitive risk showed significant improvement in traffic flow characteristics under congested conditions.  The limitations of the rule-based strategies can be mainly attributed to the reactive rather than proactive nature of the control. Due to the resultant time lag, reaction to real-time traffic measurements as a basis for real-time control is significantly inferior to the use of predictive information. By the time VSL actions are deployed, traffic conditions may have already reached breakdown, and VSL control is able to do little in resolving the situation. Model Predictive Control (MPC) approaches were developed to address the limitations of the reactive counterpart. In MPC approach, future traffic such as bottleneck formations are anticipated before they even occur, and remedial VSL strategies are injected in the system to reduce the inflow to the anticipated jammed area and resolve shock waves before traffic reaches breakdown.  One of the pioneering MPC-based VSL studies was initiated by Hegyi et al. (2005), who considered VSL systems as a method to eliminate or reduce shock waves. The main concept in Hegyi’s work was the compensation or decrease of a shock wave resulting from an incident/construction by creating an artificial recovery shockwave resulted from the reduced speed of the traffic flow approaching the bottleneck, thus delaying the onset of congestion. Hegyi et al. (2005) applied the MPC scheme using the METANET macroscopic traffic prediction model to control the dynamism of traffic in a proactive fashion. The advantages of this MPC approach have been made clear through its adoption in several subsequent VSL studies (Zhang et al., 2005; Popov et al., 2008; Hegyi et al., 2008; Hegyi and Hoogendoorn, 2010; Ghods et al., 2010; Carlson et al., 2010b, 2011, 2012). In a recent study, Yu and Abdel-Aty (2014) used an extension of the METANET model to optimize VSL values to minimize the total crash risk. The study concluded that the proactive VSL system was able to improve traffic safety by decreasing crash risk and enhancing speed homogeneity under both the high and moderate compliance levels.  Moreover, Carlson et al. (2010a, 2011), Papamichail et al. (2008), and Abdel-Aty and Dhindsa (2007) showed the advantages in integrating the control of both ramp metering and VSLs. They concluded that traffic flow efficiency could be substantially improved when VSL control measures were integrated with coordinated ramp metering. Carlson et al. (2011) also pointed out the potential for a vehicle-infrastructure integration (VII) system as a mean to slow down the equipped vehicle to control the mainstream flow in a way similar to VSL system. In a more recent study, Chen et al. (2014) used the same principle of limiting inflow to the bottleneck using kinematic wave theory and realized significant delay saving using the principle.  The current practices of VSLs have thus far been mainly focused on applications in freeway operations, work zones, and safety conditions. The environmental benefits of VSL have been largely ignored. A number of previous studies have shown that mobile emissions, especially nitrogen oxides, are highly correlated with high speeds and that these emissions can be significantly reduced if traffic speeds are maintained at appropriate levels. In addition, greenhouse gas emissions are higher during stop-and-go and congested traffic conditions than in free flow conditions. Zegeye et al. (2010) used MPC approach to assess the impact of dynamic speed limit control in reducing CO2 emissions, fuel consumption and travel time. Their study concluded that a reduction of Total Time Spent (TTS) alone could not meet the requirement of reducing emissions. Grumert et al. (2013) introduced a cooperative VSL system in a Connected Vehicle setting to compare its performance with an existing VSL system. The cooperative VSL system resulted in a more harmonized flow, less varying speed pattern, and a reduction of high acceleration and deceleration rates, which reduced negative impact on the environment. In order to evaluate the effectiveness of VSL system, Castro and Monzon (2013) developed a single indicator called Positive Accumulated Acceleration (PAA), which was based on accumulated acceleration in a section (or instantaneous speed variations). The results of the study showed slightly increased throughput and a positive impact on emission reduction, but increased TTS. In another study, Soriguera et al. (2013) demonstrated the effectiveness of VSL in reducing accident risk, emissions and fuel consumption, but at the expense of higher induced delays. Lee et al. (2013) developed a Cooperative Vehicle Intersection Control (CVIC) for urban intersection by optimizing vehicle trajectories to avoid crashes and examined positive impacts on mobility and environment. These studies provided a good indication that a VSL system, if operated properly, may provide a promising solution to balance travelers’ need for simultaneous mobility and conservation of the environment.  Recently, there has been considerable interest in using simulation based surrogate safety assessment models to assess the safety impact of future intelligent vehicles. For instance, Gettman and Head (2003) developed a widely used surrogate assessment model (SSAM) that could identify conflicts by analyzing each vehicle’s interaction using vehicle trajectory records. The introduction of Connected Vehicle technology will provide a basis to detect these individual vehicle trajectories that can be used as relatively high precision input data to derive surrogate safety measures for freeways. Although these surrogate models were aimed at evaluating highway safety measures, none of them examined the applicability of these indicators in evaluating the impact of VSL in improving safety. Moreover, very few strategies have been identified that would provide positive simultaneous impacts on mobility, safety and environment. Therefore, this paper takes the research in this area a step further by investigating the impact of a VSL control strategy based on individual vehicle data to provide simultaneous mobility, safety and sustainability benefits. This was achieved by optimizing an objective function that included a microscopic traffic flow prediction model, a surrogate safety model and a microscopic emission/fuel consumption model. More details of these models and the control strategy of VSL application are presented in subsequent sections.  In order to assess the sustainability impacts covering mobility, safety and environment, this paper incorporated three distinct components into a single VISSIM microsimulation framework using microscopic data. These components were: (i) a microscopic traffic flow prediction model to minimize TTT (Total Travel Time) of all vehicles in the network, (ii) a surrogate safety model TTC (Time To Collision) to capture the instantaneous safety between each individual pair of vehicles, and (iii) a microscopic emission and fuel consumption model ‘VT-Micro model’ (Rakha et al., 2004) to measure Emission (E)/Fuel Consumption (FC). Finally, a system-wide optimization using a multi-objective function was formulated to obtain the VSL values that: (i) minimized TTT, (ii) maximized safety as reflected in TTC, and (iii) minimized emission (E) and/or fuel consumption (FC). The optimization was conducted over a short-term prediction horizon of 5min and repeated in a rolling horizon fashion. In this research, it has been assumed that Road Side Equipment (RSE) collected data from vehicles and broadcasted this information via DSRC. Also, data used to design VSL were available at the microscopic level in a Connected Vehicle environment assuming the trajectory of the vehicles was fully tractable (i.e., 100% penetration rate of Connected Vehicles). In other words, the input parameters involved the speed and position of each vehicle; consequently, depending on the predicted state of each vehicle, VSLs are adopted for each vehicle individually.  To develop a proactive VSL control strategy, Model Predictive Control (MPC) technique was used in this research (Yang et al., 2010; Maciejowski, 2002) . In MPC approach, the future state is predicted so that traffic disturbances are anticipated before they even occur, and control strategies are injected in the system proactively. The MPC approach has four main components: (i) data input and traffic state estimation, (ii) traffic state prediction over a short time prediction horizon (Np), (iii) optimization using an objective function based on rolling horizon, and (iv) a control action that implements the first step of the optimization results. In a rolling horizon scheme, only the first optimized value is implemented. The horizon is then shifted one sample time (i.e., 1min) with new information becoming available from the system and fedback to the optimization function. The control time step used in this study was 1min, meaning that the VSL system was able to adjust the posted speed limit values every minute if required. Thus, the whole process was repeated continuously until the end of the simulation. To limit the computational complexity, a control horizon (Nc) was applied, after which the control variable did not change.  A microscopic traffic flow prediction model was used in this study. The model was a general discretized longitudinal kinematic motion equation of vehicles. At this stage, only the longitudinal kinematic behavior of vehicles was considered in this paper. However, further analysis should be performed on lateral movements of the vehicles (lane changing maneuvers). The general discretized longitudinal kinematic motion of the vehicles can be described by the following equations:  (1)    v   i   ( t + 1 ) =   v   i   ( t ) +   a   i   ( t )   T   m        (2)    x   i   ( t + 1 ) =   x   i   ( t ) +   v   i   ( t )   T   m   +   1   2     a   i   ( t )   T   m   2     where xi (t), vi (t) and ai (t) are the position, speed and acceleration of the ith vehicle in the network at time t; and, Tm is the simulation time step size (s). In Eqs. (1) and (2), the speed (vi ) and position (xi ) of any vehicle at current time instant (t) can be obtained from vehicle trajectory data. The acceleration term (ai ) is mainly a function of the corresponding VSL action and is described in the following paragraph.  The driving process can be divided into two different regimes based on the corresponding behavior of drivers and traffic situation: free flowing and car following. The behavior of drivers as reflected by this acceleration term can take different forms, depending on the status of the episodes that drivers are in at a particular time instant. In order to reflect this behavior, the Intelligent Driver Model (IDM) (Treiber et al., 2000) was adopted in this research. Compared to other car following models, IDM has only a few parameters making it easy to calibrate. In addition, while most of the car following models (e.g., GHR model, Gazis et al., 2000) describe only congested traffic state, IDM has the capability of describing both regimes – free flow and congested state – making it suitable for the adopted approach of this research. Moreover, in many of the stimulus–response based models, the acceleration of the vehicles is modeled by introducing a delay related to the reaction time. However, IDM model does not use the driver reaction time as a delay parameter for the determination of acceleration of a vehicle, which also makes it computationally suitable.  In IDM, the acceleration can be defined by the following equation:  (3)    a   i   =   a   max , i      1 -         v   i       v   ref , i         δ   -         s   ∗   (   v   i   , Δ   v   i   )     s   i         2        where vi is the speed of the ith vehicle, vref  ,  i is the reference speed (variable speed limit) of the ith vehicle, si is the actual gap between leading vehicle i −1 and following vehicle i (i.e., si  = xi  −1 − xi ), Δvi is speed differential between leading vehicle i −1 and following vehicle i (i.e., Δvi  = vi  −1 − vi ), amax  ,  i is the maximum comfortable acceleration of the ith vehicle, δ is the free flow acceleration exponent, and s ∗(vi ,Δvi ) is the minimum desired gap shown by the following equation:  (4)    s   ∗   (   v   i   , Δ   v   i   ) =   s   0   +  max       Tv   i   +     v   i   Δ   v   i     2     a   max , i     b   max , i       , 0      where s 0 is the minimum inter-vehicular distance at standstill, T is the safe time headway and bmax  ,  i is the maximum comfortable deceleration of the ith vehicle.  In Eq. (3), the acceleration is a superposition of two acceleration terms: free flow acceleration and car following acceleration. Under the free flow condition, when the actual gap of vehicles si increases (i.e., si  ≫0), the influence of the second term becomes negligible. Hence, the free flowing acceleration of the ith vehicle can be written as:  (5)    a   i , free  flow   =   a   max , i      1 -         v   i       v   ref , i         δ        Eq. (5) shows that, as the speed of vehicle i (vi ) reaches the displayed speed limit (vref  ,  i ), the acceleration approaches zero. However, when vi is greater or less than vref  ,  i , the acceleration (ai  ,  free  flow ) becomes negative or positive.  When the traffic situation becomes congested, actual speed vi , speed limit vref  ,  i and actual gap si decrease, allowing the last term in Eq. (3) to become significant. Thus, the car-following acceleration of the ith vehicle can be written as:  (6)    a   i , car  following   =   a   max , i      1 -         s   ∗   (   v   i   , Δ   v   i   )     s   i         2        Eq. (6) shows that, when actual gap si approaches the minimum desired gap s ∗(vi ,Δvi ) in a congested situation, acceleration ai  ,  car    following decreases to zero. If si becomes less than s ∗(vi ,Δvi ), the acceleration becomes negative and the vehicle actually decelerates.  In developing the VSL algorithm, it was necessary to define when drivers would switch from the free flowing state to the car following state. The following switching rule was used in this research based on minimum desired gap s ∗ (vi ,Δvi ) and actual gap si between two consecutive vehicles:  (7)    a   i   =         a   i , car  following   ,   if    s   ∗   (   v   i   , Δ   v   i   ) ⩾   s   i         a   i , free  flow   ,   if    s   ∗   (   v   i   , Δ   v   i   ) <   s   i           Eq. (7) shows that, when the actual gap between two consecutive vehicle is greater than the minimum desired gap, they are in a ‘free flow state’. However, when the actual gap is less than the minimum desired gap, the vehicles are in a ‘car following state’. Thus with the value of ai , Eqs. (1) and (2) can be used to optimize TTT of all vehicles as shown by Eq. (8):  (8)  TTT ( t ) =    ∑   t = 1   Np       ∑   i = 1   N        x   i   ( t ) -   x   i   ( t - 1 )     v   i   ( t )     where Np denotes the length of prediction horizon and N is the total number of vehicles.  In order to optimize safety, a surrogate safety measure TTC between each pair of vehicles has been adopted. TTC can be defined as the time it would take a following vehicle to collide with the leading vehicle if both vehicles’ movements remain unchanged. If proper precautions are taken within this time interval, collision can be avoided. TTC at a particular time instant between a pair of vehicles can be described by the following equation:  (9)    TTC   i , t   =     x   i   ( t ) -   x   i - 1   ( t )     v   i + 1   ( t ) -   v   i   ( t )     where t is the time interval, i is the leading and i +1 is the following vehicle. TTC, therefore, only depends on the same variables as IDM model, such as, instantaneous speed (vi ) and position (xi ), between two vehicles. These two variables, in turn, depend upon the instantaneous acceleration (ai ) of that pair of vehicles, where ai is a function of the variable speed limit. Since one of the main objectives of VSL control is increased safety by reducing speed differential among vehicles (denominator in Eq. (9)), the objective is the maximization of TTC by minimizing speed differential based on the position of each pair of vehicles.   Bachmann et al. (2011), however, identified two cases where Eq. (9) may give erroneous results: (i) when the leading (i) and following (i +1) vehicles are traveling at the same speed, and (ii) when the leading (i) vehicle is traveling faster than the following (i +1) vehicle. In order to overcome this limitations, the revised definition in Bachmann et al. (2010) was adopted:  (10)    TTC   i , t   =           x   i   ( t ) -   x   i - 1   ( t )     v   i + 1   ( t ) -   v   i   ( t )   ,   if    v   i + 1   ( t ) >   v   i   ( t )     ∞ ,   if    v   i + 1   ( t ) ⩽   v   i   ( t )            In this study, VT-Micro model developed by Rakha et al. (2004) was adopted, since it has gained significant attention from several researchers for evaluation of the environmental impact of traffic management, operations, and ITS strategies. VT-Micro is a microscopic dynamic model that provides emissions and fuel consumption using second-by-second speed (vi) and acceleration (ai) of individual drivers. The model has the following form:  (11)  log (   J   E / FC   ) =    ∑   i = 0   3       ∑   j = 0   3    (   k   i , i   e   ∗   v   i   ∗   a   j   )   where J E/FC =fuel consumption (FC) or emission rates (E) (l/h or mg/s), k =model regression coefficients, v =speed (m/s), and a =acceleration (m/s2).  Thus, unlike planning level emission/fuel consumption models, such as EMFAC (Air Resources Board, 2011) and MOVES (US EPA, 2001) which use aggregate profiles of drivers, this model can accurately estimate the emission level and fuel consumption by taking into account each driver’s start, stop, acceleration and deceleration behavior.  In this paper, it has been assumed that trajectories of all vehicles in the network are available, providing continuous information of each vehicle’s speed (vi ) and position (xi ). Therefore, a multi-objective function was optimized to assess the sustainability benefit of the VSL algorithm. This is described in more detail in the following subsections.  In this study, a multi-objective function was formulated with TTT as the network efficiency measure, TTC as the instantaneous safety measure and E and/or FC as the emission and/or fuel consumption measures. The variables used for all three measures were instantaneous speed (vi), acceleration (ai) and position (xi) of each vehicle. Hence, the MPC controller predicted the evaluation of traffic in the network over time and optimized the speed limit control in such a way that TTT and E/FC were minimized and TTC was maximized. However, only the first estimated control inputs were considered final and applied to the process. The system then received new information after 60s; and, the process started all over again. The general form of the objective function is shown by the following equation:  (12)    J   obj   = w 1 ·    ∑   t = 1   Np        J   TTT ( t )       N   TTT ( t )     + w 2 ·    ∑   t = 1   Np        N   TTC ( t )       J   TTC ( t )     + w 3 ·    ∑   t = 1   Np        J   E / FC ( t )       N   E / FC ( t )          Thus, TTT was calculated by summing up each vehicle’s travel time over Np. Likewise, TTC and E/FC were calculated by summing up each vehicle’s ratio of relative speed and relative position over Np and each vehicle’s amount of emission produced/fuel consumption over Np respectively. Also, wi (i =1, 2, 3) were the weights assigned, and NTTT  (  t  ), NTTC  (  t  ) and N E/FC(  t  ) were the normalized values of the corresponding terms in the objective function (to make the units consistent).  Two constraints were used for the above-mentioned objective function to ensure safety of drivers:  1. The difference between speed limits displayed on the same variable message sign in two consecutive time steps could not exceed 10km/h:  (13)  |   V   ref , i   ( t + 1 ) -   V   ref , i   ( t ) | ⩽ 10      The difference between speed limits displayed in two consecutive variable message signs at the same time step could not exceed 10km/h:  These conditions protected drivers from experiencing sudden changes between speed limits that could be potentially dangerous, as it may confuse drivers and create shock waves.  While designing a coordinated VSL system, it is important to ensure that the VSL system does not create any negative impact somewhere else in the network or induce an increase in travel time. Therefore, it is important to set trigger conditions that justify the initiation of VSL. In this study, a VSL trigger condition based on a sudden speed drop of a particular section with respect to the successive upstream sections was used (Jo et al., 2012). Thus, if the average speed of a particular section dropped suddenly with respect to the two consecutive upstream sections, VSL was triggered, because a queue is formed with stations successively affected by the traffic jam from the bottleneck. For instance, beginning from the most downstream station in Fig. 1 , the speed at station 8 is lower than the other 2 upstream stations (4 and 6). Hence, station 8 can be identified as the back of queue that is forming at section 10 and propagating upstream to station 8.  Two conditions, therefore, had to be satisfied in the development the VSL trigger algorithm:(i) the average speed of the bottleneck station had to be low enough to justify it as a bottleneck section and (ii) the lower speed should be sustained for at least 1min. The general form of the algorithm is as follows:   If    U   i   ⩽   U   i - 1    and    U   i   ⩽   U   i - 2    and    U   i   < ( default speed limit - 10  km / h )  for  1  min then    S   i    is the bottleneck section .  Hence,  VSL should be triggered   where Ui represents the average speed of different sections, and Si represents section numbers. According to the above algorithm, whenever the first two conditions are satisfied and the speed of that particular section goes below 90km/h (default is 100km/h) for 1min, the section is considered as an active bottleneck; and, VSL is triggered. Also, when the trigger condition is absent, VSL is deactivated automatically and the system gradually goes back to default speed limit values (i.e., 100km/h). More studies need to be done on the sensitivity of speed drop and its duration to represent VSL trigger condition.  In this research, the compliance rate followed to the ‘desired speed distribution’ curve assigned to each vehicle class in VISSIM. In other words, a corresponding desired speed distribution curve, with which drivers were assumed to comply, was set up for each speed limit. It is important to note that the compliance rate was modeled in VISSIM as a function of the posted speed limit. Thus higher compliance rates were associated with higher posted speed limits and lower compliance rates were associated with lower posted speed limits (PTV Vision, 2011).  With the presence of vehicle trajectory data in a Connected Vehicle environment, it is possible to adjust the selected VSL based on the observed real-time compliance rate. Knowing each vehicle’s speed information in the previous time step, the average speed of a particular section can be fed-back to the current time step to adjust the calculated optimal speed limit values for that section. Thus:  (15)  VSL ( t ) = ( 1 + α ) ∗   V   opt   ( t )      (16)  α =     V   avg ( t - 1 )   -   VSL   ( t - 1 )       VSL   ( t - 1 )       where V opt(t)=selected speed limit from the optimization model in the current time step (t), VSL(t)=displayed speed limit in the current time step (t), α =real-time compliance rate of drivers, V avg(  t  −1) =detected average speed of a particular section in the previous time step (t −1), VSL(  t  −1) =displayed speed limit in the previous time step (t −1).  The use of this real-time compliance enables the design of a more robust and efficient VSL control strategy.  For the optimization of the objective function, Genetic Algorithm (GA) was used, since GA enables the solution of multi-criterion optimization problems. GA also provides output in terms of discrete variables (i.e., speed limits). In order to create this VSL control logic, VISSIM COM (Component Object Model) interface was used to write the user-defined VSL logic using Visual Basic for Applications (VBA). In addition, the MATLAB Global Optimization Toolbox was interfaced with VISSIM to create an integrated and flawless data transfer between VISSIM and MATLAB. Therefore, while simulation was running in VISSIM, it also facilitated the easy transfer of online data in MATLAB, performed the optimization and again returned the optimized control values back to VISSIM. This integrated VISSIM COM/MATLAB environment used in this paper for the design of the advanced traffic control measure is shown in Fig. 2 .  The proposed approach was tested in a case study using the VISSIM microsimulation tool. In this research, a hypothetical single-lane 8km roadway section was considered, as shown in Fig. 3 . The roadway was divided into 8 sections, with the length of each section as 1km. The free flow speed was 100km/h, and the demand was set at 2000veh/h. In order to create an artificial bottleneck, an incident was scheduled to take place at the 6th section of the freeway 10min after the beginning of the simulation. It was assumed that the collision resulted in the reduction of vehicular speed, as the vehicles involved in the incident pulled off the road. Thus, the speed limit was set to 30km/h in that section for time period t from 600s to 1800s, i.e., it took 20min to clear the incident. After 1800s, the speed limit was again set to the default value. This scenario resulted in the formation of an active bottleneck and a queue upstream of the bottleneck. In order to mitigate the congestion and reduce the inflow to that bottleneck section, six dynamic speed limit control signs were placed in the middle of sections 1, 2, 3, 4, 5 and 7. Vehicles followed the ‘desired speed distribution’ curve assigned to them in VISSIM, unless they were hindered by other vehicles or objects (e.g., new speed limit). As soon as they encountered a new speed limit, vehicles adjusted their speed according to the new speed limit distribution and took some perception distance (which is a function of current speed and reaction time distribution) to adjust. The limitation of the rate of change of acceleration (jerk) in VISSIM also prevented any turbulence caused by sudden speed change.  For calibration of the network, Newell’s (1993) triangular fundamental diagram was adopted and calibrated using randomly sampled flow, density and speed data from simulation. The accident scenario created in this case resulted in this triangular fundamental diagram with both uncongested and congested branches. A one-lane road network of length 8km was coded with a free flow speed of 100km/h and a volume of 2000veh/h. The simulation was run for 1h; and, flow, speed and density data were aggregated across the links over an interval period of 30s. The estimated values of these parameters were a capacity of 2400veh/h (without considering capacity drop), a free flow speed of 95km/h, a critical density of 26veh/km, a jam density of 122veh/km, and a capacity drop of 12% (i.e., a capacity of 2100veh/h considering this capacity drop). A detailed description of the methodology for these parameter estimates are beyond the scope of this paper. Since all of the values of the parameters reproduced realistic results, the default values of the driver behavior parameters of VISSIM were adopted.  In this case study, a prediction horizon (Np) of 5min was chosen, which was approximately equal to the travel time of the network under normal traffic conditions. A control horizon (Nc) of 3min was selected. It was assumed that the controller signal could change once per minute.  The speed limit values were all discrete variables, i.e., VSL(t)∈{50, 60, 70, 80, 90, 100} km/h with defined upper bound (100km/h) and lower bound (50km/h). Also a rounding algorithm was used in the optimization process so that the speed limit values are always rounded to the nearest 10th speed values.  The normalized values of NTTT  (  t  ) and NTTC  (  t  ) were calculated by running the simulation for a speed limit of 90km/h and thus collecting the corresponding values of NTTT  (  t  ) and NTTC  (  t  ). Also, for Eq. (10), the values of the IDM parameters were chosen as amax  ,  i  =1m/s2, bmax  ,  i  =3m/s2, δ =1, s 0 =2m and T =1.5s.  The simulation was run with ten different random seeds for 1h with 5min as a warm-up period which was disregarded in the analysis. Hypothesis testing was conducted to examine the difference in the mean and variance between the 2 populations that corresponded to 10 and 20 simulation runs respectively. The results showed that 10 simulation runs were statistically sufficient for the case study (i.e., no statistical difference between the variance and mean of the two population).  The ‘desired speed decision’ attribute in VISSIM was used to model VSL via VISSIM-COM. In order to analyze the simulation results and compare the performances of the network under uncontrolled and controlled scenarios, Average Travel Time (ATT) and Average Fuel Consumption (AFC) were used, as described in Eqs. (17) and (18). It is to be noted that only the fuel consumption part of VT-Micro model has been considered in this paper.  (17)  ATT =   TTT   N        (18)  AFC =   TFC   N     where N denotes the number of vehicles that have entered the network in the simulation time period.  TTC as the safety indicator was calculated as an output using VISSIM-COM at each time step. Since the average value of TTC does not provide much insight about the possible safety condition, the probability of collision was used to assess the safety condition by comparing the calculated TTC and the threshold TTC (1.5s) as shown in Eq. (19):  (19)  Collision probability =   No. of TTC < Threshold TTC   Total number of recorded TTC        Four scenarios were investigated by varying the weights assigned to TTT, TTC and FC, as shown in Table 1 .   Table 2 shows the results of the simulation runs for the above mentioned scenarios assuming 100% penetration rate of vehicle probes (i.e., CV/AV) with 80% passenger cars and 20% heavy vehicles. The results of the analysis showed that, compared to the uncontrolled case, there was considerable improvement in all the Measures of Effectiveness (MOEs) for the controlled scenario. TTT was reduced 20.5% for S1 and around 19% for S2, S3 and S4. It is quite apparent from the results that reducing the speed variation in S2, decreasing the sudden acceleration/deceleration in S3 and taking into account the optimization of all three MOEs in S4 helped create smoother flows, which also contributed to the improved travel time in S2, S3 and S4.  The largest improvement in collision probability (11%) occurred in S2, and the largest improvement in AFC (16%) occurred in S3. There were also significant improvements in the average delay per vehicle, total number of stops, flow, speed, density and standard deviation (SD) of speed for all scenarios. The improvement in the total number of stops for all scenarios implies that the proposed VSL algorithm was able to smooth traffic flow by reducing the number of vehicle stops, which in turn had a positive impact on the environment in terms of reducing fuel consumption. However, more experiments need to be conducted on other networks of realistic sizes to confirm if the results can be generalized.  In summary, the results of Table 2 imply that, by assigning different weights, it is possible to achieve the maximum benefit according to the desired policy while resulting in simultaneous improvements in the other two measures. In other words, our findings reveal that S1 which optimized for mobility, resulted in improvements in terms of safety and sustainability.Similarly, S2 which optimized for safety alone, lead to improved mobility and environment impact. Even when optimizing only for sustainability (S3), the results showed benefits in terms of mobility and safety; however, the safety benefits were not as pronounced as other scenarios. The simultaneous improvements in all measures obtained in all examined scenarios can be explained by the fact that all scenarios in one way or another, attempted to suppress shockwaves, which resulted in travel time improvements, increased safety through reduction of speed variation and sudden changes in acceleration/deceleration, which in turn lessened fuel consumption and emissions.  It is important to note that the emission reduction in S4 was not as substantial as those of the other three scenarios. One possible explanation could be the weights assigned to the various components. By changing weights systematically, it is possible to solve several sub-optimization problems obtaining optimal solutions in the objective space. All of the optimal solution points then represent the Pareto front. Hence, future work on the sensitivity analysis of the weights needs to be conducted. In addition, more work is required to examine the impact of different network topographies, congestion levels, O–D patterns, etc.   Fig. 4 (a) and (b) shows the traffic flow/throughput in various sections of the study area for the uncontrolled case and VSL implementation in the S4 scenario. Fig. 4(a) shows that, when the incident occurred (i.e., at 600s), it resulted in a drop in flow close to section 6. However, Fig. 4(b) shows that, even before traffic breakdown occurred and VSL being proactively activated, the traffic inflow entering the jammed section was delayed on purpose to maintain stable flow condition. Thus, the VSL system was able to stabilize and smooth traffic flow on the whole freeway by eliminating sudden acceleration/deceleration of drivers (stop and go), which reduced travel time. Fig. 5 provides further explanation through the change in the shape of the flow–density diagram when VSL was activated. A lower VSL value would result in shifting the critical density to the right, thereby delaying the occurrence of traffic breakdown. By shifting the traffic state from the congested region (i.e., stop and go condition) to the uncongested region, a larger number of vehicles could pass at higher speed through the vicinity of the bottleneck area, which in turn resulted in reduction in travel time compared to the uncontrolled case.   Fig. 4(c) and (d) shows the speed distributions in various sections of the network in the S4 and uncontrolled scenarios respectively. The figures illustrate that a lower speed was sustained almost until the end of the simulation period in the uncontrolled case, whereas the lower speed began to pick up about halfway through the simulation time in the controlled case (S4), as a result of bottleneck elimination and the corresponding stop and go conditions.  The computation time for the 1h simulation was around 5–8min in a 3.6GHz Intel Xeon PC, which is at least eight times faster than real time.  With CV/AV technology still moving toward deployment, there will be a transition period until a 100% market penetration rate is achieved. Therefore, further analysis was conducted assuming a lower % penetration of CV. For the microscopic traffic state prediction step, the trajectory data from every vehicle is required, since the variables needed for the analysis are mostly related to vehicle-to-vehicle interaction (e.g., spacing, speed differential, acceleration/deceleration). Hence, it is necessary toestimate the trajectory of each unequipped vehicle on the roadway from the available CVs. In this context, the principle of microscopic estimation of freeway vehicle positions from the behavior of CVs developed by Goodall et al. (2014) was adopted. The algorithm estimated the locations and trajectory of unequipped vehicles traveling between each two consecutive CVs by examining their behavior. This was achieved by comparing the acceleration/deceleration behavior of each two pairs of CVs with the expected acceleration/deceleration. The reader may refer to Goodall et al. (2014) for more details of this approach.  In this part of the analysis, a market penetration rate of 50% for equipped vehicles (all passenger cars) was assumed. Again, the simulation was run with ten different random seeds for 1h with 5min as a warm-up period which was disregarded in the analysis. Table 3 summarizes the results of the simulation runs for all four scenarios (i.e., for different weights in the objective function).  As shown in Table 3, at 50% penetration rate the approach outperformed the uncontrolled scenario consistently in terms of improved mobility and reduction in fuel consumption. However, mixed results were obtained in terms of safety. Thus, S1 which optimized for mobility alone, resulted in reduction in both travel time and fuel consumption but at the expense of significantly higher safety risk. However, S2, which optimized for safety alone, led to simultaneous improvements in all three measures. While this finding was consistent with the earlier findings for the case of 100% penetration rate, the improvements were not as pronounced (i.e., 16%, 2.5%, 6.5% as compared to 20%, 11% and 15% respectively). For S3, which optimized for AFC only, resulted in reductions in both travel time and AFC, but again at the expense of increasing collision probability. On the other hand, S4, which optimized all of the three components, provided the largest benefit in terms of mobility, safety and sustainability. Thus, unless, safety term is included in the objective function, increased collision risk would result. This might be explained by the fact, that the safety measure is very sensitive to the information on the relative vehicle positions/speed, which was unknown and estimated for 50% of the vehicles in the case of 50% penetration rate of CV’s.  In summary, the results suggested that formulating the problem as a multi-criteria optimization was needed to realize optimum benefits in terms of mobility, safety and sustainability when the trajectory of only 50% of the vehicles was available. However, with 100% penetration rate, optimizing for safety alone was enough to achieve simultaneous and optimum improvements in all measures, implying that the multi-objective optimization was not necessary.   CONCLUSIONS AND FUTURE WORK   This paper presents a Variable Speed Limit (VSL) control algorithm for simultaneously achieving mobility, safety and environmental benefits in a Connected Vehicle environment. Development of Connected Vehicle technology will provide essential data at the microscopic level capable of providing real-time individual driver behavior information. Most of the VSL control algorithms in the literature have been based on aggregate traffic data and ignored the fact that drivers have different preferences and compliance behavior. Using a microscopic approach focusing on individual driver’s behavior, this paper developed a new VSL control algorithm through the use of MPC approach with traffic prediction and performance evaluation capabilities. A multi-objective optimization function was formulated with the aim of finding a balanced trade-off among mobility, safety and sustainability. A microscopic traffic flow prediction model was used to calculate Total Travel Time (TTT), a surrogate safety measure Time To Collision (TTC) was used to measure safety; and, a microscopic fuel consumption model VT-Micro was used to measure the environmental impact. In addition, real-time driver’s compliance with the posted speed limit was considered in adjusting the optimal speed limit values.  Based on the simulation results, the VSL system was shown to result insignificantly improved performances in terms of mobility, safety and sustainability. With a hypothetical freeway modeled in VISSIM microsimulation, the developed approach outperformed the uncontrolled scenario, resulting in TTT reductions of around 20%, safety improvements of 6–11%, and overall fuel consumption reductions of 5–16% with 100% CV penetration. The results also suggested that when trajectories of all vehicles are available (100% CV/AV penetration), one can be better off by optimizing one component only (e.g., mobility), benefits in terms of other two would follow (e.g., safety and sustainability). However, with lower penetration rate, a multi-objective optimization is essential to realize optimal benefits in terms of mobility, safety and sustainability simultaneously.  In this paper, it was assumed that the wireless communication was perfect in Connected Vehicle environment and that there were no communication delays, which may not be true in the real world. Moreover, issues related to measurement accuracy were not investigated. In future research, the approach should be further extended to incorporate noisy measurements and wireless communication delays. Also this paper did not consider the occurrence of lane-changing maneuvers for multi-lane highways. The implementation of such case studies and sensitivity analyses of the compliance rate of drivers, Connected Vehicle penetration rate and optimal VSL spacing needs further investigation and currently being considered as the next phase of this research.   ACKNOWLEDGEMENTS   The authors wish to thank the Natural Science and Engineering Research Council of Canada (NSERC), Stantec, Alberta Motor Association-Alberta Innovates Technology Futures (AMA-AITF) collaborative grant in Smart Multimodal Transportation Systems and Urban Alliance for providing funding for this research. Special thanks to Aishwarya Malgonde and Imran Matin for helping in writing the codes. The authors would also like to thank three anonymous reviewers for their careful reading of our manuscript and their many insightful comments and suggestions which helped us to improve the manuscript.   REFERENCES", "highlights": "This paper presents a Variable Speed Limit (VSL) control algorithm for simultaneously maximizing the mobility, safety and environmental benefit in a Connected Vehicle environment. Development of Connected Vehicle (CV)/Autonomous Vehicle (AV) technology has the potential to provide essential data at the microscopic level to provide a better understanding of real-time driver behavior. This paper investigated a VSL control algorithm using a microscopic approach by focusing on individual driver’s behavior (e.g., acceleration and deceleration) through the use of Model Predictive Control (MPC) approach. A multi-objective optimization function was formulated with the aim of finding a balanced trade-off among mobility, safety and sustainability. A microscopic traffic flow prediction model was used to calculate Total Travel Time (TTT); a surrogate safety measure Time To Collision (TTC) was used to measure instantaneous safety; and, a microscopic fuel consumption model (VT-Micro) was used to measure the environmental impact. Real-time driver’s compliance to the posted speed limit was used to adjust the optimal speed limit values. A sensitivity analysis was conducted to compare the performance of the developed approach for different weights in the objective function and for two different percentages of CV. The results showed that with 100% penetration rate, the developed VSL approach outperformed the uncontrolled scenario consistently, resulting in up to 20% of total travel time reductions, 6–11% of safety improvements and 5–16% reduction in fuel consumptions. Our findings revealed that the scenario which optimized for safety alone, resulted in more optimum improvements as compared to the multi-criteria optimization. Thus, one can argue that in case of 100% penetration rates of CVs, optimizing for safety alone is enough to achieve simultaneous and optimum improvements in all measures. However, mixed results were obtained in case of lower % penetration rate which showed higher collision risk when optimizing for only mobility or fuel consumption. This indicates that with such % penetration rate, multi-criteria optimization is crucial to realize optimum and balanced benefits for the examined measures."}