{"id": "S0968090X16000371", "article": "MAIN-TITLE Are multi-car households better suited for battery electric vehicles? – Driving patterns and economics in Sweden and Germany   HIGHLIGHTS          About 400 Swedish and 6300 German vehicles from multi-car households are analysed.      For similar mileage, second cars show less frequent long-distance driving.      Second cars are better for battery electric vehicles even without trip swapping.      Second cars are economically better than first cars despite lower average mileage.          KEYPHRASES   Electric vehicles  Battery electric vehicles  Multi-car households  Early adopter  Driving pattern    BACKGROUND   Electric vehicles (EVs) could reduce global and local emissions from the transport sector (Chan, 2007). Yet, the limited electric driving range of battery electric vehicles (BEVs) is technically and mentally a major hurdle for many consumers and impacts a BEV’s utility. The variation in distances travelled by one individual on different days of the year is important for the utility of BEVs (Greene, 1985; Pearre et al., 2011). Furthermore, long recharging times seem to impede BEV adoption as well. On the positive side, EVs can easily be charged at home for most car owners, potentially yielding more comfort since extra visits to gas stations become unnecessary (Gnann et al., 2015; Kurani et al., 1996). Another important factor that affects BEV market diffusion are costs for the vehicle. A BEV typically has a higher investment cost and lower operating cost compared to a conventional vehicle. Given these special attributes of the vehicle, it is important to identify how to best utilise its strengths while mitigating its weaknesses. Thus, we need to identify suitable usage scenarios and early adopter groups for the BEV.  One such early adopter or early majority group could be multi-car households. In such households a conventional long-range vehicle could supplement the BEV. This is also observed as important in regions where BEV penetration is high. For example, in Norway, the country with the highest BEV share per capita, 91% of the BEV owners also have another car (Figenbaum and Kolbenstvedt, 2013). Furthermore, multi-car households have higher income (Dargay, 2002; Jong et al., 2004) and are thus more likely to afford the higher purchase price of BEVs. On the other hand, higher income is correlated to higher annual mileage and could imply more trips that exceed the electric driving range of a BEV. These trips would, if travelled by a car, require that the BEV is replaced by either a conventional vehicle in the household, or by renting another vehicle. In both cases the economic viability of the BEV is reduced. Thus, a systematic understanding of the utility of BEVs in multi-car households with respect to the driving need is required to understand if multi-car households are better suited for early BEV adoption compared to single-car households (i.e. households with only one car).  A common line of argumentation for BEVs in multi-car households builds on two assumptions. The first assumption is that households have cars for different purposes; where one car is used for towing, longer trips, and when transporting more people, while another car is used for shorter everyday trips. The second of these car usage scenarios would then be satisfied by a BEV more easily. The second assumption is that households may be able to shift trips between the cars to circumvent the range limitations of the BEV. In this paper we focus on the first assumption and address the following two questions: Are the second cars in a multi-car household better suited as BEVs from a driving pattern point of view? And taking into consideration total cost of ownership, are these BEVs economical compared to conventional vehicles?  Several studies have analysed the potential first user groups to adopt EVs. It is often stated that EVs are most likely to be used in large cities (Parrish et al., 2011), due to their limited range and small size. However, Biere et al. (2009) as well as Plötz et al. (2014b) analyse car owner groups in Germany from an economic point of view and find that early adopters of EVs are likely to be those with a full-time job living in towns and cities with less than 100,000 inhabitants. For the UK, Anable et al. (2011) focused on demographic and attitudinal variables in the adoption likelihood of EVs and concluded that BEVs are considered as possible second household cars by car buyers, whereas plug-in hybrid electric vehicles (PHEVs) are also taken into account as the main or only vehicle. In the US, an online survey found that early adopters of EVs are young or middle-aged and have a bachelor degree or higher (Hidrue et al., 2011). They did not find any evidence that household income influences the likelihood of EV adoption, although Curtin et al. (2009) found an increase in expressed interest for buying a PHEV in households with higher income. The role of the availability of more than one car in the household seems to be disputed. Kurani et al. (1996) find that it increases the probability of adoption while Hidrue et al. (2011) conclude that it does not affect the willingness to buy an EV. Hidrue et al. (2011) also conclude that economic motives such as fuel cost savings are more decisive for EV adoption than reducing CO2 emissions. The findings of a survey by Egbue and Long, (2012) indicate that costs and range are rated most important for adoption, while reducing petroleum use was seen as the major advantage. The fact that costs are important is not that surprising given that it is often one of the determining factors for vehicle choice (Bolduc et al., 2008; Horne et al., 2005; Mau et al., 2008; Sprei et al., 2013). A UC Davis study found that range anxiety was less of a problem during a longer trial period (Turrentine et al., 2011). However, it should be noted that these households all had an additional conventional vehicle. So did the trial households studied by Golob and Gould (1998), which found that some trips were shifted between vehicles in the household; however there was still a demand for a longer range.  Some studies have considered the adoption of BEVs in multi-car households prior to this study, specifically, Khan and Kockelman (2012) as well as Tamor and Milačić (2015) use a GPS measured driving data set for the Seattle region in the US to investigate similar questions. Khan and Kockelman (2012) investigate the effect of replacing the car that drives the least in a multi-car household with a BEV of 160km (100 miles) range and find that 80% of multi-car households would need to adapt their driving less than four days per year, compared to 50% for single-car households. Tamor and Milačić (2015) differ from Khan and Kockelman (2012) in assuming that the BEV will drive the longer daily trip of the two vehicles in a household, as long as this distance is below the vehicle’s range. This leads to a higher electric travel distance, as well as lower travel cost for the household. Based on this assumption, they find a BEV with 100km of range (60 miles) to obtain the same number of days per year requiring adaptation as a BEV with range 190km (120 miles) when using direct replacement over the whole car fleet. Tamor and Milačić (2015) also compare the incremental cost of a battery with higher range to the fuel cost savings of electrifying more travel. They find that the optimal range of a BEV adopted in a two-car household is 110km (70 miles) at a battery costs of 350$/kWh when assuming an acceptance of three days per year of unfulfilled driving. This would then lead to BEV adoption in about 30% of two-car households.  Overall, the findings concerning the early adopters of EVs are still not conclusive and most of the studies focus on the US. Furthermore, most studies suggest that range anxiety is a strong barrier for adoption. In the present study, with its focus on multi-car households, the range limitation may be less of an issue for the second car according to our definition above.  We take a user perspective and analyse the technical and economical suitability of EVs in single- and multi-car households. We utilise GPS- and survey-based driving data from single-car and multi-car households in Sweden and Germany and analyse their annual and daily vehicle kilometres travelled (VKT). This analysis is used to calculate the number of days per year with a driving distance larger than the electric range, in short: the days requiring adaptation (DRA). We also calculate the total cost of ownership per vehicle including the potential extra cost of replacing the BEV with another car during long distance driving days.  The present study differs from much of the previous work by explicitly comparing single- and multi-car households with respect to their suitability for BEV adoption. Special attention should be given to how our paper differs from Khan and Kockelman (2012), as well as Tamor and Milačić (2015). Compared to the latter, we analyse the effect of directly replacing the first and second car with a BEV, without shifting trips or daily driving distances between vehicles. This results in providing a lower bound for the performance of BEVs as first and second cars. The corresponding upper bound would be if households had full knowledge of future trips, and an absolute willingness to shift trips in-between the cars in the same household. This may not be the case due to several factors, such as towing need, individuals subjective feeling of car ownership within a household, or incomplete knowledge of future trips. In relation to Khan and Kockelman (2012), we make the same choice of which car in the household to replace with a BEV. However, we also extend the work by including an economic analysis. This is important, given that a BEV should have a high annual VKT to obtain a favourable total cost of ownership vis-à-vis conventional cars, and this may not be the case for second cars. Additionally, though some studies have considered the effect of including a cost for days with driving above the range limitation (Barter et al., 2015; Lin, 2014), such costs have not been considered in other multi-car household studies. We therefore also extend the economic analysis to not only include the cost of range vis-à-vis fuel savings, but also the cost of having a driving day that requires adaptation. Furthermore, this is – at least to our knowledge – the first study analysing the Swedish and German market in this respect. It should also be noted that both the Swedish and German data is randomly sampled from the vehicle registries, and thus contains a representative mix of driving from cities, suburbs and rural areas. Using two data sets from different countries is a strength that further confirms our results.  The outline of the paper is as follows: In Section 2, the methodology used, the technical and economic assumptions as well as the driving data are described. Section 3 contains the results and is followed by a discussion in Section 4. We close with a summary in Section 5.  We analyse the suitability of BEVs on an individual user level instead of discussing average values and average driving patterns. This is important given the differences in individual driving behaviour (see the results in Section 3.1). In our analysis, we utilise two properties of the individual driving patterns, these are: the annual VKT and the annual number of DRA a user would have given a specific range limitation with unchanged driving pattern. A description of the data sets from which we obtain these properties is available in Section 2.1.  There are two parts to our analysis; first we focus on the driving patterns of different cars in multi-car households and cars in single-car households, and analyse to what extent a BEV would fulfil the given cars driving. We do this by investigating the effect of range on the annual number of DRA for the cars, as well as the cumulative share of cars that fulfil their driving need given increased acceptance to the number of DRA. The second part of the analysis focuses on the economics of BEVs, where we calculate the total cost of ownership of a BEV and compare this to the total cost of ownership of an equivalent gasoline or diesel car. This is described in Section 2.2.3, and the parameters for the economic analysis are discussed in Section 2.3.  It should be clearly noted that we do not perform any optimisation of car selection for different trips within a household (since driving data is not available for all vehicles of multi-car households). This limits the study in the sense that a two-car household may be able to do more short trips with their BEV and more (or possibly all) of the longer trips with the alternative car.  We use two data sets to analyse the differences between single-car and multi-car households. The data sets comprise vehicle motion data from Germany (MOP, 2010) and Sweden (Karlsson, 2013) where the observation periods range from seven days for the German data to an average of 58days for the Swedish drivers.  The German Mobility Panel (MOP) is one of two annual national household travel surveys in Germany. Since MOP is a household travel survey which focuses on people and their trips, we assigned trips to vehicles if unambiguously possible (see Kley, 2011; Plötz et al., 2013 for details). By using all data from 1994 until 2010, we obtain 6339 vehicle driving profiles with 172,978 trips in total. Apart from driving, the profiles contain socio-economic information of the driver (e.g., age, sex, occupation, household income, education) and the vehicle (e.g., size, owner, garage availability). This data set is representative for German driving in terms of daily and annual mileage, vehicle size and garage ownership (Gnann, 2015).  The Swedish Car Movement Data (SCMD) consists of GPS measurements of more than 700 privately driven cars in Västra Götaland and Kungsbacka in western Sweden. Of these, we have selected 429 cars that have at least 30days of good GPS measurements, whereas the rest have less than 30days and are not included in the analysis (for details see Björnsson and Karlsson, 2015). Measurements were evenly distributed over the years 2010–2012. The cars were randomly sampled from the Swedish vehicle registry with an age restriction on the car of maximum eight years, the positive response rate of the selected households was 5%. Western Sweden is representative for Sweden in terms of urban and rural areas, city sizes and population density. The sample is representative in terms of car size and car fuel type. There is a slight overrepresentation of measured cars being the higher annual VKT cars in the households compared to the national average (first cars), this is due to the age inclusion criteria in the sampling. Similarly, the cars in the data have a higher annual VKT of 17,154km compared to about 13,000km for the national average, which is also due to the lower age of the cars compared to the national average. With regard to the driver’s age, there is a slight overrepresentation of senior citizens. A full description of the data including pre-processing is available in (Karlsson, 2013).  In both data sets, we distinguish between cars belonging to single-car households as well as first and second cars in multi-car households. We define a first car in a multi-car household as the car with the higher annual VKT in this household. In this case, we use the owner’s statements to determine annual VKT, since in the Swedish data, only one car is measured in the household. For the analysis we use the stated annual VKT for the German data when available (59% of the vehicles) and extrapolate annual VKT from observed driving otherwise., In the Swedish data we extrapolate annual VKT from the GPS measured driving for all the vehicles. The three car categories that we have formed (single cars, first cars, and second cars) are the different categories we compare in the analysis. That we define a first car as the car with higher stated annual VKT in the household has implications for both the DRA analysis and the economic analysis where we have to take care that it is not the differing annual VKT that causes the differences between the car categories. Furthermore, both datasets contain households with third and fourth cars, these have been grouped together with second cars in the analysis. This discrepancy affects only a few cars (259 out of 6339 in the German data, 4 out of 429 cars in the Swedish data). The Swedish dataset also contains households that have not reported the number of cars they possess; these have all been excluded from the analysis. Table 1 shows the distribution of cars within the different car categories.   Table 2 contains an overview of the summary statistics of both data sets. Note that average daily VKT are the user-specific averages and range from 0.29km per day to up to 469km per day for the one week data for Germany.   METHODS   In the Swedish data we aggregate the GPS measured trips into daily driving distances by assigning all trips that start between 00:00 and 23:59 on a given day to that same day. This means that we assume charging once a day (during the night), and a full battery after this charging. Using the daily driving distance and assigning a distance threshold (BEV range) we then linearly scale up the number of days requiring adaptation (DRA) for the different users to a yearly basis. Similarly, the annual VKT is scaled up from the total driving during the measurement period. The linear extrapolation in the Swedish data is equivalent to using the empirical cumulative distribution function of the share of vehicles with less than a specified number of DRA annually, and is thus comparable to the cumulative distribution function of the number of DRA used for the German data (as described in Section 2.2.2).  An understanding of the distribution of daily VKT allows us to estimate the probability of rare long-distance travel. Since only seven days of observation are available in the German data, the direct extrapolation as for the Swedish data is not applicable since it would result in very rough multiples of 52 since we would extrapolate from one week to 52weeks. Instead, we adapt a log-normal distribution to the driving of each individual user. Please note that other right-skewed two-parameter distributions such as the Weibull or Gamma distribution could be used as well. However, they only lead to minor changes for the individual prediction and our results concerning the comparison of the three car categories analysed here is not altered. Furthermore, an earlier study has shown that the log-normal distribution outperforms the Weibull and Gamma distributions in three out of four goodness of fit measures, namely AIC, MAPE, Chi2, and RMSD (Plötz et al., 2014a). For the analysis, we follow the methodology described in (Plötz, 2014) that is briefly outlined in the following.  The individual daily VKT    r   i    for user i are assumed to be independent and identically distributed (iid) random variables. Let  f ( r )  denote the user-specific distribution of daily VKT. The probability of driving more than L km, i.e. more than the BEV range, on a driving day is then given by   ∫  L   ∞   f ( r ) d r = 1 - F ( L )  where  F ( r )  is the cumulative distribution function of  f ( r )  . Let n denote the number of driving days out of N days of observation such that  n / N  is the share of driving days. Thus,  D ( L ) = 365 ( n / N ) [ 1 - F ( L ) ]  is the expected number of days per year with more than L km of daily VKT. Accordingly,  D ( L )  is the expected number of days requiring adaptation for a potential BEV user. Following (Plötz, 2014), we use the log-normal distribution  f ( r ) = exp [ -   ( ln r - μ )   2   / ( 2   σ   2   ) ] / ( r   2 π   σ )  to model the random variation in daily VKT of each driver. For each individual driver i, the log-normal parameters for the typical scale of daily driving μi and the variation in daily VKT σi are obtained by maximum likelihood estimates.  The number of days requiring adaptation is calculated as follows. For each driver the share of driving days is estimated as    n   i   / N  and the driver-specific log-normal parameters are estimated from likelihood maximisation. Using the cumulative distribution function of the log-normal distribution  F ( x ) =   1   2   [ 1 + erf      ln x - μ     2   σ      ]  the user-specific number of days requiring adaptation    D   i   ( L )  is calculated. In very rare cases (37 out of 6339), there is no variation in daily driving distance between the days reported, i.e.,    σ   i   = 0  . We set    σ   i    equal to the sample mean in those cases. However, this has almost no effect on the results reported below. This log-normal estimate is expected to be valid for different driving ranges L but seems to slightly overestimate the actual number of days requiring adaptation (Plötz, 2014). Similar to the analysis of the Swedish data we consider daily driving distances with charging once per day and a full battery after charging.  We further compare the economics of BEVs in single- and multi-car-households. We calculate the total cost of ownership (TCO) as:      TCO   a   =   a   capex   +   a   opex      which consists of annual capital expenditure (    a   capex    ) and annual operating expenditure (    a   opex    ). These are calculated for BEVs and – as reference cases – for two conventional vehicle technologies (gasoline and diesel). For the capital expenditure, we use the discounted cash-flow method and calculate the investment annuity for user i as:      a   i   capex   = p ·   (   LP   j   + BP ∗ BS - S ) ·   ( 1 + p )   T       ( 1 + p )   T   - 1      where p stands for the interest rate,    LP   j    for the net list price for vehicle j, T is the vehicle investment horizon for the vehicle purchase, BP is the battery price per kWh, BS is the battery size in kWh (zero in the case of conventional vehicles), and S is the subsidy for BEVs (zero for conventional vehicles). The operating expenditure (    a   opex    ) for user i is calculated as:      a   i   opex   =   VKT   i   · (   c   j   ·   k   j   +   k   OM / j   ) +   k   tax / j         It comprises driving dependent and driving independent costs. The cost for driving consists of the specific consumption for electric or conventional driving (    c   j    for vehicle j) in kWh/km or l/km times the specific cost for electricity or fuel (    k   j    ) in EUR/kWh or EUR/l, respectively. By adding the specific cost for operations and maintenance for vehicle j (    k   OM / j    ) we obtain the specific costs per kilometre, which are multiplied by the annual vehicle kilometres travelled (    VKT   i    ) for the driving dependent cost. Driving independent costs consist of annual vehicle tax for vehicle j (    k   tax / j    ).  We incur a cost on a BEV if it needs adaptation to fulfil some of its driving. This cost is assumed to be a rental car cost and is calculated as:      a   i   Adaptation   =   VKT   i   · (   c   3   ·   k   3   ) +   k     rent   i     ·   D   i      where the daily cost for a rental car (    k     rent   i      ) is multiplied by the number of days that exceed the driving range of a BEV (    D   i   )  deriving from the first part of this analysis plus the gasoline cost for driving this day.  To complement the driving data used in the driving need analysis, we need several technical and economic assumptions for the economic analysis. The general parameters are given in Table 3 , and the country-specific parameters in Table 4 . Since the current economic conditions are disadvantageous for EVs, we use a near future scenario (around 2020) with slightly more favourable economic and technical parameters. The analysis could also have been performed for present day values, yet some of the parameters, in particular battery prices, are quickly changing at the moment and more likely to remain at stable values in the near future. Furthermore, more BEV-favourable conditions allow us to analyse a higher number of driving profiles with economical BEVs, making the results below more robust.  The technical parameters comprise battery sizes, depths of discharge of the batteries as well as the specific electricity and conventional fuel use. As we take a users’ perspective we keep the range of the electric vehicle as a variable in the analysis, and from this we calculate battery sizes and corresponding cost. As discussed above the economic assumptions are made for 2020. Generally, the parameters are more favourable for BEVs in Sweden with a higher gasoline and diesel price, a lower electricity price and a direct subsidy for environmental cars to vehicle consumers upon purchase.   RESULTS   In Section 3.1, we analyse how well BEVs, with their range limitation, would replace cars in the different car categories given their driving patterns. The analysis is performed with respect to vehicle kilometres travelled (VKT), varying range limits of the BEV, as well as varying number of accepted DRAs. Thereafter, in Section 3.2 an economic analysis is performed with varying DRA acceptance and varying BEV range limits.  In the first step of our analysis, we calculate the distribution of DRA with respect to annual VKT for a battery range of 120km. We do this only for the Swedish data. In Fig. 1 , the vehicles are separated into single car households as well as first cars and second cars in multi-car households and displayed as triplets of bars w.r.t. annual VKT. The differently coloured portions of the bars denote the adaptation level required according to the figure legend. From the figure, it is clear that annual VKT is a strong indicator of how much adaptation is required, should a car be replaced by a BEV. It is also clear that a large proportion of drivers will have to do some adaptation in order to use a BEV with this range, while a range of 120km would suffice for some drivers. As expected, there are fewer first cars with a low annual VKT, and fewer second cars with a high annual VKT. The number of days requiring adaptation grows with the annual VKT. It can be noted that for annual VKT up to 10,000km, about half (51%) of the second cars have no days requiring adaptation, while for first cars, there is a much smaller fraction (22%) without the need for adaptation. That second cars have fewer DRAs for a given annual VKT is non-trivial, and it suggests that second cars are better suited to be replaced by BEVs. To test this hypothesis, we performed significance tests for the different shares of vehicles with a limited number of DRA in the three categories. More specifically, we divided the cars into the three car categories, two annual mileage groups (0–10,000km, 10,000–20,000km), and two DRA groups (exactly 0 DRA and less than 12 DRA per year). The two tests used are the Fisher exact and the chi-square test. In the German data, differences between the car categories turn out highly significant (at 1% level) in 12/12 pair-wise comparisons of these mileage groups and DRA groups for both tests. In the Swedish data, at 5% significance level, 4 out of 12 tests for the Fisher exact test, and 8 out of 12 for the Standard test are significant. Specifically, in both data sets, first and second cars always have significantly different shares of cars for the chosen DRA categories and annual VKT groups. But single cars are occasionally not significantly different compared to first and second cars. If we would use smaller annual VKT categories (5000–10,000km, 10,000–15,000km, and 15,000–20,000km) the differences between the car categories remain highly significant in the German data (15/18 pairwise comparisons at 1% level), but the significance in the Swedish data is reduced (1/18 in Fisher exact test, 5/18 in chi-square test at 5% level). We interpret this to be an effect of the smaller sample size in the Swedish data. Thus, annual VKT is an important indicator of how easily a car is replaced by a BEV, as well as the car category.  The large sample in the German data enables us to directly visualise the differences in DRA with respect to annual VKT. This is shown in Fig. 2 where the three car categories are separated and the individual mileage (as stated if available and extrapolated otherwise) and DRA are shown. Furthermore, local linear regression lines (LOESS curves – solid lines in Fig. 2) with 95% confidence bands have been added to highlight the average DRA for given annual VKT. The top panel and right panel of Fig. 2 show the distribution of annual VKT and distribution of DRA respectively. Here it can be clearly seen that second cars have fewer DRAs than the other car categories for a large part of the annual VKT span.   Fig. 2 demonstrates that first cars have the highest number of DRA and second cars the lowest number of DRA (which is also supported by highly significant (at 0.1% level) one-sided KS-tests). Furthermore, it emphasises the non-trivial result that second cars have lower average DRA than first cars and single cars even for the same mileage over a large range of annual VKT.  An important factor in this analysis is the vehicle’s range determined by the battery size. Hence, the next step is to understand how the number of DRA changes with increased vehicle ranges. Fig. 3 shows the share of groups with different adaptation frequency as a function of vehicle range for the Swedish data without differentiation by the car categories. Surprisingly, the group with no adaptation needed increases with approximately 2 percentage units per 10km of additional range over the entire range span. Thus, if one seeks to minimise adaptation need for drivers during a transition to a BEV car fleet, an extra 10km of range is as important for long range batteries as for short range ones. Furthermore, very long ranges are needed for BEVs if one expects all driving to be fulfilled without any adaptation. Specifically, a range of 230km is required for half of all cars to fulfil all their driving, while 400km range is needed for four out of five cars to fulfil all their driving.  In Fig. 4 , we contrast first, second and all cars to each other w.r.t. battery range for two different adaptation acceptance levels in the Swedish data. The blue lines correspond to no days requiring adaptation, while the black lines correspond to maximally 12 DRA per year (note that this is different from the previous figure where the second group had more than zero but less than 1day per month, i.e. zero was excluded). The full drawn lines are all cars, the dashed are first cars and the dashed-dotted are the second cars. When demanding all driving to be fulfilled, the second cars have at least 20 percentage points higher fulfilment of driving need compared to first cars for ranges above 90km. The corresponding figure for accepting up to 12 DRA per year is 30 percentage points for the same range spectrum. Furthermore, 70% of the second cars can fulfil all driving at a range of 220km compared to first cars where 70% are reached at 390km of range. In the German data, the average differences between first and second cars are similar to the Swedish, 26% for 0 DRA, and 27% for less than 12 DRA per year. In Fig. 4 it is also interesting to note that the line marking the share of second cars that require no adaptation very closely follows the line marking all cars for an adaptation acceptance level of 12days. This indicates that an adaptation level of 12 DRAs per year correspond to shifting the driving pattern of an average car to the driving pattern of a second car.  Besides varying ranges, it is important to understand what impact behavioural change, or tolerances to days requiring adaptation might have. In the third step of our analysis we have investigated this by analysing the cumulative share of vehicles with respect to number of annual days requiring adaptation for the different car categories. The results are shown in Fig. 5 with Swedish data to the left and German data to the right for a range of 120km. For the Swedish data, the results are extrapolated linearly to one year, while for the German data we have estimated the best-fitting log-normal distribution and taken the integral of it to obtain the cumulative density function (see Section 2.2). For each vehicle in the German data, the seven days of observation have been used to first find a vehicle-specific best fitting log-normal distribution (by maximum likelihood estimates). The resulting individual μ and σ are both normally distributed (mean of the μ’s is 3.3 with standard deviation 0.7, the mean of the σ’s is 0.9 with standard deviation of 0.4). Following the method described in Section 2.2.2, the vehicle-specific annual number of days requiring adaptation has then been calculated. Note that the method for extrapolating the Swedish data yields a result equivalent to calculating the empirical cumulative density function.  In Fig. 5, the cars are differentiated as single- and first- or second-car. We find the distribution of DRA from single-car households to be similar to that of all cars for both Sweden and Germany. In the Swedish data set, we find that more than 30% of the second cars in multi-car households have no days requiring adaptation. This can be compared to about 8% for the first car in multi-car households and about 15% for cars in single car households. The German data yield 0% cars that have 0 DRAs for all car categories, this is an effect of using the log-normal distribution for estimating the number of DRAs; there will always be a small probability for a DRA, and thus, zero probability for zero DRAs. If however, the DRA estimates are rounded to nearest integer values, the shares of vehicles with zero DRA are 15% for single-car households, 4% for first cars and 25% for second cars. When accepting a few DRAs, the German and Swedish results are consistent with each other. In the Swedish dataset, a second car typically has half or less than half of the number of days requiring adaptation compared to a single car, and even less in relation to a first car. For the German dataset, the second car also outperforms the other car categories. This confirms that multi-car households are better suited for adopting BEVs, though it should be remembered that, a large part of the second cars in both data sets need some adaptation of their driving at a battery range of 120km.  Concluding, Figs. 4 and 5 demonstrate that second cars outperform the other car categories both for varying battery ranges, and for varying adaptation acceptance levels.  To determine the market potential of BEVs, we calculate the share of economical BEVs with respect to varying DRA limits as well as to range for both data sets and display these results for the different car categories for varying DRA limit in Fig. 6 and as a function of range in Fig. 7 . As described in Section 2.2.3, this calculation incorporates a cost for DRA (rental car cost), and costs for larger battery sizes (longer driving ranges). Our definition of an ‘economical BEV’ is a BEV that, given a user’s driving pattern end up with a lower total cost of ownership than both a gasoline car, and a diesel car.  For the Swedish dataset (Fig. 6, left panel), we observe that second cars outperform first cars and single cars consistently for varying DRA limits (at an assumed range of 120km). This is an effect of second cars having more regular driving compared to first cars with fewer DRAs as described in Section 3.1. All car categories increase their share of economical BEVs when accepting more DRAs. This is eventually stabilized to fixed levels as the cost of DRA becomes too large. This stabilization occurs later for first cars as they have a higher annual VKT and thus can support more DRAs in the economic analysis. The choice of range has some effect on this result, where a lower range favours second cars and a higher range favours first cars. At a range of 180km, first cars have a higher share of economical BEVs compared to second cars for the whole DRA limit spectrum.  For the German data, the pattern is similar but the stabilized and maximal shares of economical BEVs are close to zero (2.2% for second cars and 0.2% for the first cars) (right panel of Fig. 6). This can be explained by the worse economic conditions for BEVs in Germany, which results in only a few first cars having a high enough annual VKT, and at the same time few enough DRAs to be economical.  In Fig. 7, the share of cars that are economical BEVs is shown with respect to range for the two data sets. For the Swedish data, we find second cars having the potential for a higher market share at lower range limits compared to first cars, and they achieve higher overall shares. The share of second cars peaks at 24% around a range of 100km, while the share of first cars peaks at 15% for a range of 150km. This is consistent with the results from the analysis of DRAs and range in Section 3.1.2: Single cars perform worse than both the other car categories due to a combination of lower annual VKT than first cars and a higher number of DRAs than second cars (cf. Fig. 1).  For the German data, the peaks of second cars and single cars coincide at around 70km while the first cars have no discernible peak. The second cars have the highest share (close to 5%) due to the lower number of DRAs compared to first cars and single cars. In the Swedish data, the higher annual VKT of first cars enables them to become economical to a larger degree, while the price difference between electricity and conventional fuels is too small in Germany to achieve the same effect. Thus, it is mostly second cars that are economical as BEVs in Germany.  To summarise, second cars have the potential for a higher market share compared to other car categories in Sweden and Germany for low battery ranges, and higher market shares overall for varying DRA acceptance limits. The main reasons behind these results are that first cars have more DRAs than second cars, but also a higher annual VKT. The group of cars that best economizes are those that achieve a high annual VKT while maintaining a low number of DRA. In our analysis, these turn out to be mostly second cars. The difference in economic outcomes for BEVs in Sweden and Germany is mostly due to the different economic parameters (see Section 3.2.2 for an elaboration on this). The different annual VKTs (due to the age of the included cars analysed) play a role, but not as strong as the economic parameters. Our economic analysis shows that BEVs are better suited for multi-car-households both in Sweden and in Germany.  The difference in economic conditions for BEVs in Sweden and Germany clearly have an influence on the previous results. But to what extent is this due to the Swedish subsidy and to what extent is it due to price differences? And, how close or far off are the uneconomical BEVs from being economical? Fig. 8 answers the second question by showing the size of the savings achieved by adopting a BEV compared to a conventional vehicle. The figure shows the results for the Swedish driving data with the Swedish and German sets of economic parameters separately. In this figure, the straight lines of dots correspond to the cars with zero DRAs, thus making the savings increase linearly with annual VKT. The other dots represent cars with varying number of DRAs. The dots representing results for the Swedish parameters are, compared to the crosses representing the German conditions, shifted upwards by the Swedish direct subsidy and by the increased savings with annual VKT (due to the energy price differences between Sweden and Germany). The size of the discounted subsidy in Sweden is 680 euro per year. Even when removing this subsidy about one fifth of the Swedish economical BEVs will remain economical. We can see that with Swedish economic parameters a number of cars are close to break-even. For these cars the economic differences could easily be offset (or enhanced) if one were to consider other values, such as the convenience of the much longer range for a conventional car, or the driving experience with the electric car.  A way to compare the relative effect of the price differences between Sweden and Germany and the effect of the Swedish subsidy is to consider the break-even annual VKT required for the BEV compared with a conventional car (for zero DRAs). Since zero DRAs are assumed, this break-even annual VKT is obtained directly from the economic calculation. These are given in Table 5 . As can be seen, the case of Swedish economic parameters without subsidy requires almost exactly the same annual VKT as the case with German economic parameters but with a Swedish subsidy. Thus, the subsidy and the price differences between Sweden and Germany give the same effect on the number of cars that turn out as economical BEVs.   DISCUSSION   We assessed the suitability of BEVs with respect to driving need and economy. This was specifically investigated for three car categories: single cars, first cars in multi-car households, and second cars in multi-car households. Different to PHEVs, the possible adoption areas of BEVs are narrower, given the hard range limit of the BEV. In our analysis we find that BEVs are technically and economically better suited for second cars in multi-car households since they show lower need for adaptation and are more likely to be economical.  We presume that the cars are only recharged at night. Adding the possibility for daytime charging, e.g. at the workplace would yield more days for which the driving requirement is fulfilled. It would also have consequences for the economic analysis since more driving on electricity would make more BEVs economically viable. Charging during the day has been analysed by Gnann (2015) with the aforementioned outcomes, but in this case, no differentiation between car categories was considered.  We combine two data sets with different qualities. The Swedish data has a long observation period but limited sample size, whereas the German data contains a limited observation period but large sample. For the German data, the limited individual observation period implies noteworthy uncertainty for predicting the individual annual mileage or DRA. However, when considering averages from a large sample the individual errors should cancel. We checked this for the annual mileage where estimated and stated mileage have similar averages and found the ratio between individually stated and estimated mileage centred around unity. For the DRA, such a comparison is not possible. But an inconsistency (estimated DRA>maximum possible DRA from stated annual mileage) occurs only for a very minor fraction of the sample. In addition to this, our conclusions rely on the overall statistical behaviour in the three groups not on the accuracy of individual vehicles. Finally, our findings are similar for both German data sets indicating robustness of our results.  When extrapolating the Swedish data to a full year, it is possible that there might be some seasonal effects that influence the number of DRA for individual users. On aggregate, the number of DRA should be correct, since the measurements of the users are evenly spread out over the year. However on individual level, it may be that the users with zero DRAs to a larger extent are measured outside of common vacation periods. This effects all car categories, so the main point of the paper that second cars perform better as BEVs still stands. In fact, if there is a difference, one would expect first cars to have more DRAs in vacation periods than second cars, so second cars may perform, relatively, even better than shown here.  For the German data the number of observations per vehicle is quite limited with a measurement period of seven days. From a statistical point of view, this means that the estimated μ and σ parameters show large confidence intervals and accordingly the estimated DRA have large confidence intervals (see Eq. (6) in Plötz (2014)). However, for large enough sample sizes, the individual errors approximately cancel and reliable averages are obtained (this has been confirmed by bootstrap simulations). Thus, conclusions from the average, as e.g. Fig. 2, are valid despite the limited observation period as the limited observation period is compensated by the large sample size.  We find that annual VKT is an important factor for the number of DRA. When a vehicle ages, the annual VKT decreases (Karlsson, 2013). It is thus likely that the vehicles with the fewest DRAs are also the oldest vehicles. However, when an EV is purchased one would presume that it is new and thus its profile is more similar to new vehicles with higher VKTs and more DRAs. This is not taken into account in our analysis, and would be interesting for further research. Furthermore, we do not consider the heterogeneity in size and models of the vehicles. A further development of the present study might be to compare specific BEVs on the market to their equivalents among conventional vehicles (cf. Khan and Kockelman (2012)).  One possibility of mitigating the effect of the range limitation is to charge the car several times a day. This could ideally be done at a work place or some other location where the car stand still for at least a few hours. In our analysis, we have excluded the possibility of multiple charging events per day. This has been done for two reasons: one is that the charging infrastructure is not developed enough in Sweden and Germany to allow for large scale charging of electric cars. The other reason is that in the German data we lack the possibility to judge if a car has been standing still long enough at a suitable location to allow for charging. Our conclusion that second cars are more suitable as BEVs compared to first cars would be reinforced by multiple charging per day as multiple charging makes short-range BEVs more cost-effective than long-range BEVs (see Lin, 2014), and we have shown that the optimal range for second cars is lower than for first cars (Fig. 7).  In the economic analysis, we compare a conventional vehicle and an EV only based on costs and do not consider the socio-economic characteristics of the owner. The willingness to pay for EVs might be higher in some groups than in others. This was, e.g., found in early adopters of hybrids in California (Heffner et al., 2007) and of EVs in Germany (Peters et al., 2011). Thus, targeting potential early adopters may lead to higher adoption rates.  The argument that BEVs are better suited for two-car households rests on two assumptions. The first is that the second car of a household has fewer long-distance driving days and more regular driving compared to the first car or single cars. The second assumption is that the household may be able to optimise their driving so that the BEV takes the majority of short trips and the conventional car takes the majority, or all, of the long distance trips. In a study that address only the first assumption (such as the present study), the effects of adopting a BEV as a second car in a multi-car household might be underestimated, given that households could optimise for BEV usage. However, a study only addressing the second assumption might over-estimate the effect of adopting a BEV in a multi-car household, since people may not want to, or might not be able to, optimise their BEV usage.  In this paper, we have analysed the validity of the first argument with real world driving data from Sweden and Germany. We find that second cars have more regular driving patterns with fewer long distance driving days and are thus better suited to be replaced by a BEV compared to the first car. This is especially true for cars with a low annual VKT since these have few DRAs. However, even within these groups there are many second cars that are not suited for replacement by a BEV from a daily driving distance perspective, since they may have too many DRAs.  The range needed to reach a majority of about 70% of the second cars without DRA is much shorter than for first cars or single cars (220km compared to 390km). If second cars are targeted for replacement this lessens the need to extend the ranges of today’s BEVs. This, of course, does not take psychological factors into consideration, such as households which believe they need much more range to feel secure and to want to purchase the vehicles.  If we also consider the economic viability of replacing the cars in the different categories, the share of suitable BEVs decreases. Specifically, the second cars still fit the requirements of the BEV better than the other categories, but not by as much.  The observed differences between first cars, second cars and single cars have a number of implications. In EV market models the different car categories are important for BEV adoption, however, these are rarely taken into consideration. The implication for policy makers and industry, is that there is a need to provide different types of cars for different purposes. Long-range BEVs might be necessary for first cars and single cars, but there is a substantial market niche in second cars that could use short- or medium-range vehicles.   ACKNOWLEDGEMENTS   The research was made possible as part of the REM 2030 project, which is funded by the Fraunhofer Society and the federal state Baden-Württemberg. The Area of Advance of Transport at Chalmers is also gratefully acknowledged for funding of this research.   REFERENCES", "highlights": "Battery electric vehicles (BEVs) could reduce CO2 emissions from the transport sector but their limited electric driving range diminishes their utility to users. The effect of the limited driving range can be reduced in multi-car households where users could choose between a BEV and a conventional car for long-distance travel. However, to what extent the driving patterns of different cars in a multi-car household’s suit the characteristics of a BEV needs further analysis. In this paper we analyse the probability of daily driving above a fixed threshold for conventional cars in current Swedish and German car driving data. We find second cars in multi-car households to require less adaptation and to be better suited for BEV adoption compared to first cars in multi-car households as well as to cars in single-car households. Specifically, the share of second cars that could fulfil all their driving is 20 percentage points higher compared to first cars and cars from single-car households. This result is stable against variation of driving range and of the tolerated number of days requiring adaptation. Furthermore, the range needed to cover all driving needs for about 70% of the vehicles is only 220km for second cars compared to 390km for the average car. We can further confirm that second cars have higher market viability from a total cost of ownership perspective. Here, the second cars achieve a 10 percentage points higher market share compared to first cars, and to cars in single-car households for Swedish economic conditions, while for Germany the corresponding figure is 2 percentage points. Our results are important for understanding the market viability of current and near-future BEVs."}