{"id": "S2314808X15000664", "article": "MAIN-TITLE Cardioameliorative effect of punicalagin against streptozotocin-induced apoptosis, redox imbalance, metabolic changes and inflammation   HIGHLIGHTS          Punicalagin ameliorates hyperglycemia and metabolic risk factors.      Punicalagin ameliorates proinflammatory cytokines, oxidative stress and protected DNA integrity.      It modulates apoptotic proteins to protect heart against diabetes-induced apoptosis.          KEYPHRASES   Polyphenols  Cardiomyopathy  Lipids  Streptozotocin  Heart   The prevalence of the diabetic heart has markedly increased in the past few years and is now considered the main cause of sickness and death among the diabetic and obese population. Diabetic cardiomyopathy is associated with increased oxidative stress that stimulates cellular injury and contributes to the development and progression of complications associated with diabetes [1]. Apoptosis is a key process in diabetic cardiac diseases derived from poor glycemic control. A number of studies have documented an increased occurrence of apoptosis in the cardiomyocytes of diabetic patients and experimentally induced diabetic animals [2,3]. It is mediated, at least in part, by the activation of the mitochondrial pathway, which is often triggered by reactive oxygen species (ROS).  There is evidence from experimental and clinical settings on the benefits of antioxidant therapies in the prevention and management of diabetic complications [4–6]. Pomegranate (Punica granatum L. Punicaceae) juice has been shown to contain the highest antioxidant capacity compared to other polyphenol-rich beverages [7,8]. Clinical studies showed positive effects of pomegranate juice consumption on diabetic patients' blood diabetic and oxidative stress parameters [9]. Furthermore, it is documented that pomegranate juice supplementation showed a protective effect against isoperiotinaol-induced cardiac necrosis in rats [10]. The efficient antioxidant potential of the pomegranate is attributed to its major antioxidant polyphenol, punicalagin [11]. A primary mechanism by which pomegranate fractions exert their beneficial effects on the disease condition is by reducing oxidative stress and lipid peroxidation. This reduction may occur by directly neutralizing the generated ROS, enhancing the activities of specific antioxidant enzymes, prompting metal chelation activity, and inhibiting or activating certain transcriptional factors, such as nuclear factor kappaB and peroxisome proliferator-activated receptor gamma [12].  Punicalagin is a bioactive ellagitannin, a type of phenolic compound isolated from pomegranate and exhibits high antioxidant and free radical scavenging activities [13], with several health benefits [14]. It demonstrated a marked outcome in patients with metabolic syndromes, such as hyperlipidemia, non-alcoholic fatty liver disease, and coronary heart disease [12,15–17]. Punicalagin inhibits the formation of advanced glycation end-products [18] and fructose-mediated non-enzymatic protein glycation by scavenging reactive carbonyl species [19]. Good results in terms of fat loss [20] and inhibition of oxidized LDL uptake in macrophages [21] have been demonstrated using punicalagin. In addition to its antioxidant, anti-diabetic and anti-atherosclerotic actions [12,14], punicalagin also exhibited anti-inflammatory activity in cell culture and animal studies [22,23]. It is worth mentioning that repeated oral administration with punicalagin for five weeks is not toxic to rats [24].  Because diabetes is associated with high frequency of heart failure, a better understanding of its pathophysiology is essential for testing of new bioactive compounds and the development of treatment strategies for diabetes-associated cardiac dysfunction. To date, no studies regarding the effect of punicalagin on diabetic cardiac apoptosis and injury have been conducted. The present study hypothesized that punicalagin can counteract oxidative stress and, in turn, ameliorate cellular damage and reduce the development and progression of diabetic complications. Therefore, the current study was designed to investigate the potential beneficial effect of punicalagin against diabetes-induced cardiac injury and apoptosis in connection with its anti-lipid peroxidation and anti-hyperlipidemic actions.  Streptozotocin (STZ) and punicalagin (PU) were purchased from Sigma Chemical (St. Louis, MO). All other chemicals were of the highest grade.  Diabetes was induced in rats by single intraperitoneal (i.p.) injections of freshly prepared STZ (40 mg/kg body weight) in 0.01 M citrate buffer, pH 4.5 [25]. The blood glucose level was assayed 48 h after STZ injection using a glucose monitor set (Elegance, CT-X10, Convergent Technologies GmbH & Co. KG, Marburg, Germany). The rats with a blood glucose level above 250 mg/dl were considered diabetic and were used for the experiments.  Punicalagin is supplied in water soluble dark-yellow powder. Applied dose of 1 mg/kg dissolved in 0.2 ml saline solution was daily i.p. administered for 15 days [26].  Male Wister rats weighing 280–300 g were provided by the Biological Products & Vaccines (VACSERA) of Cairo, Egypt, and were housed in cages with free access to food and drinking water. The animals were acclimated to laboratory conditions of 22–24 °C with a 12-h light/dark cycle for two weeks before experimentation. The current study was approved by Mansoura University, and all experiments were performed in accordance with the standards accepted by the regional experimental animal ethics panel. The rats were divided randomly into four groups of seven rats each. The first group served as a control, the second group received a daily dose of punicalagin (1 mg/kg, i.p.) for 15 days, the third group received a single i.p. injection of 40 mg/kg STZ, and the fourth group received a single injection of STZ (40 mg/kg, i.p.) followed by punicalagin (1 mg/kg, i.p.) every other day for two weeks. After 15 days of treatment, blood was obtained by cardiac puncture after overnight fasting. Serum and heart ventricle were kept in refrigerator for the following investigations.  The glucose and insulin levels in serum and the HbA1c levels in blood were determined using kits supplied by Spinreact (St. Esteve d'en Bas Girona, Spain), Abcam (Cambridge, MA, USA) and BioSystems (Barcelona, Spain), respectively. The lipid profiles in serum, including total lipids, triglyceride, total cholesterol, high-density lipoprotein (HDL), low-density lipoprotein (LDL) and very low-density lipoproteins (VLDL), were assayed according to the manufacturer's instructions (Spinreact, St. Esteve d'en Bas Girona, Spain). Interleukin 6 (IL-6), interleukin 1 beta (IL-1b), tumor necrosis factor alpha (TNF-α) and troponin T in serum were assessed using kits provided by R&D Systems (Minneapolis, MN, USA) and Bioscience (San Diego, CA, USA). Creatine kinase (CK-MB) and lactic dehydrogenase (LDH) activities in the serum were determined using kits purchased from Elitech (Puteaux, France). Lipid peroxidation was assessed by determining the amount of malondialdehyde (MDA). The hydrogen peroxide (H2O2) concentrations were estimated according to the manufacturer's instructions (Dokki-Giza, Egypt). The superoxide dismutase (SOD) and catalase (CAT) activities and the glutathione (GSH) concentration were assayed using kits provided by Biodiagnostic (Dokki-Giza, Egypt). The protein concentrations were assayed as previously described [27].  For flow cytometry, samples from the heart were prepared as previously described [28]. The cells were suspended in PBS with BSA, divided into aliquots and stored at 4 °C for analysis. The flow cytometry analyses were performed on a FACSCalibur™ cytometer (BD Biosciences, San Jose, CA) using CellQuest Pro software (Becton Dickinson) for data acquisition and analysis [29].  Apoptosis was assessed using the fluorescein isothiocyanate-conjugated annexin V/PI, ApoAlert kit from Clontech (Palo Alto, CA) according to the manufacturer's instructions.  The cell suspensions were prepared in a PBS/BSA buffer and were then incubated for 30 min with anti-Bcl-2 [100/D5] antibody (ab692) and anti-Bax [6A7] antibody (ab5714) for flow cytometry analysis of Bcl-2 and Bax, respectively. A mouse anti-P53 “aa20-25” FITC, Clone: DO-1, was used for P53 analysis by flow cytometry. A monoclonal anti-Fas (CD95/Apo-1) antibody was used for CD95 determination. After 30-min incubation at room temperature, the cells were washed with PBA/BSA, centrifuged at 400 × g for 5 min, re-suspended in 0.5% paraformaldehyde in PBS/BSA and analyzed using flow cytometry.  In case of caspases-3, -8 and - 9: FITC rabbit anti-active caspase-3 (CPP32; Yama; Apopain, BD Bioscience), anti-caspase-8 (E6) antibody (Abcam) or rabbit monoclonal anti-caspase-9 (E23) antibody (ab32539) were used respectively.  DNA damage in the heart samples was assessed using the single-cell gel electrophoresis (comet assay) method, a well-validated technique developed for measuring DNA strand breaks in individual cells, as described previously [30,31]. The quantification of the DNA strand breaks in the obtained images was performed with CASP software to directly obtain the percent of DNA in the tail, the tail length and the tail moment.  The ventricle was excised and fixed in 4% buffered paraformaldehyde, dehydrated in ascending grades of ethyl alcohol, cleared in xylene and mounted in molten paraplast 58–62C. Four micron histological section were cut, stained with hematoxylin and eosin and examined under bright field light microscopy and photographed.  The data were presented as the mean ± SEM. The statistical analyses were performed by one-way ANOVA followed by Students Newman–Keul's post hoc test.   RESULTS   The administration of punicalagin alone every other day for two weeks did not affect the body weight, the concentration of glucose, insulin or the lipid profile. Similarly, punicalagin treatment did not affect the levels of IL-1b and IL-6. Furthermore, the activities of SOD and CAT and the lipid peroxidation product (TBARS) in the heart did not change after punicalagin treatment. Conversely, significant increases were demonstrated in the HDL level in the serum and the GSH level in the heart.  The body weight of the STZ-treated rats significantly and gradually decreased compared to that of the normal rats. The diabetic rats treated with punicalagin (1 mg/kg; every other day) showed a significant increase in body weight during the experimental period compared with the diabetic group (Fig. 1a ); however, they remained significantly lower than the control group.  The blood glucose of the diabetic rats was significantly increased during the experimental period compared to that of the control group. The diabetic rats treated with punicalagin exhibited a marked amelioration over the experimental period (Fig. 1b) and at the end of the experimental period (Table 1 ) compared with the diabetic group, but the level was significantly lower than that of the control group.  The STZ injection significantly elevated the serum glucose and HbA-1c levels two weeks after diabetic induction (Table 1). In addition these rats had significantly lower insulin levels and higher HOMA-IR than the controls (Table 1). Punicalagin treatment for 15 days after diabetic induction significantly ameliorated the serum glucose and HbA-1c levels compared to the STZ-treated rats. The diabetic rats treated with punicalagin exhibited a significant increase in the insulin levels and a decrease in the HOMA-IR values compared to the diabetic rats, but the results were similar to the control levels.  The lipid profile, including total lipids, TG, total cholesterol, LDL and VLDL, were significantly higher and HDL was significantly lower in the STZ-treated rats than in the control rats. Punicalagin treatment significantly ameliorated these lipid fractions at 15 days after diabetic induction in the rats (Fig. 2 ).  The concentration of troponin T and the activity of CK-MB and LDH in heart were significantly increased in STZ-induced diabetes compared to the normal control animals (Table 2 ). When diabetic rats were treated with punicalagin, the activity of both enzymes and troponin T level was normalized to a level comparable to that of the control rats and was significantly lower than that of the diabetic animals.  The levels of the lipid peroxidation product and H2O2 were significantly increased in the hearts of the STZ-induced diabetic rats (Fig. 3 ). In addition, significant decreases were demonstrated in the SOD and CAT activities and the GSH content in the hearts of STZ-treated rats. These changes appeared similar to control levels when punicalagin was administered for 15 days after diabetic induction and were significantly better than those of the diabetic rats (Fig. 3).  The ability of punicalagin to influence the production of IL-1b, IL-6, TNF-α was measured in the serum of the different rat groups using enzyme immunoassays. Animals that received STZ had significantly higher levels of IL-1b, IL-6 and TNF-α compared to the control values (Table 3 ). Punicalagin administration after diabetic induction ameliorated the increase in these inflammatory proteins in the serum and displayed insignificant changes when compared to the diabetic rats.  Flow cytometry was used to assess apoptosis in the heart using Annexin V-FITC staining (Fig. 4 ). The percentages of early and late apoptotic cells and necrotic cells were significantly higher in the hearts of diabetic rats than in those of the controls. The punicalagin therapy considerably minimized the number of apoptotic cells compared to the diabetic rats.  Similarly, CD95 and P53 expressions were significantly increased in the hearts of STZ-treated rats (Fig. 5a,b ). Punicalagin administration after diabetic induction significantly ameliorated the increase in CD95 and P53 in the heart compared to the diabetic rats. The effects of punicalagin along with diabetes for particular apoptotic proteins have been evaluated.  The analysis of the flow cytometry data revealed that the anti-apoptotic protein Bcl-2 was significantly reduced, while the apoptotic protein Bax was augmented in the hearts of STZ-induced diabetic rats (Fig. 6a,b ). Punicalagin treatment considerably normalized the STZ-induced changes in the expression of these proteins.  In Fig. 7 , the expression levels of caspases-3, 8 and 9 were significantly up-regulated in the hearts of the STZ-induced diabetic rats. Punicalagin administration significantly normalized these apoptotic proteins (Figs. 6c,7a,b).  The changes in the levels of the comet parameters are displayed in Fig. 8 . The STZ-treated rats showed an increase in the levels of all comet attributes, including percent DNA in tail, tail length and tail moment, suggesting that DNA damage occurred in the diabetic rats. Meanwhile, the treatment of diabetic rats with punicalagin significantly repressed the increase in the comet parameters.  The histological examination of heart sections from the control and punicalagin-treated animals demonstrated the uniform size and regular arrangement of the cardiac muscle fibers, with centrally located round or oval nuclei. The heart sections of STZ-diabetic rats showed a disorganized array of the myocardial structure, myofibrillar discontinuation, myocyte degeneration, and pyknotic nuclei. Punicalagin treatment of STZ-induced diabetic rats reduced these changes in the STZ-injected rat hearts and revealed markedly less disorganization of the architecture of most of the cardiac muscle fibers, with centrally located vesicular nuclei (Fig. 9 ).   DISCUSSION   The actual prevention and management of diabetic cardiomyopathy continues to be an essential health issue. To our knowledge, this is the first study demonstrating that punicalagin has cardioprotective effects in STZ-induced diabetes and that punicalagin reduces the risk of diabetes-induced cardiac apoptosis. Oxidative stress is a core player in the cardiac pathophysiology of hyperglycemia-induced cardiac injury; therefore, it is hypothesized that treatment with bioactive antioxidants is a promising approach to block the pathological changes and protect the heart function.  In the diabetic rats, the body weights were significantly decreased, which may be attributed to increased metabolism of the muscle tissue, fats and proteins [32]. In punicalagin-treated diabetic rats, the body weights were markedly maintained within control levels, indicating a role of punicalagin in protecting against muscle damage, possibly by influencing disturbed muscle protein turnover and the subsequent loss of muscle mass after diabetic induction.  Punicalagin treatment significantly lowered fasting serum glucose, HbA1c and HOMA-IR levels and increased the insulin level in STZ-treated rats at the end of the experimental period. The mechanism underlying the glucose-lowering effect of punicalagin may be due to increased insulin release from the protected and/or remaining β-cells, restored insulin sensitivity [33], changes in the absorption of dietary carbohydrates in the small intestine and facilitated utilization of glucose by the peripheral tissues that is mediated by an insulin-dependent glucose transporter [34]. The present results are consistent with findings from cell culture and animal studies as well as clinical human research that pomegranates rich in punicalagin exhibited anti-diabetic effect [12]. A pomegranate seed methanol extract that is rich in punicalagin showed hypoglycemic activity in STZ-induced diabetes and improved insulin sensitivity in rodent animals [35].  It is well known that maintaining normal serum lipid levels through nutrition programs is an effective approach to decrease the major risk of cardiovascular disease and related disease complications [36]. In the current study, the total cholesterol, LDL-cholesterol, VLDL-cholesterol and triglyceride levels in the serum were significantly reduced after diabetic rats were treated with punicalagin, indicating its beneficial effect on the lipid profile. In Zucker fatty diabetic rats, the pomegranate extract improved abnormal cardiac lipid metabolism by activating peroxisome proliferator-activated receptor-alpha (PPAR-α), thereby decreasing the circulating lipid levels and inhibiting their cardiac uptake [37]. PPAR-α is a cardiac transcription factor involved in myocardial energy production via fatty acid uptake and oxidation. The augmented fatty acid oxidation improves insulin sensitivity by reducing lipid accumulation in the heart [38]. The beneficial effect of punicalagin on the lipid profile in the present study explains the clinical study in diabetic patients with hyperlipidemia [16,39]. The authors claimed that pomegranate reduced cholesterol absorption, increased cholesterol excretion in feces, exerted positive effects on cholesterol metabolizing enzymes, markedly decreased total and LDL-cholesterol and improved the total/HDL and LDL/HDL-cholesterol ratios [16]. Moreover, the pomegranate-mediated reduction of oxidized-LDL cellular uptake and cellular cholesterol biosynthesis was associated with a significant reduction in cellular oxidative stress [40] [41]. In accord with these results, PPARγ modulation by punicalagin resulted in reduced oxidative stress in macrophages in vitro [42]. Thus, punicalagin treatment reduces lipid risk factors, confirming its anti-hyperlipidemic effects in diabetic rats.  A number of publications have reported the involvement of lipid peroxidation in the pathogenesis of diabetes-induced cardiac injury. The increased levels of H2O2 and MDA with decreased levels of SOD, CAT and GSH established excessive oxidative stress in STZ-induced diabetic rats. The increase in oxidative stress in diabetic rats is a consequence of higher ROS generation, which are produced by metabolic disturbances [1,43]. Punicalagin treatment significantly decreased the oxidative stress parameters, increased the GSH levels and normalized the activities of antioxidant enzymes in the hearts of STZ-treated rats, demonstrating the anti-peroxidation effect of punicalagin. It is worth mentioning that punicalagin treatment significantly augmented the GSH levels in the rat heart, revealing its potential ability to improve the antioxidant mechanisms in the heart. Similarly, there was a significant increase in the GSH content in the heart of the pomegranate-treated rats compared to the doxorubicin-treated group, indicating an antioxidant effect against doxorubicin-induced oxidative cardiotoxicity in rats [44]. These results indicate that punicalagin possesses potent antioxidant capacity that is responsible for cardioprotection against oxidative stress.  Moreover, punicalagin administration significantly ameliorated the elevated levels of troponin T levels and LDH and CK-MB activities toward normal levels, indicating that punicalagin is an efficient cardioprotectant in diabetic conditions and can protect cardiomyocyte membrane integrity. Histopathological examination of the heart confirmed this finding and showed that punicalagin effectively prevented STZ-induced cardiac damage. The current data coincide with the ability of the punicalagin-rich pomegranate to protect against I/R injury, doxorubicin and isoproterenol-induced cardiotoxicity in rats, likely because of its actions in enhancing oxygen free radical scavenging activity and decreasing lipid peroxidative damage [10,44,45]. These results indicate that punicalagin can defend the heart against oxidative stress and the associated pathology and dysfunction.  The increase in ROS resulting from sustained hyperglycemia can lead to myocardial inflammation, which is characterized by the production of large number of cytokines [46]. Previous studies reported that the levels of proinflammatory cytokines and ROS were markedly increased and were associated with impaired glucose tolerance [47,48]. Therefore, it has been hypothesized that punicalagin can modulate cellular activity during inflammation due to its antioxidant properties. The current study demonstrated that punicalagin attenuated IL-1b, IL-6 and TNF-α in STZ-induced diabetes in rats. Several recent experimental studies suggest anti-inflammatory effects of pomegranate polyphenols in other settings that are characterized by increased oxidative stress. It has been reported that punicalagin treatment attenuated the elevation of TNF-alpha, IL-6 and IL-1b after LPS-induced acute respiratory distress syndrome in mice [49], in rat primary microglia [22], in cerebral I/R in rats [50] and in an in vitro model of human intestinal epithelium [51]. These data suggest that punicalagin could be an interesting nutritional source that contributes to preventing myocardial inflammation in diseases characterized by excessive oxidative stress, such as diabetes.  To understand the mechanism underlying the cardioprotective action of punicalagin on cardiac apoptosis in diabetes, we investigated the involvement of the STZ-mediated extrinsic and intrinsic apoptotic cell death pathway in cardiac tissues. Flow cytometry analysis demonstrated that punicalagin treatment ameliorated STZ-induced programmed cell death in cardiac tissues by regulating pro-apoptotic proteins, such as CD95; caspases-3, 8, and 9; Bax; and P53, and anti-apoptotic proteins, such as Bcl-2. These results indicate a marked modulation of both mitochondrial and death receptor apoptotic pathways in the hearts of punicalagin-treated diabetic rats and provide evidence that punicalagin has the ability to modulate apoptotic pathways in diabetes. Punicalagin significantly decreased trophoblast death as shown by the reduced levels of cleaved-PARP and LDH release [52]. Punicalagin-rich pomegranate peel extract protected the liver and kidneys by stimulating antioxidant activities and elevating the anti-apoptotic protein Bcl-2 [53]. Punicalagin reduced cerebral ischemia-reperfusion effects via attenuation of proinflammatory cytokines, up-regulation of Bcl-2 and down-regulation of Bax and caspase-3 [50]. In contrast to the induction of apoptosis reported in cancer cells [54], punicalagin protects against heart cell death in STZ-induced diabetes, reflecting the cell type-specific nature of the responses to punicalagin.  In addition, STZ-induced cardiac apoptosis was also evident from the DNA damage. A significant correlation between oxidative DNA damage and hyperglycemia was previously reported [55]. Punicalagin treatment protected cardiac tissue from STZ-induced DNA damage, as evidenced by the inhibition of the increase of comet parameters compared to the diabetic rats. This implies that punicalagin prevented DNA strand breaks and maintained its supercoiled loops in an appropriately firm status. The precise mechanism is unidentified. However, this may be attributed to the effective antioxidant capacity of punicalagin. Therefore, punicalagin can decrease the DNA damage by scavenging the ROS in diabetic cases.  Significantly, the current results display, for the first time, that punicalagin has biological activities in addition to being an antioxidant in the diabetic heart. Punicalagin showed anti-apoptotic effects and protected DNA. It can trigger a variety of anti-apoptotic pathways due to its inherited antioxidant property. Punicalagin treatment effectively down-regulates P53 and up-regulates Bcl-2 and intracellular GSH levels in the STZ-treated rats. P53 and its regulated genes can be activated by hyperglycemia, leading to cardiomyocyte death [56]. It is reported that P53 has the ability to induce apoptosis by an ROS-dependent pathway [57,58]. In contrast, Bcl-2 exhibits an anti-apoptotic and anti-necrotic influence via its antioxidant effect on intracellular ROS [43,59]. Bcl-2 can decrease lipid peroxidation by increasing cell resistance to ROS and blocking ROS production [58]. Accordingly, it is suggested that the anti-apoptotic effect of punicalagin may occur via down-regulating P53 induction and up-regulating Bcl-2, which is related to the enhanced GSH and antioxidant levels in the heart. It also seems that punicalagin decreases apoptosis by blocking DNA damage via the suppression of caspases and pro-inflammatory cytokines that may be related to its anti-glycemic and anti-hyperlipidemic actions.  In conclusion, the underlying mechanisms of punicalagin-induced protection against diabetic cardiomyopathy are pleiotropic and include anti-hyperglycemic, anti-hyperlipidemic, antioxidant and anti-inflammatory activities. It can play an important role in the modulation of inflammatory and apoptotic cell signaling in the diabetic heart.   ACKNOWLEDGMENTS   The facilities provided by the Faculty of Science, Mansoura University, Egypt, are greatly acknowledged and appreciated.   REFERENCES", "highlights": "The effect of punicalagin on metabolic risks, oxidative stress, inflammation, cardiac apoptosis and histopathological alterations in experimentally induced diabetes was addressed. Diabetes was induced in male rats by a single injection of streptozotocin (STZ; 40 mg/kg, i.p.), and then punicalagin (1 mg/kg) was i.p. administered every other day for 15 days. The diabetic rats treated with punicalagin exhibited ameliorated hyperglycemia and HbA1c; improved insulin levels, HOMA-IR levels and lipid profiles; and normalized levels of IL-1b, IL-6 and TNF-α. Punicalagin also reduced the increase in the MDA and H2O2 levels; normalized the levels of GSH, SOD and CAT in the heart; and improved serum markers of heart function including the levels of troponin T level and CK-MB and LDH activities. Histopathological examinations of heart sections match these results, confirming the beneficial effect of punicalagin. It also modulated cardiomyocyte apoptosis via enhanced Bcl-2 expression; blocked the increases in P53, Bax and caspases-3, 8 and 9; and ameliorated DNA damage in the heart. The current results suggest that punicalagin protected the heart against apoptosis, necrosis, inflammation and DNA damage by improving the redox state, suppressing caspases and P53 and increasing Bcl-2. In conclusion, punicalagin possesses strong therapeutic potential in treating and regulating diabetes and attenuating its associated complications in the heart."}