{"id": "S2314808X16000026", "article": "MAIN-TITLE Facile synthesis and vapochromic studies of Co(II) complexes bearing NO and OO donor ligands   HIGHLIGHTS          Two Co(II) complexes of malonic or isonicotinic acids were prepared by a solvent-free technique.      The compounds were characterized by elemental analysis, FT-IR, UV-vis spectroscopy and XPRD.      Vapochromic behaviours of the two compounds were studied using colour changes and FT-IR spectroscopy.      Heating the exposed samples at 100 °C regenerates the original material without degradation.          KEYPHRASES   Solvent-free synthesis  Spectroscopic analysis  Vapochromic studies  Sensors   Vapochromic materials that display colour or luminescence changes upon exposure to vapours have been a subject of continued research in recent years due to their potential applications in chemical vapour detection in food and chemical industries, electronic noses and safety in toxic ambient conditions [1–4]. Although a variety of chemical sensors have been successfully commercialized, there still exists the need for improvement on their performance and several investigations are ongoing in this regard. Applications of coordination complexes as sensors for VOCs detection have been reported [2–4]. Coordination complexes have several advantages such as structural diversity, possibility for post-synthetic modification and a wide range of chemical and physical properties over other sensor types [5,6]. Coordination complexes also compare well to zeolites in terms of large internal surface areas, extensive porosity, and high degree of crystallinity, consequently they have been utilized for many of the same applications including gas storage and separations [7,8].  Complexes are thermally robust with decomposition temperatures above 300 °C, in few cases they can be stable up to 500 °C and are also capable of overcoming the challenge of selectivity that plague other sensor materials [9]. Because complexes contain metal ions in addition to their organic components, they have characteristics similar to discrete coordination complexes, and changes in the coordination sphere of these metal centres can play a role in complex sensing. The polymeric Prussian Blue complex Co2+/[Re6Q8(CN)6]4− (Q = S, Se) produced dramatic changes in the visible spectrum when exposed to specific VOCs; the colour changes were linked to the sensed solvent impacting the geometry and hydration around the Co(II) centres with a change in coordination environment from the octahedral to tetrahedral geometry [10]. Several metal organic framework materials and coordination polymers based on Au(I), Pd(II) and Pt(II) have been extensively investigated for vapochromic responses [11,12].  One of the major goals of green chemistry is to limit the extensive use of solvents or even better to carry out the synthetic reaction in the absence of them. Solvent-free synthesis has therefore been applied over the years both in academic and industrial laboratories [13,14]. Solvent-free reactions are thought to occur in the solid phase, hence the problem of releasing toxic volatile organic compounds; low yield and slow reaction time associated with solution synthesis are avoided. Co(II) complexes are well-known for dramatic colour changes associated with inter-conversion between octahedral and tetrahedral coordination geometries [10]. As a continuation of our work on the use of solvent-free techniques to prepare functional materials [15–18], we hereby report mechanochemical solvent-free synthesis of Co(II) compounds of isonicotinic and malonic acids. Their vapochromic responses to a series of analytes such as methanol, ethanol, benzene, dimethylformamide and dichloromethane were also investigated.  All reagents were purchased from Sigma-Aldrich and were used without further purification. The melting points were determined in capillary tubes using a Gallen-Kamp melting point apparatus. FT-IR spectra were recorded in KBr pellets within the range of 4000–400 cm−1 on a SHIMADZU scientific model 500 FITR spectrophotometer. Electronic spectra of the complexes in solution were recorded on SHIMADZU UV-1650pc UV-vis spectrophotometer. Elemental analyses were carried out in a 2400 Series II Perkin-Elmer CHN Analyzer. Powder XRD analyses were performed on a Syntag PADS diffractometer at 294 K using Cu Kα radiation (λ = 1.54059 Ǻ). Each sample was analyzed between 4.0 and 40.01 2θ with a total scan time of 5.0 min. The thermal analysis (TGA/DTG) was carried under nitrogen atmosphere with a heating rate of 10 °C/min using Shimadzu TGA Q500 V6.7 Build 203 thermal analyzer. Solid-state electronic spectra were measured on polycrystalline samples on Analtikjena Specord 210-plus UV-Vis spectrophotometer over the range 350–900 nm at scanning rate of 5 nm s−1.  The two complexes were prepared by modification of a literature procedure [19].  Malonic acid (0.208 g, 2 mmol) and cobalt acetate tetrahydrate (0.332 g, 1 mmol) were weighed into a clean agate mortar and ground together continuously for 15 minutes. The orange powder obtained was washed with methanol to remove any unreacted starting material, dried at room temperature and then stored in a desiccator over CaCl2. The general chemical equation of the reaction is as shown in Scheme 1 . Yield: 92%, M. wt. = 196.93 g/mol, m.pt. = 230 °C, Anal. Calcd for C3H6O6Co (%): C, 18.28; H, 3.05. Found: C, 18.28; H 3.07. IR (KBr, cm−1): 3288b ν(O-H band of H2O), 1573 νasym(COO-), 1460 νsym(COO-), 542 ν(M–N), 457 ν(M–O); UV-vis (DMSO) nm: 260, 295, 532, 682, 930.  Isonicotinic acid (0.246 g, 2 mmol) and cobalt acetate tetrahydrate (0.332 g, 1 mmol) were weighed into an agate mortar and ground together continuously for 15 minutes. The light pink powder obtained was washed with methanol to remove any starting material, dried at room temperature and then stored in a desiccator over CaCl2. Yield: 93%, m.wt. = 341 g/mol, m.pt. = decomposed > 300 °C; Anal. Calcd for C12H12N2O6Co: C, 42.48; H, 3.54 N, 8.26. Found: C, 42.23, H, 3.52, N, 8.21; IR (KBr, cm−1): 3244 ν(O-H band of H2O), 548 ν(M–N), 457 ν(M–O); UV-vis (DMSO) nm: 264, 302, 476, 516, 1078.  The vapochromic studies of compounds 1 and 2 were carried out following a literature procedure [20]. The compounds were activated by heating at 180 °C for 20 minutes and placed in small open vials. The vials containing the compounds were then placed in a larger vial containing each of the volatile oxygen or nitrogen donor solvent (methanol, ethanol, dimethylformamide, dichloromethane, benzene and NH4OH). The larger vials were then tightly closed for 24 hours. Changes in colour were observed and vapochromic properties were monitored by running IR and solid-state UV-Vis spectra of the samples before and after exposure.   RESULTS AND DISCUSSION   The composition of the complexes was determined by elemental analyses, FT-IR and PXRD. The experimentally determined elemental analysis data were in agreement with the calculated values. The two compounds were obtained with good yields exceeding 90% for both compounds; they are crystalline and very stable in air compared to the highly hygroscopic starting materials. Complex 1 has a sharp melting point at 230 °C while 2 decomposed at temperature above 300 °C.  Malonic acid, HOOC-CH2-COOH, has one -CH2- function between the two carboxylic groups and in metal malonates, it can bind in a bidentate chelating manner through the two carboxylate oxygen at each of the two functional ends to form a four-membered metallocycle [21]. The characteristic broad band at 3075 cm−1 due to ν(O-H) in the free ligand H2(mal) was absent in 1, indicating the existence of deprotonated form of the malonate group in the complex. A broad peak at around 3288 cm−1 was observed in the complex which is characteristic of ν(O-H) band of H2O, indicating the presence of water in the system in agreement with the elemental analysis data. Metal malonate complexes containing coordinated water molecules have been reported [22]. The νasym(COO-) and νsym(COO-) peaks were found at 1573 cm−1 and 1460 cm−1 respectively. Therefore, the Δν(COO-) of 113 cm−1 indicates bidentate coordination of the carboxylate group to cobalt atom, thereby making the malonate ions function as bridging moieties [22a,23]. The presence of new band in the IR spectrum of 1 at 457 cm−1 attributed to M–O also supports complex formation.  Isonicotinic acid has different coordination modes [24], and it is coordinated not only through the carboxylate group but also through the nitrogen atom of the pyridine ring. Sometimes, the nitrogen of the pyridine ring does not participate in the coordination [25]. This property results in different constructions in the Co(II) complex [26,27]. Important vibrational modes implying coordination of the isonicotinic ligand molecule to the metal atom in this work were ν(O-H) and pyridine ring vibrations. The nitrogen of the pyridine ring was observed to have participated in the coordination due to the shift in its band in the complex spectra from 1555 cm−1 to 1552 cm−1 in the spectrum of the Co(II) complex. These variations clearly indicate that coordination of isonicotinic acid takes place via the pyridine ring nitrogen to the metal atom. The O-H band around 3490 cm−1 in the free ligand was observed to have been shifted to 3362 cm−1 in the complex; this is also suggesting the coordination through the hydroxyl oxygen. This coordination mode was also observed by Can et al. [28]. The Δν values of 121 cm−1 in this complex suggests a bidentate coordination of the COO- to the Co(II) centre [29]. Band corresponding to metal–oxygen was observed at 457 cm−1 in the FT-IR spectrum of the complex. In addition, the presence of water was suggested due to appearance of a new band at 690 cm−1 in the complex. The infrared spectroscopic data combined with elemental analysis results support the structures proposed for 1 and 2 in Fig. 1a and b respectively.  The TG and DTG thermogram of complex 1 is shown in Fig. 2a . The compound decomposed in three successive steps beginning from 93–115 °C attributed to the loss of two lattice water molecules (calcd./found: 18.10/19.23%) [30]. Then the compound is stable up to 163 °C. The malonic acid ligand is lost in the second step in the range 160–380 °C (calcd./found: 52.28/51.29%). The experimental values for the mass loss of the dehydration stage and loss of malonic acid molecule are well consistent with the calculated values. After the loss of the ligand and water molecules, the network began to decompose with the continuous weight loss up to 480 °C. Complex 2 was thermally decomposed in four successive decomposition steps within the temperature range 95–550 °C. The first decomposition step (calcd./found: 5.57/4.92%) within the temperature range 95–102 °C may be attributed to loss of lattice water molecule in the complex. At the temperature above 550 °C, loss of the two isonicotinic acid molecules was evident from the TGA curve in Fig. 2b (calcd./found: 76.10/72.24%). The water molecules present in the two compounds were therefore confirmed to be lattice water.  The selected UV-Vis spectra data of malonic and isonicotinic acids and their Co(II) compounds in solutions are given in Tables 1 and 2 . It can be seen from the Tables that the UV-vis spectra of the carboxylic acids present two absorption bands that are assigned to π-π* and n-π* of increasing wavelengths. For the Co(II) compounds, i.e [Co(Mal)].2H2O]n and [[Co(Ina)2].2H2O]n, the visible region produced three bands that can be attributed to 4T1g - 4T1g(P), 4T1g - 4A2g and 4T1g - 4T2g of increasing wavelengths, thereby suggesting octahedral geometry for the compounds [31]. It can be observed from Table 2 that the Co(II) complex of isonicotinic acid show UV-visible spectra along the expected lines. The complex exhibit three peaks around 476 nm, 516 nm and 1078 nm attributtable to 4T1g – 4T1g(P), 4T1g – 4A2g and 4T1g – 4T2g respectively. This is a characteristic of octahedral Co(II) species [31].   The solid powder obtained in the synthesis was used directly without any modifications. Evidence of formation of complexes was demonstrated by comparing the powder X-ray diffraction patterns of the ligands with that of the products 1 and 2 as shown in Fig. 3 . Comparing the XRPD patterns of 1 with those of the ligand (malonic acid), the major peaks in 1 were observed at 2θ = 15.19, 16.26, 17.19, 22.93, 24.17, 26.00, 28.48, 30.42, 35.95, while those of malonic acid were found at 2θ = 10.94, 17.76, 18.86, 22.93, 23.89, 25.20, 27.11, 27.83, 33.35, 33.70, 34.87, 35.42 and 37.21. Quantitative estimation of XRPD patterns of 1 and malonic acid revealed appearance of new peaks in 1 that are absent in the malonic acid ligand indicating formation of a new phase. This suggests a complexation of malonic and cobalt acetate. Similarly, XRPD patterns of 2 were different from the diffraction patterns of the isonicotinic acid ligand. The peaks observed for the isonicotinic acid ligand are situated at 2θ = 12.25, 14.21, 15.09, 16.43, 19.74, 21.56, 22.79, 24.37, 26.25, 26.97, 28.09, 28.65 and 37.30. The peaks present in the 2 are 2θ = 10.15, 14.37, 16.14, 18.06, 19.39, 26.21, 27.68, 28.31, 28.85, 29.79 and 32.99. Some 2θ values appeared for complex 2 that are absent in the ligand suggesting complex formation.  To test for vapochromic behaviour, compounds 1 and 2 were activated by heating at 180 °C for 20 minutes. The complexes after activation were named 1a and 2a. Colour changes were observed after exposure to some solvents, namely ethanol, methanol, dimethyl formamide, benzene, dichloromethane and ammonium solution for 24 hours to give 1a-EtOH, 1a-MeOH, 1a-DMF, 1a-DMSO, 1a-Benzene, 1a-DCM and 1a-NH3 respectively. So, also for compound 2, change in colour in response to the solvents were observed and the FT-IR spectra before and after exposure were obtained. Solid-state exposure of the compounds to vapours of the above VOCs produces a selective and reversible change in their colours that is perceptible to the human eyes and even deeper under UV irradiation, allowing them to function as sensors for these VOCs. In all the compounds after heating, the O-H band intensity around 3400 cm−1 reduces with concomitant water loss, or just a single O-H band is seen. The IR spectra of the activated materials differ from those of the complexes, an indication of structural changes in response to the removal of water molecules. Thus, as a result of heating, the cobalt–aqua bonds were broken and water molecules were lost, resulting in the colour change. Upon exposure of the activated complexes in ambient environment, water vapour is adsorbed and the colours change back to the original colours, or heating the samples exposed to the VOCs for a few minutes at 100 °C regenerates the original material without degradation, even after several exposures/heating cycles, thus confirming the reversibility of the vapochromic properties.  The change in colours of complex 1 with VOCs inclusion is given in Fig. 4a , and important FT-IR bands with the corresponding colour changes are recorded in Table 3 . The FT-IR spectra of 1, its activated form and after exposure to different solvents are given in Fig. 5a . The vapochromic characteristics of 1 were tested and gave some colour changes and differences in the IR spectra. Here, solvent peaks were observed in the spectra of the as synthesized material which disappear on activation; also, the intensity of the O-H peak is reduced and shifted from 3425 cm−1 to 3288 cm−1. Various shifts, either to lower or higher frequencies, were observed for the solvent-included complex, and appearance of peaks characteristic of the functional groups of some of the solvents was observed. For instance, peak characteristic of aromatic C = C stretch was found at 3194 cm−1 for 1a-Benzene, peak at 3273 cm−1 characteristic of N–H stretch was also found for 1a-NH3, C–N stretch peak was observed at 1236 cm−1 for 1a-DCM and an additional O-H peak at 3200 cm−1 was found for ethanol. The appearance of these solvent peaks after exposure is an evidence of solvents inclusion.   Fig. 6a shows the solid state UV-visible spectra of complex 1 before and after exposure to volatile organic solvents. The assignments are as shown in Table 4 . Comparison of the solid state UV-visible spectra of complex 1 with those obtained after exposure to VOCs was carried out. The complexes containing the VOCs showed substantial shifts in wavelength and changes in intensity. The absorption band of the complexes after exposure to VOCs showed red shift in different solvents to higher wavelength relative to their corresponding complexes. Complex 1 showed absorption band at 383 nm, upon direct exposure to VOCs, the absorption band shifted to 400 nm in benzene, 407 nm in DCM, 421 nm in DMF and 400 nm in ethanol with vapochromic shift λmax in the range 17–38 nm. Similar findings were obtained for Cobalt(II) complex of 4-(pyridin-4-yl)benzoic acid after exposure to VOCs [32].  For complex 2, the colour changes after VOCs inclusion are given in Table 5 while their FT-IR spectra are given in Fig. 5b. The colour changes on exposure to the VOCs vary from light orange to light purple. In the IR spectrum of the as synthesized complex, solvent peaks were present which disappeared after activation. Also, the intensity of C = O band at 1716 cm−1 increased. The intensity of other bands either increased or decreased. Also, on inclusion of benzene, solvent peaks appeared and the O-H band shifted. For DCM, DMSO and DMF inclusion, the O-H bands were also shifted to 3240 cm−1, 3356 cm−1 and 3240 cm−1, respectively, likewise for methanol and ethanol inclusion. NH3 inclusion gave rise to new peaks at 3184 cm−1 and 3242 cm−1 corresponding to the N–H stretch. The FT-IR spectroscopic analysis indicated broad O-H band at around 3400 cm−1 the band observed at about 2950 cm−1 corresponds to the aliphatic C-H group while the peak around 1683 cm−1 corresponds to C = O stretch. Mostly, the ν(O-H) region in the IR spectrum, and sometimes other functional group peaks are sensitive to the presence of volatile vapours of oxygen and nitrogen donors. As seen above, there is shift of the O-H band and sometimes, the other bands to either higher or lower frequency for all the solvent-included complexes. Exposure of the complex to VOCs vapours led, in some cases, to compounds whose FT-IR spectra clearly show the bands corresponding to the characteristic absorptions of the functional groups of the VOCs employed, which appeared displaced with respect to those observed for the free VOCs, probably as a consequence of the coordination of the organic molecules to the metal atoms that weakens the bonds. In other cases, the characteristic absorptions were masked by other vibrational modes and assignments were not clear. Because complexes contain metal ions in addition to their organic components, they have characteristics similar to discrete coordination complexes, and changes in the coordination sphere of these metal centres can play a role in complex sensing [19]. From a literature report, a system does not need to be porous in order to undergo guest uptake [33], a flexible metal–ligand structure can adapt in order to accommodate guest molecules [34,35]. We therefore reasoned that the mechanism of guests' uptake here most likely results from molecular distortions in the framework probably caused by solvent hydrogen bonding [36]. Such framework distortions may result to changes in d-d transitions in the visible region.  The solid-state UV-vis spectra of complex 2 before and after exposure to the VOCs are shown in Fig. 6b with the data recorded in Table 6 . Complex 2 exposed to the VOCs also showed red shifts in wavelength and changes in intensity attributed to electronic transitions to higher wavelength as a result of metal–ligand charge transfer. The characteristic absorption band at 370 nm in complex 2 upon direct exposure to VOCs has shifted to 378 nm (benzene), 381 nm (DCM), 397 nm (DMF), 387 nm (ethanol) and 493 nm (methanol) with vapochromic shift λmax in the range 8–123 nm. This finding is in agreement with a literature report [37]. Such distortion in structure of the complex may results to changes in d-d transitions in the visible region.   CONCLUSIONS   Two malonic and isonicotinic acid complexes of Co(II) were prepared using solvent-free mechanochemical technique. The method is simple, environmentally-friendly, efficient and affords products in good yields. Vapochromic properties of the two compounds were studied by exposing them to some volatile organic compounds namely ethanol, methanol, dimethyl formamide, dichloromethane, dimethyl sulphoxide and ammonia for 24 hours after activation by heating at 180 °C for 20 minutes. The changes in colour and the FT-IR spectra pattern were monitored. It was noticed that exposure of the water-desorbed complexes to various solvents results in the formation of several phases. The inclusion of these solvents gives rise to new structural phases whose colours are different from those of the former. These effects are fully reversible, a desirable property for a potential sensor material for the detection of volatile organic compounds.   ACKNOWLEDGEMENT   ACT and SOO are grateful to the Royal Society of Chemistry for the award of 2015 RSC Research Fund Grant.   REFERENCES", "highlights": "Two Co(II) complexes containing malonic and isonicotinic acids have been prepared by manual grinding of stoichiometric amounts of the starting materials. Elemental analysis (CHN), IR, UV-vis spectroscopic techniques, TGA-DTG investigation and X-ray powder diffraction analysis were used to characterize the two compounds. Isonicotinic acid coordinated to the metal via the pyridine ring nitrogen and one oxygen atom of the carboxylic group while malonic acid coordinated via both oxygen atoms of the carboxylate groups indicating bidentate coordination mode in the two compounds. The compounds were exposed to some volatile organic compounds (VOCs) containing nitrogen or oxygen donor atoms in the solid state and their vapochromic behaviours studied using colour changes, FT-IR and solid state UV-vis spectroscopies. Heating the samples exposed to the VOCs for a few minutes at 100 °C regenerates the original material without degradation, even after several heating cycles."}