{"id": "S2314808X14000049", "article": "MAIN-TITLE TP53 polymorphism as a risk factor for hepatocellular carcinoma in hepatitis C virus-infected Egyptian patients   HIGHLIGHTS          The association between the TP53 Arg72Pro polymorphism and the risk of HCC in HCV patients was studied.      The relation between the TP53 Arg72Pro polymorphism and the plasma TP53 levels was also studied.      The Pro/Pro genotype and the Pro allele of TP53 codon 72 are associated with increased risk of HCC.      The plasma TP53 level is downregulated in HCC.          KEYPHRASES   TP53 polymorphism  Chronic hepatitis C  Hepatocellular carcinoma   Hepatocellular carcinoma (HCC) is the fifth most common cancer worldwide and the third leading cause of cancer death, exceeded only by cancers of the lung and stomach [1]. Because of its high fatality rates, the prevalence and mortality rates are approximately equal [2]; however, these values vary among different countries. Most cases of HCC occur in Asia [3]. The development of HCC is multifactorial, resulting from the interaction of environmental factors (possibly hepatitis viruses) and host factors (genetic factors) [4]. Hepatitis C virus (HCV) infection is an important global health problem, as well as the major cause of end-stage liver disease such as liver cirrhosis (LC) and HCC. Most HCV-infected patients become chronic hepatitis sufferers; some of them may develop liver cirrhosis after years of follow-up, which will be followed by HCC [5]. Among the genetic factors, polymorphisms of the TP53 gene have been associated with HCC; however, their impacts on the progression of liver disease remain controversial [6].  TP53 is a tumor suppressor gene (OMIM no. 191170) located on chromosome 17p13.1, and it encodes a 53-kDa nuclear phosphoprotein, which plays a central role in safeguarding the integrity of the human genome [7]. In the cell, the TP53 protein binds to the DNA, stimulating the production of a protein, p21. P21 interacts with a cell division-stimulating protein (cdk2), which acts as a tumor suppressor protein. P53 gene mutations and polymorphisms have been widely associated with cancer [8]. Because the loss of TP53 function has been suggested to be the most important step in multistage hepatocarcinogenesis, TP53 is a potential candidate to decrease the risk of HCC [9]. The codon 72 polymorphism is located in exon 4 of the TP53 gene, a region containing very few mutations. The TP53 protein exhibits a common polymorphism at amino acid 72, resulting in the substitution of an Arginine (Arg) residue (CGC) with Proline (Pro) residue (CCC), designated as TP53 Arg72Pro (ace no dbSNP ID: rs1042522) [10].  The aim of this study was to investigate the association between the TP53 Arg72Pro polymorphism and the risk of HCC in HCV-infected patients. Additionally, we investigated the relation between the TP53 Arg72Pro polymorphism and the plasma TP53 levels in HCC patients.  This is a hospital-based case–control study that included 69 HCC patients, 101 LC patients and 46 healthy volunteers as controls. The HCC and LC patients were suffering from HCV infection. All of the patients were recruited from the Clinics of Tropical Medicine Department, Mansoura University during the period from January 2012 to March 2013. An informed consent was taken from all of the participants before the study. In addition, an approval was obtained from the ethical and scientific committees of the local health authorities.  All of the 69 HCC patients were diagnosed with HCC, based on either triphasic CT scans, positive histologic findings of focal lesions or an elevated α-fetoprotein (AFP) level (≥400 ng/ml), combined with at least one positive image on angiography, sonography and/or high-resolution contrast computed tomography. Furthermore, ultrasound-guided liver biopsy was performed, and at least two strips of liver tissue measuring 2 cm in length were obtained. Liver specimens were prepared with the hematoxylin and eosin stains and the Mason trichrome stain for histological evaluation. All of the patients were newly diagnosed, previously untreated (neither chemotherapy nor radiotherapy) and free from any other cancer. The selection criteria for the 101 LC patients with no evidence of HCC were defined either by histology or using the combination of clinical, laboratory and endoscopic tests. The absence of HCC was established by the absence of focal lesions on the triphasic CT scan and by an AFP level (<400 ng/ml). The LC patients included in the study had no previous histories of cancer and frequency matching to the cases on sex and age. Both the HCC and LC patients were positive to the anti-HCV Ab (3rd generation) test. Additionally, the HCV RNA was extracted from their serum and amplified using molecular methods. Furthermore, lab investigations were performed on all serum samples, for bilirubin (Total & Direct), aspartate aminotransferase (AST/GOT), alanine aminotransferase (ALT/GPT), albumin (Alb), alkaline phosphatase (ALP) and α-feto protein.  The exclusion criteria included autoimmune hepatitis, HBV, dietary aflatoxin, alcohol, fatty liver disease, obesity and diabetes. This study was performed with the approval of the Ethical Committee of the faculties of Science and Medicine, Mansoura University.  All of the subjects were instructed to fast for at least 12 h. A 10-ml blood sample was drawn. Five ml of this sample was delivered to centrifuge tubes containing k2EDTA. One ml of this EDTA anti-coagulated blood sample was stored at −30 °C for DNA extraction, whereas the remaining 4 ml was used to obtain plasma for measuring plasma TP53 levels. The remaining 5 ml from the withdrawn blood sample was allowed to clot for 15 min and centrifuged at 7000 rpm for 10 min to achieve serum separation and the subsequent determination of: activities of liver enzymes (GPT, GOT and alkaline phosphatase) and serum levels of total bilirubin, direct bilirubin, albumin and α-fetoprotein.  Genomic DNA was extracted from the peripheral whole blood using a DNA extraction kit (AxyPrep Blood Genomic DNA Miniprep Kit) in accordance with the manufacturer's protocol. The extracted DNA was stored at −20 °C until further use. The genotypes of TP53 were determined using PCR-based restriction fragment length polymorphism (RFLP) method.  Polymerase chain reaction (PCR) was performed in a DNA thermal cycler (TECHEN TC-312, Model FTC3102D, Barloworld Scientific Ltd., Stone, Stafford Shire, st 150 SA, UK), using the Taq-PCR reaction mix purchased from Fermentas International Inc., Canada. The PCR mixture was prepared for each sample containing approximately 2× of the ready master mix, 25 pmol of forward primer 5′-TGAGGACCTGGTCCTCTGACT-3′, 25 pmol of reverse primer 5′-AAGAGGAATCCCAAAGTTCCA-3′ and 100 ng of template DNA. The thermal cycling conditions were initial denaturation at 95 °C for 5 min, followed by 35 cycles of 94 °C for 30 s, 55 °C for 60 s and 72 °C for 30 s, with a final extension at 72 °C for 10 min. The PCR product was subjected to electrophoresis using a 1.5% ethidium bromide-stained agarose gel.  The PCR product was then digested overnight at 37 °C with the BstUI restriction enzyme (Fermentas, Canada). The digested products were then electrophoresed on a 2% agarose gel and visualized in UV light after ethidium bromide staining. Genotyping was performed using a gel documentation system (Chemi XRS Gel Documentation System) as follows: Pro/Pro gives a single band of 416 bp and Arg/Arg gives two bands, 161 bp and 263 bp. All of the samples were genotyped twice in two different PCR and digestion sets. Twenty samples from each group with different genotypes were re-genotyped using an ABI Prism® BigDye Terminator version 3.1 Cycle Sequencing Kit (Applied Biosystems, Foster City, CA) according to the manufacturer's standard protocol.  The quantitative determination of TP53 levels was performed using Human TP53 ELISA kits (Immuno-Biological laboratories, Inc., 8201 Central Ave NE, Suite P, Minneapolis, MN 55432). This assay employs the quantitative sandwich ELISA technique, which measures TP53 in the plasma. It was performed according to the manufacturer's instructions. The absorbance of each sample was read on a plate ELISA reader (Tecan, Sunrise Absorbance reader) at 450 nm wave length.  The statistical analysis of the data was performed using the Excel program and the statistical package for social science (SPSS) program version 10. The data were reported as the mean ± standard deviation (SD) for the quantitative data and as frequency and proportion for the qualitative data. The data were analyzed to test for statistically significant differences between the groups. For the quantitative data, the Student unpaired t-test was used to compare two groups. The one-way ANOVA test was used to compare more than two groups. The Chi-square test was used to compare qualitative data. P is significant if <0.05 at a confidence interval of 95%.   RESULTS   An agarose gel image represents the PCR-RFLP analysis of the TP53 Arg72Pro polymorphism for LC, HCC and healthy controls, using restriction endonuclease enzyme BstU I (Fig. 1 .A). The Pro allele is not cleaved by BstU I at codon 72 and has a single band with a fragment length of 414 bp. The Arg allele is cleaved by BstU I and yields two small fragments (263 bp and 161 bp). Thus, the heterozygote has three bands (414 bp, 263 bp, and 161 bp). The direct sequencing data confirm the results of the PCR-RFLP Analysis (Fig. 1.B). The TP53 gene exhibits a common polymorphism at codon 72, resulting in the substitution of an Arg residue (CGC) by Pro (CCC), due to a common guanine (G)/cytosine (C) single nucleotide polymorphism (SNP) at the second position of codon 72 in exon 4 of TP53. Three genotypes occur: Arginine homozygotes (Arg/Arg), Proline homozygotes (Pro/Pro) and heterozygotes (Pro/Arg).  Arg72Pro polymorphism in exon 4 has been genotyped in all of the groups. The first group included 46 normal healthy controls (36 males and 10 females). The second group included 101 LC patients (75 males and 26 females) with long term chronic liver disease and without signs and symptoms of focal lesions associated with HCC. The third group included 69 HCC patients (59 males and 10 females). Descriptive clinical and laboratory data are presented in Table 1 . There was a significant increase in plasma TP53 level in both the HCC and LC groups, compared with the control group. In addition, there were significant increases in the activity of liver enzymes, serum total bilirubin, serum direct bilirubin and serum α-fetoprotein levels in the HCC group, compared with the control or with LC groups.  The frequencies of Arg/Arg, Arg/Pro and Pro/Pro genotypes in the healthy control group were 50.0%, 39.1% and 10.9%, respectively. In the LC group, these frequencies were 51.5%, 25.7% and 22.8%, respectively, whereas, for the HCC group, these frequencies were 21.7%, 40.6% and 37.7%, respectively. The allelic frequencies in the HCC group (Arg, 0.42; Pro, 0.58) were significantly different from those in the LC group (Arg, 0.64; Pro, 0.36) and those in the control group (Arg, 0.70; Pro, 0.30) (P ≤ 0.001). The Pro/Pro genotype and the Pro allele were more frequent in the HCC group. The Arg/Arg genotype and Arg allele frequencies were higher in the healthy group, as shown in Table 2 .  The association between the TP53 codon 72 variant genotypes and the development of HCC showed that the overall risk associated with the Proline allele was OR = 2.461, 95% CI: 1.391–4.3558, with a relative risk of 1.5116, 95% CI: 1.156–1.9754. The risk associated with Proline allele carriage was OR = 1.986, 95% CI: 1.1651–3.3857, P = 0.0081 and χ 2 = 5.57, with a relative risk of 1.1138, 95% CI: 1.0862–1.919, P = 0.0112 and χ 2 = 6.42. The variant genotypes were also associated with HCC risk (Pro/Pro: OR = 3.7956, 95% CI: 1.9228–7.4923, P = 0.0001; Arg/Pro: OR = 2.099, 95% CI: 1.0911–4.0383, P = 0.0263; Arg/Arg: OR = 1.9594, 95% CI: 1.0023–3.8306, P = 0.0492) (Table 3 ).  There were significant increases in the plasma TP53 levels in the HCC group when compared with the healthy control group or with the LC group. There was a significant increase in the plasma TP53 level in the CC genotype, compared with the GG genotype, in all the groups, as depicted in Table 4 .  There were significant increases in the plasma TP53 levels in carriers of at least one C allele (GC, CC), compared with carriers of the G allele, in all the groups. Similarly, the plasma TP53 levels were significantly higher in the carriers of at least one C allele (GC, CC) and the G allele carriers in the HCC group, compared with the healthy control group or the LC group, as shown in Table 5 .   DISCUSSION   Human HCC is one of the most common malignancies worldwide. However, no therapy has been effective to date. There is an urgent need to identify molecular markers for the prediction of the disease course and for novel therapeutic approaches [11]. The development of HCC depends on multiple factors: the interaction of environmental factors, possibly, the hepatitis viruses, and host factors, including genetic factors [12]. TP53 regulates a large number of genes (>100 genes) that control numerous key tumor suppressing functions, such as cell cycle arrest, DNA repair, senescence and apoptosis [13]. While the activation of TP53 often leads to apoptosis, TP53 inactivation facilitates tumor progression; inactivation of TP53 mutations occurs in over 50% of cancers [14]. In this study, Arg72Pro of exon 4, a single nucleotide polymorphism in the TP53 gene, has been investigated for its possible role in the development of HCC in HCV-infected patients.  The results from this study demonstrated the association of the Arg72Pro polymorphism of TP53 with the development of HCC. The overall risk of the TP53-Pro72 variant compared with LTC was OR = 2.461, 95% CI: 1.391–4.3558, with a relative risk of 1.5116, 95% CI: 1.156–1.9754. The TP53-Pro72 variant carriage risk was OR = 1.986, 95% CI: 1.1651–3.3857, P = 0.0081 and χ 2 = 5.57 with a relative risk of 1.1138, 95% CI: 1.0862–1.919, P = 0.0112 and χ 2 = 6.42. The variant genotypes were also associated with HCC risk (Pro/Pro: OR = 3.7956, 95% CI: 1.9228–7.4923, P = 0.0001; Arg/Pro: OR = 2.099, 95% CI 1.0911–4.0383, P = 0.0263; Arg/Arg: OR = 1.9594, 95% CI: 1.0023–3.8306, P = 0.0492). In the HCC patients, the frequencies for the Arg/Arg, Arg/Pro and Pro/Pro genotypes were 21.7%, 40.6% and 37.7%, respectively, whereas, in the LC patients, these frequencies were 51.5%, 25.7% and 22.8%, respectively (χ 2 = 15.1, P ≤ 0.001). The allelic frequencies in the HCC patients (TP53-Arg72 variant, 0.42; TP53-Pro72 variant, 0.58) were significantly different from those in the LC control patients (TP53-Arg72 variant, 0.64; TP53-Pro72 variant, 0.36) (χ 2 = 16.5, P ≤ 0.001). These results support previous data [15–18] that reported an association between the TP53 Arg72Pro polymorphism and an increased risk for HCC.  TP53 is critical in cell-cycle arrest and apoptosis after DNA damage; alterations in its function may accelerate the progression from chronic liver disease to HCC [19]. TP53 has been shown to localize to both the outer membrane and inner membrane of mitochondria [20]. The TP53-Arg72 variant is more effective in inducing apoptosis and protecting cells from cancer development than the TP53-Pro72 variant. This might be due to the ability of the TP53-Arg72 variant that were localized at the mitochondrial membrane to regulate the release of cytochrome C into the cytosol. The released cytochrome C would play a pivotal role in activation of caspase-3 and apoptosis induction. This suggests that the TP53-Pro72 variant might be a weaker tumor suppressor than its TP53-Arg72 counterpart. Thus, the TP53-Pro72 variant may be partly associated with the apoptosis suppression of cells, which is an accepted mechanism of tumorigenesis. Although TP53-Pro72 binds more weakly than TP53-Arg72 to the positive regulatory protein, PIN1, a prolyl isomerase, it interacts more readily with the inhibitory protein iASPP (inhibitor of ASPP) [21]. These attributes also predict that TP53-Pro72 has a weaker apoptotic potential than TP53-Arg72. This difference could explain why the TP53-Pro variant may increase susceptibility to HCC. Moreover, the TP53-Arg72 variant was found to suppress the transformation of primary cells to a higher degree, compared with the TP53-Pro72 variant [22]. The results of our study were consistent with these experimental findings. Therefore, it is likely that the different functions of TP53-Arg72 variant and TP53-Pro72 variant affect cell cycle regulation, DNA repair capacity, apoptosis, tumor development, tumor progression and consequently influence susceptibility to HCC.  The summary OR from meta-analyses revealed that Caucasian individuals with the Pro/Pro had an increased risk of HCC [23]. However, no significant association was found in Asian individuals. This discrepancy may due to ethnic heterogeneity and difference in environmental factors. Moreover, the OR value of the Caucasian group is much higher than the Asian group, leading to a skewed overall OR [24]. In contrast [25–27], have reported opposite findings. However, this contrast should be considered with cautions. In addition to the susceptible SNPs, interactions between genes and between genetic and environmental factors may influence cancer predisposition. Confirmation of these findings would require further studies using larger sample sizes, focusing on TP53 Arg72Pro transmission pattern in pedigrees.  In this study, the plasma TP53 level was significantly lower in the HCC patients when compared with the LC group or with the healthy controls, suggesting that the plasma TP53 level was down regulated in HCC. Additionally, the Pro allele of the TP53 Arg72Pro polymorphism had an increased risk of HCC development in HCV-infected patients. This result is consistent with previous results reported for breast cancer, by Hewala [28], and for colon, lung, breast, ovarian and prostate cancer, by Essmann [29,30], confirming the down-regulation of TP53 in HCV patients compared with healthy controls.  Inactivation of TP53 gene mostly results from mutations of this gene. To enable a TP53 gene response in cells containing mutant TP53 and restore TP53 functions in cancer cells [28], suggested two approaches. These strategies include either the ectopic expression of functional TP53 or the reactivation of mutant TP53 in tumor cells. In contrast [31–33], found an over-expression of TP53 in HCC. These contradictory results may be because TP53 is involved in multiple steps during the development of HCC. Our results indicated that TP53 is expressed in multiple stages. In the early stage of HCC, TP53 may be over expressed, resulting in higher plasma TP53 levels when compared with healthy tissues. In contrast, in the late stage of HCC, TP53 is down regulated, compared with healthy tissues. To resolve this ambiguity, it is necessary to expand the sample size for the study and identify the stage of HCC for each patient, based on histopathological, radiological and clinical examinations.  In conclusion, this case–control analysis suggested that Pro/Pro (C/C) genotype and Pro (C) allele of the TP53 codon 72 are associated with an increased risk of HCC in HCV-infected patients and that the downregulation of plasma TP53 is a feasible indicator to predict HCC.  The authors declare complete freedom of any issue concerning conflict of interests related to this work.   ACKNOWLEDGMENTS   The authors are grateful to the staff of the Clinics of Tropical Medicine Department and the Faculty of Science, Mansoura University, Egypt, for the facilities provided throughout this work.   REFERENCES", "highlights": "Background and aims Human hepatocellular carcinoma (HCC) is one of the most common malignancies worldwide. Polymorphisms of the TP53 gene are known to play an important role in HCC. It is aimed to investigate the impact of the Arg72Pro polymorphism of TP53 in the development of HCC among chronic hepatitis C patients with different stages of liver disease.  Subjects & methods This study included 69 HCC patients, 101 liver cirrhosis (LC) patients and 46 healthy, unrelated, age-matched volunteers as controls, from the same locality of Egypt. The HCC and LC patients were suffering from HCV infection. The Arg72Pro polymorphism of codon 72 was tested by PCR, followed by restriction enzyme digestion (PCR-RFLP).  Results The results showed that the Proline allele significantly increases the risk of HCC development (OR 2.461, 95% CI 1.391–4.3558, P = 0.002, Z* = 3.094), compared with the development of LC. The variant genotypes were also associated with the risk of HCC (Pro/Pro: OR 3.7956, 95% CI 1.9228–7.4923, P = 0.0001; Arg/Pro: OR 2.099, 95% CI 1.0911–4.0383, P = 0.0263; Arg/Arg: OR 1.9594, 95% CI 1.0023–3.8306, P = 0.0492). There was a significant decrease in the plasma TP53 level in the HCC group when compared with the LC group or with the control group (P = 0.000).  Conclusion This case–control analysis confirmed that the Pro/Pro (C/C) genotype and the Pro (C) allele of TP53 codon 72 are associated with increased risk of HCC in HCV-infected patients. Additionally, the data suggest that the plasma TP53 level is downregulated in HCC."}