{"id": "S2314808X16000166", "article": "MAIN-TITLE  In vitro study of aqueous leaf extract of Chenopodium album for inhibition of calcium oxalate and brushite crystallization   HIGHLIGHTS          Study of Chenopodium album leaf aqueous extract on in vitro crystallization processes.      Nucleation and aggregation were studied in calcium oxalate crystals and growth assay in brushite crystals.      The extracts and cystone showed inhibition of nucleation, aggregation and growth of crystals.      Anti-urolithiatic effects of the extract might be due to the presence phytochemicals like flavonoids and saponins.          KEYPHRASES   Bathua  Urolithiasis  Cystone  Calcium oxalate  Brushite  Citric acid   Urolithiasis is defined as the presence of one or more calculi in any location within the urinary tract [1]. It is a common disorder estimated to occur in approximately 12% of the population, with a recurrence rate of 70–80% in male and 47–60% in female [2]. Majority of the stones are calcium-containing stones, especially calcium oxalate (80%) and others are 20% [3].  The medical management of urolithiasis involves drug treatment and extracorporeal shock wave lithotripsy (ESWL). The various therapies including thiazide as diuretic and alkali-citrate are used to prevent the recurrence of hypercalciuria and hyperoxaluria, which induce calculi formation, but evidence for their efficacy is less [4]. The surgical endoscopic stone removal and extracorporeal shock wave lithotripsy have revolutionized the treatment of urolithiasis but does not prevent the likelihood of new stone formation [5]. Besides imposing the high cost, shock waves in therapeutic doses may cause acute renal injury, decrease in renal function and an increase in stone recurrence. The recurrence of stone formation is also very high (50–80%). In addition, persistent residual stone fragments and the possibility of infection after ESWL represent a serious problem in the treatment of stones. Thus, medical management of urolithiasis is either costly or poses serious side effects.  The crystallization of the stone begins with increased urinary supersaturation, with the subsequent formation of the solid crystalline particles within the urinary tract. This is followed by nucleation, by which stone-forming salts in supersaturated urinary solution coalesce into clusters that then increase in size by the addition of new constituents [6]. These crystals then grow and aggregate with other crystals in solution, and are ultimately retained and accumulated in the kidney [7]. Therefore, if this progression of crystallization can be prevented, then lithiasis can also be prevented.  There is growing interest of public in herbal medicine, particularly in the treatment of urolithiasis partly because of limited choice in the pharmacotherapy. Data from in-vitro, in-vivo and clinical trials reveal that phytotherapeutic agents could be useful as either an alternative or an adjunctive therapy in the management of urolithiasis. Many Indian plants are useful as antilithiatic agents [5,8–13]. Hence, the Indian medicinal plants are constantly being evaluated for possible antilithiatic effects.   Chenopodium album L. (family: Chenopodiaceae) is a herbaceous vegetable plant locally known as Bathua. It is cultivated as pot-herb and usually grown in gardens, but can be found in the corner of early grain fields in Bombay presidency and elsewhere in India (Kashmir and Sikkim). The medicinal property of this plant is mainly present in leaves and seeds. The leaves of C. album are used in ethno-medicinal practices for treatment of kidney diseases and urinary stones. Ethnobotanical studies of Aravalli region of Rajasthan (India) report the folk medicinal uses of cooked leaves of C. album in kidney stones and urinary tract troubles [14]. Cooked leaves of C. album are used as traditional medicine in the Shekhavati region of Rajasthan for treatment of urinary troubles and colic [15]. In Ladakh, leaves are also used traditionally for controlling painful urination [16]. C. album is an important medicinal weed of Moradabad useful in the treatment of urinary retention and kidney diseases [17].  In view of traditional and ethno-medicinal use of leaves of C. album in the treatment of kidney stones, the present work demonstrated the effect of aqueous extract of the leaves of C. album on in-vitro crystallization of CaOx and brushite crystals. As this plant is consumed as food substance by human beings and as weed fodder by cattle, its antilithiatic property would be good preventive option available.  The leaves of C. album were collected from the local market of Gwalior in December 2012 and identified by Dr. N.K. Pandey, Research Officer (Botany), National Research Institute for Ayurveda-Siddha Human Resource Development, Aamkho, Gwalior. A voucher specimen (Field Book No. 5-4/12–13/NRIASHRD/Tech/Survey/134) of the authenticated C. album has been deposited in the herbarium of the institute.  Cystone (Himalaya Drug Company) and citric acid 1-monohydrate (E. Merck (India) Ltd., Mumbai) were purchased from the local market. All remaining chemicals used in the experiment were of the highest grade commercially available.  The leaves were separated from other extraneous matter and subjected to shade drying. The dried leaves were subjected to a coarse powder by using dry grinder. The powder (100g) was soaked (maceration) in 1 L purified water and kept in dark and dry place for 48 h at a temperature range of 20–26 °C. Chloroform was added in quantity of 1% total mixture to avoid microbial growth. After 48 h, solutions were filtered by Whatman Filter Paper No. 1. The filtered extracts were dried in a rotary evaporator to obtain a dark brown powdery extract (13.4% w/w).  Preliminary phytochemical screening [18] of CAAE was carried out to detect the presence of sterols, alkaloids, saponins, terpenes, tannins, phenolic substances, carbohydrates, volatile oil and mucilage. The total phenolic content of the extracts was determined spectrometrically [19] and expressed as milligram of tannic acid equivalents (TAE) per gram of extract. Total flavonoid content was measured by aluminum chloride colorimetric assay [20] and expressed as milligram of quercetin equivalent per gram of extract. Total saponins were determined according to the previously described methods by Obadoni and Ochuko (2002) with little modification [21].  Nucleation and aggregation assay were performed as per method previously described by Hess et al. [2000] with minor modifications [22]. Briefly, freshly prepared solution of 10 mM calcium chloride dihydrate and 1.0 mM sodium oxalate, containing 200 mM NaCl and 10 mM sodium acetate trihydrate, was adjusted to pH 5.7. All experiments were performed at 37 °C, using a circulating water bath. For crystallization experiments, 25 ml of sodium oxalate solution was transferred into a beaker and placed in the hot plate magnetic stirrer (Model 2MLH, REMI), which was maintained at 37 °C and constantly stirred at 800 rpm. An additional 1 ml of distilled water/standard (cystone)/extract were added and finally calcium chloride solution (25 ml) was added. The optical density was measured at 620 nm in spectrophotometer (UV 1800, Shimadzu Corporation, Japan) after addition of calcium containing solution, on every 15 s over 5 min and then every 1 min over 10 min. All the experiments were performed in triplicate. The final solutions were seen under a light microscope to analyze the density of formed crystals in the solution (Olympus, USA). Percent inhibition in the presence of cystone or CAAE was compared with the control by the following formula.  The percentage inhibition was calculated as:     [  1 −  (    Tsi  /  Tsc    )   ]  × 100    where Tsc, the turbidity slope of the control; and Tsi, the turbidity slope in the presence of the inhibitor.  Inhibitory activity of CAAE against CaOx crystal growth was measured using previously described methods [23,24]. Briefly, 20 ml each of 4 mM calcium chloride and 4 mM sodium oxalate were added to a 30 ml of solution, containing NaCl (90 mM) buffered with Tris HCl (10 mM) pH 7.2. To this 600 µl of calcium oxalate monohydrate (COM) crystal slurry (1.5 mg/ml acetate buffer) was added. Consumption of oxalate begins immediately after COM slurry addition and was monitored for 600 s by disappearance of absorbance at 214 nm. One ml of CAAE (500) and CAAE (1000 µg/ml) was added separately into this solution. The depletion of free oxalate ions will decrease if CAAE inhibits calcium oxalate crystal growth. Rate of reduction of free oxalate was calculated using the baseline value and the value after 30 s incubation with or without the extract. The relative inhibitory activity was calculated as follows:       %  Relative inhibitory activity =  (     (  C − S  )   / C   )  × 100    where C is the rate of reduction of free oxalate without any extract and S is the rate of reduction of free oxalate with CAAE.  Growth assay in single diffusion gel growth of brushite crystals was carried out according to the methods previously described by of Joshi et al. [2005b] with little modification [11]. Single diffusion gel growth method was followed to grow calcium hydrogen phosphate dihydrate (CHPD). When crystals achieved the maximum growth the inhibitive effects of citric acid solution having different concentrations were studied by adding them into the supernatant solution.  Glass test tubes of 2.5 cm diameter and 15 cm length were used for growing the crystals. Five milliliters of sodium metasilicate solution of specific gravity 1.06 were acidified by adding appropriate amount (2.7 ml) of orthophosphoric acid so that 5.0 pH could be obtained for the mixture, which was subsequently transferred into different test tubes. After gelation took place, 10 ml of 1 M aqueous solution of calcium chloride was carefully poured on the set gels. Crystals were found growing very rapidly within two days from pouring the supernatant solutions. Elongated platelet type and star shaped crystals were grown in the gel. The apparent length of growing crystals was measured under microscope at different time intervals. The plot of apparent length of growing crystals versus time showed that the crystals achieved maximum length on the 5th day of pouring supernatant solution on set gel. Aqueous solution of citric acid as a standard and CAAE was added in the same volume as the calcium chloride solution on the 5th day after acquiring the maximum length of CHPD crystals, and their effect was studied on the growth of CHPD crystals up to the 8th day. For pH 5.0, many crystals having star and platelet star and platelet type morphologies were observed. The photographs of the test tube showing the growth of the crystals were recorded.  The data obtained were analyzed by one-way ANOVA, two-way ANOVA and linear regression analysis wherever necessary. A value of p < 0.05 was considered significant in all cases.   RESULTS   CAAE showed the presence of proteins, alkaloids, saponin glycosides, amino acids and flavonoids, while carbohydrates, sterols and tannins were absent. The total phenolic and flavonoid content of CAAE were found to be 239.8 mg TAE/g of extract and 87.23 mg quercetin equivalents/g of extract, respectively while the total saponins content was found to be 1.6 mg saponins/100g of powder mass.  The changes in the turbidity or optical density of different solutions, viz control, cystone (1000 µg/ml), and CAAE (500 µg/ml and 1000 µg/ml), were plotted at different time intervals. The turbidity increased linearly up to 5 minutes, which indicated the nucleation process and then decreased linearly up to 15 minutes indicating the aggregation process. CAAE (500 µg/ml and 1000 µg/ml) and cystone (1000 µg/ml) inhibited both the rate of nucleation and the rate of aggregation. The maximum optical density of the solutions, viz control, cystone (1000 µg/ml) and CAAE (500 µg/ml) and CAAE (1000 µg/ml), recorded was 0.170, 0.072, 0.122 and 0.095. The percent inhibition rates of nucleation of CaOx by cystone (1000 µg/ml), CAAE (500 µg/ml) and CAAE (1000 µg/ml) were found to be 58.33, 12.5 and 37.5 percent, respectively (Fig. 1 ). The percent inhibition rates of aggregation of CaOx by cystone (1000 µg/ml), CAAE (500 µg/ml) and CAAE (1000 µg/ml) were found to be 66.66, 66.66 and 33.33 respectively (Fig. 1). The photomicrographs of the CaOx crystals in solutions of control, cystone (1000 µg/ml) and CAAE (500 µg/ml and 1000 µg/ml) showed that CaOx crystals were less denser in cystone (1000 µg/ml), CAAE (500 µg/ml) and CAAE (1000 µg/ml) as compared to control (Fig. 2 ).  In calcium oxalate growth assay, CAAE inhibited calcium oxalate monohydrate (COM) growth. The percentage inhibition of cystone (1000 µg/ml), CAAE (500 µg/ml) and CAAE (1000 µg/ml) were 50.96, 22.05, and 39.57 respectively (Fig. 1).  The growth of brushite crystals was measured as length (thickness of crystal deposition). The crystals acquired maximum length (approximately 0.35 cm) on day 3 after gelation took place and then after the length of the crystals deposited became constant up to day 8. The average length of the deposited CHPD crystals was decreased by citric acid (1 M), CAAE (500 µg/ml) and CAAE (1000 µg/ml) until day 8. The length of the crystals in control, CAAE (500 µg/ml) and CAAE (1000 µg/ml) were 0.35 cm, 0.21 cm and 0.133 cm, respectively; however, it could not be measured due to absence of any measurable size crystals in citric acid (1 M) group. Figs. 3 and 4 show the effects of citric acid and CAAE on the length of deposited CHPD crystals.    Fig. 5 shows the microphotographs of CHPD crystals in different groups. Crystals in CAAE (500 and 1000 µg/ml) groups were very small compared to the control, whereas in citric acid there was no appearance of observable crystals. Citric acid and CAAE (500 and 1000 µg/ml) significantly decreased the size of crystals (p < 0.001) as measured by its thickness using stage micrometer. The microphotographs of the CHPD crystals of the control showed the plate like crystals having an average thickness size of 52.64 µm, while the average thickness of the crystals in CAAE (500 µg/ml) and CAAE (1000 µg/ml) was 17.28 µm and 14.15 µm, respectively (Fig. 6 ). There were no observable crystals present in tube containing citric acid (1M).   DISCUSSION   The recurrence of stone is a very serious concern in the medical management of urolithiasis. Drug treatments like thiazide as diuretic and alkali-citrate, used to prevent the recurrence of hypercalciuria and hyperoxaluria, are considered to be less efficacious [4]. Although the surgical endoscopic stone removal and extracorporeal shock wave lithotripsy have revolutionized the treatment of urolithiasis, they increase the chances of new stone formation [5], and the shock waves in therapeutic doses may cause acute renal injury, decrease in renal function and an increase in stone recurrence (50–80%).  In view of these, the effect of leaves of C. album, having traditional use in the treatment of kidney stones and urinary tract troubles, was studied in in-vitro models of urolithiasis. In in-vitro calcium oxalate crystallization study, the process of nucleation and aggregation was studied in sodium acetate buffer of pH 5.7 to simulate the conditions of urine so as to favor the above processes. In the crystallization study, the turbidity increased linearly up to 5 min and then decreased linearly up to 15 min after the addition of calcium chloride dihydrate. Earlier increase in the turbidity was suggestive of the nucleation phenomenon, while the decrease in the later part indicated the aggregation. These two phenomena represented the complete process of in-vitro crystallization as observed previously by Hess et al. [2000] [22]. Simultaneous addition of CAAE (500 and 1000 µg/ml) and cystone (1000 µg/ml) along with calcium chloride dihydrate inhibited the nucleation as well as aggregation process of CaOx crystallization as indicated by dose-dependent decrease in turbidity of the solution in both phenomena. The inhibition of in-vitro crystallization of CaOx suggests that CAAE has influence on the formation of crystals from sodium oxalate and calcium chloride and/or their aggregation. Most of the previous papers [25,26] stated that the test drug or extract inhibited the crystallization by favoring the formation of calcium oxalate dihydrate (COD) crystals instead of calcium oxalate monohydrate (COM). The study needs a use of polarized light to differentiate between COM and COD crystals, which is a limitation of the present study and thus could not state whether the CAAE favored the formation of COD and less of COM, but the possibility of this cannot be ignored. The non-significant decrease in turbidity as observed in the process of aggregation may be due to the possibility of more amounts of COD crystals in the solution. Moreover, growth assay showed that CAAE also inhibited the growth of calcium oxalate monohydrate crystals with maximum inhibition at 1000 µg/ml concentration. This indicates that CAAE has inhibitory influence on nucleation/aggregation and growth of calcium oxalate crystals.  Similarly, CAAE also showed significant inhibition of growth of brushite (CHPD) crystals and caused their dissolution, indicated by the small length of the crystal deposition thickness in the test tube (See Figs. 3 and 4) and decreased microscopic thickness of the crystals (P < 0.001) as compared to control (see Figs. 5 and 6). CAAE exhibited effects comparable to standard drug citric acid, which showed the complete dissolution of the CHPD crystals. The effect of citric acid corroborates with previous finding [27]. The results indicated that CAAE has significant influence on the formation, growth and dissolution of crystals, and further suggest that the extract has beneficial effect in preventing the formation of crystals and their growth.  Literature of the previous studies is silent on the exact mechanism involved in the inhibition of in-vitro crystallization and stated that the extracts contained some chemical components that inhibited the crystallization. There are reports that flavonoids inhibit calcium oxalate crystallization in human urine as well as in animal models [28] and crystal deposition [29]. Saponins showed anti-crystallization properties by disaggregating the suspension of mucoproteins, the promoters of crystallization [30]. Phytochemical screening and estimation of important constituents revealed that CAAE contains flavonoids and saponins. It has total flavonoid content of 87.23 mg quercetin equivalents/g of extract and total saponins content of 1.6 mg saponins/100g of powder mass. Thus, the flavonoids and saponins present may be playing a contributing role in anti-crystallization action of CAAE. Fouda et al. [2006] studied the effect of in-vitro and in-vivo antilithiatic effects of saponins rich fraction of Herniaria hirsuta and stated that fraction contained a substance that promoted the nucleation of COD crystals [25]. Finally, the results of the present investigations suggest that the leaves of the C. album have in-vitro anti-crystallization effect on CaOx and brushite crystals. These findings substantiate the traditional use of the leaves in the treatment of urinary stones and kidney problems. In order to substantiate its in-vitro effect, the in-vivo studies need to be carried out in experimental animals.   CONCLUSION   The leaves of C. album have beneficial inhibitory effect on in-vitro crystallization of CaOx and CHPD (brushite) crystals.   ACKNOWLEDGMENT   The authors acknowledge the Director General, Central Council for Research in Ayurvedic Sciences, New Delhi, India, for providing necessary facilities to carry out the research work.   REFERENCES", "highlights": "The leaves of Chenopodium album Linn. are traditionally used for treatment of kidney diseases and urinary stones. The present work investigated the effect of aqueous extract of leaves of C. album (CAAE) on in-vitro crystallization of CaOx and brushite crystals. Crystallization was studied by using nucleation and aggregation assay of calcium oxalate (CaOx) crystals and growth assay of calcium oxalate monohydrate and brushite crystals. The effects of CAAE and cystone on slope of nucleation and aggregation as well as growth of calcium oxalate crystallization were evaluated spectrophotometrically. The densities of the formed crystals were compared under microscope. The effects of CAAE and citric acid on growth of brushite crystals were studied by using single diffusion gel growth technique, and the parameters evaluated were length, morphology and average size of the deposited crystals. CAAE significantly inhibited the slope of nucleation and aggregation of CaOx crystallization, and decreased the crystal density. It also inhibited the growth and caused the dissolution of brushite crystals. The standard drug cystone or citric acid also exhibited similar effects. The study reveals that the leaves of C. album were found effective in the prevention of the experimentally induced urinary stones and substantiate the traditional claim. It is concluded that the leaves of C. album have beneficial inhibitory effect on in-vitro crystallization of CaOx and CHPD (brushite) crystals."}