{"id": "S2314808X16300033", "article": "MAIN-TITLE Consumption of high sucrose and/or high salt diet alters sperm function in male Sprague–Dawley rats   HIGHLIGHTS          Altered sperm function is markedly evident in rats fed with high sucrose and/or high salt diet.      High sucrose and salt modulates corticosterone and testosterone secretion.      Testicular lipid peroxidation is associated with high sucrose and/or high salt diet consumption.          KEYPHRASES   Sucrose  Salt  Sperm function  Testosterone  Corticosterone   In recent times, diets are laden with salt and sugar [1] and constitute ‘the term’ Western diet [2]. The present day dietary pattern closely parallels the technological innovation that has penetrated the global food system, which has increased food availability and accessibility [3].  Processed foods alone account for 80% of daily salt intake [4] apart from daily salt addition to cooking as well as those from natural sources such as meat and plant matter. It could therefore be inferred that daily high salt intake occurs frequently and individuals are often unaware of the amount of salt consumed. The recent estimate on human consumption of salt per day is about 8–12 g [5,6] and this amount is higher than the recommended daily intake of 1.5–2.0 g of salt [7]. In the same vein, soft drinks and sugar-sweetened beverages are a leading source of added sugar in the world [8,9]. Before the advent of modern agriculture, less than 2% energy was derived from sugar, but today about 18%–25% energy comes from simple sugars [6].  The contemporary dietary habit of processed food consumption has become a risk factor in the development of metabolic syndrome [10–12]. Precisely, a high sucrose and/or high salt diet has been associated with increasing prevalence of obesity, hypertension, stroke and type 2 diabetes [5,13,14]. Interestingly, the growing report of infertility closely aligns the increasing incidence of metabolic diseases such as obesity and diabetes, which are fueled by changes in dietary pattern and behavior [15]. Furthermore, recent experimental studies have provided evidences that reproductive potential may be altered by the modern-day dietary habit. For instance, consumption of diet with high levels of sugar and saturated fats disrupt testicular metabolism and compromises spermatogenic processes in rats [16,17]. Similarly, testicular mitochondrial dysfunction and oxidative stress was reported in rats fed a high energy diet, which consequently resulted in sperm defects [18]. In addition, a recent study has revealed that consumption of high fructose and/high salt diet exerted a profound effect on pregnancy outcome and fertility in female rats [6]. We have also reported that consumption of a high sucrose solution alters sperm motility and concentration in rats [19].  Given that dietary habit exerts a profound influence on reproductive function [20], there is however lack of data on the comparative and synergetic effect of high sucrose and high salt diet on testicular physiology vis-a-vis sperm parameters and reproductive hormone profile. The present study was therefore designed to investigate the impact of a high sucrose and/or salt diet on reproductive function in male Sprague–Dawley rats. Food intake, body weight, fasting blood glucose, serum electrolyte and corticosterone levels, oxidative stress parameters, reproductive hormone profile and sperm function were evaluated in the experimental rats.  A total of 24 male Sprague–Dawley rats (8 weeks old) weighing 100–120 g were used for this study. This rat strain was used because several studies have demonstrated its suitability to mirror diet-induced diseases in human [21,22]. The animals were kept in the laboratory animal facility of Babcock University, Ilishan-Remo, Nigeria. Rats were housed in transparent cages under constant environmental conditions (temperature; 24 ± 2 °C, relative humidity; 55–65% and illumination; 12-h light–dark cycle). The animals had ad libitum access to commercial rodent pellet diet (Livestock Feed, Lagos, Nigeria). Care was taken to ensure that all animal handlings and experimental protocols complied with the internationally accepted guideline for laboratory animal use and care (NIH publication No. 85-23, revised 1985).  Rats were randomly assigned to one of four groups comprising of six animals each and designated as control; fed standard chow and tap water, sucrose; fed standard chow and 30% w/v sucrose solution as drinking water, salt; fed 8% NaCl diet and sucrose + salt; fed 30% w/v sucrose solution and 8% NaCl diet. The high sucrose solution (30% w/v) was prepared every second day and this was in accordance with the method of Riberio et al. [23]. The 8% NaCl diet was prepared as described by Iranloye et al. [24]. The standard chow had 0.3% NaCl, thus, 7.7% salt was added to the feed in a w/w ratio to make up for 8% NaCl diet. All rats were fed the experimental diet and sucrose solution ad libitum for a period of 6 weeks. Since it has been identified that processed food consumption may be a risk factor in the development of diabetes and hypertension [25,26], we used a 30% sucrose solution and 8% NaCl dietary regimen, which has been well validated to induce diabetes and hypertension, respectively, in experimental rats [22,23] to test our hypothesis on reproductive parameters. Food intake was recorded daily at 0800 hrs and body weight was determined once a week using a digital weighing scale (Scout Pro, Ohaus Corporation, USA). At the end of the treatment, all rats were euthanized by cervical dislocation following an overnight fast. Blood was collected via the retro-orbital sinus [27] into plain bottles, allowed to clot and centrifuge at 8000 g for 10 mins to obtain serum for hormonal assays and electrolyte determination. Sperm function was assessed post mortem. The reproductive organ – testes, caudal epididymis, seminal vesicle, and prostate gland – were dissected out, blotted dry and weighed. The testes were subsequently processed for oxidative studies.  At the end of the 6th week of treatment, animals were fasted overnight and the tail vein was pricked with a sterilized needle to obtain blood for measurement of glucose levels using a blood glucose monitoring system (Accu-Chek Glucometer, Roche, Germany). The electrolytes were analyzed on Beckman Coulter DXC auto analyzer.  Serum level of corticosterone, testosterone, luteinizing hormone (LH) and follicle stimulating hormone (FSH) were determined using enzyme linked immunoassay (ELISA) and according to the manufacturer's instruction. The ELISA kits were manufactured by Diagnostics Automation Inc., Calabasas, California (USA).  Oxidative analysis of the testes homogenate was done using previously described methods. Malondialdehyde (MDA), a marker of lipid peroxidation was estimated by the method of Uchiyama and Mihara [28] as thiobarbituric acid reactive substance (TBARS). To 1 ml of testes homogenate, 2 ml of thiobabarturic acid (TBA) reagent was added. The TBA reagent consists of 0.375% w/v TBA in 0.25 N HCL mixed with 15% w/v trichoroacetic acid (TCA) in deionized water in equal proportion. The mixture was vortexed and heated in a water bath at 100 °C for 15 minutes and then centrifuged at 1000 g for 10 minutes. The absorbance of the supernatant was measured at 532 nm against an appropriate blank. The concentration of TBARS was calculated from the extinction coefficient of 1.56 × 105M−1 cm−1.  The reduced glutathione (GSH) content of the testes homogenate was determined using the method described by Van Dooran et al. [29]. Two milliliters of testes homogenate was deproteinized by the addition of 3 ml of a reagent consisting of 120 g NaC1, 6.68 g (HPO3)n (metaphosphoric acid) and 0.8 g ethylenediaminetetraacetic acid (EDTA) dissolved in 400 ml distilled water. After centrifugation at 40,000 g for 20 min, 0.5 ml of the supernatant obtained was added to 2 ml 0.3 M Na2HPO4•2H20 solution, followed by the addition of 2 ml of a dithio-bisnitrobenzoate (DNTB) solution (0.4 mg/ml 1% sodium citrate). The absorbance at 412 nm was measured immediately after mixing.  Catalase (CAT) activity was determined by measuring the exponential disappearance of H2O2 [30]. The enzyme reaction was started by adding 0.1 ml of testes homogenate to 2.9 ml of 50 mM phosphate buffer, pH 7.0 containing 12 mM H2O2. The absorbance was recorded at 240 nm immediately at 15 s interval until 2 minutes. A blank was also taken without sample.  The activity of superoxide dismutase (SOD) was determined by the method of Sun and Zigman [31]. The reaction was carried out in 50 mM sodium carbonate buffer pH 10.3 and was initiated by the addition of 3 × 10−4 M epinephrine in 0.005 N HCl. Absorbance was read at 480 nm. For all measurements, the absorbance was recorded using Shimadzu recording spectrophotometer (UV 160).  The testes from each rat were carefully excised and removed along with its adjoining epididymis. One of the testes was separated from the epididymis and the caudal epipidymal tissue was removed and placed in a Petri dish containing 1 mL normal saline (0.9% NaCl) solution. An incision of about 1 mm was made in the caudal epididymis so as to liberate its spermatozoa into the saline solution. Progressive sperm motility, sperm count and sperm viability were then examined under the microscope using ×40 objective as previously described by Raji et al. [32]. Epididymal sperm motility was determined by calculating motile spermatozoa per unit area and was expressed as percent motility. Epididymal sperm counts were evaluated using the improved Neubauer hemocytometer and were expressed as million/ml of suspension. The sperm viability was also determined using eosin/nigrosin stain. The motile (live) sperm cells were unstained while the non-motile (dead) sperms absorbed the stain. The stained and unstained sperm cells were counted and an average value for each was recorded from which percentage viability was calculated. Sperm morphology was evaluated by staining the sperm smears on microscope slides with two drops of Walls and Ewa stain after they were air-dried. The slides were examined under the microscope under oil immersion with ×100 objectives. The abnormal sperms were characterized based on the presence of double tails, detached heads, detached tails, mid piece bending and irregular heads. The relative proportions of normal and abnormal sperm were expressed in terms of percentages.  Data are expressed as mean ± standard error of mean (SEM). Comparison was made by analysis of variance (ANOVA) followed by Newman–Keuls post-hoc test to determine the specific pairs of groups that were statistically different. P < 0.05 was accepted as significant. All analyses were done using the GraphPad Instat Version 3.05 for Window Vista, GraphPad Software, San Diego California, USA.   RESULTS   The weekly food intake of the dietary treatment groups for 6 weeks was depicted in Table 1 . Consumption of high sucrose and/ or salt diet had no effect on food intake until the second week of study where the sucrose and sucrose + salt fed rats had reduced food intake (P < 0.05) compared with control and salt fed rats. Furthermore, by the third week, the food intake in all the treated groups was significantly reduced (P < 0.05) compared with control rats. At the fourth and fifth weeks, sucrose fed rats had a significant reduction in food intake (P < 0.05) compared to the other experimental groups. In addition, at the fifth week, the food intake in the sucrose + salt fed rats was significantly reduced (P < 0.05) when compared with control rats, although it was significantly higher (P < 0.05) than the sucrose fed rats.  The changes in body weight in rats fed with high sucrose and/or high salt diet over a period of six weeks were presented in Fig. 1 . There were no significant differences in body weight in the first two weeks of administration. By the third week, the reduction in body weight was statistically significant (P < 0.05) in the sucrose + salt fed rats compared with the other groups. By the fourth and fifth weeks, all the treated groups had a significant reduction (P < 0.05) in body weight compared with control. Meanwhile, sucrose intake resulted in a higher body weight (P < 0.05) than salt or sucrose + salt intake. Additionally, the salt fed rats had higher body weights (P < 0.05) than sucrose + salt fed rats. Finally, at the sixth week of study, the salt and sucrose + salt fed rats had reduced body weight (P < 0.05) when compared with control. A further reduction (P < 0.05) in body weight was observed by the sixth week in sucrose + salt fed rats when compared with the control, sucrose and salt fed rats.  The weight of the testes and other male accessory organs recorded at the end of the experiment was shown in Table 2 . The combination of high sucrose and high salt in the diet lead to a significant reduction (P < 0.05) in the rats' testicular weight when compared with that of control and sucrose fed rats. Furthermore, there was a significant decrease (P < 0.05) in the weight of the seminal vesicle in sucrose + salt and salt fed rats when compared with both control and sucrose fed rats. There was no significant change in the weight of the epididymis and prostate gland in the experimental rats.  There was no significant difference in the fasting blood glucose (FBG) of the experimental rats in all treated groups when compared with the control. In addition, serum concentration of potassium ion (K+), sodium ion (Na+) and calcium ion (Ca2+) were not significantly different in the treatment groups when compared with the control. However, there was a significant increase in chloride ion (Cl−) concentration (P < 0.05) in the salt and sucrose + salt fed rats when compared with the control rats (Table 3 ).  There was a significant increase in corticosterone level and a significant decrease in testosterone level in the treated rats when compared with the control rats. The result showed no significant changes in LH and FSH levels in the treated rats compared with control rats (Table 4 ).  Epididymal sperm motility, concentration and viability were significantly reduced (P < 0.05) in the treated rats when compared with the control rats. Also, a significantly high abnormal sperm morphology (P < 0.05) was observed in the treated rats when compared with control rats (Table 5 ).   Table 6 shows MDA level and the activity of antioxidant enzymes in experimental rats. MDA level was significantly higher in the salt and sucrose + salt fed rats when compared with both the control and sucrose fed rats. Furthermore, SOD activity was significantly higher in the treated rats when compared with the control. There were no significant differences in GSH and catalase activities of the experimental animals groups when compared with the control animals.   DISCUSSION   The aim of this study was to evaluate the impact of high sucrose and/or high salt diet on male reproduction function using Sprague–Dawley rats. This is imperative in the light of growing concerns with male infertility. Data from this experimental study showed that diet laden with sucrose and salt has a negative impact on male reproduction.  In the present study, it appeared that high sucrose consumption is associated with the regulation of food intake. This is evident by the reduction in food intake being more pronounced when sucrose was administered in isolation than in combination with salt. For most part of the study, comparison of food intake in rats fed a high sucrose diet with those fed on high salt diet revealed that the animals fed on high salt diet had a significantly increased food intake compared with sucrose-fed rats. Sucrose satiating effect has been observed in earlier studies [14,33] with increased feeling of fullness associated with sweetness of sugar [34]. This observed reduction in food intake as a result of high sucrose consumption is in line with the glucostatic hypothesis of food regulation where central glucoreceptive elements respond to rise in blood glucose concentration [35,36]. High salt feeding, on the other hand had no significant effect on food intake when compared with control and this is similar to the observation of Ogihara et al. [37].  It is expected that food intake should correspond with changes in body weight. Clearly, the lower magnitude of weight gain observed in high sucrose-fed rats particularly between the fourth and fifth weeks of treatment aligns with their pattern of food intake when compared with the control rats, although this reduction was not statistically significant by the sixth week of study. The precise role of sugar consumption on body weight gain in experimental rats is controversial; while some authors have reported an increased weight gain in rats [38,39] others have reported no difference in body weight [40,41]. In the present study, the reduction in body weight of the sucrose fed rats appears to be a consequence of reduced food intake. Meanwhile, the combination of high sucrose and high salt diets resulted in a drastic decline in body weight as the dietary treatment progressed despite no major alteration in food intake. The factor responsible for this contrasting observation between food intake and body weight gain is not clear, but could be related to changes in metabolism [42].  Furthermore, a high sucrose diet appeared not to cause any significant alteration in serum electrolyte levels; however, a high salt diet or in combination with high sucrose, significantly raised the serum level of chloride ion, with no changes in other electrolytes measured. Consumption of high salt diet may result in retention of sodium and expansion of extracellular fluid volume, thus raising plasma sodium level. Although there were no changes in sodium ion levels after high salt diet consumption, the observed elevation in chloride ion level corroborates a previous report [43]. Morita et al. [44] also reported that high sodium diet resulted in no significant change in serum electrolyte levels, but increased urinary sodium excretion. Determination of urinary sodium level may have presented a clearer view on why plasma sodium level remained unchanged, but urinary sodium level was not measured in this study.  With respect to reproductive variables, testes weight decreased significantly in the sucrose + salt fed rats and changes in testicular weight may reflect changes in seminiferous tubules [45] which eventually alter quality and quantity of sperm produced. Similarly, reduced seminal vesicle weight in rats fed either a high sucrose, high salt or both may also contribute to reduced sperm quality. This is because seminal vesicular secretion is important for sperm motility and stability of sperm chromatin [46]. The weight of the seminal vesicle is the combined weight of the organ and its secretion [47]; therefore, the decrease in weight observed may likely reflect a decreased secretory content of the seminal vesicle. Sperm function as shown by sperm count, motility, viability and morphology is an important indicator of male fertility potential, with reduced sperm quality associated with decreased fertility rate [48]. The consumption of a diet highly laden with sucrose and/or salt for six weeks greatly altered sperm function in the present study and this was associated with reduced level of testosterone. Reduced production of testosterone by the testes also hampers spermatogenesis [49] and could probably mediate the alteration in sperm quality observed in this study. The precise role of the dietary manipulation on sex hormone production is not clear, but may be associated with changes in testicular weight indicative of tissue atrophy. Going further, Leydig cells produce testosterone in response to LH stimulation, therefore, the non significant change in gonadotropin levels despite the reduced level of testosterone indicated that the dietary treatment acted downstream of the hypothalamic–pituitary axis probably by interfering with LH receptors in the Leydig cells. This assertion however needs to be investigated.  The high level of lipid peroxidation in the testes of rats fed a high sucrose and/or high salt diet may be indicative of free radical damage, which affirms the deleterious effect of the dietary combination on reproductive function. The increased activity of superoxide dismutase (SOD) may also reflect its induction by high level of superoxide (O2 −) in the testes. This is because antioxidant enzymes are often mobilized in response to increasing free radical levels but when overwhelmed by high level of free radicals, oxidative stress results. Oxidative stress on the other hand is associated with sperm malfunction and low fertility [50]. It can therefore be inferred that consumption of a diet laden with sucrose and salt result in oxidative stress in the testes and therefore hampers reproductive function in male Sprague–Dawley rats.  In addition, the dietary manipulation in the present study modulates adrenal corticosterone secretion going by increased corticosterone level in rats fed high sucrose and/or high salt diet. Increased glucocorticoid production following sodium loading has been reported earlier [51] with the enzyme 11beta-hydroxysteroid dehydrogenase type 1 (11β-HSD1) implicated as a causative factor [52]. It is therefore plausible that the dietary combination causes nutritional stress; hence, the high level of corticosterone. High cortisol level may reduce fecundity [53] and this in part may be an underlying factor for the observed effect on the reproductive function.   CONCLUSION   The combination of a high sucrose and high salt diet promoted weight loss and reduced sperm function in Sprague–Dawley rats probably by eliciting metabolic disturbances associated with stress. The reversibility of this negative impact on reproductive function is warranted in future studies.   ACKNOWLEDGMENTS   The authors wish to thank Samuel Dashe who provided technical assistance for the study.   REFERENCES", "highlights": "Diets laden with salt and refined sugar have been implicated in the pathogenesis of diabetes and hypertension. However, few studies have investigated the impact of such diets on reproductive functions, hence, the present study. Male Sprague–Dawley rats (100–120 g, n = 24) were randomly divided into four groups designated control (standard chow), sucrose (30% w/v as drinking water), salt (8% salt diet) and sucrose + salt (30% w/v as drinking water + 8% salt diet). After 6 weeks, rats were euthanized by cervical dislocation. Sperm function was assessed post mortem. Blood sample was drawn via the retro-orbital sinus for estimation of serum levels of corticosterone, testosterone, LH and FSH using ELISA kit and electrolytes using flame photometer. Oxidative analyses of testes homogenate were carried out using previously described methods. Values are means ± SEM, compared by ANOVA. Sperm concentration, motility, viability and morphology were significantly altered in sucrose, salt, and sucrose + salt fed rats. In addition, the serum level of testosterone was significantly reduced in the treated rats compared with control. Sucrose, salt and sucrose + salt feeding resulted in increased level of serum corticosterone when compared with control. MDA level was significantly increased in salt and sucrose + salt fed rats compared with control and sucrose fed rats. Meanwhile, the activity of SOD was significantly increased in the treated rats compared with control. These data indicate that consumption of high sucrose and high salt diet either together or in isolation impact negatively on sperm function and may be underpinning the increasing prevalence of male infertility."}