{"id": "S2314808X15000780", "article": "MAIN-TITLE Synthesis and characterization of Hg(II) and Cd(II) complexes derived from the novel acenaphthaquinone-4-phenyl thiosemicarbazone and its CPE application   HIGHLIGHTS          The acenaphthoquinone-4-phenyl thiosemicarbazone and its bimetallic Hg(II) and Cd(II) complexes have been synthesized.      The ACPTH utilized in CPE for preconcentration and determination of trace amounts of Hg(II) and Cd(II) in aqueous medium.      The Hg(II) and Cd(II) preconcentration optimum conditions were 0.1% (w/v) Triton X-114 and 2 × 10−5 M ACPTH at pH 7.      The proposed method was applied successfully in the determination of Hg(II) and Cd(II) in different water samples.          KEYPHRASES   Acenaphthaquinone  Thiosemicarbazone  Separation and preconcentration  CPE   Thiosemicarbazones is an important class of NS donors due to their variable donor properties, structural diversity and biological applications [1]. They got biological importance from the fact that they have good antiparasital [2], antibacterial [3], antitumor [4,5], antimalarial [6], antineoplastic [7] and antivira1 [8] activities. Chelation of some thiosemicarbazones to some metal ions increase their antitumor activity [9,10]. Since, the chemical nature of thiosemicarbazone derivatives and their metal complexes have been widely investigated [11–15]. Thiosemicarbazones have been used for extraction and determination of some metal ions in biological and pharmacological samples [16,17].  Acenaphthaquinone used as an intermediate for the manufacturing of dyes, pharmaceuticals, pesticides, and synthesis of versatile fluorescent chemosensors when reacts with 8-aminoquinoline [18]. Acenaphthaquinone thiosemicarbazone reacted with Fe(III), Ni(II), Cu(II) and Zn(II) chlorides or acetates leads to formation of complexes that have been characterized by spectroscopic studies. Also, the free ligand showed high activity of cell proliferation inhibition and induced differentiation on Friend erythroleukemia cells (FLC) [19].  Determination of trace metals in a complex matrix has been usually complicated. In such matrixes, separation and preconcentration steps should precede determination to minimize or even eliminate matrix effects and contaminants, lower the detection limit and enhance the detectability. Cloud point extraction (CPE), as an effective separation and preconcentration technique, was first studied by Watanabe and co-workers in the early 1980's [20–23]. The CPE have distinct merits of low cost, simplicity, speed, and lower toxicity to the environment than extractions using organic solvents, which have high capacity to concentrate wide variety of analytes, high recoveries, and high concentration factors. In the CPE technique, the surfactants used are mostly of nonionic type, such as Triton X-114, X-100, or PONPE. Triton X-114 is the most applied surfactant due to its low cloud-point temperature (30 °C), high density, commercial availability and lower toxicity [24].  Heavy metals like Cd(II) and Hg(II) are toxic [25,26] where the excess of Cd(II) leads to renal toxicity while Hg(II) leads to damage of the central nervous system and causes neuropsychiatric disorders [27]. Due to their low concentration in the environmental and biological samples, a preconcentration-separation technique is generally necessary prior to determination. For this purpose, various analytical procedures have been used such as adsorption on graphene oxide nanosheets [26], activated carbon [28,29], co-precipitation [30,31], Streptococcus pyogenes immobilized on Dowex Optipore SD-2 [32], column extraction [33,34], ion selective electrode [35,36], liquid–liquid extraction LLE [37], biosorbent Staphylococcus aureus [38], biomass Drepanocladus revolvens and Xanthoparmelia conspersa [39,40] and cloud-point extraction CPE [41,42].  In the present study, the new acenaphthaquinone-4-phenylthiosemicarbazone (APTH) and its complexes with Hg(II) and Cd(II) was synthesized and characterized. In addition, it is employed in CPE procedure for separation, preconcentration and determination of Cd(II) and Hg(II) in water samples.  The IR spectra were recorded as KBr discs using Thermo-Nicolet IS10 FTIR Spectrometer (Thermo Fisher Scientific Inc, Waltham, MA, USA). The electronic spectra were measured on a Unicam UV-Vis Spectrometer UV2 (Akribis Scientific Ltd., Cheshire, WA16 0JG, United Kingdom). The 1H-NMR spectra of APTH and its Cd(II) complex, in DMSO-d6, were recorded on Jeol Delta2 Spectrometer (500 MHz) (JEOL USA Inc., Peabody, MA 01960, USA). The mass spectrum of APTH was measured by Thermo DSQ II Spectrometer (Thermo Fisher Scientific Inc., Waltham, MA, USA). The FAAS measurements were carried out using A Perkin Elmer Analyst 800 atomic absorption spectrometer (Perkin Elmer Inc., Waltham, MA 02451, USA) with a longitudinal Zeeman background correction furnished with a transversely heated graphite atomizer (THGA), which was used for the determination of Cd(II) at wavelength 228.8 nm, slit width 0.7 nm and lamp current 12 mA. Sample solutions were injected into the atomizer by using AS-800 auto-sampler. The sample injection volume was 20 µl. The system is equipped with winLab 32 software. The Hg(II) was determined by cold vapor technique (CVAAS) using 1% m/v NaBH4 in 0.05% m/v NaOH at carrier gas flow rate of 1000 ml/min and slit width 0.7 nm. The pH of the solution was adjusted using Hanna instrument model 8519 digital pH meter (HANNA Instruments, Rhode Island, Woonsocket, RI 02895, USA). The temperature of the cell compartment was kept constant by circulating water from a thermostatic water bath at the desired temperature, which was used for the CPE experiments (Memmert GmbH Co. KG, D-91126 Schwabach, Germany). A centrifuge was used to accelerate the phase separation process employing Centrifuge Hematocrit Mikro set (Alkeslabindo, Kota Depok, Indonesia).  All chemicals purchased from Aldrich (Sigma-Aldrich Chemie GmbH, Munich, Germany) were of analytical grade quality and used without purification. Distilled water was used in all experiments. The stock solution of 10−4 M CdCl2 and HgCl2 was prepared by dissolving 0.0660 and 0.0027 g, respectively, in 100 ml distilled water in a measuring flask. The non-ionic surfactant, Triton X-114, was used without further purification. The stock solution 1% w/v was prepared by dissolving 1 g of Triton X-114 in 100 ml distilled water. Hexamine buffer solutions 0.5 M, pH 4-8, were prepared by dissolving 17.5240 g in 250 ml distilled water in a measuring flask. A 0.1 M NaOH and/or HNO3 solution used to adjust the pH to the desired value. For pH 9 and 10, ammonium chloride/ammonium hydroxide buffer solution was used. A stock solution of the ligand (APTH) 10−3 M was prepared by dissolving 0.0331 g in 100 ml acetone.  The acenaphthaquinone-4-phenylthiosemicarbazone (APTH) was prepared by heating under reflux a mixture of acenaphthaquinone (0.01 mol, 1.82 g) and 4-phenylthiosemicarbazide (0.01 mol, 1.67 g) in ethanol in the presence of 5 ml glacial acetic acid for 1 h. On cooling, a fine brown powder was formed, filtered off, and washed successfully with EtOH and then diethyl ether, and recrystallized from EtOH (m.p. 190 °C; yield 91%).  The metal complexes prepared by reacting the APTH (0.001 mol, 0.331 g) with the equivalent amount of CdCl2.2.5H2O and HgCl2 salts were dissolved in EtOH under reflux for 2 h after. A red break and reddish brown precipitate were formed in case of Cd(II) and Hg(II), respectively, filtered off while hot, washed successfully with hot ethanol and then diethyl ether, and dried and preserved in a vacuum desiccator over anhydrous calcium chloride (for Cd(II); m.p. 275 °C, yield 96%; for Hg(II), m.p. 215 °C, yield 93%).  For the CPE, an aliquot of 10 ml of a solution containing Cd(II) or Hg(II), Triton X-114 (0.1% w/v), 2 × 10−5 M APTH and 2 ml of buffer solution (pH = 7), were kept for 10 min in a thermostatic bath at 45 °C. Subsequently, separation of the phases was achieved by centrifugation for 10 min at 4000 rpm. The phases were cooled down in an ice bath in order to increase the viscosity of the surfactant rich phase. The bulk aqueous phase was easily decanted simply by inverting the tube. The surfactant-rich phase was made up to 0.5 ml by adding absolute methanol. The absorbance was measured at 478 and 446 nm for Cd(II) and Hg(II), respectively.  First, the water samples from different origin were filtered through filter paper to separate the coarse particles and suspended matter, and second, through a Millipore cellulose nitrate membrane (pore size 0.45 µm), then acidified to pH 2 with HNO3 and stored in a refrigerator in a dark polyethylene bottle.  The reaction of the ligand with the chloride salt of Cd(II) and Hg(II) led to formation of bimetallic complexes which its elemental analyses indicate that have the formula [Cd2(APTH)Cl4] (red break) and [Hg2(APTH)2Cl4(EtOH)2] (reddish brown) respectively (Table 1 ).  The comparison of the APTH infrared spectrum with that of the acenaphthylene-1,2-dione, as shown in Fig. 1 , indicated that four new bands were observed at 3292, 3263, 1143 and 750 cm−1, and attributed to ν(N4H), ν(N2H), ν(NN) and ρ(NH) [43] vibrations, respectively. Another four bands were observed at 1540, 1430, 1168 and 828 cm−1 and assigned to Thioamide I, II, III and ν(C  S) [44], respectively (Table 2 ). The broad band observed in 1710–1620 cm−1 region consisted of three overlapped bands according the deconvolution analysis data (Table 3 ). The first one at 1690 cm−1 was attributed to the ν(C  O) while the second at 1680 cm−1 was due to the ν(C  O) involved in hydrogen bond. The third one at 1660 cm−1 was assigned to ν(C  N1) vibration (Fig. 2 ). The existence of a shoulder at 3238 cm−1 in addition to a weak band at 1937 cm−1 suggest the involvement of the C  O and N2H in intramolecular hydrogen bond [45] (Table 2).  The 1H-NMR spectrum of the ligand in DMSO-d6 shows two singlet signals at 12.82 and 10.93 ppm attributed to protons of N4H and N2H [19], respectively. Addition of D2O to the solution of the ligand leads to disappearance of these two signals, confirming its assignment. Also, the spectrum displayed three triplet signals at 7.45, 7.87 and 8.12 ppm assigned to the protons at positions (f), (b) and (e) [44], respectively. Moreover, the spectrum shows three doublet signals at 7.32, 7.65 and 8.37 ppm attributed the protons at (d), (a) and (c) positions [44], respectively (Fig. 3 ) (Structure 1 ).  The mass spectrum of APTH showed a molecular ion peak at (m/z = 331; 31.23%), which coincides with its molecular weight (331.39). The suggested fragmentation pattern, shown in Scheme 1 , indicated that there were two routes by which fragmentation may occur, showing base peak at m/z = 180 corresponding to the formula C12H8N2 (180.21).  Finally, the electronic spectrum of the ligand in DMSO showed four bands at 37,040, 30,675, 28,090 and 23,255 cm−1 with a shoulder at 19,840 cm−1. The first two bands were attributed to π→π* transitions of the aromatic rings, C  O, C  N1 and C  S [43] while the other three bands were attributed to n→π* transitions of carbonyl, azomethine and C  S groups [45,46], respectively (Fig. 4 ).  The spectrum of [Cd2(APTH)Cl4] complex, in KBr disc, displayed band at 3236 cm−1 with a shoulder at 3292 cm−1 in addition to two bands at 1145 and 732 attributed to ν(N2H), ν(N4H) [46], ν(NN), and ρ(NH) [43] vibrations, respectively. Moreover, four bands were observed at 1535, 1442, 1172 and 802 cm−1 assigned Thioamide I, II, III and ν(C  S) [44], respectively. The deconvolution analysis of the broad band centered at 1673 cm−1, shown in Fig. 5 , indicated that it consisted of two overlapped bands at 1675 and 1655 cm−1 attributed to ν(C  O) [47] and ν(C  N1) [48] vibrations, respectively (Table 4 ). The comparison of the spectral data with that belonging to the ligand clears that ν(N2H), ν(C  O), ν(C  N1) and ν(C  S) are shifted to lower wavenumbers suggesting its involvement in coordination to the metal ion [49] (Table 2). Therefore, it could be concluded that the ligand is coordinated to the metal ion in neutral tetradentate manner and exists in keto-form (Structure 2 ).  On the other hand, the [Hg2(APTH)2Cl4(EtOH)2] spectrum showed a broad band centered at 3450 cm−1 attributed to the ν(OH) of the ethanol molecules. The appearance of the ν(N4H) band at 3290 cm−1 indicates that it did not participate in coordination to the metal ion [46] (Fig. 6 ). A band at 3351 cm−1 and shoulder at 3264 cm−1 were attributed to ν(N2H) [49] involved in coordination to the metal ion and the free one, respectively. Moreover, two bands at 1706 and 1683 cm−1 were observed and attributed to ν(C  O) coordinated to metal ion [47] and ν(C  O) free, respectively. The ν(C  N1) vibration band observed at 1620 [49] cm−1 indicating its participation in coordination to metal ion. All these spectral data clears out that the ligand exists in keto-form [46]. Thus, the appearance of two bands due to ν(N2H) and ν(C  O) vibrations corresponding to the free and coordinated groups was taken as evidence for that one ligand molecule coordinated to the metal ion as neutral tetradentate while the other is neutral bidentate (Structure 3 ) (Table 2).  Moreover, the 1H-NMR spectrum of Cd(II) complex in DMSO-d6, in comparison to that of the ligand, shows the aromatic protons at more or less the same positions in addition to singlet signals at 12.83 and 10.84 ppm attributed to the N2H and N4H protons, respectively. The appearance of the N4H at the same position and the shift of N2H to upfield (~0.1 ppm) confirm the involvement of N2H in coordination to the metal ion (Fig. 7 ).  The electronic spectrum of Cd(II) complex in DMSO showed three bands at 36,230, 32,050 and 27,930 cm−1 attributed π→π* of the aromatic rings, π→π* of C  O and n→π* of C  O [43,45,46], respectively. Also, a band at 20,000 cm−1 was observed with two shoulders at 23,255 and 21,460 cm−1 and assigned to ligand to metal charge transfer [50] and n→π* of azomethine groups, respectively. The shift in band position of the carbonyl transition confirms the involvement of carbonyl group in coordination to the metal ion. Finally, the spectrum of Hg(II) complex displayed three bands at 33,780, 27,780 and 19,840 cm−1 with three shoulders at 31,850 and 23,925 cm−1 due to intra-ligand transitions. Moreover, a new band at 21,000 cm−1 was observed and attributed to LMCT transition. The data confirm the existence of the ligand in keto form.  The extraction of metal ions using cloud point technique involves formation of a complex with the reagent used that has sufficient hydrophobic nature to be extracted into a small volume of surfactant-rich phase and so obtaining the desired preconcentration. The pH plays a unique role in metal-chelate formation and subsequent extraction [51]. Fig. 8 shows the influence of pH on the absorbance of the Cd(II) and Hg(II) complexes at 478 and 446 nm, respectively. As seen, both metals can be extracted efficiently at pH 7 after which the complexation and/or extraction of the metal ion decreased. The Hg(II) shows higher stability than Cd(II), which has a sharp decrease. Hence, pH 7 was chosen as the working pH.  The effect of concentration of APTH on analytical response is shown in Fig. 9 . As seen, the absorbance increases, reaching maximum at 2 × 10−5 M, which is considered as complete chelation and extraction of both metals Cd(II) and Hg(II). From the data, the optimum concentration used for further studies is 2 × 10−5 M.  The plot of the recovery percentage versus the concentration of Triton X-114 is shown in Fig. 10 . At a concentration of 0.1% (w/v), optimum recovery of the analytes is obtained. At lower concentrations, the extraction of chelated metal ions is low probably because of the inadequacy of the surfactant micelles to entrap the hydrophobic complex formed quantitatively. Increasingly, after this optimal concentration, the recovery is observed to decrease, which may be attributed to the increase in the final volume of the surfactant that causes the preconcentration factor (phase volume ratio) to decrease [52].  Optimal incubation time and equilibration temperature are necessary to complete reactions and to achieve easy phase separation and preconcentration as efficient as possible. The greatest analyte preconcentration factors are expected under conditions where the CPE is conducted using temperatures that are well above the cloud point temperature of the surfactant. It was found that a temperature of 45 °C is adequate for the analytes (Fig. 11 ).  It was desirable to employ the shortest equilibration time and the lowest possible equilibration temperature, which compromise the completion of reaction and efficient separation of phases. The dependence of absorbance upon equilibration and centrifugation times was studied within the range 5–25 min. The optimal time for equilibration and centrifugation is 10 min (Fig. 12 ).  Under the optimum conditions, the increase of the metal concentration was studied in the range 0.25–10 ng/ml for Cd(II) and 0.25–25 ng/ml for Hg(II). The data indicated that the linear ranges are 0.25–3 and 0.25–7.5 ng/ml for Cd(II) and Hg(II), respectively; LOD = 1.0 and 2.0 ng/ml for Cd(II) and Hg(II), respectively; LOQ = 3.38 and 6.65 ng/ml for Cd(II) and Hg(II), respectively; % R.S.D. in the range 1.20–1.62 and phase volume ratio = 50 (Figs. 13 and 14 ). The detection limits (LODs) and limits of quantification (LQDs) calculation were based on the 3σ and 10σ criterion, respectively, where σ is the standard deviation of 5 determinations of the method carried out during the same analytical run. The blank was a 1% v/v ultrapure HNO3 solution. Repeatability (precision) was calculated as the relative standard deviation of five measurements of a sample with concentration values in the central region of the analytical range carried out during the same analytical run.   Two types of interference affect the preconcentration and/or the detection [53]. The effect of interfering ions at different concentrations on the absorbance of a solution containing 0.25 ppm of both Cd(II) and Hg(II) was studied. An ion was considered to interfere when its presence produced a variation in the absorbance of the sample of more than 5%. This increment of absorbance was evaluated for Cd(II) and Hg(II) at 478 and 446 nm, respectively, to establish the different effects of the interfering ions on the analytes. Among the tested interfering ions, Na+, K+, Cl− and NO3 − did not interfere at concentrations higher than that of the analytes by even more than 1000 fold while ions like Mg2+, Ca2+, I−, PO4 3− and SCN− in addition to thiourea did not interfere at medium concentrations in the range 500–100 fold. On the other hand, Fe2+, Fe3+,Al3+, SO4 2−, F−, acetate and citrate show strong inference in concentration range 1–50 fold (Table 5 ).  The proposed CPE procedure was applied in determination of Cd(II) and Hg(II) from real water samples. The water samples were collected from tap water in Mansoura City, River Nile at Mansoura City, El-Manzala Lake, Mediterranean Sea at Gamasa, and underground water at Belqas territory. Hence, the determinations were carried out in spiked water samples with 1 ml of 20 ng/ml to 50 ml, assuming that the original content of this ions was negligible compared to the concentration spiked. The Hg(II) and Cd(II) content were determined spectrometrically and compared with those determined by HG-FAAS and FAAS, respectively. Table 6 shows the results of applying the proposed method on different water samples to determine the Cd(II) and Hg(II) contents. Finally, a comparison of the current work with previous studies is shown in Table 7 . In case of Hg(II), the proposed procedure showed detection limit higher than the spectrophotometric determination using PAN as chelating agent (difference is 0.35 mg/l) [57]. In case of Cd(II), the detection limit of the proposed procedure is very close to ICP-OES determination using Dithiazone as chelating agent [57].   CONCLUSION   In this study the new acenaphthaquinone-4-phenyl thiosemicarbazone (APTH) and its bimetallic Hg(II) and Cd(II) complexes were synthesized and characterized. The chelation mode of the ligand to the metal ions is tetradentate as N,N,S,O donor. Applying the APTH as a chelating agent in CPE procedure for extraction of Hg(II) and Cd(II) from aqueous medium was achieved at pH 7 using 0.1% w/v Triton X-114 and 2 × 10−5 M APTH. Linear calibration curve is obtained in the ranges 0.25–3 and 0.25–7.5 ng/ml for Cd(II) and Hg(II), respectively. The method was applied successfully for determination of Hg(II) and Cd(II) in different water samples.   REFERENCES", "highlights": "The new acenaphthaquinone-4-phenyl thiosemicarbazone (APTH) was synthesized. The reaction of Hg(II) and Cd(II) chloride with APTH yields bimetallic complexes, which are characterized by elemental, IR, UV-Vis., 1H-NMR and Mass spectroscopy. The APTH employed as a chelating agent for CPE procedure of trace amounts of mercury and cadmium from aqueous medium. The Hg(II) and Cd(II) is preconcentrated using 0.1% w/v Triton X-114 and 2 × 10−5 M APTH at pH 7. The calibration curve is linear in the ranges 0.25–3 and 0.25–7.5 ng/ml for Cd(II) and Hg(II), respectively. The proposed method was applied successfully in the determination of Hg(II) and Cd(II) in different water samples."}