{"id": "S2314808X1500069X", "article": "MAIN-TITLE Mathematical modeling of gas phase and biofilm phase biofilter performance   HIGHLIGHTS          Analytical expressions of concentrations of substrate are presented in gas and biofilm phase.      Analytical results are compared with the numerical results and are good in agreement.      Analytical results provide a good understanding of the system and the optimization of the parameters in biofiltration model.          KEYPHRASES   Methanol  Biofilters  VOCs  Mathematical modeling  Non-linear differential equations  Adomian decomposition method   Different cleaning technologies of gaseous effluents have been developed. Among these technologies, biological methods are increasingly applied for the treatment of air polluted by a wide variety of pollutants. Biofilteration is certainly the most commonly used biological gas treatment technology. Biofilteration involves naturally occurring microorganisms immobilized in the form of biofilm on a porous medium such as peat, soil, compost, synthetic substances or their combination.  The medium provides to the microorganisms a hospitable environment in terms of oxygen, temperature, moisture, nutrients and pH. As the polluted airstream passes through the filter-bed, pollutants are transferred from the vapor phase to the biofilm developing on the packing particles [1,2].  Recently Li et al. [3] as well as other research groups [4–10] have investigated emissions of VOCs into the atmosphere. Currently, biological control processes have become an established technology for air pollution control. Biological control processes have many advantages over traditional methods such as lower operating fees and less secondary pollution, which is rather true for the removal of readily biodegradable VOCs at low concentrations, so these processes are investigated largely and widely. Bioreactors for VOC removal can be classified as biofilters, bio scrubbers, biotrickling filters, or rotating drum biofilters, and choice of reactors should be based on many factors including the characteristics of the target VOCs [11–15].  In order to control the emission of volatile organic compounds (VOC) like methanol, α-pinene, etc. from industries, biofilters are being used nowadays instead of chemical complex absorption method [16–20]. Biofilters offer two major advantages to an energy-starved country like India. A mathematical model is describing the dynamic physical and biological processes occurring in a packed trickle-bed air biofilters to analyze the relationship between biofilter performance and biomass accumulation in the reactor [4].  For the treatment of mixed VOCs [21–23], the presence of methanol and α-pinene in the air stream significantly influenced the removal of pollutants. The removal capacity for methanol and α-pinene per unit volume of the bed decreased linearly with increasing loading rates of methanol and α-pinene. The presence of this easily biodegradable compound suppressed the growth of the methanol and α-pinene degrading microbial community, thereby decreasing methanol and α-pinene removal capacity of the biofilters. Some researchers have studied the biofitration of pure methanol [24–26] and pure α-pinene [27,28].  Recently, few researchers have studied the biofitration of mixtures of pure methanol and pure α-pinene. Also a few researchers have tried to examine the treatment of mixtures of hydrophobic and hydrophilic VOCs and to understand the interactions between these compounds despite the fact that this situation exists in larger amount of air emissions. Mohseni and Allen [16] developed a mathematical model for methanol and α-pinene removal in VOC's biofilteration. Lim et al. [29] developed the steady state solution of biofilter model only for the limiting cases (first order and zero order kinetics). Also Lim et al. [30,31] obtained the non-steady solution of biofilter model using numerical methods. Recently some authors [32,33] solved the non-linear problems using fractional reduced differential transform method (FRDTM). To the best of our knowledge, to date, a rigorous analytical expression of concentrations of substrate in the biofilm phase and air phase has been reported. The purpose of this communication is to derive approximate analytical expressions for the concentrations in both the phases using the Adomian decomposition method [34–40].  The mathematical model relating the biofiltration of blends of hydrophilic and hydrophobic VOCs is based on the biophysical model proposed by Mohseni and Allen [16]. It includes two main processes of diffusion of the compounds methanol and α-pinene through the biofilm and their degradation in the biofilm. Fig. 1 illustrates a schematic diagram of a single particle, in the biofilter, covered with a uniform layer of biofilm in which the simultaneous biodegradation of methanol and α-pinene takes place. The experimental setup for the biofilteration of this organic compound is given in Fig. 2 .  The removal of methanol and α-pinene in the biofilm at steady state is described by the following system of non-linear differential equations (Mohseni and Allen [16]):  (1)    D  e m      d 2   S m    d  x 2    =  X   Y m       μ  max  ( m )     S m     K m  +  S m          (2)    D  e p      d 2   S p    d  x 2    = α  X   Y p       μ  max  ( p )     S p     K p  +  S p       where Sm and Sp represent the concentration of methanol and α-pinene respectively.   μ  max   ​ ,  K ,  Y ,   D e   and  x  are maximum specific growth rate, half saturation constant, yield coefficient, effective diffusion coefficient and the distance respectively. Subscripts m and p represent methanol and α-pinene respectively. The dry cell density in the biofilm X represents the overall population of microorganisms that consist of methanol and α-pinene degraders. The coefficient for the effect of methanol on α-pinene biodegradation is defined as follows:  (3)   α =  1 /     (  1 +  (     C m   /   K i     )   )   2       where Ki and Cm are the inhibition constant and the concentration of methanol in the air phase respectively. The boundary conditions are  (4)    S m  =    C m     m m    =  S  i m    and   S P  =    C P     m P    =  S  i P    at  x = 0       (5)     d  S m    d x   =   d  S P    d x   = 0  at  x = δ       The concentrations of methanol and α-pinene in the air, along the biofilter column, are described by  (6)    U g    d  C m    d h   =  A s   D  e m       [    d  S m    d x    ]    x = 0         (7)    U g    d  C p    d h   =  A s   D  e p       [    d  S  m p     d x    ]    x = 0      where Cm and Cp represent the concentration of methanol and α- pinene in the air phase.   U g  ​ ,   A s  ​ ,   D  e m   ​ ,   D  e p    and  h  are the superficial gas velocity, biofilm surface area, effective diffusivity of methanol, effective diffusivity of α-pinene and position along the height of the biofilters respectively. The corresponding initial conditions are  (8)    C m  =  C  m i    and   C p  =  C  p i    at  h = 0    where the subscript i represents the concentration of the VOCs at the biofilters inlet.  The non-linear differential Eqs. (1) and (2) are made dimensionless by defining the following dimensionless parameters:  (9)   β =    S  i m      K m    ,   φ 1  =   X   μ  max  ( m )       Y m       δ 2     D  e m    K m    ,   S m  ​ * =    S m     S  i m           (10)    β 1  =    S  i p      K p    ,   φ 1  =   X   μ  max  ( p )       Y p       δ 2     D  e p    K p    ,   S p  ​ * =    S p     S  i p           Using the above dimensionless variables, Eqs. (1) and (2) reduce to the following dimensionless form:  (11)      d 2   S m *    d X  * 2    = φ  (     S m *    1 + β  S m *     )        (12)      d 2   S p *    d X  * 2    = α  φ 1    (     S p *    1 +  β 1   S p *     )        The corresponding boundary conditions for the above Eqs. (11) and (12) can be expressed as  (13)    S m  ​ * = 1 ,   S p  ​ * = 1  at  X * = 0       (14)     d  S m  ​ *   d X *   =   d  S p  ​ *   d X *   = 0  at  X * = 1       The differential Eqs. (6) and (7) are made dimensionless by defining the following parameters:  (15)   A =   H  A s   D  e m    S  i m      U g  δ  C  m i     ,   A 1  =   H  A s   D  e p    S  i p      U g  δ  C  p i     ,  h * =  h H  ,   C m *  =    C m     C  m i     ,   C p *  =    C p     C  p m i           Using Eq. (15), Eqs. (6) and (7) can be expressed in the dimensionless form as follows:  (16)     d  C m *    d h *   = − A    (    d  S m *    d X *    )    X * = 0         (17)     d  C  m p  *    d h *   = − α  A 1      (    d  S p *    d X *    )    X * = 0         The corresponding initial conditions for the above Eqs. (16) and (17) can be expressed as  (18)    C m *  =    C m     C  m i      and   C p *  =    C  m p      C  p i      at  h * = 0       In recent years, many authors have applied the ADM [35–40] to various problems and demonstrated the efficiency of the ADM for handling non-linear and solving various chemistry and engineering problems. Using ADM (refer to Appendix A), we can obtain the concentration of methanol and α-pinene in the biofilm phase (see Appendix B) as follows:  (19)       S m *    (  X *  )  =     S m    ( x )     S  i m     = 1 +   X  μ  max  ( m )     δ 2     Y m   D  e m     (   K m  +  S  i m    )     (     x 2    2  δ 2    −  x δ   )       =  1 +  φ   (  1 + β  )     (    X  * 2   2  − X *  )          (20)       S p *    (  X *  )  =     S p    ( x )     S  i p     = 1 +   X  μ  max  ( p )    α  δ 2     Y p   D  e p     (   K p  +  S  i p    )     (     x 2    2  δ 2    −  x δ   )       =  1 +   α  φ 1     (  1 +  β 1   )     (    X  * 2   2  − X *  )          Also solving Eqs. (6–7) and (16–17) using the analytical method, we can obtain the concentration of methanol and α-pinene in the air phase.  (21)    C m *    (  h *  )  =    C m    ( h )     C  m i     = 1 −    A s  X  μ  max  ( m )  δ      Y m   U g   K m    (  1 +  (     S  i m    /   K m     )   )    h = 1 −   A φ    (  1 + β  )    h *       (22)    C p *    (  h *  )  =    C p    ( h )     C  p i     = 1 − α    A s  X  μ  max  ( p )  δ      Y p   U g   K p    (  1 +  (     S  i p    /   K p     )   )    h = 1 −   α  A 1   φ 1     (  1 +  β 1   )    h *       Now we consider the limiting case where the substrate concentrations of methanol and α-pinene in biofilm phase are relatively low. In this case   S m  ≤  K m   and   S p  ≤  K p   . Eqs. (1) and (2) now reduce to the following form.  (23)    D  e m      d 2   S m    d  x 2    =   X  μ  max  ( m )       Y m   K m     S m        (24)    D  e p      d 2   S p    d  x 2    = α   X  μ  max  ( p )       Y p   K p     S p        The analytical expression for concentrations of methanol and α-pinene in the biofilm phase becomes  (25)    S m *    (  X *  )  =    S m    ( x )     S  i m     =   cosh  (      X  μ  max  ( m )       Y m   D  e m    K m       (  x − δ  )   )    cosh  (      X  μ  max  ( m )       Y m   D  e m    K m      δ  )    =   cosh  φ   (  X * − 1  )    cosh  φ          (26)    S p *    (  X *  )  =    S p    ( x )     S  i p     =   cosh  (      α X  μ  max  ( p )       Y p   D  e p    K p       (  x − δ  )   )    cosh  (      α X  μ  max  ( p )       Y p   D  e p    K p      δ  )    =   cosh   α  φ 1     (  X * − 1  )    cosh   α  φ 1            Using Eqs. (6–7) and (25–26) we obtain the analytical expression of the concentrations of methanol and α-pinene in the air phase.  (27)       C m *    (  h *  )  =     C m    ( h )     C  m i     = 1 −    A s   D  e m    S  i m      U g        X  μ  max  ( m )       Y m   D  e m    K m      tanh     X  μ  max  ( m )       Y m   D  e m    K m      δ      =  1 −  (  A  φ  tanh  φ   )  h *         (28)       C p *    (  h *  )  =    C p  ( h )     C  p i     = 1 −    A s   D  e p    S  i p      U g        α X  μ  max  ( p )       Y p   D  e p    K p      tanh     α X  μ  max  ( p )       Y p   D  e p    K p      δ      =  1 −  (   A 1    α  φ 1    tanh   α  φ 1     )  h *         Next we consider the limiting case where the substrate concentrations of methanol and α-pinene in biofilm phase is relatively high. In this case   S m  ≥  K m   and   S p  ≥  K p   and Eqs. (1) and (2) reduce to the following form.  (29)    D  e m      d 2   S m    d  x 2    =  X   Y m     μ  max  ( m )          (30)    D  e p      d 2   S p    d  x 2    = α  X   Y p     μ  max  ( p )          Then the analytical expressions for concentration of methanol and α-pinene in the biofilm phase are as follows:  (31)    S m *    (  X *  )  =    S m    ( x )     S  i m     = 1 −   2 X  μ  max  ( m )       Y m   D  e m    S  i m     x +   X  μ  max  ( m )       Y m   D  e m    S  i m      x 2  = 1 +   α φ  β   (  X  * 2  − 2 X *  )        (32)    S p *    (  X *  )  =    S p    ( x )     S  i p     = 1 −   2 X  μ  max  ( p )       Y p   D  e p    S  i p     x +   X  μ  max  ( p )       Y p   D  e p    S  i p      x 2  = 1 +   α  φ 1     β 1     (  X  * 2  − 2 X *  )        Using Eqs. (6–7) and (31–32), we obtain the analytical expression of the concentrations of methanol and α-pinene in the air phase.  (33)    C m *    (  h *  )  =    C m    ( h )     C  m i     = 1 −   2 X  μ  max  ( m )     A s  δ h    Y m   U g    = 1 −   2 A φ  β  h *       (34)    C p *    (  h *  )  =    C p    ( h )     C  p i     = 1 −   2 α X  μ  max  ( p )     A s  δ h    Y p   U g    = 1 −   2 α  A 1   φ 1     β 1    h *       The percentage of the methanol removal ratio is  (35)     methanol  R  =    C  m i  *  −  C  m f  *     C  m i  *    × 100    where   C  m i  *   and   C  m f  *   are the initial (before treatment) and the final (after treatment) concentrations of methanol in the air phase, respectively. The percentage of the α-pinene removal ratio is  (36)   α −   pinene  R  =    C  p i  *  −  C  p f  *     C  p i  *    × 100    where   C  p i  *   and   C  p f  *   are the initial (before treatment) and the final (after treatment) concentrations of α-pinene in the air phase respectively.  In order to investigate the accuracy of the ADM solution with a finite number of terms, the system of differential equations was solved numerically. To show the efficiency of the present method, our analytical results are compared with numerical results graphically. The analytical solution of the concentrations of methanol and α-pinene in air phase and biofilm phase are compared with simulation results in Figs. 3–6 . Upon comparison, it gives a satisfactory agreement for all values of the dimensionless parameters   S m  ​ * ​ ,   S p  ​ * ​ ,   C m *   and   C p *   . The detailed Matlab program for numerical simulation is provided in Appendices C and D.      RESULTS AND DISCUSSION   Eqs. (19–22) represent the simple and new analytical expression of the concentrations of methanol and α-pinene in biofilm phase   S m  ​ * ​ ,   S p  ​ *  and in the air phase   C m  ​ * ​ ,   C p  ​ *  respectively. The concentrations of methanol and α-pinene in the biofilm phase and the air phase depend upon the parameters φ and β. The variation in the dimensionless variable φ can be achieved by varying either the thickness or dry cell density of the biofilm. The parameter β depends upon the initial concentration and half saturation constant.   Fig. 3 represents the concentration of methanol   S m  ​ *  in the biofilm phase versus dimensionless distance X * for different values of φ and β. From Fig. 3a, b, it is inferred that the concentration of methanol increases when the initial concentration of methanol β increases for the fixed values of φ. For large value of dimensionless parameter β, the concentration of methanol remains constant. In Fig. 3c, d, we present the concentration of methanol in the biofilm phase for various values of φ and for some fixed values of β. Maximum specific growth rate of methanol biodegradation φ decreases the concentration of methanol slowly and reaches the constant level. The minimum value of   S m *    (  X *  )   and   S p *    (  X *  )   are  1 −  (   φ /  2  (  1 + β  )     )   and  1 −  (    α  φ 1   /  2  (  1 +  β 1   )     )   respectively.   Fig. 4 exhibits the concentration of α-pinene   S p  ​ *  in the biofilm phase versus dimensionless distance X * for different values of  α ,   φ 1   and   β 1   . From Fig. 4a, b, it is inferred that the concentration of α-pinene increases when the initial concentration of α-pinene   (   β 1   )   increases for the fixed values of dry cell density φ 1. For large value of β 1, the concentration of α-pinene is uniform. In Fig. 4c, d, we show that the concentration of α-pinene in the biofilm phase for various values of cell density φ 1 and for some fixed values of dimensionless parameter β 1. From this figure, we conclude that the concentration of α-pinene   S p  ​ *  increases when thickness of the film decreases. The concentration of α-pinene is equal to one   (   S p  ​ * = 1  )   when   (   φ /  2  (  1 + β  )     )  < 2  .   Fig. 5a, b shows the dimensionless concentration of methanol   C m *   versus dimensionless height h *. From Fig. 5a, it is described that the concentration of methanol slowly reaches the constant when the biofilm thickness or φ increases. In Fig. 5b, it is labeled that the concentration of methanol decreases when half saturation constant of methanol β decreases for the fixed value of other parameter.   Fig. 6a, b demonstrates the concentration of α-pinene   C p *   in the air phase versus dimensionless height h *. From Fig. 6a, it is inferred that the concentration of α-pinene slowly reaches a constant level when the diffusion coefficient φ1 increases for the fixed value of other parameter. In Fig. 6b, it is labeled that the concentration of α-pinene attains the steady state values when the initial concentration of α-pinene   (   β 1   )   increases.   Fig. 7 shows the profile of dimension concentration of methanol and α-pinene in the air phase versus height h for some fixed value of the parameters. From these figures it is inferred that the concentration is linearly proportional to the height of the biofilter. And also the concentration of   C m *   and   C p *   decrease when the height of the biofilter increases. Fig. 8a, b illustrates the removal ratio of methanol and α-pinene in the air phase. From this figure it is observed that the removal ratio is directly proportional to the inlet loading. Our analytical results are compared with the experimental result and excellent agreement is noted.   CONCLUSION   In this paper, the non-linear differential equations in biofiltration model have been solved analytically. Approximate analytical expressions pertaining to the concentrations of methanol and α-pinene in the biofilm phase for all the values of parameters are obtained using the Adomian decomposition method. This solution of the concentrations of methanol and α-pinene in the biofilm phase and air phase are compared with the numerical simulation results. This model is also validated using experimental results. These analytical results provide a good understanding of the system and the optimization of the parameters in biofiltration model.   ACKNOWLEDGEMENTS   This work was supported by the Department of Science and Technology (DST) (No. SB/S1/PC-50/2012). The authors are thankful to The Principal, The Madura College, Madurai and The Secretary, Madura College Board, Madurai for their encouragement.  Consider the non-linear differential equation  (A.1)    y ″  + N  ( y )  = g  ( x )     with boundary conditions  (A.2)   y  ( 0 )  = A ,  y  ( b )  = B    where N(y) is a non-linear function, g(x) is the given function and A, B and b are given constants. We propose the new differential operator, as below  (A.3)   L =    d 2    d  x 2          So, Eq. (A.1) can be written as  (A.4)   L  ( y )  = g  ( x )  − N  ( y )        The inverse operator   L  − 1    is therefore considered as a two-fold integral operator (Duan and Rach [37]), as below  (A.5)    L  − 1     ( . )  =    ∫ 0 x      ∫ b x    ( . )  dxdx             Applying the inverse operator   L  − 1    on both sides of Eq. (A.4) yields  (A.6)   y  ( x )  =  L  − 1     (  g  ( x )   )  −  L  − 1     (  N  ( y )   )  +  y ′   ( b )   (  x − 0  )  + y  ( 0 )  ,       Using the boundary conditions Eq. (A.2), Eq. (A.6) becomes  (A.7)   y  ( x )  =  L  − 1     (  g  ( x )   )  −  L  − 1     (  N  ( y )   )  + B x + A       The Adomian decomposition method introduces the solution y(x) and the non-linear function N(y) by infinite series  (A.8)   y  ( x )  =   ∑  n = 0  ∞    y n    ( x )       and  (A.9)   N  ( y )  =   ∑  n = 0  ∞    A n       where the components yn (x) of the solution y(x) will be determined recurrently and the Adomian polynomials An of N(y) are evaluated using the formula  (A.10)    A n    ( x )  =  1  n !      d n    d  λ n    N    (    ∑  n = 0  ∞    λ n   y n     )    λ = 0      which gives  (A.11)      A 0  = N  (   y 0   )  ,      A 1  =  N ′   (   y 0   )   y 1  ​ ,      A 2  =  N ′   (   y 0   )   y 2  +  1 2   N ″   (   y 0   )   y 1 2  ​ ,      A 3  =  N ′   (   y 0   )   y 3  +  N ″   (   y 0   )   y 1   y 2  +  1  3 !     N ′  ″   (   y 0   )   y 1 3  ​ ,  .     ⋮         By substituting Eqs. (A.8) and (A.9) in Eq. (A.7) gives  (A.12)     ∑  n = 0  ∞    y n    =  L  − 1     (  g  ( x )   )  −  L  − 1     (    ∑  n = 0  ∞    A n     )  + A x + B       Then equating the terms in the linear system of Eq. (A.11) gives the recurrent relation  (A.13)    y 0  =  L  − 1     (  g  ( x )   )  + B x + A ,   y  n + 1   = −  L  − 1     (   A n   )  ,  n ≥ 0    which gives  (A.14)      y 0  =  L  − 1     (  g  ( x )   )  + A x + B ,      y 1  = −  L  − 1     (   A 0   )  ,      y 2  = −  L  − 1     (   A 1   )  ,      y 3  = −  L  − 1     (   A 2   )  ,  .     ⋮         From Eqs. (A.11) and (A.14), we can determine the components yn (x), and hence the series solution of yn (x) in Eq. (A.7) can be immediately obtained.  In this appendix, we have derived the solution of Eqs. (11) and (12) using the Adomian decomposition method. Eq. (11) can be written with the operator form  (B.1)   L (  S m *  ) = φ N (  S m *  )       (B.2)   wherethe differential operator  L =    d 2    d X  * 2     and  N (  S m *  ) =    S m *    1 + β  S m *          Applying the inverse operator   L  − 1     ( . )  =    ∫ 0  x *       ∫ 1  x *     ( . )  d X * d X *        on both sides of Eq. (B.1) yields  (B.3)    S m *    (  X *  )  = A X * + B + φ  L  − 1     [     S m *    1 + β  S m *     ]     Where  A =  S m *  ′   ( 1 )   and  B =  S m *    ( 0 )   . We let,  (B.4)    S m *    (  X *  )  =   ∑  n = 0  ∞    S   m n   *    (  X *  )          (B.5)   N [  S m *    (  X *  )  ] =    S m *    1 + β  S m *    =   ∑  n = 0  ∞    A n          In view of Eqs. (B.4) and (B.5), Eq. (B.3) gives  (B.6)     ∑  n = 0  ∞    S   m n   *    (  X *  )    = A X * + B + φ  L  − 1     ∑  n = 0  ∞    A n          We identify the zeroth component as  (B.7)    S   m 0   *    (  x *  )  = A X * + B    and the remaining components as the recurrence relation  (B.8)    S   m  n + 1    *    (  X *  )  = φ  L  − 1    A n  ​ ,  n ≥ 0    where An are the Adomian polynomials of   S  m 1  *  ​ ,   S  m 2  *   ⋯   S  m n  *   . We can find the first few An as follows:  (B.9)    A 0  = N (  S  m 0  *  ) =    S  m 0  *    1 + β  S  m 0  *          (B.10)    A 1  =      d  d λ   [ N (  S  m 0  *  + λ  S  m 1  *  ) ]  |    λ = 0   =    S  m 1  *       (  1 + β  )   2          The remaining polynomials can be generated easily, and so,  (B.11)    S  m 0  *    (  X *  )  = 1       (B.12)    S  m 1  *    (  x *  )  =  φ   (  1 + β  )     (    X  * 2   2  − X *  )        Adding (B.11) and (B.12), we get Eq. (19) in the text. Similarly, we can apply the above method to find the solution of Eq. (12). Higher order iteration will be considered to improve the accuracy of the results.                           Symbols Definitions Units     As  Biofilm surface area per unit volume of the biofilters       m 2   /   m 3         Cm  Concentration of methanol in the air stream     g /   m 3             C  m i      Concentration of methanol in the inlet air stream     g /   m 3         Cp  Concentration of α-pinene in the air stream     g /   m 3             C  p i      Concentration of α-pinene in the inlet air stream     g /   m 3             D  e m      Effective diffusivity of methanol in the biofilm       m 2   / h           D  e p      Effective diffusivity of α-pinene in the biofilm       m 2   / h       h Dimension along the height of the biofilters m   H Total height of the biofilters m   Ki  Inhibition constant for α-pinene in the presence of methanol     g /   m 3         Km  Half saturation constant of methanol in Monod kinetics obtained from differential biofilters experiments     g /   m 3         Kp  Half saturation constant of α-pinene in Monod kinetics     g /   m 3         mm  Air/biofilm partition coefficient for methanol, dimensionless –   mp  Air/biofilm partition coefficient for α-pinene, dimensionless -    Sm  Concentration of methanol in the biofilm     g /   m 3         Sp  Concentration of α-pinene in the biofilm     g /   m 3         Ug  Superficial velocity of air through the biofilters m/s   X Dry cell density of the biofilm      k g  /   m 3         Y Organic carbon content of the biofilm     g / g       Ym  Biomass yield coefficient for methanol      k g  /    cell  /  k g      methanol   Yp  Biomass yield coefficient for α-pinene kg/cell/kg α-pinene       S m  =    C m     m m    =  S  i m      Initial concentration of methanol in the biofilm     g /   m 3             S p  =    C p     m p    =  S  i p      Initial concentration of α-pinene in the biofilm     g /   m 3         L Linear operator    An  Adomian polynomial           Greek letters        α  Coefficient for the effect of methanol on α-pinene biodegradation, dimensionless –   δ Biofilm thickness m       μ  max  ( m )       Maximum specific growth rate for methanol biodegradation     h  − 1            μ  max  ( p )       Maximum specific growth rate for α-pinene biodegradation h−1    ρb  Density of the biofilm kg/m3           Dimensionless Parameters:          β =    S  i m      K m       Dimensionless constant of methanol in Monod kinetics obtained from differential biofilters experiments –      φ =   X  μ  max  ( m )       Y m       δ 2     D  e m    K m       Dimensionless parameter –      X * =  x δ     Dimensionless coordinate in dry cell density of the biofilm –       S m  ​ * =    S m     S  i m        Dimensionless concentration of methanol in the biofilm –       β 1  =    S  i p      K p       Dimensionless constant of α-pinene in Monod kinetics obtained from bench-scale biofiltration results –       φ 1  =   α X  μ  max  ( m )       Y m       δ 2     D  e m    K m       Dimensionless parameter –       S p  ​ * =    S p     S  i p        Dimensionless concentration of α-pinene in the biofilm –      A =   H  A s   D  e m    S  i m      U g  δ  C  m i        Dimensionless parameter –       A 1  =   H  A s   D  e p    S  i p      U g  δ  C  p i        Dimensionless parameter –       C m *  =    C m     C  m i        Dimensionless concentration of methanol in the air stream –       C p *  =    C p     C  p i        Dimensionless concentration of α-pinene in the air stream –       C  m i  *     Initial (before treatment) concentration of methanol –       C  m f  *     Finial (before treatment) concentration of methanol –       C  p i  *     Initial (before treatment) concentration of α-pinene –       C  p f  *     Initial (before treatment) concentration of α-pinene –      h * =  h H     Dimensionless along the height of the biofilters –         REFERENCES", "highlights": "In this paper, mathematical models of biofilteration of mixtures of hydrophilic (methanol) and hydrophobic (α-pinene) volatile organic compounds (VOC's) biofilters were discussed. The model proposed here is based on the mass transfer in air–biofilm interface and chemical oxidation in the air stream phase. An approximate analytical expression of concentration profiles of methanol and α-pinene in air stream and biofilm phase have been derived using the Adomian decomposition method (ADM) for all possible values of parameters. Furthermore, in this work, the numerical simulation of the problem is also reported using the Matlab program to investigate the dynamics of the system. Graphical results are presented and discussed quantitatively to illustrate the solution. Good agreement between the analytical and numerical data is noted."}