{"id": "S2405609X15300142", "article": "MAIN-TITLE Biofabrication and its in vitro toxicity mechanism of silver nanoparticles using Bruguiera cylindrica leaf extract   HIGHLIGHTS          AgNPs were synthesized using Bruguiera cylindrica extract as reducing agent.      Green synthesis of AgNPs is a simple, economic and by eco-friendly approach.      Hexagonal AgNPs were derived.      AgNPs shows good cytotoxic effect against MCF-7 breast cancer cell lines.          KEYPHRASES   Green synthesis     Bruguiera cylindrica       Surface plasmon resonance  Cell line culture   Nanotechnology is the engineering of functional systems at the nano scale level with multi-disciplinary areas of applied science and engineering. It deals with the design, manufacture and characterization of extremely small components and systems [1–4]. Nanometals are more reactive because of their small size and greater surface area [5]. Synthesis of nanoparticles is done by various methods. But they are having some limitations in their synthesis and application aspects [6,7]. Bio synthesis of nanoparticle provides the advisable applications like eco-friendly, cost effective and the minimum time consuming method [8–12]. Abou El-nour et al. [13], reported the various phytochemicals present in plant will act as a reducing and capping agent for synthesis of AgNPs. Bruguiera cylindrica is an important medicinal mangrove tree, belongs Rhizophoraceae with diverse of phyto-constituents. It is in medicinal practice against to malignant ulcers, hepatitis, diarrhea and malaria [14,15]. Bio-synthesized AgNPs was performed to analyze the cytotoxic effect against MCF-7 breast cancer cell lines [16–18]. The present study has aimed to synthesis, characterization and cytotoxic effect of green AgNPs using B. cylindrica leaf extract.  Matured fresh leaves of B. cylindrica were collected from Pichavaram Mangrove forest, Tamil Nadu, India. B. cylindrica was confirmed by Department of Botany, Annamalai University, Annamalai Nagar, Tamilnadu, India.  The collected leaves were washed in running water followed by rinsed with double distilled water and shade-dried at room temperature for 10 days. The fully dried leaves were powdered with a sterile electric blender. The powdered samples were preserved in an airtight container and away from the sunlight for further use. Two grams of powder leaf was mixed with 100 ml of de-ionized sterile water, heat up to 100 °C for 30 min and filtered by Whatman No.1 filter paper, finally the residue was re-extracted using vacuum pumps.  Qualitative phytochemical screening of B. cylindrica aqueous leaf extracts was performed [13].  Silver Nitrate (AgNO3) stock solution was prepared by dissolving 6.299 g of AgNO3 in 100 ml of de-ionized water. 2 ml of B. cylindrica leaf extract was added to 20 ml of AgNO3 solution and kept at room temperature [17].  The absorption spectrum of the reaction mixture was recorded at room temperature using UV–vis spectrophotometer (Hitachi-U-2001) from 300 to 800  nm at 1 nm resolution for detection of AgNPs formation. The residue containing silver nanoparticles solution was dispersed in sterile de-ionized water to remove the biological impurities. The pure residue was dried in oven at 70 °C overnight. Fourier Transform Infrared (FTIR) studies, dry powder of the nanoparticles was prepared by centrifuge at 10,000 rpm for 15 min by Perkin–Elmer spectrum instrument resolution at 4 cm−1 in the transmission mode of 4000–400 cm−1 in KBR pellets. XRD measurement, the silver nanoparticles solution was drop-coated on glass on XPERT-PRO, D-8, with 30kv, 40 mA with Cu kα radians at 2θ angle. X-ray powder diffraction is a rapid analysis for phase identification of a crystalline material and can provide information on unit-cell dimensions. The crystallite size was calculated by width of the XRD peaks using the Scherrer's formula, D = Kλ/βcosθ. The size distribution and shape of NPs were estimated on the basis of TEM micrographs. The sample was placed over a carbon tape and dried. A pinch of dried sample was coated with a thin layer of platinum in an auto fine coater. The transmission electron microscopy (TEM) was performed the synthesized AgNPs using JEM 1011, JEOL, Japan.  MCF-7 cells were collected from National Centre for Cell Science (NCCS), Pune, India. The cell viability was estimated using the MTT calorimetric technique. Cells were cultured in 96 well plate for 6 h at 37 °C and kept in CO2 incubator. 100 μL of MTT solution (3-(4,5-dimethlthiazoyl-2)-2,5-diphenyltetrazolium bromide, a yellow tetrazole) without phenol red (5 mg/mL) in phosphate buffer solution was added to each well and incubated for 5 h at 37 °C, for the reduction of MTT by metabolically active cells, in part by the action of dehydrogenase enzymes to generate reducing equivalents. Purple color formazone crystals formed and then dissolved with 100 μL of isopropanol or dimethyl sulphoxide (DMSO). After the treatment, these crystals were observed at 540 nm absorbance which is directly proportional to the number of living cells in culture. The percentage of viability was calculated by using the following formula,    Percentage  of  viability =   Sample  absorbance   ( AgNPs )    Control  absorbance   ( untreated )    × 100        RESULTS AND DISCUSSION   Phytochemical screening of B. cylindrica was observed that the aqueous fraction contains alkaloids, saponins, phenols and flavonoids, while the tannins, glycosides and cardiac glycosides were absent in the extract [19,20]. The colorless silver nitrate solution color was turned into yellow in color when it was mixed with B. cylindrica leaf extract and after some incubation period the reaction mixture was turned into dark brown in color, which designates the formation of silver nanoparticles [21–23]. Thus, the nanoparticle was obtained by reduction of Ag+ ions using B. cylindrica leaf extract [24,25]. Fig. 1 shows the UV–vis spectrum of AgNPs synthesis with increased time intervals at 0 to 5, 10, 15 and 20 min and absorption peaks of SPR observed at 450 nm without any shifting of peak and similar results were accepted by Arbutus unedo and Cynodon dactylon [26,27]. The XRD spectrum revealed the occurrence of four major intense peaks by leaf extract at 2θ values of 35.89°, 40.30°, 64.52° and 76.09° which are corresponding to (111), (200), (220) and (311) (Fig. 2 ). Based on the intense peaks diffraction pattern shows the face centered cubic (fcc) crystal structure. The intense peak at 64.52° indicates high degree of crystallinity and the similar patterns also been reported by Sanjenbam et al. and Shameli et al. [28,29]. The average size of AgNPs was calculated by Debye-Scherrer's formula,    D =   K λ   β  cos θ      where D is the particle diameter size, K is a constant equal to 1, λ is X-ray wavelength (0.1541 nm), β is full width half maximum (FWHM) and θ is the diffraction angle. The result from the Scherrr's formula the average diameters of the AgNPs according to the strong diffraction peak was around 12 nm [30]. In FTIR, the stabilized AgNPs showed their vibration spectrum (Fig. 3 ) at 3361.01 cm−1 (alcohols group of O–H stretching), 2281.91 cm−1 (alkynes–C–C– stretching), 1575.12 cm−1 (carbonyl group of amides N–H stretching), 1034.79 cm−1 (aliphatic amines C–N stretching), 821.96 cm−1 (alkyl halides C–Cl stretching), 717.07 cm−1 (aromatic C–H stretching), 590.92 cm−1 (alkyl halide C–Br stretching) and band at 2926.81 cm−1 suggests that the presence of alkanes group bound by C–H stretching of individual protein were measured respectively. Based on the TEM analysis, particle was hexagonal with the size distribution was ranged between 9 and 24 nm (Fig. 4 ). In vitro cytotoxic effect of AgNPs was screened against the MCF-7 cell lines. In the present study, the dose dependent cytotoxicity of AgNPs against MCF-7 cells using MTT assay. The cell viability of MCF-7 cell lines was observed for 12 h, 24 h and 36 h after treatment with AgNPs. As per the Table 1 , the increasing concentrations of AgNPs with decreasing cell viability of MCF-7 cell lines. After twelve hours of treatment, fifty percentages of dead cells determines IC50 value of biosynthesized AgNPs against MCF-7 cells holds of 100 μg/mL concentration and 90% of dead cells reached after 36 h. However, the toxicity of synthesized AgNPs showed higher effect than B. cylindrica leaf extract and AgNO3 at the same incubation period.   CONCLUSION   To conclude from this study, the synthesis, characterization and cytotoxic effect against MCF-7 cell lines of biosynthesized AgNPs was performed using B. cylindrica leaf extract as stabilizer and reductant. The biosynthesis of AgNPs using B. cylindrica leaf extract showed excellent anticancer activity with little uncovered mechanism. Further studies are required to fully characterize the toxicity mechanism of cell growth from biosynthesized AgNPs for cancer therapy.   ACKNOWLEDGMENTS   We are grateful to the Management of J.J. College of Arts & Science, Pudukkottai, Tamil Nadu, India for providing a Research grant (KVET-RG-2014-BT03) by Karpaga Vinayaga Educational Trust for conduct this work. The authors are grateful to Prof. V. Venkatesalu, Professor and Head, Department of Botany, Annamalai University, Annamalai Nagar, Tamil Nadu, India for plant identification and other supports to complete the work.   REFERENCES", "highlights": "Silver nanoparticles (AgNPs) were synthesized using Bruguiera cylindrica (B. cylindrica) leaf extract, the extract was acted as a reducing and stabilizing agent. The formation of AgNPs was observed by UV–vis spectroscopy and surface plasmon resonance (SPR) occurred at 450 nm. The X-ray diffraction (XRD) analysis shows that the particles are face centered cubic (fcc) structure and average size of AgNPs was found at 16 nm. Fourier transmission infrared spectroscopy (FTIR) suggests that the presence of thirteen functional groups in capping with AgNPs. Transmission electron microscopy (TEM) image shows the well dispersed particles with size of 9–24 nm. Furthermore, the biosynthesized AgNPs were exhibited an excellent cytotoxic effect against MCF-7 breast cancer cell lines."}