{"id": "S2405609X15300749", "article": "MAIN-TITLE Synthesis and optical properties of chemical bath deposited ZnO thin film   HIGHLIGHTS          ZnO thin films were prepared by chemical bath technique.      Band gap increases with decreasing the concentration of TEA (1 M−0.01 M).      The optical band gap of the ZnO thin film was found in the range of 2.59–3.57 eV.          KEYPHRASES   Chemical bath deposition method  Nanopartical  Stoicheiometry  Band gap  Refractive index   Owing to a direct wide band gap (3.37 eV), large exciton binding energy (60 meV), and superior conducting properties based on oxygen vacancies, the wurtzite-structured [1–4,8,11,12]. Zinc oxide (ZnO) has become one of the most promising materials and has lots of research interest due to their unique structure and size dependent electrical, optical and mechanical properties. ZnO nanostructures were studied extensibly owing to their potential applications in nano-devices and optical materials [40,41].  Different techniques to synthesized nano and Micro range phosphor such as spray plasma-enhanced chemical vapour deposition [13], sol gel [1], sputtering [20]; pyrolysis [18], solid state reactions [15–17,26,28,29,33,36], co-precipitation [22,31,43] and combustion [24,25,27,34,35] etc have been used, but in recent times much interest has been generated around the chemical route technique. The technique is simple cost; effective, reproducible and the material are readily available [7,9,45]. The technique is simple cost; effective, reproducible and the material are readily available. As compared to other oxide material ZnO material is much cheap and easily available material [3,29,38–42].  Another advantage of the CBD method over other method is that the film can be deposited at different shapes and size of substrates.  In this paper, we report that decreasing in concentration of TEA, band gap increases.  The ZnO thin films were prepared by chemical bath technique at room temperature (28 °C). The reaction bath is composed of ZnCl2, NaOH and TEA (tri ethanolamine) used as complexing agent. For deposition of the film, commercial quality glass microscope slides of dimension 16 mm × 26 mm × 1 mm are used. Prior to use, these glass slides were soaked in aqua regia, a mixture of concentrated HCl and HNO3 in the ratio of 3:1. They were removed after 24 h and washed thoroughly in cold detergent solution, rinsed in distilled water and drip dried in air. The properly degreased and cleaned substrate surface has the advantage of producing highly adhesive and uniform film.  The substrate was immersed vertically at the centre of reaction bath in such a way it should not touch the walls of the beaker. Only one concentration of ZnCl2 (0.04 M) and of NaOH (0.08 M) were used in this method. Tri ethanolamine was used either directly or as aqueous solution with varying concentration of TEA to prepare various samples.  At the end of the dip period, the films are washed and drip-dried in air. Post deposition annealing of the films expelled the water molecules resulting in the ZnO. The annealing temperature used in this study was 563 K [14].  The optical absorbance, transmittance, and reflectance of the film were studied in the spectral range of 285–1000 nm using UV spectrophotometer (Varian). The surface morphology of the white precipitate was determined by Scanning Electron Microscope (SEM) JEOL6380A. The structural parameters of the powder were determined using X-Ray Diffraction technique. The XRD patterns were recorded with Pan analytical XPRT IPRO using a Cu Kα radiation source (λ ± 1.54056 Å). The X-rays were detected using a fast counting detector based on silicon strip technology (Bruker Lynx Eye detector). Thickness is calculated by the formula.    t =  m / A  ∗ ρ    where  m = mass  A = area  ρ = density  Reaction mechanics is as follow [14]   ZnCl2 + TEA ↔ Zn (TEA)2+ + 2Cl−      Zn (TEA)2+ ↔ Zn2+ + TEA     NaOH + OH− ↔ Na+ + 2OH−      Zn2+ + 2OH− ↔ Zn (OH)2      Zn (OH)2 ↔ ZnO + H2O     We have characterized by employing scanning electron microscopy (SEM) and XRD. SEM was used for morphological characterization of sample. The surface morphology of the white precipitate was determined by scanning electron microscope (SEM) JSM-7600F. The structural parameters of the powder were determined using X-ray diffraction technique. The XRD patterns were recorded with Bruker D8Advanced X-ray diffractometer using a Cu Ka radiation source (λ = 1.54056 Å). The X-rays detected using a fast counting detector based on Silicon strip technology (bruker Lynx Eye detector) [15,30–37].  In direct Used of TEA (sample 219) the colour of the film was white but when we decrease the concentration of TEA in aqueous solution the whiteness of the deposition film decreases and become almost transparent, and their band gap also increases. In sample 219 (3 ml of direct solution of TEA) we obtain band gap as 2.59 eV [14] and transmittance between 30 and 40%. In sample 311 we used 10 ml of 1 mol aqueous solution of TEA, we obtain band gap as 2.92 eV and transmittance between 40 and 50%. In sample 339 and 328 we used 8 ml of 0.1 and 8 ml of 0.01molarity aqueous solution of TEA, we obtain band gap between 3.37 and 3.57 eV and transmittance between 60 and 80%. We obtain different result when we used aqueous solution of TEA. Same results are also reported in case of lead hydroxide [5,6,41,44]. The deposition parameters and thickness of the film are shown in Table 1 .   Fig. 1 and Fig. 2 , show the optical transmittance, reflectance, and absorption curve of deposited ZnO film of two thicknesses (0.286 and 0.180 μm) of 339 and 328 sample.   Fig. 1 show that transmittance increases with decreasing concentration of the TEA and with decreasing thickness. Higher transmittance is observed in IR region. This indicates that film is a good material for warming applications in low temperate regions; it could be used as window glazing to create warmth in the house. It could also be very useful in Agriculture especially creating warmth for chicken in a poultry farm. On the other hand reflectance decreases rapidly with increase in wavelength falling from about 20%near UV region to about 12% near Infrared region [19].  The band gap of the metallic oxide was determined by plotting (αhv)2 as a function of hv, and extrapolating the linear portion of the curve to (αhv)2 = 0 as shown in Fig. 3 . The value obtained for the optical band gap is 3.37 and 3.57 eV of 339 and 328 sample.  It implies that with higher concentration of TEA, reaction rate high and we get large particle and vice verse [17,42].  Islam and podder reported [1] the absorption coefficient can be calculated by α = A/d.where A is the optical absorbance and d is thickness of the film. The extinction coefficient can be obtain from the relation = αλ/4π.  The refractive index (n) and extinction coefficient (K) value provide the optical properties of the film. The variation of extinction coefficient with wave length is shown in Fig. 4 . It is observed that the extinction coefficient decreases with the increase of the thickness of the film. The rise and fall in the extinction coefficient is directly related to the absorption of light [1]. From Fig. 4 it is clear that K decreases rapidly with increasing wavelength from 300 to 400 and after that value of K gradually increases.  The refractive index has been calculated using the relation reported by Islam and podder [1]. The variation of refractive index with wave length for of 339 and 328 sample is shown in Fig. 5 . From fig. it is evident that refractive index between 2 and 2.58 in the visible/near infrared region [1,14], means that electromagnetic radiation is 2–2.58 time slower in the oxide films than in the free space and increases with the decrease in thickness of the film, which is in good agreement. In sample 219,311 we obtain value of refractive index is 1.6–2.1. Low refractive index occurs due to successive internal reflection or due to the trapped photon energy with the grain boundary.  It is also attributed to the variety of impurities and defects with the increase of the thickness of the film and this implies that there is a strong optical scattering in the sample [1].  The real εr and imaginary εi parts of dielectric constant were determined using the formula εr = n2 − k2 and εi = 2nk. The variation of the real and imaginary parts of the dielectric constant for different film thickness is illustrated in Fig. 6(a) and (b) of 339 and 328 samples.   Fig. 6(a) revealed that the value of the real part (4–7) is higher than that of the imaginary part (0.2–0.45). From the optical data, it is observed that refractive index (n), extinction coefficient (k), and the real and imaginary parts of the dielectric constant follow the same pattern [1,14].  SEM image of ZnO, plate and powders like structure are shown in Fig. 7 (sample 311) and Fig. 8 (sample 328).  The results of our structural studies of the ZnO films (Sample 328) were done with X ray diffraction and show (100), (002), (101), (102), (210), (103) and (212) distinct diffraction peaks for the films grown in this study, as shown in Fig. 9 . Table 2 showed miller indices, particle size and inner planer spacing [10,21,23].  The grain size (D) was estimated from Scherer's formula    D =   Kλ  /  β  cos θ      where K is a dimensionless constant, 2Ө is the diffraction angle, λ is the x-ray wavelength, and β is the full width at half maximum (FWHM)of the diffraction peak. Particle size is obtained in nano range [10,21,23].   CONCLUSION   Zno films have been successfully prepared by CBD method using ZnCl2 and NaOH with TEA as complexing agent. The band gap of the film is 3.57 eV. The film shows high transmittance in the visible/near infrared regions of electromagnetic spectrum. Refractive index is (2–2.6). Value of the real part of dielectric constant is 4–7. Plate and powder like morphology showed in SEM images. Particle size was obtained in nano range.   REFERENCES", "highlights": "Zinc oxide thin films were deposited on glass slide from aqueous solution of ZnCl2 and NaOH by chemical bath deposition method. The films of various thicknesses have been obtained by varying the concentration of TEA (1 M−0.01 M). Optical properties, surface morphology and particle size of the deposited thin film have been studied by U.V spectrophotometer (Varian) SEM and XRD. The optical band gap of the ZnO thin film was found in the range of 2.59–3.57 ev. Optical constant is such as refractive index, extinction coefficient, real and imaginary parts of dielectric constant were evaluated from reflectance, transmittance and absorbance curve. The film show high transmittance in the visible/near infrared region. Reflectance (10%–20%), refractive index (2–2.6), extinction coefficient (0.04–0.075), real (4–7) and imaginary parts (0.2–.0.3) of dielectric constant are obtained in visible/near infrared region. SEM studies shown plate and powder like morphology of sample. Particles size is obtained in nano range."}